{"title":"The Religion of The Chinese by J. J. M. de Groot","uid":8339885,"size":632683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0012a2b491ba09793fbc5e65bd8ad34169182fc7&amp;dn=The+Religion+of+The+Chinese+by+J.+J.+M.+de+Groot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"imarion","files":-1,"time":1365072757,"description":"J. J. M. (Jan Jakob Maria) de Groot, Ph.D., (1854-1921) was a Dutch Sinologist and historian of religion. In this scholarly book published in 1910, he details the history, rituals, and beliefs of the major traditional religions of China: universal animism, polydemonism, specters, ancestral worship, Confucianism, Taoism, and Buddhism. He thought that one spiritual essence could be detected beneath a great variety of religious, philosophical, and even political expressions in China, and his lifework was the discovery and exposition of that essence.\n\nThe reader should be mindful that this was written while China was still under its imperial system of government with an emperor at its head, prior to the revolutions which established a republic and later a communist system that eschewed any state religion. Currently China is officially an atheist country. The CIA World Factbook reports China's religions as &quot;Daoist (Taoist), Buddhist, Christian 3%-4%, Muslim 1%-2%&quot;. (https://www.cia.gov/library/publications/the-world-factbook/geos/ch.html on Feb 4, 2013), therefore although this eBook is over 100 years old, it is still relevant to modern China's culture and traditions.\n\nThe cover image is &quot;Confucius presenting the young Gautama Buddha to Laozi,&quot; a painting from the Qing Dynasty. This is a new cover for the eBook, not the original cover of the published book. ","torrent":{"xt":"urn:btih:0012a2b491ba09793fbc5e65bd8ad34169182fc7","amp;dn":"The+Religion+of+The+Chinese+by+J.+J.+M.+de+Groot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0012a2b491ba09793fbc5e65bd8ad34169182fc7","infoHashBuffer":{"type":"Buffer","data":[0,18,162,180,145,186,9,121,63,188,94,101,189,138,211,65,105,24,47,199]},"announce":[],"urlList":[]}}