{"title":"Cutaneous Flaps in Head and Neck Reconstruction [PDF] [StormRG]","uid":10704782,"size":78516378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:005758f295e859aa16c295c2d7e2905be171757c&amp;dn=Cutaneous+Flaps+in+Head+and+Neck+Reconstruction+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":-1,"time":1407267973,"description":"Author: Vasilios K. Thomaidis \nHardcover: 379 pages\nPublisher: Springer; 2014 edition (June 11, 2014)\nLanguage: English\nISBN-10: 364241253X\nISBN-13: 978-3642412530\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nThis textbook, containing a plethora of illustrations and pictures, will serve as an atlas and as a superb guide to the use of cutaneous flaps in head and neck reconstruction. Each chapter depicts, in a layered manner, the anatomy of a particular donor site from which flaps are derived and used in head and neck defects, providing systematic steps in understanding the topographical anatomy of the various tissue layers. The flaps derived from each donor site are presented in detail, with step-by-step instructions in flap design and harvesting techniques based in anatomy. The author uses numerous high-quality color illustrations drawn from his own practice in order to demonstrate the techniques. His combined expertise as a maxillofacial surgeon and an assistant professor of anatomy enables him to explain clearly the transition from basic science anatomy to applied anatomy and to document reconstructive surgical techniques in precise detail. This beautifully illustrated book, including many basic and advanced flap designs, will be an illuminating reference for all who treat defects in the head and neck area.","torrent":{"xt":"urn:btih:005758f295e859aa16c295c2d7e2905be171757c","amp;dn":"Cutaneous+Flaps+in+Head+and+Neck+Reconstruction+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"005758f295e859aa16c295c2d7e2905be171757c","infoHashBuffer":{"type":"Buffer","data":[0,87,88,242,149,232,89,170,22,194,149,194,215,226,144,91,225,113,117,124]},"announce":[],"urlList":[]}}