{"title":"Planet of the Apes and Philosophy by John Huss","uid":9617582,"size":376596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0134ab33f55a8f0bde92b7efd54078ed5855db0b&amp;dn=Planet+of+the+Apes+and+Philosophy+by+John+Huss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1392434319,"description":"\nWhat makes humans different from other animals, what humans are entitled to do to other species, whether time travel is possible, what limits should be placed on science and technology, the morality and practicality of genetic engineeringthese are just some of the philosophical problems raised by Planet of the Apes.\n\nPlanet of the Apes and Philosophy looks at all the deeper issues involved in the Planet of the Apes stories. It covers the entire franchise, from Pierre Boulles 1963 novel Monkey Planet to the successful 2012 reboot Rise of the Planet of the Apes. The chapters reflect diverse points of view, philosophical, religious, and scientific.\n\nThe ethical relations of humans with animals are explored in several chapters, with entertaining and incisive observations on animal intelligence, animal rights, and human-animal interaction. Genetic engineering is changing humans, animals, and plants, raising new questions about the morality of such interventions. \n\nThe scientific recognition that humans and chimps share 99 percent of their genes makes a future in which non-human animals acquire greater importance a distinct possibility.\nPlanet of the Apes is the most resonant of all scientific apocalypse myths.\n\nGenre: Non Fiction , Philosophy","torrent":{"xt":"urn:btih:0134ab33f55a8f0bde92b7efd54078ed5855db0b","amp;dn":"Planet+of+the+Apes+and+Philosophy+by+John+Huss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0134ab33f55a8f0bde92b7efd54078ed5855db0b","infoHashBuffer":{"type":"Buffer","data":[1,52,171,51,245,90,143,11,222,146,183,239,213,64,120,237,88,85,219,11]},"announce":[],"urlList":[]}}