{"title":"Laurence Olivier - Philip Ziegler (2013 - Retail epub)","uid":9212071,"size":8913645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:017a56dc1a01278bce6711b305a89144644a2d87&amp;dn=Laurence+Olivier+-+Philip+Ziegler+%282013+-+Retail+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":5,"time":1384806474,"description":"Books : Biography : English\n\n\nReview\n'A triumph ... it glitters with theatrical life - the tensions, the triumphs, the backstage bitchery ... above all it succeeds, as far as is humanly possible, in bringing alive on the page Olivier's magnetic theatrical presence, which those who saw him act will never forget' Sunday Times.\n\n\nProduct Description\nHollywood superstar; Oscar-winning director; greatest stage actor of the twentieth century. The era abounded in great actors - Gielgud, Richardson, Guinness, Burton, O'Toole - but none could challenge Laurence Olivier's range and power.\n\nBy the 1940s he had achieved international stardom. His affair with Vivien Leigh led to a marriage as glamorous and as tragic as any in Hollywood history. He was as accomplished a director as he was a leading man: his three Shakespearian adaptations are among the most memorable ever filmed.\n\nAnd yet, at the height of his fame, he accepted what was no more than an administrator's wage to become the founding Director of the National Theatre. In 2013 the theatre celebrates its fiftieth anniversary; without Olivier's leadership it would never have achieved the status that it enjoys today.\n\nOff-stage, Olivier was the most extravagant of characters: generous, yet almost insanely jealous of those few contemporaries whom he deemed to be his rivals; charming but with a ferocious temper. With access to more than fifty hours of candid, unpublished interviews, Philip Ziegler ensures that Olivier's true character - at its most undisguised - shines through as never before.\n\n\nAbout the Author\n\nPhilip Ziegler is one of Britain's leading biographers, who counts among his subjects two kings and four prime ministers. He has written for various newspapers and journals and was editorial director at Collins from 1979 to 1980.\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:017a56dc1a01278bce6711b305a89144644a2d87","amp;dn":"Laurence+Olivier+-+Philip+Ziegler+%282013+-+Retail+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"017a56dc1a01278bce6711b305a89144644a2d87","infoHashBuffer":{"type":"Buffer","data":[1,122,86,220,26,1,39,139,206,103,17,179,5,168,145,68,100,74,45,135]},"announce":[],"urlList":[]}}