{"title":"Shooting Straight (2013) Piers Morgan (multi) ","uid":9363091,"size":2548551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01bd702d55d940504b8050b30fc1a2fc5d778adb&amp;dn=Shooting+Straight+%282013%29+Piers+Morgan+%28multi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1387363321,"description":"Shooting Straight: Guns, Gays, God and George Clooney (2013) Piers Morgan (multi) \n\nFormat: mobi/epub/azw3\nLength: 336 pages\nGenre: Non-Fiction/Biography\nDate: 15 October 2013\n\nAs host of the CNN show Piers Morgan Live, Piers Morgan has come a long way from his days as a British tabloid editor and judge on America's Got Talent. Love him or hate him, it's undeniable that Morgan is one of the most talked-about, controversial figures in the media today. From gun control and gay marriage to religion and pop icons, he tackles the hot-button topics head on.\n\nIn Shooting Straight, he discusses candidly his refusal to bend to public pressure or political correctness, from his childhood in England to his career as a tabloid editor to his meteoric rise to fame in the United States. Offering an inside view of the real-time drama behind covering huge breaking news stories such as the killing of Osama bin Laden, Hurricane Sandy, and the massacre at Newtown, Morgan's account is a riveting, no-holds-barred depiction of an adrenaline-fueled life anchoring a nightly news show in the world's most ruthless, competitive, and pressurized media marketplace.\n\nAuthor:\n\nPiers Morgan, is a British journalist and television presenter. He began hosting Piers Morgan Tonight for CNN in the timeslot previously occupied by Larry King Live before the retirement of host Larry King. Morgan has authored eight books, including three volumes of his memoirs.","torrent":{"xt":"urn:btih:01bd702d55d940504b8050b30fc1a2fc5d778adb","amp;dn":"Shooting+Straight+%282013%29+Piers+Morgan+%28multi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01bd702d55d940504b8050b30fc1a2fc5d778adb","infoHashBuffer":{"type":"Buffer","data":[1,189,112,45,85,217,64,80,75,128,80,179,15,193,162,252,93,119,138,219]},"announce":[],"urlList":[]}}