{"title":"HypnosisDownloads Pack 1","uid":5117101,"size":70194382,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:01cc52d69761a7cd1077f28e6adeb04c6d237e84&amp;dn=HypnosisDownloads+Pack+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"thrice23","files":7,"time":1255117380,"description":"A pack of 7 hypnosis sessions from Hypnosis Downloads.\nAuthor: Mark Tyrrell, director of Uncommon Knowledge\n\n\nHypnosis is a very effective tool to reprogram your subconsicous mind and achieve permanent change in many areas of life.\n\nIf you like the sessions, please contribute by buying some of their products and sharing them here. They have a ton of interesting downloads.\n\n\n\nThe tracks are:\n\n---------------------------------------------------------------------------------\n-Approaching women          (15:53)\n\nThe thing is, regardless of how terrified you get when approaching women, there are times in your life when you talk to other people without even thinking about it. If you are chatting to a member of your family, or a good friend, you are not worrying about 'sounding cool', or 'being funny'; you are simply talking!\n\nUsing hypnosis, you can take this ability and transfer it to the 'chatting up women' situation. It's not like you need to learn something completely new; you just need access to your ability in that situation.\n\n---------------------------------------------------------------------------------\n-Be a Conversation Starter  (16:15)\n\nBe a Conversation Starter banishes self consciousness and nerves, allowing you to feel much calmer and confident starting up conversations. Good conversations and a positive initial connection can be the start of great friendships and relationships.\n\n---------------------------------------------------------------------------------\n-Body Dysmorphia            (29:02)\n\nBody dysmorphic disorder becomes an overwhelming preoccupation that can stop enjoyment of life. The message the condition sends is 'how can anything be right if my body isn't right?'\n\nHaving a distorted body image means being made unhappy because of how you feel about a particular part of your body or face. People may obsess about their hands, nose, eyes, shape, ears anything at all. \n\n---------------------------------------------------------------------------------\n-Cure Impotence             (15:38)\n\nHypnosis is such an effective psychological impotence cure because it:\n\n1) Hands control of your sexual performance back to your unconscious mind where it belongs (you can't try to get an erection - it just has to happen by itself, just like falling asleep)\n2) Lowers anxiety around sexual performance\n3) Reminds the mind of your old effective pattern for getting and maintaining an erection\n\n---------------------------------------------------------------------------------\n-Male libio                 (18:26)\n\nFor males, libido can be a key part of self image. A healthy male libido or sex drive makes you feel more manly, and can add to your confidence in other areas of life.\n\n---------------------------------------------------------------------------------\n-Overcome Porn Addiction    (28:43)\n\nDoes regular viewing of porn dull your senses and leave you feeling empty and worthless?\n\nAddiction to pornography can make you feel bad about yourself, unbalance your attitude to sex, damage relationships and waste your time and money. And like many compulsive behaviors, porn addiction is usually a secret addiction, spoiling trust in relationships. \n\n---------------------------------------------------------------------------------\n-Sexual Performance Anxiety (20:06)\n\nWhen a sexual problem occurrs more than once, part of you can begin to expect it to happen, causing a conditioning effect to occur. Then, even thinking about sex can cause an anxiety response, which inhibits your natural sex response. \n\n---------------------------------------------------------------------------------\n\nEncoded in 64 kbps MPEG 3.\n","torrent":{"xt":"urn:btih:01cc52d69761a7cd1077f28e6adeb04c6d237e84","amp;dn":"HypnosisDownloads+Pack+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01cc52d69761a7cd1077f28e6adeb04c6d237e84","infoHashBuffer":{"type":"Buffer","data":[1,204,82,214,151,97,167,205,16,119,242,142,106,222,176,76,109,35,126,132]},"announce":[],"urlList":[]}}