{"title":"Car Warriors (epic Comics)","uid":8217772,"size":49939473,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:01e26c8bbe037bfa3b7c6ef417612597c4eefe71&amp;dn=Car+Warriors+%28epic+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Ichthypod_Crane","files":4,"time":1362383545,"description":"Car Warriors is a four-issue comic book series published in 1991 by Epic Comics. It was written by Chuck Dixon and illustrated by Steve Dillon and Phil Winslade.\n\nThe Wild Wombastic World of Wikipedia says:\n\nThe series was conceived by Steve Jackson and Sharleen Lambard of Steve Jackson Games based on the board game Car Wars. The comic series was followed by a three-volume series of novels set in the same world but featuring different characters.\n\n2038 America after a series of natural and man-made disasters have changed the country. The Grain Blight destroyed crops causing widespread famine, and wars over dwindling resources culminated in a limited nuclear exchange.\n\nDuring the dark years, life in America was similar to the post-apocalyptic world of Mad Max and the roads were ruled by heavily armed biker-gangs. In response, average citizens had to arm their cars in self defense, and by the time the country began to recover autoduelling had become the nation's most popular sport (both on the open road and in specially built arenas).\n\nThe main character, Chevy Vasquez, lost his parents and sister to a biker gang attack during those dark years, and is now a successful arena autoduellist. He is approached by a wealthy individual who wants to back Vasquez in The Delorean Run! (think Cannonball Run and Death Race 2000, but the cars have weapons and armor).\n\n\nKudos to the creative team and the scanner. Get it, seed it.\n","torrent":{"xt":"urn:btih:01e26c8bbe037bfa3b7c6ef417612597c4eefe71","amp;dn":"Car+Warriors+%28epic+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01e26c8bbe037bfa3b7c6ef417612597c4eefe71","infoHashBuffer":{"type":"Buffer","data":[1,226,108,139,190,3,123,250,59,124,110,244,23,97,37,151,196,238,254,113]},"announce":[],"urlList":[]}}