{"title":"Illuminati/NWO Symbolism &amp; Predictive Programming Presentation","uid":5719698,"size":711779156,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:01e6799402dd0d51302eee50b36c11afc1493fe4&amp;dn=Illuminati%2FNWO+Symbolism+%26+Predictive+Programming+Presentation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1280242176,"description":" &lt;a href=&quot;http://www.HollywoodInsiders.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.HollywoodInsiders.net&lt;/a&gt;\nIlluminati symbolism and Predictive Programming Presentation [AVI,1:52hr]\n\nMuch like an &quot;extras&quot; to the Hollywood Insiders series, this presentation reviews Illuminati symbolism, Satanism, and predictive programming in movies today, and 50 years ago. It also reviews countless quotes from Satanic literature and Black Magic texts regarding body-transformation, and the Jedi. This presentation includes movies such as: Things to come, The Spirit, Beat the Devil, Max Payne, The devil's Hand, The Crow, and The Punisher. \n-\nMichael Wynn new world government order conspiracy occult free mason nwo 911 9/11 trade center synchronicity Alex jones exposed revealed industry barack obama deception alien mike  satan devil florida economic economic dollar tampa crisis collapse fall republic bank fallen christopher angels cia nsa Federal Reserve bilderberg Aleister Clowley jewish vatican truth catholic church jesuit zionism zionist israel george bush wtc wtc7 jordan maxwell theory jesse ventura cooper jeff rense alan watt shape shifter martial law 666 jfk Terrorstorm Endgame zietgiest mark beast rfid subliminal messages prophecy demon mind control haarp loose change nine spirits fallen angel alien star wars avatar terminator chemtrails enoch dajjal nuclear american chicago tsarion bible jesus magic witchcraft tyranny america abduction iraq war film ghost iran paranormal usa internet internet2 george lucas pakistan india china russia patriot wars england atlantis islam lucifer reptilian ufo age antichrist","torrent":{"xt":"urn:btih:01e6799402dd0d51302eee50b36c11afc1493fe4","amp;dn":"Illuminati%2FNWO+Symbolism+%26+Predictive+Programming+Presentation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01e6799402dd0d51302eee50b36c11afc1493fe4","infoHashBuffer":{"type":"Buffer","data":[1,230,121,148,2,221,13,81,48,46,238,80,179,108,17,175,193,73,63,228]},"announce":[],"urlList":[]}}