{"title":"Molecular and Nano Electronics - Analysis, Design and Simulation","uid":15521949,"size":16474961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:022c584308081fb1ae8ae2f21ff56633df273b9f&amp;dn=Molecular+and+Nano+Electronics+-+Analysis%2C+Design+and+Simulation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1470758571,"description":"Molecular and Nano Electronics - Analysis, Design and Simulation - J. M. Seminario (Elsevier, 2007).pdf\r\n\r\nThe aim of Molecular and Nano Electronics: Analysis, Design and Simulation is to draw together contributions from some of the most active researchers in this new field in order to illustrate a theory guided-approach to the design of molecular and nano-electronics. The field of molecular and nano-electronics has driven solutions for a post microelectronics era, where microelectronics dominate through the use of silicon as the preferred material and photo-lithography as the fabrication technique to build binary devices (transistors). The construction of such devices yields gates that are able to perform Boolean operations and can be combined with computational systems, capable of storing, processing, and transmitting digital signals encoded as electron currents and charges. Since the invention of the integrated circuits, microelectronics has reached increasing performances by decreasing strategically the size of its devices and systems, an approach known as scaling-down, which simultaneously allow the devices to operate at higher speeds.\r\n\r\n* Provides a theory-guided approach to the design of molecular and nano-electronics\r\n* Includes solutions for researchers working in this area\r\n* Contributions from some of the most active researchers in the field of nano-electronics","torrent":{"xt":"urn:btih:022c584308081fb1ae8ae2f21ff56633df273b9f","amp;dn":"Molecular+and+Nano+Electronics+-+Analysis%2C+Design+and+Simulation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"022c584308081fb1ae8ae2f21ff56633df273b9f","infoHashBuffer":{"type":"Buffer","data":[2,44,88,67,8,8,31,177,174,138,226,242,31,245,102,51,223,39,59,159]},"announce":[],"urlList":[]}}