{"title":"army of darkness comics","uid":4041624,"size":631412936,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:026644aba8062ea6ed9d71ac9006689491229e40&amp;dn=army+of+darkness+comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"decepticonjon","files":48,"time":1203706109,"description":"hello new torrent today featuring all army of darkness comics - up to date.\nall thanks goes to the scanners.  enjoy, seed, and keep your local comic book store alive.\nhere we go:\n\nFilm adaptation\n\nIn 1992 Dark Horse published an adaptation of the film with the original ending intact, written by Sam Raimi and Ivan Raimi, with art by John Bolton.\n\nIt was published as a 3-issue mini-series \n\nAshes 2 Ashes\n\nThe plot picks up right at the end of the film. It was written by Andy Hartnell, with art by Nick Bradshaw.\n\nIt was a 4-issue mini-series,\n\nShop Till You Drop Dead\n\nThis story starts where Ashes 2 Ashes ends.\n\nIt was written by James Kuhoric, with art by Nick Bradshaw and Sanford Greene.\n\nIt was a 4-issue mini-series,\nDarkman vs. Army of Darkness\n\nA crossover with another Sam Raimi film character, Darkman.\n\nIt was written by Roger Stern and Kurt Busiek, with art by James Fry.\n\nIt ran for four issues \nArmy of Darkness vs. Reanimator\n\nA crossover with Herbert West from H. P. Lovecraft&amp;#039;s short story, &quot;Herbert West?Reanimator&quot; and well-known from the film Re-Animator and its sequels.\n\nThis story starts where Shop Till You Drop Dead ends.\n\nThis was published as issue #1-4 of the ongoing Army of Darkness series.\n\nOld School\n\nAsh returns to the cabin in the woods in an attempt to stop the evil at its source.\n\nThis was published as issue #5-7 of the series.\n\nAsh vs. Dracula\n\nAsh tries to kill all the other monsters released by the Necronomicon: Dracula, Frankenstein&amp;#039;s monster, the Wolf-Man and the Mummy.\n\nThis was originally published in the series #8-11. \nThe Death of Ash\n\nThe story starts where Ash vs. Dracula ends and leads up to Marvel Zombies vs. The Army of Darkness.\n\nIt was published as issues #12-13 of the ongoing series.\n\nMarvel Zombies vs. The Army of Darkness\n\nA five-issue mini-series crossover with Marvel Comics set in the Marvel Zombies universe, also doubling as an origin story for that universe alongside the interlinked prequel Marvel Zombies: Dead Days.\n\nFrom The Ashes\n\nAsh vs. Evil Ash Prime and his many mutants and monsters in a post-apocalyptic world. #1 August 2007. It was a four issue story arc.\n\nThe Long Road Home\n\nA four issue story arc that will follow the aftermath of Ash defeating Evil Ash Prime and his quest (with Sheila by his side) to repair the damage done to the world. 2 of 4\n\nFreddy vs. Jason vs. Ash\n\nThe film sequel to Freddy vs. Jason was never made, but Wildstorm Comics and Dynamite announced that they&amp;#039;d be presenting the story in comic form as the six-issue mini-series Freddy vs. Jason vs. Ash. 4 of 6\n\nThe Evil Dead\n2 of 4","torrent":{"xt":"urn:btih:026644aba8062ea6ed9d71ac9006689491229e40","amp;dn":"army+of+darkness+comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"026644aba8062ea6ed9d71ac9006689491229e40","infoHashBuffer":{"type":"Buffer","data":[2,102,68,171,168,6,46,166,237,157,113,172,144,6,104,148,145,34,158,64]},"announce":[],"urlList":[]}}