{"title":"D&amp;D Redux - Basic Set: Player's Book","uid":10133671,"size":47932324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02b2a9023492b688f06d09644a0e75aa5de4a72d&amp;dn=D%26amp%3BD+Redux+-+Basic+Set%3A+Player%27s+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ReduxDM","files":-1,"time":1399924518,"description":"This is a labor of love. This Redux of the Dungeons &amp; Dragons game system has been crafted from multiple editions of the game. From the originals three-volume set to the latest 5th-Edition release, each has left their mark on this custom re-working of our favorite fantasy tabletop roleplaying game.\n\nIn the spirit of the Metzner and Moldvay Basic D&amp;D Sets, this set reveals everything that both players and Dungeon Masters need to begin creating and playing their first D&amp;D campaign. Future Redux releases will expand the game and introduce optional rules, equipment, spells, monsters, magic items, and more.\n\nThe Player's Book that you now hold in your hands includes everything you need to create and play a character that you can advance to the 4th-level of experience. The rules have been Reduxed and recompiled to make them elegant and easy for new players to learn while still offering a degree of flexibility that allows you to create and play a variety of character types.\n\nNow all you need are a set of dice and a few good friends to hit the table with.\n\nThe Basic Set: Player's Book includes:\n\n* An elegant task resolution system that includes flexibly defined skills\n* A unique take on the four core classes\n* Warriors perform might feats of arms unequaled by their peers\n* Rogues use their uncanny luck to survive adventuring hazards\n* Priests leverage the divine favor of their gods to empower their spells\n* Wizards use ancient magics at the risk of the corruption of body and soul\n* Flexible multi-classing rules that don't break the game\n* Fourteen backgrounds that help distinguish your character\n* Gain inspiration points to give you an edge in your adventuring","torrent":{"xt":"urn:btih:02b2a9023492b688f06d09644a0e75aa5de4a72d","amp;dn":"D%26amp%3BD+Redux+-+Basic+Set%3A+Player%27s+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02b2a9023492b688f06d09644a0e75aa5de4a72d","infoHashBuffer":{"type":"Buffer","data":[2,178,169,2,52,146,182,136,240,109,9,100,74,14,117,170,93,228,167,45]},"announce":[],"urlList":[]}}