{"title":"THE EXTINCTION PARADE 001 (2013) MAX BROOKS (GreenManGroup-DCP)","uid":8594073,"size":49287048,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:02c13f5c1418307b67faaeb885abb85adb6889d5&amp;dn=THE+EXTINCTION+PARADE+001+%282013%29+MAX+BROOKS+%28GreenManGroup-DCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1371710599,"description":"EXTINCTION PARADE #1\n(Mature Readers)\n\nPublisher: AVATAR PRESS\n(Writer) Max Brooks\n(Artist/Cover Artist) Raulo Caceres\n\nThe best-selling Zombie writer in history finally unleashes an all-new epic for comics!\n\nBe ready for the summer's biggest comic event as millions of zombie fans come looking for the first chapter of Max Brooks' Extinction Parade! One of the founders of the zombie renaissance, Max Brooks has sold millions of books in dozens of languages. His first book The Zombie Survival Guide not only singlehandedly jump-started the zombie prep subculture, its graphic novel companion Recorded Attacks debuted as #1 on the New Times Bestseller list. His second book World War Z (already a multi-million copy NYT bestseller in its own right) has been adapted by Brad Pitt into what is sure to be one of the biggest blockbuster movies of 2013.\n\nNow Brooks takes the zombie genre to a whole new level with his new comic series Extinction Parade featuring stunningly rendered art by super-star Raulo (Crossed, Captain Swing) Caceres. Building on the seed of his hit 2010 short story, Brooks has crafted a truly epic series spanning over 250 pages. Not only does Extinction Parade's multilayered depth and meticulously researched detail raise it to the standard of his previous work, it also introduces fans to an entirely new, fresh and terrifying subgenre: Vampires Vs Zombies.  \n\nAs humans wage their losing fight versus the hoards of the subdead, a frightening realization sets in with the secretive Vampire race: our food is dying off. This is the story of Vampires' descent into all-out war with the mindless hungry hordes of the zombie outbreak as humanity tries to survive them all. Three species in mortal conflict. This is how a species dies.\n\nIn Shops: 6/19/2013","torrent":{"xt":"urn:btih:02c13f5c1418307b67faaeb885abb85adb6889d5","amp;dn":"THE+EXTINCTION+PARADE+001+%282013%29+MAX+BROOKS+%28GreenManGroup-DCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02c13f5c1418307b67faaeb885abb85adb6889d5","infoHashBuffer":{"type":"Buffer","data":[2,193,63,92,20,24,48,123,103,250,174,184,133,171,184,90,219,104,137,213]},"announce":[],"urlList":[]}}