{"title":"Alex Jones - Martial Law 9-11 Rise of the Police State (2005)","uid":3359657,"size":738615727,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:02df0e37a0fe3e41789c3faaca7a93c31248318a&amp;dn=Alex+Jones+-+Martial+Law+9-11+Rise+of+the+Police+State+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rci","files":3,"time":1122061789,"description":"Martial Law 9/11: Rise Of The Police State is documentary film maker Alex Jones' latest release and is considered by many to be his best work to date.\n\nThe film documents....\n\n&gt;&gt; What the modern day police state looks like as thousands of peaceful protesters are forcibly detained at a Guantanamo style detention camp called Pier 57 during the 2004 Republican National Convention.\n\n&gt;&gt; How multitudes of New Yorkers and others are fully aware of the fact that 9/11 was an inside job and are now actively exposing the people behind it.\n\n&gt;&gt; Why the collapse of Building 7 is potentially the biggest smoking gun indicating government involvement in 9/11. Alex returns to the scene of the crime to physically dissect why the official story can be nothing else but a fraud.\n\n&gt;&gt; How many of the RNC protesters are actually aiding what they claim to oppose by being deluded into thinking that a re-energization of the left will successfully counteract the Neo-Cons. Communists and socialists are confronted with the truth about the false left-right paradigm and their response only betrays their ignorance.\n\n&gt;&gt; The awful truth about Michael Moore, a man with basic honest intentions but also a man who has been carefully shepherded by the culture creators to pose as the orthodoxy milquetoast of the true story behind 9/11. How Moore stood at the front of the protest for his photo-op and then spent the rest of his time eating tacos.\n\n&gt;&gt; The occult and satanic underpinnings of the ruling elite families and how their oath to secret societies and each other makes a mockery of their counterfeit pseudo-loyalty to America and what it is supposed to stand for.\n\n&gt;&gt; Arnold Schwarzenegger's alarming and sordid past and why his intentions should unnerve us all in light of his fated future presidential run. A womanizing, egotistic, power-mad, imperious Nazi whose ideals are diametrically opposed to those represented by the founding fathers. &gt;fsck the nwo;&gt;","torrent":{"xt":"urn:btih:02df0e37a0fe3e41789c3faaca7a93c31248318a","amp;dn":"Alex+Jones+-+Martial+Law+9-11+Rise+of+the+Police+State+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02df0e37a0fe3e41789c3faaca7a93c31248318a","infoHashBuffer":{"type":"Buffer","data":[2,223,14,55,160,254,62,65,120,156,63,170,202,122,147,195,18,72,49,138]},"announce":[],"urlList":[]}}