{"title":"Ghostbusters I, II - Comedy Eng Subs 1080p [H264-mp4]","uid":11594634,"size":2621014352,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:02e761e3c6b0f84448b2479acb74465e5427e10e&amp;dn=Ghostbusters+I%2C+II+-+Comedy+Eng+Subs+1080p+%5BH264-mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eyezin","files":-1,"time":1417270231,"description":".........................................................\n..:+++++++++++++++++++++++++++++++++++++++++++++++++++:..\n..:++++++++++++++++++++Ghostbusters+++++++++++++++++++:..\n..:+++++++++++++++++++Ghostbusters II+++++++++++++++++:..\n..:+++++++++++++++++++++++++++++++++++++++++++++++++++:..\n.........................................................\n\nPlot.\nPeter Venkman, Ray Stantz, and Egon Spengler are three scientists at Columbia\nUniversity in New York City. When their grant expires, the guys are fired and\nthey go into business as a ghost extermination company called Ghostbusters.\nTheir first customer is orchestra cello player Dana Barrett, who was scared\nout of her apartment on the 22nd floor of a high rise apartment building on\nCentral Park West. It seems that Dana's neighbor, Louis Tully, is also being\naffected by the strange happenings in the apartment building. Armed with\nproton guns, the Ghostbusters become wildly popular, and they are joined by\nWinston Zeddmore, who is looking for a job with good pay. Overzealous\nEnvironmental Protection Agency (EPA) agent Walter Peck thinks the\nGhostbusters are frauds, and he has the Ghostbusters put in jail. Peck is\nforced to believe the Ghostbusters when New York City is put under siege by\nan ancient Sumerian God named Gozer the Gozerian, who is channeled through\nthe apartment building that Dana and Louis live in, and the mayor has no\nchoice but to let the Ghostbusters out of jail to face Gozer.\n\nStars.\n=&gt;-Bill Murray.\n=&gt;-Dan Aykroyd.\n=&gt;-Sigourney Weaver.\n=&gt;-Harold Ramis RIP.\n\nDirector.\n=&gt;-Ivan Reitman.\n\nPlot.\nIt's 5 years after the battle against Gozer. A restraining order has forbidden\nPeter Venkman, Ray Stantz, Winston Zeddemore, and Egon Spengler from working\nas Ghostbusters, and as a result, they've had to find other jobs. Ray owns a\nbook store called Ray's Occult and performs at children's birthday parties\nwith Winston, Egon conducts experiments at the institute for advanced\ntheoretical research, Dana Barrett broke up with Peter some time ago before\nmarrying another guy, and Peter now hosts a local TV show called The World of\nthe Psychic. Dana, who is now the divorced mother of an 8-month-old baby named\nOscar, works in the restoration department at the Manhattan Museum of Art.\nStrange things start happening when Oscar's baby carriage takes off by itself\nwith Oscar in it, and it stops in the middle of 1st Avenue. While Dana's boss,\nJanosz Poha, is restoring a painting of a 16th-century tyrant named Vigo Von\nHomburg Deutschendorf, the painting comes to life. Vigo wants to live again by\ntaking over Oscar's body. Vigo takes complete control of Janosz and orders\nJanosz to get Dana to cooperate. Janosz also has his own agenda. He wants Dana\nbecause he's in love with her. When Peter, Ray, and Egon try to help Dana,\nthey are arrested and put on trial for violating the restraining order. When\nthe ghosts of the killer Scoleri Brothers show up at the court room, the judge\nis forced to remove the restraining order against the guys so they can put the\nScoleri Brothers in a ghost trap. After this, Peter, Ray, Egon, and Winston\nre-open Ghostbusters, and mayor's assistant Jack Hardemeyer tries to slow them\ndown any way he can, because he believes the Ghostbusters are frauds who will\nhurt the mayor's chances of becoming the governor of New York. The Ghostbusters\nand their lawyer, Louis Tully, refuse to be stopped by Jack. When Jack has the\nGhostbusters put in the Parkview mental hospital, there is an eclipse and\nJanosz kidnaps Oscar for Vigo. The mayor wants the Ghostbusters on the job,\nand when the mayor hears that Jack had the Ghostbusters put in the Parkview\nmental hospital, he fires Jack and has the Ghostbusters released to try to\nrescue Oscar from Vigo, and Vigo intends to make it as hard as possible for\nthe Ghostbusters.\n\nStars.\n=&gt;-Bill Murray.\n=&gt;-Dan Aykroyd.\n=&gt;-Sigourney Weaver.\n=&gt;-Harold Ramis RIP.\n\nDirector.\n=&gt;-Ivan Reitman.\n\nInfo.\n=&gt;-Genre..........................: Action : Comedy : Sci-Fi.\n=&gt;-Release Date...................: 1984 : 1989.\n=&gt;-Language.......................: English.\n=&gt;-File Size......................: 1.21 GiB : 1.23 GiB.\n=&gt;-Overall bit rate...............: 1 643 Kbps : 1 633 Kbps.\n=&gt;-Movie Runtime..................: 1h 45mn : 1h 48mn.\n\nVideo.\n=&gt;-Codec..........................: H.264/MPEG-4 AVC.\n=&gt;-Aspect Ratio...................: 2.40:1.\n=&gt;-Resolution.....................: 1 920 x 800.\n=&gt;-Bit rate.......................: 1500 Kbps.\n\nAudio English.\n=&gt;-Codec..........................: mp4a: MPEG-4 AAC LC.\n=&gt;-Channels.......................: 2 channel Stereo.\n=&gt;-Bit Rate.......................: 128 Kbps.\n=&gt;-Maximum bit rate...............: 245 Kbps.\n\nSubtitles.\n=&gt;-English","torrent":{"xt":"urn:btih:02e761e3c6b0f84448b2479acb74465e5427e10e","amp;dn":"Ghostbusters+I%2C+II+-+Comedy+Eng+Subs+1080p+%5BH264-mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02e761e3c6b0f84448b2479acb74465e5427e10e","infoHashBuffer":{"type":"Buffer","data":[2,231,97,227,198,176,248,68,72,178,71,154,203,116,70,94,84,39,225,14]},"announce":[],"urlList":[]}}