{"title":"Pinky.Violence.Girl.Boss.Guerilla.1972.DVDRip.XviD-Allzine","uid":5610394,"size":751229757,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:030535030bbaa344b2ef2d4aad6541ee5a07ae26&amp;dn=Pinky.Violence.Girl.Boss.Guerilla.1972.DVDRip.XviD-Allzine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thelad53","files":52,"time":1275835697,"description":"The best of the four films in the set is this third entry, directed by Norifumi Suzuki (of Convent Of The Sacred Beast) in 1972 and once again starring Reiko Ike and Miki Sugimoto in prominent roles. This is the third film in the Sukeban series.\n\nMiki is the tough and spunky leader of a gang of female bikers who ride around Tokyo on their choppers and tend to get into trouble a lot. When she falls head over heels in love with a troubled boxer played by Masataka Naruse (who also shows up in Sex &amp; Fury), her life starts looking up.\n\nThat doesn't last for too long, however, as a Yakuza gang have set their sites on the female bikers, and they don't have nice things in mind for them. Miki knows that the only way that she and her gal pals will be able to stand up to the Yakuza is to make amends with her sworn enemy, played by - you guessed it - Reiko Ike.\n\nOnce the girls have made peace, and the Yakuza are no longer a threat, the movie takes a strange turn into typical Suzuki anti-Catholic territory when the girls decide that they ought to try their hands at seducing some priests so that they can blackmail them. Once that's out of the way with, the girls get back on their bikes and the movie picks up the romance aspect as Miki sets out to find the boxer who stole her heart.\n\nJust before the girls show up at the gym where he's training with his coach, the bad Yakuza guys shake the poor bastard around a bit. Being a boxer by trade, he's not going to take their crap lying down and he gets into a pretty serious brawl with the gangsters. Just as it looks like it's curtains for ol' Rocky, Miki and the girls burst onto the scene, hoping to save the day.\n\nMiki almost gets her arm chopped off by a maniac mobster with a power tool fetish, but she makes it out more or less unscathed. Too bad her boy toy wasn't so lucky - he takes a knife to the gut and goes off to that big boxing ring in the sky.\n\nWith her true love buried, Miki and her minions decide it's time for cold hearted revenge, girl gang style. They mount up on their bikes and head on out after the men who killed her Romeo...\n\nPlenty of topless biker girl action, some killer fight scenes, a great score and even a few cool scenes with vintage motorbikes make this one a complete blast. Fast paced with plenty of period kitsch (watch for the guy in the striped pants and the Easy Rider shirt) coupled with the plentiful amount of naked ladies make the movie a visual treat, and the story clicks along at such a great pace that it's not dull, even for a second.\n\nMiki Sugimoto does an excellent job of carrying the film, showing audiences that she can be saucy, sexy and brainy all at the same time. Her character is as tough as any of the gangsters that she's up against and Suzuki wisely allows the focus of the film to remain on her this time out.\n\nRip iNFO\n\nName.........: 02-Girl.Boss.Guerilla.1972.DVDRip.XviD-Allzine.avi\nFilesize.....: 695 MB\nRuntime......: 01:23:41\nVideo Codec..: XviD\nVideo Bitrate: 1031 kb/s\nAudio Codec..: MPEG-1 Layer 3\nAudio Bitrate: 121 kb/s (60/ch, stereo) VBR LAME3.90\nFrame Size...: 544x224 (2.43:1)\nQf...........: .282 bits/pixel\n\n...also included, the movie trailer in QuickTime format...","torrent":{"xt":"urn:btih:030535030bbaa344b2ef2d4aad6541ee5a07ae26","amp;dn":"Pinky.Violence.Girl.Boss.Guerilla.1972.DVDRip.XviD-Allzine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"030535030bbaa344b2ef2d4aad6541ee5a07ae26","infoHashBuffer":{"type":"Buffer","data":[3,5,53,3,11,186,163,68,178,239,45,74,173,101,65,238,90,7,174,38]},"announce":[],"urlList":[]}}