{"title":"One on One: Behind the Scenes with the Greats in the Game","uid":8573840,"size":4126499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03bd0bf821e911d038fc9cf2ef45a067f1e07a36&amp;dn=One+on+One%3A+Behind+the+Scenes+with+the+Greats+in+the+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371229990,"description":"John Feinstein, &quot;One on One: Behind the Scenes with the Greats in the Game&quot;\nISBN: 0316079049 | 2011 | EPUB\n\nJohn Feinstein's illuminating recollections from two decades of interviews with sports legends.\n\nJohn Feinstein's career is a sports fan's dream-a lifetime of encounters with the great figures in sports, not just on the field, but in the locker room and behind the scenes with legends like Bob Knight, Dean Smith, Mike Krzyzewski, Jack Nicklaus, Tiger Woods, and John McEnroe.\n\nSince his days as a young Washington Post journalist, Feinstein has written twenty-eight books and countless magazine articles and newspaper columns, covering college basketball, golf, tennis, baseball, and very nearly every sport in between. He has told us of victory and defeat, of athletes and coaches we love--and love to hate. But some of his best stories have been left untold, until now.\n\nOne on One is an incredible portal into the sports we love-from the box scores and the pageantry of game night and into the hard work and intensity that turn players and coaches into legends.","torrent":{"xt":"urn:btih:03bd0bf821e911d038fc9cf2ef45a067f1e07a36","amp;dn":"One+on+One%3A+Behind+the+Scenes+with+the+Greats+in+the+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03bd0bf821e911d038fc9cf2ef45a067f1e07a36","infoHashBuffer":{"type":"Buffer","data":[3,189,11,248,33,233,17,208,56,252,156,242,239,69,160,103,241,224,122,54]},"announce":[],"urlList":[]}}