{"title":"The Four agreements","uid":11538606,"size":109732646,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:03d094e60e73c672758d8987d1caea9543343171&amp;dn=The+Four+agreements+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"seedcast","files":21,"time":1416650630,"description":"Don Miguel Ruiz is known as a nagual, or shaman, of the Toltec tradition. The Toltecs were an ancient group of scientists and artists that was formed to explore and preserve the practices and spiritual knowledge of the ancient ones. It is not a religion, but a way of life that embraces spirit and honors all the spiritual masters who have taught on the earth. Toltec wisdom arises from the same essential unity of truth as other sacred esoteric traditions that are found all over the world.\nThe Four Agreements are very simple, but very profound. To embrace and live each of the Four Agreements is to find yourself experiencing personal freedom--possibly as never before. The Four Agreements are:\nBe Impeccable With Your Words\nDon't Take Anything Personally\nDon't Make Assumptions\nAlways Do Your Best\nFrom the cover of the book:\nBe Impeccable With Your Word: Speak with integrity. Say only what you mean. Avoid using the word to speak against yourself or to gossip about others. Use the power of your word in the direction of truth and love.\nDon't Take Anything Personally: Nothing others do is because of you. What others say and do is a projection of their own reality, their own dream. When you are immune to the opinions and actions of others, you won't be the victim of needless suffering.\nDon't Make Assumptions: Find the courage to ask questions and to express what you really want. Communicate with others as clearly as you can to avoid misunderstandings, sadness, and drama. With just this one agreement, you can completely transform your life.\nAlways Do Your Best: Your best is going to change from moment to moment; it will be different when you are healthy as opposed to sick. Under any circumstance, simply do your best, and you will avoid self-judgment, self-abuse, and regret.\nThis book may be small in size, but it packs a hefty punch in terms of shattering personal illusions and opening up a path to personal freedom. I consider this book a must-have for anyone wanting to become more conscious and wanting freedom from personal stories and agreements that cause suffering","torrent":{"xt":"urn:btih:03d094e60e73c672758d8987d1caea9543343171","amp;dn":"The+Four+agreements+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03d094e60e73c672758d8987d1caea9543343171","infoHashBuffer":{"type":"Buffer","data":[3,208,148,230,14,115,198,114,117,141,137,135,209,202,234,149,67,52,49,113]},"announce":[],"urlList":[]}}