{"title":"shelly crane, Significance epub [dovah]","uid":8875695,"size":592313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03d2e52b9b8bb4eb2e13a0cc3ee59c684c8ed7e3&amp;dn=shelly+crane%2C+Significance+epub+%5Bdovah%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dovah12","files":3,"time":1378194506,"description":"Maggie is a seventeen year old girl who's had a bad year. She was smart and on track but then her mom left, her dad is depressed, she's graduating, barely, and her boyfriend of almost three years dumped her for a college football schalorship. Lately she thinks life is all about hanging on by a thread and is gripping tight with everything she has. Then she meets Caleb. She saves his life and instantly knows there's something about him that's intriguing but she is supposed to be on her way to a date with his cousin. But things change when they touch, sparks ignite. Literally. They imprint with each other and she sees their future life together flash before her eyes. She learns that not only is she his soul mate, and can feel his heartbeat in her chest, but there is a whole other world of people with gifts and abilities that she never knew existed. She herself is experiencing supernatural changes unlike anything she's ever felt before and she needs the touch of his skin to survive. Now, not only has her dad come out of his depression to be a father again, and a pain as well, but Caleb's enemies know he's imprinted and are after Maggie to stop them both from gaining their abilities and take her from him. Can Caleb save her or will they be forced to live without each other after just finding one another?\nISBN13: 9781481200578\nISBN10: 1481200577","torrent":{"xt":"urn:btih:03d2e52b9b8bb4eb2e13a0cc3ee59c684c8ed7e3","amp;dn":"shelly+crane%2C+Significance+epub+%5Bdovah%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03d2e52b9b8bb4eb2e13a0cc3ee59c684c8ed7e3","infoHashBuffer":{"type":"Buffer","data":[3,210,229,43,155,139,180,235,46,19,160,204,62,229,156,104,76,142,215,227]},"announce":[],"urlList":[]}}