{"title":"Burt Bacharach - A Man And His Music  FLAC","uid":5581206,"size":365275234,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0421201afa7b3838f1af05f477af48563e817296&amp;dn=Burt+Bacharach+-+A+Man+And+His+Music++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"keeybee","files":27,"time":1274545578,"description":"Please seed!\n\nBurt Bacharach (born May 12, 1928) is an American pianist, composer and music producer. He is known for his popular hit songs and compositions from the early 1960s through the 1980s, with lyrics written by Hal David. Many of their hits were produced specifically for, and performed by, Dionne Warwick.\n\nOther singers of his songs in the 60s and 70s included Dusty Springfield (&quot;The Look of Love&quot; from Casino Royale), (a cover of Dionne Warwick's &quot;Wishin' and Hopin&quot;), Cilla Black (a cover of Dionne Warwick's &quot;Anyone Who Had A Heart&quot;),\n(&quot;Alfie&quot;), The Shirelles, The Beatles (&quot;Baby, It's You&quot;), The Carpenters (&quot;(They Long to Be) Close to You&quot;), Aretha Franklin, Isaac Hayes (&quot;Walk On By&quot; on the Hot Buttered Soul album), B.J. Thomas (&quot;Raindrops Keep Falling on\nmy Head&quot;), Tom Jones (&quot;What's New, Pussycat&quot;), Engelbert Humperdinck (&quot;I'm A Better Man&quot;), The Stranglers, The Drifters, Jack Jones (&quot;Wives and Lovers&quot;), Jackie DeShannon (&quot;What the World Needs Now is Love&quot;), Gene Pitney, Herb Alpert,\nJerry Butler and Luther Vandross in the 1980s and 1990s.\n\nBacharach is a three time Academy Award winner.\n\nAs of 2006, Bacharach had written 70 Top 40 hits in the US, and 52 Top 40 hits in the UK.\n\n\nBurt Bacharach - A Man And His Music\nThis compilation Karussell 1997\n\n01  Burt Bacharach - A Man And His Music - Do You Know The Way To San Jose  \n02  Burt Bacharach - A Man And His Music - I Say A little Prayer  \n03  Burt Bacharach - A Man And His Music - I'll Never Fall In Love Again  \n04  Burt Bacharach - A Man And His Music - No One Remembers My Name  \n05  Burt Bacharach - A Man And His Music - This Guy's In Love With You  \n06  Burt Bacharach - A Man And His Music - Time &amp; Tenderness  \n07  Burt Bacharach - A Man And His Music - Wives &amp; Lovers  \n08  Burt Bacharach - A Man And His Music - Raindrops Keep Fallin' On My Head  \n09  Burt Bacharach - A Man And His Music - (They Long To Be) Close To You  \n10  Burt Bacharach - A Man And His Music - The Look Of Love  \n11  Burt Bacharach - A Man And His Music - Alfie  \n12  Burt Bacharach - A Man And His Music - Where Are You  \n13  Burt Bacharach - A Man And His Music - Us  \n14  Burt Bacharach - A Man And His Music - Another Spring Will Rise  \n15  Burt Bacharach - A Man And His Music - Message To Michael  \n16  Burt Bacharach - A Man And His Music - Reach Out For Me  \n17  Burt Bacharach - A Man And His Music - Bond Street  \n18  Burt Bacharach - A Man And His Music - The Young Grow Younger Every Day","torrent":{"xt":"urn:btih:0421201afa7b3838f1af05f477af48563e817296","amp;dn":"Burt+Bacharach+-+A+Man+And+His+Music++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0421201afa7b3838f1af05f477af48563e817296","infoHashBuffer":{"type":"Buffer","data":[4,33,32,26,250,123,56,56,241,175,5,244,119,175,72,86,62,129,114,150]},"announce":[],"urlList":[]}}