{"title":"Get Out of Dodge! Prepping to Leave Your Home and Bug Out During","uid":8099490,"size":221075,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0432f946919f33889ebb0611b141567e4de78e6b&amp;dn=Get+Out+of+Dodge%21+Prepping+to+Leave+Your+Home+and+Bug+Out+During&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"DaRule762","files":-1,"time":1359929034,"description":"When most people think of and picture a &quot;survivalist&quot;, they think of a big, hairy man living alone in a cabin in the woods, wearing a camouflage jacket and pants. With missing teeth and questionable hygiene, our stereotypical survivalist clutches his rifle, ready to shoot any &quot;revenooers&quot; and government agents who head his way, all while muttering under his breath that the sooner civilization collapses, the better.\n\nWell, let me assure - that stereotype couldn't be farther from the truth.\n\nMost of us &quot;survivalist preppers&quot; are normal people. We're your neighbors, your co-workers, and your friends. You see us at our kid's soccer games, or at the neighborhood movie theater, or at your local restaurant. You see us at work and at church. You see us out walking in the neighborhood or exercising down at the gym.\n\nPrepping today isn't for weird nutcases. It's for everyone.\n\nBecause the bottom line is, neither you nor I will know what will happen. It might be a natural disaster. It just might be a terrorist act. It might be martial law and civil unrest. Whatever happens, as preppers, we want to be sure the our family is safe and secure.\n\nThis new guide, &quot;Get Out of Dodge&quot;, discusses what you need to know about prepping to &quot;bug out&quot; or evacuate, if you need to leave your home during a disaster. In this book, you'll find a number of easy-to-read, short chapters to help you start making your GOOD (&quot;get out of Dodge&quot;) plan.\n\nThis book is written for the new prepper, who is ready to start putting a bug out plan in place. This book is for men and women (and yes, increasingly many new preppers are women) who care about the safety and welfare of their families. It's for those who want to be ready should they need to evacuate their family if a crisis or catastrophe happens.\n\nAre you ready with your GOOD plan? Get started on your plan to keep your family safe if you ever need to &quot;get out of Dodge.&quot;","torrent":{"xt":"urn:btih:0432f946919f33889ebb0611b141567e4de78e6b","amp;dn":"Get+Out+of+Dodge%21+Prepping+to+Leave+Your+Home+and+Bug+Out+During","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0432f946919f33889ebb0611b141567e4de78e6b","infoHashBuffer":{"type":"Buffer","data":[4,50,249,70,145,159,51,136,158,187,6,17,177,65,86,126,77,231,142,107]},"announce":[],"urlList":[]}}