{"title":"Rimbaud in Java: The Lost Voyage","uid":8940447,"size":2802948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:047617c8f4f901d121d0261bf5b9099c0e3ca8be&amp;dn=Rimbaud+in+Java%3A+The+Lost+Voyage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"livhre","files":-1,"time":1379647864,"description":"In A Season in Hell, at the age of eighteen, the French poet Arthur Rimbaud predicted the rest of his life: 'My day is done; I'm leaving Europe. The sea air will burn my lungs; lost climes will tan my skin.' Three years later, in 1876, he joined the Royal Army of the Dutch Indies as an infantryman and sailed for Java, where he promptly deserted and fled into the jungle. It was the most enigmatic passage in his life crowded with puzzles and contrarieties.\n\nIn the first book devoted to Rimbaud's lost voyage to Asia, the novelist and critic Jamie James reviews everything that is known about the episode; from there, he imaginatively spirals into a reconstruction of what the poet must have seen and informed speculation about what he might have done, vividly recreating life in nineteenth-century Java along the way. Rimbaud in Java concludes with an inquiry into what the Orient represented in the poet's imagination, with a scandalous, amusing history of French orientalism. James' surprising book is a richly concentrated blend of biography, criticism and thought-travel, which brings into sharp focus this brief encounter between a great writer and a vanished world","torrent":{"xt":"urn:btih:047617c8f4f901d121d0261bf5b9099c0e3ca8be","amp;dn":"Rimbaud+in+Java%3A+The+Lost+Voyage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047617c8f4f901d121d0261bf5b9099c0e3ca8be","infoHashBuffer":{"type":"Buffer","data":[4,118,23,200,244,249,1,209,33,208,38,27,245,185,9,156,14,60,168,190]},"announce":[],"urlList":[]}}