{"title":"The Constable 'Thorny' Deepbriar Mystery Collection","uid":11400342,"size":575895172,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0597643e070d27033fd80067a7b7941e77bb45a3&amp;dn=The+Constable+%27Thorny%27+Deepbriar+Mystery+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"davieboy1966","files":27,"time":1415410661,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\nAll three titles are from CDs and recorded at 48 kbps / 44 kHz Mono, Fraunhofer CBR MP3.\n\nConstable 'Thorny' Deepbriar solves murder mysteries in this engaging series set in rural Yorkshire in the late 1950s.\n\n\n\n1. Bury in Haste [2007], 9 hours 48 mins, 202 MB, read by Geoff Annis\n1956. Constable 'Thorny' Deepbriar is just a mere Yorkshire country bobby, but he's always longed to try his hand at detection. His chance comes when a young man is kidnapped, then turns up the next day, baffled but unharmed. With the affair dismissed as a joke, Deepbriar's unofficial investigation stalls when his only witness vanishes. Then some blood-stained clothing is found and somebody else goes missing. At last the CID takes an interest, and thanks to the flu epidemic decimating the force, Deepbriar finds himself at the very heart of a murder investigation. As the constable pulls all the strands of the affair together, a friend disappears and he has to risk his own life to prevent the murderer from claiming yet another victim...\n\n2. Deadlier than the Sword [2008], 8 hours 14 mins, 170 MB, read by Geoff Annis\n1957. Constable 'Thorny' Deepbriar expects to enjoy a few days of peace and quiet as Minecliff prepares for its summer fete, but he is called to an unpleasant incident involving an illegal mantrap. Then there is a death on the arterial road that may not have been accidental and suddenly he has more than enough to keep him busy. To add to his troubles, Deepbriar's childhood friend has returned home, bringing his fiancee and planning a fairytale wedding, unaware that the village is harbouring dark secrets. With a madman causing mayhem on the local byways, and a malicious writer of anonymous letters targeting some of Minecliff's most respected residents, the constable faces a serious challenge to his detective abilities, and ultimately a threat to his life...\n\n3. More Deaths than One [2009] , 8 hours 34 mins, 177 MB, read by Gordon Griffin\n1958. Convalescing in the English seaside resort where he was stationed during the war, Constable Thorny Deepbriar can't resist looking into a case that the local police are treating as a joke. When a body is discovered on the beach, Deepbriar is then forced to wade into the murky waters of his past to uncover the truth of events that took place over a decade ago. Most of the evidence is missing and most of the witnesses are dead or scattered, but unless Deepbriar solves the mystery, he could be facing a charge of murder himself!\n\nA fourth book in this series called &quot;Gone Astray&quot; was published in 2012 but as yet has not appeared in audio format.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0597643e070d27033fd80067a7b7941e77bb45a3","amp;dn":"The+Constable+%27Thorny%27+Deepbriar+Mystery+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0597643e070d27033fd80067a7b7941e77bb45a3","infoHashBuffer":{"type":"Buffer","data":[5,151,100,62,7,13,39,3,63,216,0,103,167,183,148,30,119,187,69,163]},"announce":[],"urlList":[]}}