{"title":"Algo Habran Hecho DVDFULL","uid":15418270,"size":14008829431,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05d4944032f6eb7fd43eeb1cd2a94379c4858847&amp;dn=Algo+Habran+Hecho+DVDFULL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OstDvd77","files":9,"time":1469610229,"description":"Miniserie de TV (2005-2008). 12 episodios. Cobertura realizada de manera entretenida y didáctica, con recreaciones dramatizadas, de los principales hechos que se sucedieron en Argentina desde sus inicios a comienzos del siglo XIX. \r\n\r\nAlabo la valentía de esta serie por mostrarnos a los grandes de la Historia tal como eran, con sus defectos (muchísimos) y virtudes (pocas), algo completamente diferente a lo que nos enseñaban en la escuela, con ese exceso de patriotismo barato. Hasta San Martín era un cabrón que pasaba a cuchillo a los soldados que se quedaban atrás, algo parecido a lo que ordenaba Stalin en la Segunda Guerra Mundial, cuando los soldados que quedaban en la retaguardia eran ametrallados si daban un paso atrás. El discurso de Sarmiento poco se diferenciaba del de Hitler, pues aquél abogaba por exterminar al gaucho, desde el más pequeño al más anciano, por considerar su raza inferior, violenta y salvaje. Todos los políticos, estadistas y militares de renombre en la Argentina fueron corruptos, asesinos y manipuladores, gente a la que solo le importaba el poder, el capital y eliminar a todo el que vieran con desagrado.\r\nEl aspecto técnico de la serie es impecable, se nota que no han ahorrado en gastos, además de contar con la presencia de talentosas y famosas caras del panorama nacional","torrent":{"xt":"urn:btih:05d4944032f6eb7fd43eeb1cd2a94379c4858847","amp;dn":"Algo+Habran+Hecho+DVDFULL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d4944032f6eb7fd43eeb1cd2a94379c4858847","infoHashBuffer":{"type":"Buffer","data":[5,212,148,64,50,246,235,127,212,62,235,28,210,169,67,121,196,133,136,71]},"announce":[],"urlList":[]}}