{"title":"You Can't Stop Me series by Max Allan Collins (ePub Retail)","uid":8652182,"size":760436,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:066172263ff8099aab8508f1bf38ca639de99c88&amp;dn=You+Can%27t+Stop+Me+series+by+Max+Allan+Collins+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TxJag","files":6,"time":1373134504,"description":"Max Allan Collins has earned an unprecedented ten Private Eye Writers of America Shamus nominations for his historical thrillers, winning twice for his Nathan Heller novels, True Detective and Stolen Away. A Mystery Writers of America Edgar nominee in both fiction and non-fiction categories, Collins has written five suspense novel series, film criticism, short fiction, songwriting, trading-card sets, and movie/TV tie-in novels, including Air Force One, The Mummy Returns, the New York Times bestselling Saving Private Ryan, CSI: Double Dealer (from the CBS series), and The Scorpion King.\n\nHe scripted the internationally syndicated comic strip Dick Tracy from 1977 to 1993 and has written the Batman comic book and newspaper strip. His graphic novel, Road to Perdition, has been made into a DreamWorks feature film starring Tom Hanks and Paul Newman, directed by Sam Mendes.\n\nCollins lives in Muscatine, Iowa, with his wife, writer Barbara Collins, and son, Nathan.\n\nYou Can't Stop Me series:\nYou Can't Stop Me (#1): Smalltown sheriff J.C. Harrow made headlines when he apprehended a would-be presidential assassin--only to come home that night and find his wife and son brutally murdered. This tragic twist of fate launched his career as the host of reality TV's smash-hit, Crime Seen! But while media star Harrow tracks down dangerous criminals coast to coast--with the help of viewers' tips--a killer with a twisted agenda is making his own bloody path to fame. . .\n\nAs the trail of violence draws closer, Harrow goes off script in a manhunt for the psycho who slaughtered his family. The cameras are rolling. And all of America is watching--including a serial killer with a very specific target audience....\n\nNo One Will Hear You (#2): The first video arrives by email. An unidentifed man. A naked woman. Her scream caught in a freeze-frame. The producers of TV's Crime Seen! can't believe what they're witnessing--an all-out sadist &quot;auditioning&quot; for a starring role in reality television. And if he doesn't get it, he'll kill again.\n\nTo meet the demented demands of the self-proclaimed &quot;Don Juan,&quot; former sheriff and TV host J.C. Harrow has no choice but to spotlight him along with another ruthless maniac who has captivated millions of viewers. Now two killers are locked in a bloodthirsty competition. For fame. For notoriety. For victims.\n\nFull Retail. ePub and Calibre reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:066172263ff8099aab8508f1bf38ca639de99c88","amp;dn":"You+Can%27t+Stop+Me+series+by+Max+Allan+Collins+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"066172263ff8099aab8508f1bf38ca639de99c88","infoHashBuffer":{"type":"Buffer","data":[6,97,114,38,63,248,9,154,171,133,8,241,191,56,202,99,157,233,156,136]},"announce":[],"urlList":[]}}