{"title":"THC - O Mundo Sem Ninguem","uid":4077711,"size":768196838,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:066e6626646b637e90692865ff9a30a99f703fd5&amp;dn=THC+-+O+Mundo+Sem+Ninguem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xara_maior","files":1,"time":1205367547,"description":"Audio: Portugues\nLegendas/Subtitles: none\nDuracao: 01:27h\nBitrate: 1027 kbps\nResolucao: 640 x 352 (4:3)\nCodecs: DivX/mp3\nTVRip\n\n++++++++++++++++++++++++++\n\nAs piramides talvez existam para sempre. As cidades vao desaparecer. Nossas maiores obras primas vao desmoronar e desaparecer. E nossas garrafas de plastico formarao enormes ilhas flutuantes vagando pelos oceanos por milenios.\n\nAA medida que o aquecimento global e a exaustao dos recursos naturais se tornam mais prementes, eh importante considerar como podemos reduzir nosso impacto sobre o planeta. O MUNDO SEM NINGUEM leva em conta a reducao total do nosso impacto: o desaparecimento do ser humano.\n\nA intrigante nocao do futuro pos-humano do nosso planeta (um exercicio de imaginacao fascinante explorado por cientistas e estudiosos) eh exaustivamente explorado nesse especial do THC atraves de um viÂ­vido imaginario e duma cativante computacao grafica.\n\nViaje com O MUNDO SEM NINGUEM a lugares ao redor do mundo jah enfrentando esse processo. Ficaremos impressionados pelas mudancas ocorridas depois de apenas algumas decadas na fantasmagorica cidade de Chernobyl, abandonada em 1986, e nas cidades costeiras do Maine. Essa producao acelera o relogio atraves de seculos no futuro para mostrar uma Terra sem os humanos. Especialistas em engenharia, botanica, ecologia, biologia, geologia, climatologia e geologia fornecem respostas a muitas perguntas provocativas.\n\nO que aconteceria com a Terra se os humanos desaparecessem? \nTodas as nossas obras desapareceriam do planeta?\nQuanto tempo isso levaria?\nAs especies ameacadas de extincao prosperarao ou a exterminacao continuarah pacificamente?\n\nNao eh o nosso futuro. Eh o futuro do planeta.\n\n+++++++++++++++++++++\n\n\nSite oficial: http://www.history.com/minisites/life_after_people","torrent":{"xt":"urn:btih:066e6626646b637e90692865ff9a30a99f703fd5","amp;dn":"THC+-+O+Mundo+Sem+Ninguem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"066e6626646b637e90692865ff9a30a99f703fd5","infoHashBuffer":{"type":"Buffer","data":[6,110,102,38,100,107,99,126,144,105,40,101,255,154,48,169,159,112,63,213]},"announce":[],"urlList":[]}}