{"title":"Cracker - Garage dOr (2 CD Greatest Hits) 2000 [FLAC] Kitlope","uid":6448019,"size":803044923,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:073f804fc2c2058ebb35849bafe2ab745c8b10c6&amp;dn=Cracker+-+Garage+dOr+%282+CD+Greatest+Hits%29+2000+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Kitlope","files":35,"time":1307335918,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716A \nPlextor Firmware: 1.11 / 1.05 (Final)\nCd Software: Exact Audio Copy V1.0 Beta 1 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: 073F804FC2C2058EBB35849BAFE2AB745C8B10C6\nFile Size: 765.84 MB\nYear: 2000\nLabel: Virgin Records\nCatalog #: 7243 8 49005 2 6\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\nCracker is an American alternative rock band featuring singer David Lowery and guitarist Johnny Hickman. They are best known for their platinum-selling 1993 album, Kerosene Hat, featuring the hit songs &quot;Low&quot;, &quot;Euro-Trash Girl&quot;, and &quot;Get Off This&quot;.\n\nFounders Lowery and Hickman formed the band in 1991, soon releasing the album Cracker (featuring the hits &quot;Happy Birthday to Me&quot; and &quot;Teen Angst&quot;) on Virgin Records. The band has been touring continually ever since, releasing 10 studio albums (plus several compilations, collaborations and live albums).[1] Their most recent album is Sunrise in the Land of Milk and Honey, released May 5, 2009 on 429/Savoy Records.[2] Cracker mixes influences and sounds ranging from rock, punk, alt-country, psychedelia, blues, and folk.\n\nShortly after Lowery's former group Camper Van Beethoven called it quits in 1990, he began demoing material along with guitarist Johnny Hickman (formerly in The Unforgiven) and bassist Davey Faragher, eventually going by the name Cracker. A brief tour with Virginia drummer Greg Weatherford followed. The band recorded a demo tape, later nicknamed Dirty Yellow Demos by the group's fan base, which included early versions of songs that would appear on later albums.\n\nBy 1991, the newly formed band had signed a recording contract with Virgin Records and enlisted the help of several drummers/percussionists (Jim Keltner, Michael Urbano and Phil Jones), issuing their self-titled debut in 1992. The album featured the radio hit &quot;Teen Angst (What the World Needs Now)&quot;, which peaked at #1 on Modern Rock Tracks, and a second single entitled &quot;Happy Birthday to Me&quot;.\n\nA year later, Cracker issued their best-selling album, Kerosene Hat, which featured the hits &quot;Low&quot; and &quot;Get Off This&quot;, as well as a cover of the Grateful Dead's &quot;Loser&quot;. The album sold close to half a million copies.[3] Urbano performed on Kerosene Hat and toured with Cracker before leaving the band, along with Faragher. After a short stint with Bruce Hughes, the group added Bob Rupe as bassist. In 1993, Cracker contributed the song &quot;Good Times Bad Times&quot; to the Encomium tribute album to Led Zeppelin (which was recorded after their rendition of &quot;When the Levee Breaks&quot; was deemed &quot;too weird&quot;).\n\nThree years later, The Golden Age was released, with &quot;I Hate My Generation&quot; as the lead single.[3] However, the music scene was shifting away from guitar-driven alternative rock, and the single and album did poorly. Following the long-term additions of drummer Frank Funaro and keyboardist Kenny Margolis, the band tried again in 1998 with Gentleman's Blues, featuring &quot;The Good Life&quot; as the lead single, to a lukewarm critical response and further poor sales.[3]\n\nCamper Van Beethoven unexpectedly re-formed in 1999. Since that time, Lowery has performed in both bands.\n\nA compilation called Garage D'Or was released in 2000, with one disc composed of greatest hits and three new songs, and another of outtakes, soundtrack contributions, demos and other obscurities. Rupe departed in January 2000 and was replaced by bassist Brandy Wood. In 2002, the band released its next studio album, Forever which, once again, was met with limited commercial and critical success.\n\nThe group left Virgin in 2003 with the independent release Countrysides, composed of eight country and western covers and one new, original song. A collaboration with bluegrass band Leftover Salmon, Oh Cracker, Where Art Thou? (2003), contained bluegrass versions of old Cracker songs. In 2005, Cracker and Camper Van Beethoven started an annual three night &quot;Campout&quot; at Pappy and Harriet's Pioneertown Palace in Pioneertown, CA, close to where David and Johnny met, in which they and several other bands perform, including sets by Cracker and Camper band members performing their own music. Previous years' guests have included Roger Clyne, John Doe, Neko Case, Ike Reilly, Ryan Bingham, Vermillion Lies, Jason Molina &amp; Magnolia Electric Co, Built To Spill, Brant Bjork and the Bros, Clem Snide, Gram Rabbit, and The Bellrays.\n\nWith Camper Van Beethoven bassist Victor Krummenacher replacing Wood, the band released the studio album Greenland on June 6, 2006 and continued to tour extensively. After the departures of Margolis and Krummenacher, the band's lineup stabilized in 2007 around Hickman, Lowery, Funaro and new bassist Sal Maida, who had played with Roxy Music.\n\nCracker released a new studio album entitled Sunrise in the Land of Milk and Honey to positive reviews on May 5, 2009. It was the band's first chart on the Billboard 200 in over a decade, after having sold over 3,000 copies in a week. This was in part due to the Triple A chart success of the album's lead single, &quot;Turn On, Tune In, Drop Out With Me.&quot;\n\nIn January 2011, David Lowery released his first solo album, The Palace Guards, on 429 Records. In March, Cracker announced Campout East, the east coast counterpart to their Campout festival, to be held in Crozet, Virginia. The first Campout East will be held at Misty Mountain Camp Resort and will be co-hosted by Sons of Bill.\n\n\n\n\n\n\n\nGarage D'or 2000\n\n\nGarage D'Or is Cracker's fifth album. It is a two disc album, with the first disc representing a &quot;greatest hits&quot; collection, and the second disc compiling rarities and previously unreleased material.\n\n\nTracks: \n\n\nDisc 1 - Greatest Hits\n\n\n1.\t&quot;Teen Angst (What the World Needs Now)&quot;\n2.\t&quot;This Is Cracker Soul&quot;\n3.\t&quot;I See the Light&quot;\n4.\t&quot;Low&quot;\n5.\t&quot;Get Off This&quot;\n6.\t&quot;Sweet Potato&quot;\n7.\t&quot;Euro-Trash Girl&quot;\n8.\t&quot;Shake Some Action&quot; (From Clueless soundtrack)\n9.\t&quot;Sweet Thistle Pie&quot;\n10.\t&quot;I'm a Little Rocket Ship&quot;\n11.\t&quot;Big Dipper&quot;\n12.\t&quot;Seven Days&quot;\n13.\t&quot;Been Around the World&quot;\n14.\t&quot;Be My Love&quot;\n15.\t&quot;Heaven Knows I'm Lonely Now&quot;\n16.\t&quot;Eyes of Mary&quot;\n\n\nDisc 2 Bonus \n\n\n1.\t&quot;Surfbilly&quot; (BBC session outtake)\n2.\t&quot;The Golden Age&quot; (Live)\n3.\t&quot;You Ain't Going Nowhere (Live featuring Adam Duritz and Joan Osborne)\n4.\t&quot;Hollywood Cemetery&quot; (Previously unreleased)\n5.\t&quot;Whole Lotta Trouble&quot; (From Empire Records soundtrack)\n6.\t&quot;I Want Out of the Circus&quot; (Live)\n7.\t&quot;Steve's Hornpipe&quot; (Early Cracker demo)\n8.\t&quot;Mr. Wrong&quot; (Live)\n9.\t&quot;Sunday Train&quot; (Kerosene Hat out-take)\n10.\t&quot;Lonesome Johnny Blues&quot; (Live)\n11.\t&quot;Rainy Days and Mondays&quot; (The Carpenters cover) (From If I Were a Carpenter tribute album)\n12.\t&quot;China&quot; (Early Cracker demo)\n\nThe Surfbilly song comes from a Mark Ratcliffe on the BBC from 1994 (12/03 or 03/12)\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:073f804fc2c2058ebb35849bafe2ab745c8b10c6","amp;dn":"Cracker+-+Garage+dOr+%282+CD+Greatest+Hits%29+2000+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"073f804fc2c2058ebb35849bafe2ab745c8b10c6","infoHashBuffer":{"type":"Buffer","data":[7,63,128,79,194,194,5,142,187,53,132,155,175,226,171,116,92,139,16,198]},"announce":[],"urlList":[]}}