{"title":"None Dare Call It Treason - John Stormer","uid":11717785,"size":8818923,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:079155e1e1868cd661eaa23f7bd2388ba413ffe4&amp;dn=None+Dare+Call+It+Treason+-+John+Stormer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1424668149,"description":"\nAre the changes in Eastern Europe and the Soviet Union for real? or could they be apart of a cleverly executed long range plan designed to disarm the United States while providing the Russians with economic aid they desperately need to bail out their collapsed economy? As a 30-year student of the world communist movement, John Stormer has the credentials to ask and answer those questions. Stormer's original None Dare Call It Treason documented how leftists of various persuasions have dominated America's schools, churches, press, labor unions and State Department for 70 years as they murdered 100-million people and enslaved other billions. These leftists - and their disciples - maintain their power bases and influence in America's basic institutions today. To prevent them from piling new tragedies on top of old - and to insure that traditional American freedomsare not traded away for socialist dreams or new communist deceptions - Americans must realize what has happened in the past and why. None Dare Call It Treason is the tool for awakening and educating Americans so they thwart leftist plans for entangling the United States in a &quot;new world order.&quot;\n\n\nAbout the author:\n In the 1950s, John Stormer became disillusioned with the political candidates and philosophies that he was asked to support. In 1962, he left his career as editor and general manager of a leading electrical magazine to begin an intensive study of communism. With what he learned, he wrote the book None Dare Call It Treason which sold millions of copies. The book argues that the United States is losing the Cold War because it has been heavily infiltrated by Communist subversives. Visiting Vietnam twice, first in 1965, he has toured many other world trouble spots on fact-finding missions.\n John Stormer cast his penetrating spotlight even on the high and mighty. He was, in fact, among the first writers to expose the nefarious goals of the Council on Foreign Relations, and to reveal the funding of subversive leftwing causes and groups by the wealthy tax-exempt foundations. John Stormer's book identified the Council on Foreign Relations as a procommunist threat. Mr Stormer also courageously exposed the un-American character of the United Nations, denouncing in the process the entire spirit of internationalism... with a call to action for all concerned Americans... he also recommended joining some of the &quot;well-established national organizations&quot; devoted to the Americanist cause, such as The John Birch Society...&quot;","torrent":{"xt":"urn:btih:079155e1e1868cd661eaa23f7bd2388ba413ffe4","amp;dn":"None+Dare+Call+It+Treason+-+John+Stormer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079155e1e1868cd661eaa23f7bd2388ba413ffe4","infoHashBuffer":{"type":"Buffer","data":[7,145,85,225,225,134,140,214,97,234,162,63,123,210,56,139,164,19,255,228]},"announce":[],"urlList":[]}}