{"title":"The Golden Book of Chemistry Experiments","uid":8834202,"size":29261391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07b4291ba26ac8f3df8f2810a39fbd2bb76d0093&amp;dn=The+Golden+Book+of+Chemistry+Experiments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"H2oDragon","files":2,"time":1377070371,"description":"Banned: The Golden Book of Chemistry Experiments (1960)\n\nBack in the late 60's this book was pulled from all public libraries and store shelves by the government. It was said that the experiments and information contained herin were too dangerous for the general public. How'd I luck up on a copy? Well, a friend of mine who could remember checking out and reading the book when he was a kid, thought he would try to find a copy for himself just for sentimental reasons. To his surprise this book is extremely rare and expensive if you do find a copy for sale. With books going from $375 for a very damaged copy to upwards of $2,000 for a decent copy he knew it would be a task. So he enlisted my help, and a couple of weeks later I just happened to find a copy at an old library book sale. So I purchased this book in great condition at a considerable discount. I sold it to him for a profit (of course), but before I let go of it I felt that the information contained herin needs to be shared. I submit to you the only electronic copy of The Golden Book of Chemistry Experiments in existance...\n\nThe Golden Book of Chemistry Experiments (1960)\nBrent, Robert\n\n\nA review:\n\nChemistry at its best. (March 10, 2004)\nReviewer: M. Petnuch &quot;stratofort&quot; (Richton Park, IL United States)\nHard to find, (and very costly if you do) is the original 1960 edition of this book. It seems to have gained infamy since the 1995 incident near Detroit of child chemist, David Hahn. With the release of a full scale book this month by author Ken Silverstein called 'The Radioactive Boyscout', which details this nuclear incident, the popularity of this early chemistry 'how to do it' book will only grow. The early edition is known for its 50's style simplicity where chemical wastes and pollution were never a concern to Americans, certainly not in the age of 'better living through chemistry'!!! Thoroughly interesting and full of ideas and inspiration, it is the bible for any young chemist-in-training. You will enjoy.\n\n\nDetails on a second printing copy for sale:\nNY: Golden Press. 1962. H Pictorial Library Binding. Very Good. fep removed, stamps, light wear, small faint thumbings at margins elsepages clean and tight. children's/juvenile science. 2nd printing. How to set up a home laboratory. Over 200 simple experiments. Words used by chemists. What chemistry is, your home laboratory, chemical formulas, metals, more.\n\nDo-It-yourself Science Extremely Scarce.\n\n* Seller Inventory #: sss0349005\n* Publisher: Golden Press\n* Place: NY\n* Date published: 1962\n* $2129.40\n\nEnjoy!\n\n--\nPeace. ~G","torrent":{"xt":"urn:btih:07b4291ba26ac8f3df8f2810a39fbd2bb76d0093","amp;dn":"The+Golden+Book+of+Chemistry+Experiments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07b4291ba26ac8f3df8f2810a39fbd2bb76d0093","infoHashBuffer":{"type":"Buffer","data":[7,180,41,27,162,106,200,243,223,143,40,16,163,159,189,43,183,109,0,147]},"announce":[],"urlList":[]}}