{"title":"Light Image Resizer 4.5.8.0","uid":9507743,"size":7076576,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:07bcc45389827b52015ead073cf776f15b3b57a3&amp;dn=Light+Image+Resizer+4.5.8.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eloisa_larissa21","files":-1,"time":1390346493,"description":"When you become one of those users who have an impressive collection of images, a little maintenance is necessary. Light Image Resizer is a small tool that can resize, compress, convert and share your pictures online.\n\nDuring the installation phase, you should pay attention because we're talking about an ad-supported application. So, Light Image Resizer offers to install various third-party software, as well as to change the search engine and homepage of the default browser.\n\nAt the first software initiation, you can select the type of interface you want to work with (basic or complete options).\n\nAll you have to do is add the source file or files, configure their options, and hit the Process button. Tasks are done in just a few seconds, after which you can click the small arrow near the Close button to process more images.\n\nIn the Options tab, you can select profile (e.g. desktop resolution, Sony PSP, iPhone), width and height (in pixels, percent, inches or centimeters), resize mode (fit, stretch, center, crop, retarget), toggle whether you want to keep aspect ratio or not, select action as well as destination directory.\n\nThanks to this tool you can resize and create copies, resize the original, resize and move, resize and compress as ZIP, create PDFs, or share on Facebook.\n\nAdvanced settings can be changed according to filtering (e.g. fast linear), policy (always resize, enlarge or reduce), format (as original, BMP, JPG, GIF, PNG, TIF, PDF, PSD, PCX, TGA), quality, size, resolution, and filename mask.\n\nFurthermore, you can integrate watermarks, invert colors, convert to gray scale, apply the Sepia effect, add borders, adjust resolution for portraits, keep original file date, or send output files by email.\n\nLight Image Resizer is clearly designed for both rookies and power users. It supports several languages, features descriptions for each option, uses a moderate amount of system resources, and it is generally very intuitive (you don't need a help file to learn how to use it).","torrent":{"xt":"urn:btih:07bcc45389827b52015ead073cf776f15b3b57a3","amp;dn":"Light+Image+Resizer+4.5.8.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07bcc45389827b52015ead073cf776f15b3b57a3","infoHashBuffer":{"type":"Buffer","data":[7,188,196,83,137,130,123,82,1,94,173,7,60,247,118,241,91,59,87,163]},"announce":[],"urlList":[]}}