{"title":"Padraic Kenney - The Burdens of Freedom. Eastern Europe Since 19","uid":10316969,"size":1937990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0819c439d6a5b57c432c7516d8d77bea7bfbfb46&amp;dn=Padraic+Kenney+-+The+Burdens+of+Freedom.+Eastern+Europe+Since+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1402258658,"description":"Description\nProduct Details\nBook Title: The Burdens of Freedom: Eastern Europe Since 1989 (Global History of the Present)\t\nBook Author: Padraic Kenney\nSeries: Global History of the Present\nHardcover: 224 pages\nPublisher: Zed Books (October 3, 2006)\nLanguage: English\nISBN-10: 1842776622\nISBN-13: 978-1842776629\n\n===================================================================================\nBook Description\nRelease date: October 3, 2006 | ISBN-10: 1842776622 | ISBN-13: 978-1842776629\nThe Burdens of Freedom is a history of fifteen countries -- some newly-created -- as they make their way from communism to the present day. For some, the story ends happily, with triumphant entry into the European Union in 2004. Others are caught in limbo, destroyed by nationalist politics, war, and genocide, or crippled by corrupt political practices. Domestically, each country, and the region as a whole, has seen a divide emerge between winners and losers, as the emergence from one particular political and economic system has proved easy for some social groups, impossible for others. Both the winners and losers, though, represent the New Europe, moving simultaneously forward to democracy, unity, and prosperity, and toward national division, corruption, and economic disparity.\n\n===================================================================================\nReviews\n&quot;An exceedingly useful book - a sensible and perspicacious assessment of the complex and often just plain confusing developments after 1989. And an exciting read. Kenney highlights the strenuous processes of democratic nation-building and reminds us that, despite set-backs and outright disasters, democratic nations can be built in the twenty-first century and that Europe has become a different continent for it.&quot;--Michael Geyer, Department of History, University of Chicago\n\n&quot;Padraic Kenney's insightful survey of Eastern Europe since the fall of communism combines sensitive local histories with sophisticated general theory. The Burdens of Freedom makes sense of the paradoxical development of a vast and diverse region: its arduous economic transitions, its accommodation of painful pasts, and despite intervening disillusion and setbacks, its emerging civic stamina.&quot;--Charles S. Maier, Saltonstall Professor of History, Harvard University and author of Dissolution: The Crisis of Communism and the End of East Germany\n\n===================================================================================\nAbout the Author\nPadraic Kenney is author of several books on East European history and politics, including A Carnival of Revolution: Central Europe, 1989 (2002). He divides his time between Wroclaw, Poland, and Boulder, Colorado, where he is Professor of History at the University of Colorado.\n===================================================================================","torrent":{"xt":"urn:btih:0819c439d6a5b57c432c7516d8d77bea7bfbfb46","amp;dn":"Padraic+Kenney+-+The+Burdens+of+Freedom.+Eastern+Europe+Since+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0819c439d6a5b57c432c7516d8d77bea7bfbfb46","infoHashBuffer":{"type":"Buffer","data":[8,25,196,57,214,165,181,124,67,44,117,22,216,215,123,234,123,251,251,70]},"announce":[],"urlList":[]}}