{"title":"Writer's Craft Series - Rayne Hall","uid":14513068,"size":5291970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:089753c6e8a544a5a49952913b4677afacb88241&amp;dn=Writer%27s+Craft+Series+-+Rayne+Hall&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":6,"time":1462306988,"description":"The ebooks in Rayne Hall's Writing Craft series equip authors with tools for their writing craft.\r\n\r\n\r\nContains:\r\nWriting Fight Scenes\r\nThis book will help you to write a fight scene which is entertaining as well as realistic, and leaves the reader breathless with excitement.\r\n\r\nThe book suggests a six-part structure to use as blueprint for your scene, and reveals tricks how to combine fighting with dialogue, which senses to use when and how, and how to stir the reader's emotions. You'll decide how much violence your scene needs, what's the best location, how your heroine can get out of trouble with self-defence and how to adapt your writing style to the fast pace of the action.\r\n\r\nWriting Scary Scenes \r\nAre your frightening scenes scary enough? Learn practical tricks to turn up the suspense. Make your readers' hearts hammer with suspense, their breaths quicken with excitement, and their skins tingle with goosebumps of delicious fright. \r\n\r\nThis book contains practical suggestions how to structure a scary scene, increase the suspense, make the climax more terrifying, make the reader feel the character's fear. It includes techniques for manipulating the readers' subconscious and creating powerful emotional effects. \r\n\r\nUse this book to write a new scene, or to add tension and excitement to a draft.\r\n\r\nWhy Does My Book Not Sell? 20 Simple Fixes\r\nDoes your book sell as well as it deserves? \r\n\r\n\r\nIf it doesn't, one of twenty blocks may hinder its sales—blocks you can easily remove once you're aware of them. Sell more books!\r\n\r\n\r\nMany authors who've used this guide for a few weeks already report a significant increase in sales. \r\n\r\n\r\nEach chapter reveals one area where indie authors are sabotaging their books' success, and shows how you can free yourself from that trap. Whether you want to sell 100,000 copies or would be happy with just 100, this guide helps you raise your book above the hundreds of thousands of titles competing for attention. All strategies are proven and ethical - no cheating, no aggressive methods, no hype. \r\n\r\nWriting About Villains\r\nCreate the villain your novel deserves: a fiend whom your readers will love to hate and can never forget. \r\n\r\nInstead of cardboard evil-doers with evil laughter and stinking breath, you will develop villains with personality, ideals, feelings and conflicts. They will challenge your heroes, chill your readers, and give your novel excitement and depth.\r\n\r\nThis book is part of the Writing Craft Series: Writing Fight Scenes, Writing Scary Scenes, The Word-Loss Diet, Writing About Villains, and more.\r\n\r\nThe Word-Loss Diet\r\nTighten and tone your writing style, and use simple revision tricks to slim down your manuscript. Shed thousands of words without changing the plot.\r\n\r\nStrip away the word fat and reveal the muscle of your unique author voice.\r\n\r\nThis book is short, but potent\r\n\r\nA short story is the perfect tool for promoting your novel. Readers who love your story will look for more fiction by the same author. \r\n\r\nHere are some ideas: post a story on your website as a free read or give it to another writer of the same genre to display it on their website. Publish it as a short free ebook, bolstering your list of published books. Offer it as a giveaway on blog tours. Submit it to a magazine, ezine or anthology where it will get read by lovers of your genre. \r\n\r\nThis book is structured like a workshop, based on an online class I taught. As you progress through the chapters, you’ll build your story step by step, from the spark of an idea to the polished version that will wow your readers and make them eager to buy your novel. \r\nWriting Short Stories to Promote Your Novels\r\n\r\nWriting About Magic\r\nUse Twitter to improve your writing, network with other authors, meet fans, build a platform, gain exposure, find reviewers and sell books. \r\n\r\nRayne Hall has one of the best platforms any writer has on Twitter – with over 50,000 genuine, engaged followers who enjoy her tweets and buy her books. Here she shares practical advice, fun ideas, step-by-strategies for success – and even the embarrassing mistakes she made. \r\nTwitter for Writers \r\n\r\nWriting Dark Stories\r\nLearn to to haunt your readers with powerful, chilling tales. Make their spines tingle with anticipation and their skins crawl with delicious fear. Disturb their world-view and invite them to look into the dark corners of their own souls. \r\n\r\nThis book gives you a wealth of tools and techniques for writing great short stories. It is part of the acclaimed Writer's Craft series. \r\n\r\nWriting Vivid Settings\r\nDo you want your readers to feel like they're really there—in the place where the story happens? \r\n\r\nWhether you want to enrich stark prose with atmospheric detail, add vibrancy to a dull piece or curb waffling descriptions, this guide can help. Learn how to make your settings intense, realistic, and intriguing. \r\n\r\nThis is the tenth book in Rayne Hall's acclaimed Writer's Craft series","torrent":{"xt":"urn:btih:089753c6e8a544a5a49952913b4677afacb88241","amp;dn":"Writer%27s+Craft+Series+-+Rayne+Hall","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089753c6e8a544a5a49952913b4677afacb88241","infoHashBuffer":{"type":"Buffer","data":[8,151,83,198,232,165,68,165,164,153,82,145,59,70,119,175,172,184,130,65]},"announce":[],"urlList":[]}}