{"title":"Ultimate Fitness for Martial Arts (by Undefined).avi","uid":3978125,"size":623800320,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:091397f093896d68def99d7809a5d9bcae23b201&amp;dn=Ultimate+Fitness+for+Martial+Arts+%28by+Undefined%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deceneu78","files":1,"time":1200358611,"description":"   Ultimate.Fitness.for.Martial.Arts.DivXNoGRP\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                             General Information\n-------------------------------------------------------------------------------\nType.................: Movie\n\n\n\nVideo Format.........: DivX \nVideo Bitrate........: 772\nResolution...........: 352x264\nFPS..................: 29.97\n\n-------------------------------------------------------------------------------\n                                Release Notes\n-------------------------------------------------------------------------------\nAchieving and maintaining the high level of fitness required for martial arts \ntraining is a scientific process. The training methods you use and the way you \nworkout can greatly affect your success in the ring and on the street. In this \ninformative DVD, Sang H. Kim has brought all of the exercises in the Ultimate \nFitness video series together into one powerful presentation. He teaches you the \nexercises that have helped him maintain ultimate flexibility for over 20 years \nand demonstrates the most effective exercises for developing explosive power and \nspeed in your techniques using weight training, running, isometrics, and more. \nPlus, get advice on developing hard to work areas like agility, balance, \ncoordination and timing.\n\nPacked with information, this DVDrip is guaranteed to bring variety to your \nworkout no matter what style you practice. You get over 100 drills, exercises \nand training methods that have made the Ultimate Fitness Series bestsellers. \nDiscover which exercises are the most effective, how you should execute them for \nmaximum results, how to apply them to your martial arts training and dozens more \nexpert workout tips from Sang H. Kim, author of Ultimate Fitness through Martial \nArts, as he explains and demonstrates each exercise.\n\nReviewer: Midwest Book Review from Wisconsin    \nIn Ultimate Fitness for Martial Arts, martial arts expert Sang H. Kim combines \nthe content of three videos on one DVD, resulting in a well-rounded presentation \non how to optimize personal physical power, flexibility and speed. Kim ably \ndemonstrated exercises and techniques in weight training, running, isometrics \nand more that helped him remain limber for over 20 years. A special feature on \ndynamic breathing rounds out this superb high-activity fitness instructional DVD \nwhich is recommended to martial arts students and general viewers with an \ninterest in optimizing their physical health and well being.\n\n\n","torrent":{"xt":"urn:btih:091397f093896d68def99d7809a5d9bcae23b201","amp;dn":"Ultimate+Fitness+for+Martial+Arts+%28by+Undefined%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"091397f093896d68def99d7809a5d9bcae23b201","infoHashBuffer":{"type":"Buffer","data":[9,19,151,240,147,137,109,104,222,249,157,120,9,165,217,188,174,35,178,1]},"announce":[],"urlList":[]}}