{"title":"Dallas (2012)","uid":13393061,"size":11652291920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:09632e93980be0afc64e1b264872edc91e467f0c&amp;dn=Dallas+%282012%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7436746","files":41,"time":1454353017,"description":"http://www.imdb.com/title/tt1723760/\r\n\r\nThe next generation of the Ewing family - cousins John Ross Ewing and Christopher Ewing - clash over the family's oil business and vast fortune.\r\n \nhttp://www.wikiwand.com/en/Dallas_(2012_TV_series)\r\n\r\nDallas is an American television soap opera developed by Cynthia Cidre and produced by Warner Horizon Television that aired on TNT from June 13, 2012, to September 22, 2014. The series was a revival of the prime time television soap opera of the same name that aired on CBS from 1978 to 1991. The series revolved around the Ewings, a wealthy Dallas family in the oil and cattle-ranching industries.\r\n\r\nThe series brought back several stars of the original series, including Patrick Duffy as Bobby Ewing, Linda Gray as Sue Ellen Ewing, Ken Kercheval as Cliff Barnes, and Larry Hagman as J.R. Ewing. They were joined by the next generation of characters, including Josh Henderson as John Ross Ewing III, the son of J. R. and Sue Ellen Ewing, Jesse Metcalfe as Christopher Ewing, Bobby and Pam's adopted son, and Julie Gonzalo as Pamela Rebecca Barnes, the daughter of Cliff Barnes and Afton Cooper.\r\n\r\nThe series is made for TNT, sister company to Warner Bros. Television, which has owned the original series since its purchase of Lorimar Television (the original show's production company) in 1989. On July 8, 2011, after viewing the completed pilot episode, TNT gave a green light for the series with a 10-episode order, which premiered on June 13, 2012. On June 29, 2012, TNT renewed Dallas for a second season consisting of 15 episodes, which premiered on January 28, 2013. On April 30, 2013, TNT renewed Dallas for a third season consisting of 15 episodes that premiered on Monday, February 24, 2014. On October 3, 2014, the series was cancelled by TNT after three seasons","torrent":{"xt":"urn:btih:09632e93980be0afc64e1b264872edc91e467f0c","amp;dn":"Dallas+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09632e93980be0afc64e1b264872edc91e467f0c","infoHashBuffer":{"type":"Buffer","data":[9,99,46,147,152,11,224,175,198,78,27,38,72,114,237,201,30,70,127,12]},"announce":[],"urlList":[]}}