{"title":"Busty Cock Worshippers 3 [DvdRip].avi","uid":7930015,"size":4003334426,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:09b1f25c4fd43cc4a24e517e497611b35cab5dee&amp;dn=Busty+Cock+Worshippers+3+%5BDvdRip%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"SplashPt","files":4,"time":1355694092,"description":"Busty Cock Worshippers 3 [DvdRip].avi\n\nYou wanted more, so we're giving you more: nearly twice the length of our best-selling DVD Busty Cock Worshippers 2, the third installment of this big-boob XXXtravaganza features 22 girls in over eight hours of action! Packed with first-timers, SCORE Group exclusives, busty legends. blondes, brunettes, Asians, black-n-stacked, naturals, even wives. You get anal, facials, creampies and more. There's something for every big-tit lover!\nSabrina Linn, a GG-cup blonde with pierced tits and pussy, gets her face and bald cunt fucked by a huge cock in her first hardcore scene.\nBlonde porn superstar Elizabeth Starr teases us with her O-cup tits in a tight bra, then dirty talks her way through a wild suck-n-fuck return to action.\nShort n' naturally stacked MILF Rachel Love tips a worker for helping her by sucking and fucking his big dick and eating his cum.\nMega-stacked Minka, the bustiest Asian ever, rewards a fan's loyalty by fucking him.\nSuper-stacked, big-assed Daphne Rosen does a POV striptease, then deep-throats a dick and has her tits and pussy fucked before riding the dude's cock with her asshole.\nShort n' stacked blonde Stephanie Stalls proves to her lawyer that she's a nympho by fucking him. He cums on her face.\nBlonde bombshell Kelly Christiansen, cleavage pouring out of a tight dress, swallows a thick cock and gets fucked hard while her HH-cups sway.\nSlim n' stacked brunette Eva Notty gets her boobs banged and her shaved pussy filled with dick, then enjoys a facial.\nKianna Dior is a deep-throating Asian hooker in stockings who sucks and fucks a street pickup.\nBlack n' naturally stacked newcomer Kristi Maxx tit-fucks and pussy fucks her first on-camera cock.\nCute Goth chick Beverly Paige lets a stud creampie her young pussy.\nJayden Prescott is a housewife who gets ass-fucked by a stranger in one of only two scenes she's ever shot.\nTall, blonde MILF Brooke Tyler pleasures a young stud with her experienced mouth and shaved cunt.\nSarah Sunshine is a sexy brunette who wants to get out of prison, so she sucks and fucks a guard.\nStacked Hawaiian MILF Claudia Kealoha wakes up horny, so she fucks her guy and eats his cum.\nBig-assed Sara Jay, wearing a sexy, black leather outfit and fishnet stockings, does a hot P.O.V. scene.\nKaren Fisher is a busty, blonde, sweater-stretching warehouse supervisor who gives a tits, mouth and pussy bonus to one of her workers.\nSiri is a natural blonde with an hourglass figure and a dirty mouth who rides a cock hard for a jizz-load on her tits.\nTahnee Taylor is a stacked MILF who has a young stud fuck her horny asshole.\nBlack and naturally super-stacked GND Maserati sucks and fucks a hung stud until her tits are doused with cum.\nRomanian brunette Lana Ivans works a tiny, tight, sheer dress then sucks and fucks.\nBeautiful Shione Cooper, wearing black, knee-high boots, offers up her big naturals and meaty pussy for cum. \n\nKelly Christiansen, Eva Notty, Lana Ivans, Shione Cooper, Daphne Rosen, Siri, Maserati, Minka, Stephanie Stalls, Beverly Paige, Sara Jay, Karen Fisher, Elizabeth Starr, Rachel Love, Sabrina Linn, Claudia KeAloha, Brooke Tyler, Kianna Dior, Tahnee Taylor, Sarah Sunshine, Jayden Prescott\n\nCum Shot, Hardcore, Huge Tits\n\nScreens:\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=9gw6apwcuh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=9gw6apwcuh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=anqatli9a1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=anqatli9a1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=9sqytk36py.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=9sqytk36py.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=149axfs29f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=149axfs29f.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tinypix.me/viewer.php?file=exgb5xe6wj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tinypix.me/viewer.php?file=exgb5xe6wj.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:09b1f25c4fd43cc4a24e517e497611b35cab5dee","amp;dn":"Busty+Cock+Worshippers+3+%5BDvdRip%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09b1f25c4fd43cc4a24e517e497611b35cab5dee","infoHashBuffer":{"type":"Buffer","data":[9,177,242,92,79,212,60,196,162,78,81,126,73,118,17,179,92,171,93,238]},"announce":[],"urlList":[]}}