{"title":"Jack and the Beanstalk (TV) (VHS) [1967] Gene Kelly","uid":6516621,"size":399663366,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0a1737cc7e34aff1115c088a9bda6ee7dacc8551&amp;dn=Jack+and+the+Beanstalk+%28TV%29+%28VHS%29+%5B1967%5D+Gene+Kelly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1309856501,"description":" &lt;a href=&quot;http://bayimg.com/bAiiOaadP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/bAiiOaadP&lt;/a&gt;\n\nJack and the Beanstalk (TV 1967) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0061830/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0061830/&lt;/a&gt;\n\n  Gene Kelly  ...  Jeremy Keen, Proprietor (Peddler)  \n  Bobby Riha  ...  Jack  \n  Ted Cassidy  ...  The Giant  \n  Marian McKnight  ...  Jack's Mother  \n  Marni Nixon  ...  Princess Serena (singing voice)  \n\nThe adventure begins when Jack trades his cow for some magic beans from peddler Jeremy Keen. The beans sprout a beanstalk high into the clouds, and Jack and Jeremy climb it to discover a giant, a goose that lays golden eggs, and Princess Serena who is trapped in a harp by a magic spell and can only be released by a kiss.\n\nBetter than many of today's children's videos, this little gem of live action plus animation from the '60s deserves to be seen again. The Hanna-Barbera production won an Emmy when NBC first broadcast it in 1967. The principal live characters are played by Bobby Riha, as Jack, and by Gene Kelly as his adult companion. (In the original fairy tale, of course, Jack has no companion, but there are obvious reasons for including a sidekick, who in Kelly's hands becomes the main character.) The giant is a gruff but comically inept animated figure whose voice is provided by Ted Cassidy. A variety of other animated characters appear, including two hilariously weird birds who dance a tango with Kelly. All the dancing, as one might expect, is terrific, with Kelly reprising the sort of dancing-with-animation he pioneered in the 1945 film &quot;Anchors Aweigh.&quot; The songs are by the experienced Hollywood team of Sammy Cahn and James Van Heusen. As actor, singer and dancer, young Riha is a satisfying partner for Kelly. The familiar Hanna-Barbera animation may look flat and uninspired to contemporary audiences, but it does its job. Highly recommended. \n\nThis is a very enjoyable TV special that kids and adults will enjoy together. It takes the well-known story of Jack and the Beanstalk but adds new elements that are enjoyable in their own right, and which keep viewers from knowing what will happen next.\n\nThe most notable addition is that Jack has an adult companion on his trip up the beanstalk and in the Giant's kingdom. Jack's friend is played by Gene Kelly, who is definitely the star of this production. The obscure child actor who plays Jack is actually quite good, in a refreshingly natural way, and he sings pleasantly ... without exhibiting a trained voice that would remind us he's a child actor. Jack sings a song called &quot;A Tiny Bit of Faith and a Large Amount of Hope&quot;, which I enjoyed. None of the other songs impressed me. Sammy Cahn and Jimmy Van Heusen are far below their usual standard here.\n\nInside the Giant's kingdom, Jack and Gene are mouse-sized in proportion to the Giant, so they take refuge in a mousehole. Inside the mousehole, they meet a colony of talking cartoon mice (all of them male, apparently) who are to scale with the Giant ... so all the mice are as tall as Gene Kelly. The mice would like to rebel against the Giant, but ... well, they're afraid. So Gene spurs them into action in a spirited song-and-dance number in which he drills the mice in military manoeuvres. This number was very obviously inspired by Gene Kelly's famous dance with Jerry the Mouse in &quot;Anchors Aweigh&quot; ... but it's extremely enjoyable in its own right, and different enough from the earlier number to make the copying acceptable. I wish that Gene had done more dancing in this show.\n\nTed Cassidy, so memorable as Lurch and in a few other roles, seems to be zombified in his portrayal of the Giant.\n\nThe mixture of animation and real-life actors may remind people of &quot;Song of the South&quot; or, more recently, &quot;Space Jam&quot;, but this is quite different. The animated characters aren't big stars that you know. But they still manage to be cute and funny.\n\nStorywise, it is of course about the boy who exchanges a goat for a few beans, instead of selling it for money, thereby almost driving the family into poverty. The next morning, a giant beanstalk has grown out of those beans, and as he climbs it he enters a magical land in the clouds, inhabited by a human-eating giant. Together with a friend, he explores the giant's castle, tries to find the gold and rescue a damsel in distress in the process.\n\nThe film is funny and loveable with enough cute characters to keep kids happy (how I loved the birds dancing with Gene Kelly!)\n\n\n&quot;Half Past April, and a Quarter to May&quot;\nLyrics by Sammy Cahn\nMusic by Jimmy Van Heusen\nPerformed by Bobby Riha (dubbed by Dick Beals) and Gene Kelly\n\n\n\n&quot;A Tiny Bit of Faith&quot;\nLyrics by Sammy Cahn\nMusic by Jimmy Van Heusen\nPerformed by Gene Kelly and Bobby Riha (dubbed by Dick Beals)\n\n\n\n&quot;One Starry Moment&quot;\nLyrics by Sammy Cahn\nMusic by Jimmy Van Heusen\nPerformed by Marni Nixon\n\n\n\n&quot;It's Been Nice&quot;\nLyrics by Sammy Cahn\nMusic by Jimmy Van Heusen\nPerformed by Gene Kelly and Bobby Riha (dubbed by Dick Beals)\n\n\n\n&quot;The Woggle-Bird Song&quot;\nLyrics by Sammy Cahn\nMusic by Jimmy Van Heusen\nPerformed by Leo DeLyon, Cliff Norton and Gene Kelly\n\n\n\n&quot;Stiffen Up That Upper Lip&quot;\nLyrics by Sammy Cahn\nMusic by Jimmy Van Heusen\nPerformed by Bobby Riha (dubbed by Dick Beals) and Chris Allen\n\n\n\n&quot;One Starry Moment&quot;\n(Reprise)\nLyrics by Sammy Cahn\nMusic by Jimmy Van Heusen\nPerformed by Marni Nixon and Gene Kelly\n\n","torrent":{"xt":"urn:btih:0a1737cc7e34aff1115c088a9bda6ee7dacc8551","amp;dn":"Jack+and+the+Beanstalk+%28TV%29+%28VHS%29+%5B1967%5D+Gene+Kelly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a1737cc7e34aff1115c088a9bda6ee7dacc8551","infoHashBuffer":{"type":"Buffer","data":[10,23,55,204,126,52,175,241,17,92,8,138,155,218,110,231,218,204,133,81]},"announce":[],"urlList":[]}}