{"title":"Everneath by Brodi Ashton (Everneath 01) (ePUB/Mobi)","uid":7884188,"size":899008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ac19fc1d82f9cd379f66c0fb6d14788bc696468&amp;dn=Everneath+by+Brodi+Ashton+%28Everneath+01%29+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"azizex666","files":-1,"time":1354573116,"description":"Last spring, Nikki Beckett vanished, sucked into an underworld known as the Everneath. Now she's returned--to her old life, her family, her boyfriend--before she's banished back to the underworld . . . this time forever. She has six months before the Everneath comes to claim her, six months for good-byes she can't find the words for, six months to find redemption, if it exists.\n\nNikki longs to spend these precious months forgetting the Everneath and trying to reconnect with her boyfriend, Jack, the person most devastated by her disappearance--and the one person she loves more than anything. But there's just one problem: Cole, the smoldering immortal who enticed her to the Everneath in the first place, has followed Nikki home. Cole wants to take over the throne in the underworld and is convinced Nikki is the key to making it happen. And he'll do whatever it takes to bring her back, this time as his queen.\n\nAs Nikki's time on the Surface draws to a close and her relationships begin slipping from her grasp, she is forced to make the hardest decision of her life: find a way to cheat fate and remain on the Surface with Jack or return to the Everneath and become Cole's queen.\n\n&quot;Everneath&quot; is a captivating story of love, loss, and immortality from debut author Brodi Ashton.\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                          Published - January 24th 2012\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:0ac19fc1d82f9cd379f66c0fb6d14788bc696468","amp;dn":"Everneath+by+Brodi+Ashton+%28Everneath+01%29+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ac19fc1d82f9cd379f66c0fb6d14788bc696468","infoHashBuffer":{"type":"Buffer","data":[10,193,159,193,216,47,156,211,121,246,108,15,182,209,71,136,188,105,100,104]},"announce":[],"urlList":[]}}