{"title":"Bill Laswell - Oscillations (2-CD)","uid":6404490,"size":112400046,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0ae5d980061d6ef3947acfc53f5c2fc39887ad1a&amp;dn=Bill+Laswell+-+Oscillations+%282-CD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RioPental","files":12,"time":1305765023,"description":"Mp3\n\nVol 1:\nIf drum'n'bass hadn't come along in the early '90s, bassist and producer Bill Laswell would probably have had to invent it. In retrospect, it seems like it was created by some benevolent dancehall god with Laswell specifically in mind -- the lazily loping, reggae-inflected basslines, the double-speed breakbeats, the faint aura of menace that always seems to lurk in ganja-clouded obscurity behind the groove, all of these are elements that come together perfectly in Laswell's art and persona. Oscillations was not his first foray into the drum'n'bass art form, but it was his first album-length drum'n'bass project, and he approaches it in just the way one would expect: by wedding basslines so simply perfect they could make one cry to the hardest beats he can get his hands on, all of them cranked up to about a million bpm, then layering everything with jazzy flute (&quot; Faktura&quot;), sinister keyboard washes (&quot;Third Stage Navigator&quot;), or exotic found-sound (like the Tibetan throat singing on &quot;Digitaria&quot;). The album's center of gravity is &quot;Extinguisher,&quot; which consists of nothing more than a bassline and incredibly dense and complex percussion -- it's a masterpiece of tightly controlled funk, which somehow isn't the contradiction in terms one would think it would be. Highly recommended.\nReview by Rick Anderson (allmusic.com)\n\nVol 2:\nOne of a string of drum'n'bass experiments from bassist/producer Bill Laswell, Oscillations 2 opens with the apocalyptic &quot;Virus,&quot; which dashes and darts in fits and spurts, stopping and starting, building an insistent groove only to break it down again when you least expect it. The album is subtitled &quot;Advanced Drum 'n' Bass,&quot; and songs like &quot;Autotopia&quot; show why, as skittering, schizophrenic rhythms scuttle on top of Laswell's deceptively simple basslines as ambient textures lend a decidedly futuristic feel. But the finest cut, the 16-minute &quot;El Hombre Invisible,&quot; is a fitting tribute to the late William S. Burroughs. Opening with a gorgeously melodic bass solo, Laswell incorporates otherworldly samples and subtle rhythms to create a hallucinogenic track that sound's like a junkie's vision of heaven. It's not exactly drum'n'bass -- like most of Laswell's genre-blending work, the track defies easy categorization -- but like the rest of Oscillations 2, it's nothing if not inventive.\nReview by Bret Love (allmusic.com)","torrent":{"xt":"urn:btih:0ae5d980061d6ef3947acfc53f5c2fc39887ad1a","amp;dn":"Bill+Laswell+-+Oscillations+%282-CD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ae5d980061d6ef3947acfc53f5c2fc39887ad1a","infoHashBuffer":{"type":"Buffer","data":[10,229,217,128,6,29,110,243,148,122,207,197,63,92,47,195,152,135,173,26]},"announce":[],"urlList":[]}}