{"title":"The Lovely Bones - Alice Sebold.  Chapter itunes audiobook","uid":4062602,"size":336944000,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0b74b9dc1264f0aa916440f9297aa8621230a7a4&amp;dn=The+Lovely+Bones+-+Alice+Sebold.++Chapter+itunes+audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"slwbe","files":1,"time":1204669010,"description":"This is the audiobook of Alice Sebold's &quot;The Lovely Bones&quot;.  It's very good and the quality is 64 kbps which is very nice.  It's a .m4b file which is the audiobook format for itunes... it's not a protected file.  .m4b files will always remember the last place you stopped listening and this is chaptered so it's easier to skip around.  Enjoy because this is one of my favorite books.  \n\nHere's the description from amazon dot com:\nWhen we first meet Susie Salmon, she is already in heaven. As she looks down from this strange new place, she tells us, in the fresh and spirited voice of a fourteen-year-old girl, a tale that is both haunting and full of hope. In the weeks following her death, Susie watches life on Earth continuing without her-her school friends trading rumors about her disappearance, her family holding out hope that she'll be found, her killer trying to cover his tracks. As months pass without leads, Susie sees her parents' marriage being contorted by loss, her sister hardening herself in an effort to stay strong, and her little brother trying to grasp the meaning of the word gone. And she explores the place called heaven. It looks a lot like her school playground, with the good kind of swing sets. There are counselors to help newcomers adjust and friends to room with. Everything she ever wanted appears as soon as she thinks of it-except the thing she most wants: to be back with the people she loved on Earth. With compassion, longing, and a growing understanding, Susie sees her loved ones pass through grief and begin to mend. Her father embarks on a risky quest to ensnare her killer. Her sister undertakes a feat of remarkable daring. And the boy Susie cared for moves on, only to find himself at the center of a miraculous event. The Lovely Bones is luminous and astonishing, a novel that builds out of grief the most hopeful of stories. In the hands of a brilliant new writer, this story of the worst thing a family can face is transformed into a suspenseful and even funny novel about love, memory, joy, heaven, and healing.\n\n\n\n*UPDATE\nadd this tracker:\nhttp://tracker.openbittorrent.com:80/announce\n\nAlso this isn't protected because I made it myself.  Don't know some people have had problems.  Remember that it's an audiobook file so it will show up in your audiobook folder on itunes","torrent":{"xt":"urn:btih:0b74b9dc1264f0aa916440f9297aa8621230a7a4","amp;dn":"The+Lovely+Bones+-+Alice+Sebold.++Chapter+itunes+audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b74b9dc1264f0aa916440f9297aa8621230a7a4","infoHashBuffer":{"type":"Buffer","data":[11,116,185,220,18,100,240,170,145,100,64,249,41,122,168,98,18,48,167,164]},"announce":[],"urlList":[]}}