{"title":"Futanari Insanity - Part One","uid":5275304,"size":154826724,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:0c2a716f7d793d926d5284040d4ed6b68698daef&amp;dn=Futanari+Insanity+-+Part+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NeoHazard","files":315,"time":1263356740,"description":"FUTANARI INSANITY P1 - BODY TYPES\n\n\nThis is the first part in my entire Futanari Hentai picture collection. It's a large collection, and will take a long time for me to finally complete uploading it all in parts. The plan is to have this uploaded to three of the big porn trackers and maybe a good hentai tracker.\n\nThis first part is from my folder of Futanari sorted by Body type. I normally sort futa by the artist name or it's influence (what game, anime, or show it parodies) and then any &quot;loose&quot; pics that I can't sort by artist or parody goes into one of my category folders. There are many category with sub categories. With this collection, you will get futanari sorted by body type such as BBW Futa, Dark Skinned Futa, Mature Futa and more. There is some male and crossdressing futa in there, but this about the only folder where I have that (besides certain artists).\n\nThis is just a small collection, but other categories might have gigs of content. I hope you enjoy this and be sure to leave feedback (Comments, Votes, Thanks, Seeds)\n\nNote: I have alot to upload, so the next time I'm on the computer and there is enough seeds, I'm dropping from the swarm. This endeavor will take a long time to complete (of all of my futa) and I want to get it done ASAP, so I wlll not waste time in getting the other ones up. This project is too large for me to reseed in the future, so this is a once in a lifetime event. Have fun, and if you have any tags to suggest to me, please let me know.\n\n\n\n\n---PLEASE NOTE THIS IS NOT PUT TOGETHER BY ME, The creator did not want to post it to Pirate Bay but said I could if I wanted.---\n","torrent":{"xt":"urn:btih:0c2a716f7d793d926d5284040d4ed6b68698daef","amp;dn":"Futanari+Insanity+-+Part+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c2a716f7d793d926d5284040d4ed6b68698daef","infoHashBuffer":{"type":"Buffer","data":[12,42,113,111,125,121,61,146,109,82,132,4,13,78,214,182,134,152,218,239]},"announce":[],"urlList":[]}}