{"title":"Star-ving","uid":4819100,"size":698872980,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0c34d32a42ef150416f1fb5280a4f8f60951f527&amp;dn=Star-ving&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GrandTheftBinary4200","files":12,"time":1238669077,"description":"Star-ving is a web series of eight to ten minutes episodes surrounding the life of David Faustino from Married with Children and is a production of FNB Entertainment LLC in association with Sony Pictures Television. It stars David Faustino and Corin Nemec, from Parker Lewis Can't Lose.\n\nThe show is very funny, David plays a exaggerated version of his washed up self- broke, no prospects, no hope- many episodes begin with a half-hearted suicide attempt. Corin Nemec is a less known formerly famous person, the perfect sidekick. The show features guest appearences by Ed 0'neil, Katey Segal, Christina Applegate, Alan Thick, Ed Asner, Gilbert Godfrey, and more. \n\nThese are all webrips, since it is on the web, so I left them in .wmv format to save space. You could download them off youtube, but they are censored. All the curse words are included here. The quality is not HD but very enjoyable, and its just nice to have it on file. I really hope this show gets picked up for a real 30 minute spot somewhere, it is hilarious.  \n\nEnjoy!\n\nplease SEED, at least once? thanking you in advance.","torrent":{"xt":"urn:btih:0c34d32a42ef150416f1fb5280a4f8f60951f527","amp;dn":"Star-ving","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c34d32a42ef150416f1fb5280a4f8f60951f527","infoHashBuffer":{"type":"Buffer","data":[12,52,211,42,66,239,21,4,22,241,251,82,128,164,248,246,9,81,245,39]},"announce":[],"urlList":[]}}