{"title":"Young And Naughty (US) (1984)","uid":13844646,"size":312764516,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0c481d88192e5dcafd730111fe70f39639c4a921&amp;dn=Young+And+Naughty+%28US%29+%281984%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"distinc","files":1,"time":1457868774,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=6566937687\r\n \nhttp://imagedisco.net/?g=7045276207\r\n\r\n\r\n\r\nDescription:\r\n\r\nThe family that plays together stays together. Or something like that. That's the theme of this heated tribute to interfamilial eroticism, one of the most explosive sexvids. Sweet little Nikki Charm stars as a hot-to-trot teenage vixen who can't help but turn on every man who comes into contact with her -- including members of her own family! And while most girls would do their best to look the other way, Nikki decides to find out just how far her ribald relations are willing to go! This is a great flick for fans of youthful ingenues, as Nikki perfectly captures the playful sexual naivete of her character. Whether watching her girlfriend Sheri St. Clair treat her beau to some back door boffing, or learning the ropes about oral fun with a guy of her own, Nikki exudes sensual allure from the moment she steps on the screen. Gorgeous Elaine Southern also shines as Nikki's sassy girl, trysting with a couple of well-built studs out by the pool. Elaine's feverish frolicking sends both of her men into heated hysterics, and you won't be far behind as you watch her svelte young curves in amorous action. Things get even wilder when Nikki decides to let her closer relatives in on the fun! It's a naughty yet nice look at the ins and outs of youthful sexual expression","torrent":{"xt":"urn:btih:0c481d88192e5dcafd730111fe70f39639c4a921","amp;dn":"Young+And+Naughty+%28US%29+%281984%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c481d88192e5dcafd730111fe70f39639c4a921","infoHashBuffer":{"type":"Buffer","data":[12,72,29,136,25,46,93,202,253,115,1,17,254,112,243,150,57,196,169,33]},"announce":[],"urlList":[]}}