{"title":"Gale Encyclopedia of the Unusual and Unexplained, 3 vol. set","uid":6306968,"size":24272026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c69d738d778b4fd6d40060a8f0cbfc2c41278d7&amp;dn=Gale+Encyclopedia+of+the+Unusual+and+Unexplained%2C+3+vol.+set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":3,"time":1302371973,"description":"From Booklist\nIn 14 chapters, these volumes cover broad concepts from &quot;Afterlife Mysteries&quot; to &quot;Invaders from Outer Space.&quot; Each chapter begins with an overview and an outline of the topics and subtopics that are covered. Within the chapters, entries are generally arranged in alphabetical order. Each ends with a further reading list called &quot;Delving Deeper.&quot; Glossaries are appended to each chapter and cumulated in volume 3. Occasional cross-references appear in bold type within the text to refer the reader to other entries, but since the set does not have a strict A-Z arrangement, one must use the index to determine where those entries are located. Because of the set's topical arrangement, the index is essential.\n\nThe Steigers, prolific writers on the paranormal, have written an encyclopedia for believers. The volumes are meant to &quot;explore and describe the research of those who take such phenomena seriously.&quot; Almost everything from mediumship to crop circles is taken at face value. Even Houdini's attacks on phony mediums are interpreted to suggest he was taking on frauds and not real mediums. Fraud does not appear in the index, nor are alternate suggestions of how phenomena could have occurred presented. Only in a few instances is some skepticism applied.\n\nThe work covers material of interest to a large segment of the public in a way that is clear and readable. Many works in the &quot;Delving Deeper&quot; sections will provide the beginning student of the paranormal with good starting points. Recommended for medium-size to large public libraries and for academic libraries with comparative religion, folklore, and popular culture collections. RBB\nCopyright Ã‚Â© American Library Association. All rights reserved \n &lt;a href=&quot;\nhttp://www.amazon.com/Gale-Encyclopedia-Unusual-Unexplained-Steiger/dp/0787653829/ref=sr_1_1?ie=UTF8&amp;qid=1302364384&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Gale-Encyclopedia-Unusual-Unexplained-Steiger/dp/0787653829/ref=sr_1_1?ie=UTF8&amp;qid=1302364384&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:0c69d738d778b4fd6d40060a8f0cbfc2c41278d7","amp;dn":"Gale+Encyclopedia+of+the+Unusual+and+Unexplained%2C+3+vol.+set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c69d738d778b4fd6d40060a8f0cbfc2c41278d7","infoHashBuffer":{"type":"Buffer","data":[12,105,215,56,215,120,180,253,109,64,6,10,143,12,191,194,196,18,120,215]},"announce":[],"urlList":[]}}