{"title":"Ann W. Duncan - Church-State Issues in America Today [3 volumes]","uid":10491043,"size":2556498,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c87f10bb01829bbdac486cf72f933c4e9319dbb&amp;dn=Ann+W.+Duncan+-+Church-State+Issues+in+America+Today+%5B3+volumes%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1404544091,"description":"Description\nProduct Details\nBook Title: Church-State Issues in America Today [3 volumes] (Praeger Perspectives)\t\nBook Author: Ann W. Duncan (Editor), Steven L. Jones (Editor)\nSeries: Praeger Perspectives\nHardcover: 840 pages\nPublisher: Praeger (December 30, 2007)\nLanguage: English\nISBN-10: 0275993671\nISBN-13: 978-0275993672\n\n===================================================================================\nBook Description\nChurch and state issues are in the news now more than ever before. Political and religious leaders alike are negotiating on shaky ground as they balance their religious/moral and political perspectives with their roles as leaders. New technologies push the boundaries of moral consensus by creating new controversies such as those involving stem-cell research and medical measures to sustain or end the lives of the terminally ill. The Supreme Court continues to work to clarify the fuzzy line between religion and politics as it addresses cases regarding abortion, school prayer, and the Pledge of Allegiance, among other issues. Further controversies only lead to further divisions among Americans.\nAt the beginning of the 21st century, there are as many interpretations of this separation as there are interpretations of particular issues such as abortion or school vouchers. This three-volume collection summarizes the history and current status of issues involving the separation of church and state through chapters examining the backgrounds, relevant constitutional concerns, and variety of perspectives on specific controversies. Framed by a general discussion of the history of the separation between church and state and through careful attention to subjects such as capital punishment, gay marriage, and clergy support of political leaders, there emerges an incredibly complex, enlightening, and provocative picture for anyone with an interest in the unique nature of religion in the United States of America.\n\n===================================================================================\nReview\n&quot;Distinguishing itself from similarly titled works by its overall broader scope and more contemporary focus, this work offers 22 introductory articles, with suggested readings, on various topics regarding the complex relations between religion and civic life in the United States....Recommended.&quot;-Choice\n\n===================================================================================\nBook Description II\nProvides crucial insight into the controversies surrounding issues surrounding the separation of church and state.\n\n===================================================================================\nAbout the Author\nANN W. DUNCAN is Ph.D. candidate in the Department of Religious Studies at the University of Virginia. STEVEN L. JONES is Assistant Professor of Sociology at Grove City College.\n===================================================================================","torrent":{"xt":"urn:btih:0c87f10bb01829bbdac486cf72f933c4e9319dbb","amp;dn":"Ann+W.+Duncan+-+Church-State+Issues+in+America+Today+%5B3+volumes%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c87f10bb01829bbdac486cf72f933c4e9319dbb","infoHashBuffer":{"type":"Buffer","data":[12,135,241,11,176,24,41,187,218,196,134,207,114,249,51,196,233,49,157,187]},"announce":[],"urlList":[]}}