{"title":"Purity Ring - Shrines [24 bit FLAC] vinyl","uid":8377486,"size":804168365,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cf2c413e257e19c66ce5f4f442e0966f77d85c3&amp;dn=Purity+Ring+-+Shrines+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"24.96","files":-1,"time":1366089124,"description":"  Purity Ring - Shrines (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Source: CAD3218 / UK &amp; Europe\n  Genre: Electronic\n  Style: Synth-pop\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Crawlersout \n  A2. Fineshrine \n  A3. Ungirthed \n  A4. Amenamy \n  A5. Grandloves \n  B1. Cartographist \n  B2. Belispeak \n  B3. Saltkin \n  B4. Obedear \n  B5. Lofticries \n  B6. Shuck \n\n  While whimsical, female-voiced electronic pop was all the rage when Purity Ring's debut album Shrines was released, the duo still managed to stand out from the crowd. While their sweetly chilly sound falls somewhere between Grimes' intricate quirks and the rhapsodic wordplay and sensuality of Braids, Purity Ring's individuality comes from the equal partnership of Megan James' girlish vocals and unusual lyrics, and Corin Roddick's playful electronic soundscapes. Shrines makes good on the promise of the songs the duo previously issued online, which remain highlights: &quot;Fineshrine&quot; may still be the quintessential Purity Ring song, with James entreating the listener to &quot;cut open my sternum and poke&quot; as Roddick's backdrop flits between gentle and ominous; many of James' songs are focused on the body, treating it with almost spiritual wonder as on the dark, Crystal Castles-like &quot;Belispeak.&quot; Meanwhile, &quot;Ungirthed&quot; remains a showcase for the duo's fascination with ultra-bright electronic tones that add to Shrines' largely, if deceptively, innocent feel. These songs and &quot;Amenamy&quot; and &quot;Obedear&quot; could be from the soundtrack to some fantastical anime series yet to be written, but just when the album threatens to become a little too sweet and samey for its own good, Roddick and James reveal new levels to Purity Ring's sound. &quot;Lofticries&quot;' more sophisticated melody and &quot;Cartographist&quot;'s eerie atmosphere and fractured beats hint at a depth that should serve the duo well. As it stands, Shrines is a fine debut, full of lighter-than-air synth pop that manages to be dark, sparkling, innocent, and knowing all at once.","torrent":{"xt":"urn:btih:0cf2c413e257e19c66ce5f4f442e0966f77d85c3","amp;dn":"Purity+Ring+-+Shrines+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf2c413e257e19c66ce5f4f442e0966f77d85c3","infoHashBuffer":{"type":"Buffer","data":[12,242,196,19,226,87,225,156,102,206,95,79,68,46,9,102,247,125,133,195]},"announce":[],"urlList":[]}}