{"title":"FalconFour's Ultimate Boot CD/USB 4.0 - Hiren's 10.6","uid":5930413,"size":423167470,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0dd8f7f683e34019b8c38d9a4db3fff921f8722b&amp;dn=FalconFour%5C%27s+Ultimate+Boot+CD%2FUSB+4.0+-+Hiren%5C%27s+10.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FalconFour","files":-1,"time":1288755383,"description":"&quot;Like&quot; F4UBCD on Facebook for the latest version: tiny url. com / F4UBCD (tpb's url filter is unnecessary crap imo)\n\nIf this torrent description is all fucked up, you're not viewing the original torrent. Please search for FalconFour's Ultimate Boot CD on ThePirateBay.org and verify that FalconFour is the uploader. DON'T SUPPORT RIPOFF SITES!\n\n\n\n.......______                                                                      |\n       L,.   ',                                                                    |\n        \\      ',_                                                                 |\n         \\   @   ',                                                                |\n          \\ ^~^    ',                                                              |\n           \\    NR   ',                                                            |\n            \\___'98fw  ',_                          _..----.._                     |\n            [______       &quot;'==.I\\_____________..--&quot;(__\\\\_n@___4\\,_                 |\n          ,..-=T         __   ____________          \\/  &quot;'&quot; O(==  &quot;&quot;-+.._          |\n          I____|_____    }_)=========I)=**&quot;&quot;''==-------------==-   &quot; |   &quot;'-.,___  |\n          [_____,.--'&quot;             _______         &quot;&quot;--=(&quot;&quot;-----=====+==--''&quot;&quot;     |\n          &quot;&quot;'-=+..,,__,-----,_____|       |         -=* |                          |\n                      |__   /     |---,--'&quot;---+------+-'&quot;                          |\n                         &quot;&quot;&quot;     d&quot;b=&quot;        '-----+t                             |\n                                 q_p                '@                             |\n-----------------------------------------------------------------------------------+\n             F A L C O N F O U R   P R O U D L Y   P R E S E N T S                 |\n-------------+-------------------------------------+----------+--------------------+\nT I T L E    | FalconFour's Ultimate Boot CD v4.0  | D A T E  | July 30, 2010      |\n-------------+-------------------------------------+----------+--------------------+\n                            D E S C R I P T I O N                                  |\n-----------------------------------------------------------------------------------+\nIn this boot CD are the most popular and useful tools anyone would ever need. The\nbest of the free software, the best of the commercial software, and it all fits on\none CD-R that's readable by any computer worth booting on. Not everything can read a\nDVD, and USB booting is hit and miss at best. \n\nThis is the Ultimate Boot CD that I've used myself, and all the combined tools I use\nfor PC diagnostics at the shop I work at. It's been part of my toolbox for years.\nWith the release of Hiren's BootCD 9.7, the entire playing field has been shifted,\nwith the new MiniXP boot functionality. It's a 30mb image that loads and\ndecompresses into RAM, then boots Windows off RAM at lightning speed - including\nreading to RAM, it appears to boot even faster than off a hard drive... and still\ngives you network (and internet) functionality on many PCs. Many drivers for net\nand SATA are built right in, but you can load anything with the F6 driver prompt\nduring startup.\n\nHiren's XP BootCD is an extremely useful diagnostic tool, and is at the heart of\nthis BootCD. However, several techs (myself included) have found issues with the\nlack of easy access to the multitude of tools on the disc, so I created a\nmodification platform to add shortcuts to popular applications right on the desktop,\nmade several adjustments, added a bunch of tools, and even put much of the\nmodification power right in your hands. With F4UBCD 4.0, it's now easier than ever\nto just drop a folder in, add a line, and get your own program added.\n\nMany techs use ERD Commander, which (after the Microsoft acquisition) is now known\nas Microsoft DaRT - the Diagnostic and Recovery Toolkit. It's a considerably smaller\n(than Hiren/UBCD4Win) set of extremely useful and specialized tools to repair\nWindows. I've repackaged the XP version into a lightning-fast-booting compressed RAM\ndisk, and added DaRT 6.0 for Windows Vista. Both versions include tools like Offline\nSystem Restore, System File Checker, and Crash Analyzer.\n\nIf you work in a tech shop, you know the pain of user passwords. The typical order\nof business would be to use NTPWEdit to erase the login passwords (replaces Active\nPassword Changer). However, Kon-Boot actually patches the Windows kernel in RAM\nduring startup, causing it to ignore an incorrect password at login! You can log in\nwithout entering the user's password, perform your tech duties, shut the system off,\nand their password stays intact. It's still an experimental tool, and often fails to\nstart on many computers, but it's a great new tool that makes a valuable addition to\na tech toolkit.\n\nOnce you dive into this disc, you'll never need another boot CD.\n\n-----------------------------------------------------------------------------------+\n                               O N   T H E   D I S C                               |\n-----------------------------------------------------------------------------------+\nHiren's BootCD 10.6 minus Linux and a few others.\n\tPlus F4UBCD tweaks &amp; addons:\n\tImgBurn 2.5.1.0\n\tActive File Recovery\n\tCCleaner 2.34 with PE extension\n\tHD Tune Pro 4.50 Trial\n\tMagical Jelly Bean Keyfinder 2.0.8\n\tMyDefrag 4.3.1 w/ FalconFour's FullOptimize script\n\tNirSoft utilities collection current as of 7/28/10\n\tNTPWEDIT\n\tRegEditPE 1.0c (Beta with some adjustments for cleaner operation)\n\tServicesPE\n\tSuper Pi 1.5 Mod\n\tTreeSize Personal v5.3.4\n\tSpinRite 6.0 (under Hard Disk Tools)\nERD Commander / Microsoft DaRT 5.0 (WinXP)\nMS DaRT 6.0 (Vista)\nDell MBR Recovery Disk\nMemtest86+ 4.10\nKon-Boot 1.1\nShiny graphics that make you feel good","torrent":{"xt":"urn:btih:0dd8f7f683e34019b8c38d9a4db3fff921f8722b","amp;dn":"FalconFour%5C%27s+Ultimate+Boot+CD%2FUSB+4.0+-+Hiren%5C%27s+10.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dd8f7f683e34019b8c38d9a4db3fff921f8722b","infoHashBuffer":{"type":"Buffer","data":[13,216,247,246,131,227,64,25,184,195,141,154,77,179,255,249,33,248,114,43]},"announce":[],"urlList":[]}}