{"title":"Lenore (v1 + v2) (1998 - Ongoing) (Minutemen &amp; Empire)","uid":10653586,"size":429147507,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0e16ca37db6ef0fa5677de467e52b63eacbbeac6&amp;dn=Lenore+%28v1+%2B+v2%29+%281998+-+Ongoing%29+%28Minutemen+%26amp%3B+Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nemesis43","files":23,"time":1406647512,"description":"Lenore (v1 + v2) (1998 - Ongoing) (Minutemen &amp; Empire)\n\n\n The comic tells of the unlife  and adventures of the titular character and her similarly odd (if not odder) friends. The story takes place in a small town called Nevermore (taking its name from another of Poe's work: The Raven) and the surrounding wilderness where Lenore's mansion and a nearby graveyard is situated.\n\nThe primary focus of the graphic novel is dark humor, with many of the stories having twist endings. Common themes are the reinvention of children's songs, games, and nursery rhymes to something more macabre, and subverting all sorts of pop culture icons and cultural figures in to topics of dark comedy. In one story, for instance, Lenore accidentally kills the Easter Bunny.\n\nWhile Lenore's actions often result in the death or injury to those around her, and in various forms of chaos, she is not a malicious character, and often thinks she is doing good. Although in recent issues, the character had shown a change in personality.\n\nThe comic also featured various onetime side stories (One of these stories, Samurai Sloth, is set to star in his own series) and occasionally guest strips from other artists (with Jhonen Vasquez being the most frequent). A recurring comic strip called &quot;Things Involving Me&quot; tells about the author's life and experience in an exaggerated, semi-autobiographical manner. ","torrent":{"xt":"urn:btih:0e16ca37db6ef0fa5677de467e52b63eacbbeac6","amp;dn":"Lenore+%28v1+%2B+v2%29+%281998+-+Ongoing%29+%28Minutemen+%26amp%3B+Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e16ca37db6ef0fa5677de467e52b63eacbbeac6","infoHashBuffer":{"type":"Buffer","data":[14,22,202,55,219,110,240,250,86,119,222,70,126,82,182,62,172,187,234,198]},"announce":[],"urlList":[]}}