{"title":"youku setup  ä¼˜é…·","uid":12312734,"size":33756256,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0e19b81bdb864b4be79ae8221e508dc3a6ddde93&amp;dn=youku+setup++%E4%BC%98%E9%85%B7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PrabeshRaj","files":1,"time":1440895101,"description":"Youku permits users to upload videos of arbitrary length. Youku has partnered with over 1,500 license holders, including television stations, distributors, and film and TV production companies in China that regularly upload media content on the site.\n\nYouku allows the Government of China to check for inappropriate or offensive videos (see Internet censorship in the People's Republic of China).\n\nYouku's video library includes many full-length films and TV episodes. Viewers from around the world can see these films on Youku for free, though often with Chinese subtitles. Other popular sites such as YouTube cannot display this content because of copyright restrictions, but these laws either do not exist in China or are poorly enforced, enabling Youku to broadcast copyrighted content from their website without license. In January 2010, Youku implemented a digital fingerprinting technology intended to eliminate copyright infringing content on the site.\n\nSome Youku videos are blocked to international IP addresses because of licensing issues","torrent":{"xt":"urn:btih:0e19b81bdb864b4be79ae8221e508dc3a6ddde93","amp;dn":"youku+setup++%E4%BC%98%E9%85%B7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e19b81bdb864b4be79ae8221e508dc3a6ddde93","infoHashBuffer":{"type":"Buffer","data":[14,25,184,27,219,134,75,75,231,154,232,34,30,80,141,195,166,221,222,147]},"announce":[],"urlList":[]}}