{"title":"The Disappearances - Gemma Malley.epub","uid":9373331,"size":300953,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ea07aff93f13e5127f6cb05fcc606c1d293603a&amp;dn=The+Disappearances+-+Gemma+Malley.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387570968,"description":"Riveting, brilliantly imagined and passionate, THE DISAPPEARANCES, the compelling sequel to THE KILLABLES, will appeal to everyone who loved the powerful and gripping storytelling of THE HUNGER GAMES. They walked in silence onto the raised path that led to the East Gate. The closer they got, the louder the buzzing was. As they approached the gate it was almost unbearable. There was a stench in the air that made it hard to breathe, a stench that made the hair on the back of Lucas' neck stand up on end. Whatever had brought the flies here wasn't good. It's been a year since Evie and Raffy escaped the controlling regime of the City, leaving Lucas behind to rebuild the ruins of the place they once called home. And Lucas knew that once he said goodbye, Evie would be lost to him forever... But the City soon finds itself plagued by another terrifying threat: the Disappearances: teenagers who have gone missing from within the City walls, apparently vanishing into thin air. With the City at stake, Lucas has no choice but to call on his old friends - even if seeing them together is more than he can bear.","torrent":{"xt":"urn:btih:0ea07aff93f13e5127f6cb05fcc606c1d293603a","amp;dn":"The+Disappearances+-+Gemma+Malley.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ea07aff93f13e5127f6cb05fcc606c1d293603a","infoHashBuffer":{"type":"Buffer","data":[14,160,122,255,147,241,62,81,39,246,203,5,252,198,6,193,210,147,96,58]},"announce":[],"urlList":[]}}