{"title":"Family Guy - Complete 7th Season[2009]DvDrip-LW","uid":4947860,"size":2934941432,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ec953c8c7d5cb5c7cf91a6e0f83a7e37e7c3a07&amp;dn=Family+Guy+-+Complete+7th+Season%5B2009%5DDvDrip-LW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"XoLWoX","files":-1,"time":1244744800,"description":"-------------------------------------------------\nF I L E - I N F O\n-------------------------------------------------\nTITLE......[ Family Guy - Complete 7th Season\nYEAR.......[ 2008\nGENRE......[ Anime\nRUNTIME....[ 05:40:54\n-------------------------------------------------\nFormat                           : AVI\nFormat/Info                      : Audio Video Interleave\nFile size                        : 2.73 GB\nOverall bit rate                 : 1 159 Kbps\nWriting library                  : XviD 1.1.2\nFrame rate                       : 23.976 fps\nWidth                            : 512 pixels\nHeight                           : 384 pixels\n\nSOURCE                           : DVD\n-------------------------------------------------\nE P I S O D E S\n-------------------------------------------------\nSeason 7 | Episode: 1 [Airdate: 9/28/08]\n{Love Blactually}\n\nBrian meets Carolyn, the girl of his dreams, and \nhe decides to take things slow. However, his taking \nthings slow manages to drive Carolyn crazy, and soon \nforces her in to the arms of another man. Brian \ndiscovers that Cleveland is the other man, and he \nvows to do whatever it takes to win Carolyn back.\n-------------------------------------------------\nSeason 7 | Episode: 2 [Airdate: 10/5/08]\n{I Dream of Jesus}\n\nPeter re-discovers his love for &quot;The Bird's the Word.&quot; \nBrian and Stewie decide to take matters into their own \nhands to ensure that the song is never heard again. \nPeter goes to every record store in Quahog to try and \nfind his song, and ends up hanging out with Paris and \nPerez Hilton.\n-------------------------------------------------\nSeason 7 | Episode: 3 [Airdate: 10/19/08] \n{Road To Germany}\n\nMort accidentally steps into a time machine. But when \nBrian and Stewie follow him in order to bring him back, \nthey discover they're in Poland on the day of the Nazi \ninvasion.\n\n-------------------------------------------------\nSeason 7 | Episode: 4 [Airdate: 11/2/08] \n{Baby Not on Board}\n\nPeter wins one year of free gas, so Brian suggests \nthe family take a road trip to the Grand Canyon. But \nwhen the Griffins pack up the car and hit the road, \nthey leave some cargo at home. When the family realizes \nwhat they left, they make the long journey back to \nQuahog.\n-------------------------------------------------\nSeason 7 | Episode: 5 [Airdate: 11/9/08] \n{The Man with Two Brians}\n\nThe guys watch Johnny Knoxville's &quot;Jackass,&quot; and \ndecide to film their own pranks. But when Brian gets \nhurt, the family starts to think, maybe the dog is \njust getting too old. When Peter brings home a new \ndog everything is great until the &quot;new Brian&quot; humps \nStewie's toy.\n-------------------------------------------------\nSeason 7 | Episode: 6 [Airdate: 11/16/08] \n{Tales of Third Grade Nothing}\n\nPeter's boss Angela (Carrie Fisher) sends him back \nto the third grade so he can meet the requirements \nfor a promotion; Brian, Stewie and Frank Sinatra Jr. \nopen a club in Quahog.\n-------------------------------------------------\nSeason 7 | Episode: 7 [Airedate: 11/23/08]\n{Ocean's Three and a Half}\n\nBonnie finally gives birth to a daughter named Susie. \nStewie falls in love, and is willing to do anything to \nwin her heart. Meanwhile, Joe is in debt to a bookie for \n$20,000 to pay for Bonnie's medical bills, and plans to \npay it off by stealing from Carter Pewterschmidt.\n-------------------------------------------------\nSeason 7 | Episode: 8 [Airdate: 3/8/09] \n{Family Gay}\n\nTo help pay off his incredible debt, Peter participates \nin medical experiments to make some extra cash. First, \nhe is injected with the &quot;Seth Rogen&quot; gene that &quot;gives \nyou the appearance of being funny even though you haven't \nactually done anything funny.&quot; Then he is injected with a \ngene that leads him to a new mate, leaving a broken-hearted \nLois behind. Although the family is crushed, they quickly \nrealize the most important thing is that Peter is happy.\n-------------------------------------------------\nSeason 7 | Episode: 9 (Airdate: 3/15/09) \n{The Juice Is Loose}\n\nPeter cashes in a raffle ticket from 1989 and wins a \ngolf outing with O.J. Simpson. When Peter befriends the \ninfamous former running back and brings him home to meet \nthe family, the residents of Quahog aren't so welcoming to \nthe new houseguest and tell him to take a hike.\n-------------------------------------------------\nSeason 7 | Episode: 10 (Airdate: 3/22/09) \n{FOX-y Lady}\n\nLois gets a job working for FOX News and has to do a \nreport on a liberal filmmaker. However, she loses the \njob when her story implicates a conservative radio host.\n-------------------------------------------------\nSeason 7 | Episode: 11 (Airdate: 3/29/09) \n{Not All Dogs Go to Heaven}\n\nMeg becomes extremely religious, and tries to convert \nBrian from Atheism. Meanwhile, after the family visits \na Star Trek convention, Stewie kidnaps the entire cast \nof Star Trek: The Next Generation and forces them to \nhang out with him.\n-------------------------------------------------\nSeason 7 | Episode: 12 (Airdate: 4/19/09) \n{420}\n\nWhen Brian gets busted for possession of marijuana, \nhe starts a campaign to legalize the drug. Mayor West \npasses the law, which turns the townspeople into a bunch \nof potheads.\n-------------------------------------------------\nSeason 7 | Episode: 13 (Airdate: 4/26/09) \n{Stew-Roids}\n\nAfter Susie Swanson beats the crap out of Stewie, \nhe and Peter take to the gym. What Stewie doesn't \nknow is that Peter is giving him a little extra help \nto get those six-pack abs. Meanwhile, Chris begins \ndating one of the popular girls in school, but her \npopularity soon begins to subside.\n-------------------------------------------------\nSeason 7 | Episode: 14 (Airdate: 5/3/09) \n{We Love You Conrad}\n\nBrian is devastated to learn that his ex-girlfriend \nJillian is getting married until he meets The Hills \nstar Lauren Conrad. Though Brian begins to think he \nand Conrad are the perfect match, he finds his heart \nmay still belong to Jillian.\n-------------------------------------------------\nSeason 7 | Episode: 15 (Airdate: 5/10/09) \n{Peter's Progress}\n\nPeter has a psychic palm reading and discovers he \nled a past life as Griffin Peterson, a dignified \ngentleman who followed the beautiful Lady Redbush \nfrom 17th century England, where the fierce King \nStewart III reigned supreme, to the newly founded \nAmerican colony of Quahog to win her heart.\n-------------------------------------------------\nSeason 7 | Episode: 16 (Airdate: 5/10/09) \n{Three Kings}\n\nWhen Peter reads some of Stephen King's works, he \nimagines his family and friends in three of King's \nstories. First, Peter, Quagmire, Cleveland and Joe \nact out Stand By Me where as 12-year-olds, they travel \nalong a railroad track on a journey of self-discovery. \nSecond, Peter's take on Misery puts an injured Brian being \nrescued by his &quot;number one fan,&quot; Stewie. And lastly Peter \nenvisions his own version of The Shawshank Redemption, \nwhere he and Cleveland become friends in prison.\n-------------------------------------------------\nP L O T\n-------------------------------------------------\nPeter and family face down one challenge after \nanother in their unapologetically no-holds-barred \nway in this season of the popular animated series, \nin which Peter must return to third grade to pick \nup skills for a promotion at work. Lois gets a job \nwith FOX news, Peter becomes part of a study on \nhomosexuality, and Brian and Stewie work to get \nmarijuana legalized. This season features a sequel \nto Season 6's Star Wars spoof. \n\nStarring: Seth MacFarlane, Alex Borstein\n\nDirector: Not Available\n-------------------------------------------------","torrent":{"xt":"urn:btih:0ec953c8c7d5cb5c7cf91a6e0f83a7e37e7c3a07","amp;dn":"Family+Guy+-+Complete+7th+Season%5B2009%5DDvDrip-LW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec953c8c7d5cb5c7cf91a6e0f83a7e37e7c3a07","infoHashBuffer":{"type":"Buffer","data":[14,201,83,200,199,213,203,92,124,249,26,110,15,131,167,227,126,124,58,7]},"announce":[],"urlList":[]}}