{"title":"THE JOY OF EATING WELL - Andrew Weil &amp; Carolyn Ross","uid":8669586,"size":104586456,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0f2a71e4897d6c4128d171d307be1b8421499c7b&amp;dn=THE+JOY+OF+EATING+WELL+-+Andrew+Weil+%26amp%3B+Carolyn+Ross&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"leopardog","files":20,"time":1373474455,"description":"The Joy of Eating Well: A Practical Guide to- Transform Your Relationship with Food- Overcome Emotional Eating- Achieve Lasting Results \nby Andrew Weil and Carolyn Ross\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/1604070781/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/1604070781/4353-20&lt;/a&gt;\n\nHealth first, then weight. This is part of the liberating new approach to managing our patterns of eating developed by integrative medicine pioneer Dr. Andrew Weil and Dr. Carolyn Ross. The Joy of Eating Well presents their revolutionary program for transforming your relationship with food and fostering harmony in the mind and spirit through greater self-awareness and body acceptance. This richly informative two-session course of practical teachings, actionable advice, and exercises explores: Dr. Weil's insights about optimal nutrition, cultural influences on our eating patterns, and an integrative view of eating well including his anti-inflammatory diet The five levels of healing our relationship with food, from behaviors and emotions to core beliefs and the needs of the recognition of the soul Dr. Ross SIMPLE Plan a five-point system for managing meals plus tips for making lifestyle changes that support your goals. Seven guided practices with Dr. Ross including Mindful Eating, The Awakened Body Process, and The Future Self Meditation. There is considerable misconception about food that tastes good being incompatible with food that is good for you. With The Joy of Eating Well, now you have a much-needed resource for honoring the body and spirit while moving toward your healthy weight.","torrent":{"xt":"urn:btih:0f2a71e4897d6c4128d171d307be1b8421499c7b","amp;dn":"THE+JOY+OF+EATING+WELL+-+Andrew+Weil+%26amp%3B+Carolyn+Ross","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f2a71e4897d6c4128d171d307be1b8421499c7b","infoHashBuffer":{"type":"Buffer","data":[15,42,113,228,137,125,108,65,40,209,113,211,7,190,27,132,33,73,156,123]},"announce":[],"urlList":[]}}