{"title":"Understanding Your Users - 2nd Edition (2015).pdf Gooner","uid":13088926,"size":27845250,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:108313c6b93e111ff3fb5fcd1361f1188e1e0e2f&amp;dn=Understanding+Your+Users+-+2nd+Edition+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1450998802,"description":"Understanding Your Users - A Practical Guide to User Research Methods - 2nd Edition (2015).pdf Gooner\r\n\r\nPublisher: Morgan Kaufmann; 2 edition (July 28, 2015)\r\nLanguage: English\r\nISBN-10: 0128002328\r\nISBN-13: 978-0128002322\r\n\r\nThis new and completely updated edition is a comprehensive, easy-to-read, &quot;how-to&quot; guide on user research methods. You'll learn about many distinct user research methods and also pre- and post-method considerations such as recruiting, facilitating activities or moderating, negotiating with product developments teams/customers, and getting your results incorporated into the product. For each method, you'll understand how to prepare for and conduct the activity, as well as analyze and present the data - all in a practical and hands-on way.\r\n\r\nEach method presented provides different information about the users and their requirements (e.g., functional requirements, information architecture). The techniques can be used together to form a complete picture of the users' needs or they can be used separately throughout the product development lifecycle to address specific product questions. These techniques have helped product teams understand the value of user experience research by providing insight into how users behave and what they need to be successful. You will find brand new case studies from leaders in industry and academia that demonstrate each method in action.\r\n\r\nThis book has something to offer whether you are new to user experience or a seasoned UX professional. After reading this book, you'll be able to choose the right user research method for your research question and conduct a user research study. Then, you will be able to apply your findings to your own products.\r\n\r\nCompletely new and revised edition includes 30+% new content!\r\nDiscover the foundation you need to prepare for any user research activity and ensure that the results are incorporated into your products\r\nIncludes all new case studies for each method from leaders in industry and academia","torrent":{"xt":"urn:btih:108313c6b93e111ff3fb5fcd1361f1188e1e0e2f","amp;dn":"Understanding+Your+Users+-+2nd+Edition+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"108313c6b93e111ff3fb5fcd1361f1188e1e0e2f","infoHashBuffer":{"type":"Buffer","data":[16,131,19,198,185,62,17,31,243,251,95,205,19,97,241,24,142,30,14,47]},"announce":[],"urlList":[]}}