{"title":"Mary Margaret O'Hara - Miss America 1988","uid":4588428,"size":75331408,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11aafbca25c22d49bb9b55331c78a0a35cb0d82d&amp;dn=Mary+Margaret+O%5C%27Hara+-+Miss+America+1988&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hb93","files":13,"time":1229727413,"description":"Mary Margaret O'Hara - Miss America 1988\n\nFrom allmusic.com:\nReview\tby Jason Ankeny\n\nOriginally recorded in 1984 and not released until 1988, Miss America still sounds light years ahead of its time: Mary Margaret O'Hara is a force of nature, a remarkable singer and composer whose crystal-clear soprano acrobatics and hypnotic songs defy accepted conventions. Flirting intermittently with country (&quot;Anew Day,&quot; &quot;Dear Darling&quot;) and jazz (&quot;Keeping You in Mind&quot;), O'Hara works primarily with pop dynamics, but deconstructs and reassembles the form according to her own blueprint: &quot;Year in Song&quot; is jaggedly intense, &quot;To Cry About&quot; is gorgeously ambient, and &quot;Body's in Trouble&quot; is delicately gripping, yet none conform easily to such facile assessments, with hairpin turns in mood and atmosphere which blindside expectations. Following instead its own abstract internal logic, Miss America is a work of mad-scientist genius, and it remains a singular experience. \n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:39fuxqe5ldke&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:39fuxqe5ldke&lt;/a&gt;\n\nBiography\tby Jason Ankeny &amp; Sean Carruthers\n\nThe sister of comedienne Catherine O'Hara (best known for her work in the groundbreaking sketch comedy series SCTV and the Home Alone movies), Mary Margaret O'Hara was born in Toronto; after graduating from the Ontario Art College, she joined her first band, the soul-pop outfit Dollars. In 1976, O'Hara signed on with the group Songship -- soon renamed the Go Deo Chorus -- and began writing much of the group's material.\n\nShe left the band in 1983, but not before recording the demos which subsequently earned her a contract with Virgin Records. After a series of delays and label battles, in 1988 O'Hara finally issued her full-length album, Miss America, which she co-produced with the innovative guitarist Michael Brook. Though Miss America was released to great acclaim, it was her final full-length release for 14 years; during that time only one release, The Christmas EP, appeared under her own name.\n\nThough she avoided releasing much in the way of new original material, O'Hara stayed busy. She worked with a diverse range of artists, contributing vocals to recordings from Morrissey, Gary Lucas, the Henrys, This Mortal Coil, and John &amp; Mary. A few tracks of her own appeared sporadically, including a triptych of songs on the Count Your Blessings Christmas compilation in 1994, one number on 1996's benefit album Sweet Relief II: The Gravity of the Situation: The Songs of Vic Chestnutt, and a track on the Kurt Weill tribute September Songs. Her continuing ambivalence to her status as critical darling was apparent: of these appearances, there was only one self-penned number.\n\nAn occasional actress, she appeared in the films The Hunter (1980), Candy Mountain (1987), and The Events Leading Up to My Death (1992). It was her appearance in the Canadian film Apartment Hunting, however, that finally broke her stalemate with the studio. The film's score was largely composed and performed by O'Hara, and even if it wasn't a proper follow-up album, most of her fans around the world were willing to be forgiving after so lengthy a wait. \n\nMiss America- 1988\n\nTracks\n\t\t\n\n\tTime \t\n 1 To Cry About \t\t\t3:23\n 2 Year in Song \t\t\t3:34\n 3 Body's in Trouble \t\t\t4:58\n 4 Dear Darling \t\t\t3:51\n 5 New Day \t\t\t\t3:11\n 6 When You Know Why You're Happy \t4:34\n 7 My Friends Have\t\t\t3:10\n 8 Help Me Lift You Up \t\t\t4:35\n 9 Keeping You in Mind \t\t\t4:39\n10 Not Be Alright \t\t\t5:13\n11 You Will Be Loved Again \t\t3:36 \n\nEncoded from CD 224k","torrent":{"xt":"urn:btih:11aafbca25c22d49bb9b55331c78a0a35cb0d82d","amp;dn":"Mary+Margaret+O%5C%27Hara+-+Miss+America+1988","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11aafbca25c22d49bb9b55331c78a0a35cb0d82d","infoHashBuffer":{"type":"Buffer","data":[17,170,251,202,37,194,45,73,187,155,85,51,28,120,160,163,92,176,216,45]},"announce":[],"urlList":[]}}