{"title":"Poet: A Tribute To Townes Van Zandt [2001] [Compilation][EAC/FL","uid":10254245,"size":353374836,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11bedddb381f2941e8dc8dd25a76ea35a6567a37&amp;dn=+Poet%3A+A+Tribute+To+Townes+Van+Zandt+%5B2001%5D+%5BCompilation%5D%5BEAC%2FFL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":18,"time":1401389848,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Free Falls Entertainment #7019\nCountry: USA\nYear: September 11, 2001\nGenre: country,americana,\nFormat: CD,Album\n\n\n01. Guy Clark - To Live's to Fly (4:13)\n02. Nanci Griffith - Tower Song (4:07)\n03. Billy Joe Shaver - White Freightliner Blues (2:39)\n04. Cowboy Junkies - Highway Kind (6:07)\n05. Emmylou Harris - Snake Song (2:34)\n06. Ray Benson - If I Needed You (3:37)\n07. John Prine - Loretta (3:59)\n08. Lucinda Williams - Nothin' (4:01)\n09. The Flatlanders - Blue Wind Blew (3:17)\n10. Robert Earl Keen - Mr. Mudd &amp; Mr. Gold (3:22)\n11. Steve Earle &amp; The Dukes - Two Girls (4:23)\n12. Willie Nelson - Marie (4:27)\n13. Delbert McClinton - Pancho &amp; Lefty (4:04)\n14. Pat Haney - Waitin' 'Round to Die (3:35)\n15. John T. Van Zandt - My Proud Mountains (4:51)\n\n\n\n\nTribute collections -- especially those dedicated to a deceased artist by a various group of performers -- are usually a mixed bag by their very nature. A dedicated various-artists set of songs by the towering songwriter Townes Van Zandt is even more daunting in concept. That said, Poet: A Tribute to Townes Van Zandt, originally issued in 2001, is the exception to the rule in every case. Containing 16 cuts by a stellar cast that includes everyone from Willie Nelson and Nanci Griffith to Lucinda Williams and John Prine with lots of folks in between. Other performers include two songwriters who have done their own full-length tributes to Van Zandt's genius: Jonell Mosser (whose wonderful Around Townes was the very first, issued in the '90s) and Steve Earle (whose own 2009 album, Townes, is classic in the genre). Nelson appears opens the album with an utterly believable reading of the harrowing &quot;Marie.&quot; Guy Clark's tender and moving &quot;To Live Is to Fly&quot; is performed with the requisite wisdom and eagle eye vision he gives his own songs. It is especially poignant given how close he and Van Zandt were. Emmylou Harris' take on &quot;Snake Song&quot; is a spare, darkly spiritual reading. Lucinda Williams' &quot;Nothin,'&quot; is dredged in her own roots as a blues singer. There are some excellent surprises here as well, such as &quot;My Proud Mountains,&quot; performed by John T. Van Zandt, the late songwriter's son. The echoes of his father's voice -- whether he likes it or not -- are threaded inseparably with his own in his performance. Billy Joe Shaver's reading of &quot;White Freightliner Blues&quot; is as hardcore country as the songwriter ever intended. The biggest shock is Asleep at the Wheel's Ray Benson's cover of &quot;If I Needed You,&quot; which is delivered with the emotion of a wise and seasoned old soul. The violins and hand percussion added a gorgeous touch to the song. Griffith's version of &quot;Tower Song&quot; is arranged in such a way as to accent Van Zandt's status as a poet; its tenderness and empathy on full display in the grain of her voice. The Flatlanders reunite for a hardcore Texas take on &quot;Blue Wind Blue&quot; -- all of them in fine voice. And John Prine's skeletal performance of &quot;Loretta,&quot; like Clark, makes the song sound like his own. . Mosser's &quot;A Song For&quot; is a very different kind of interpretation, but like Earle's rocking &quot;Two Girls,&quot; offers proof of the breadth and depth of Van Zandt's artistry as a true American folk songwriter that another performer can take a song and add something of her or his own and extend its meaning. Delbert McClinton may seem an odd choice for &quot;Pancho and Lefty,&quot; but he drenches it with a grainy, leathery expressiveness that is pure Texas, and pure McClinton, with traces of blues and R&amp;B injected into the folk and country of the original. Ultimately, Poet is an extremely fitting tribute to a legend, and in its performances underscores not only Van Zandt's reputation among his a peers, but also the enduring relevance and beauty of the work he left behind.","torrent":{"xt":"urn:btih:11bedddb381f2941e8dc8dd25a76ea35a6567a37","amp;dn":"+Poet%3A+A+Tribute+To+Townes+Van+Zandt+%5B2001%5D+%5BCompilation%5D%5BEAC%2FFL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11bedddb381f2941e8dc8dd25a76ea35a6567a37","infoHashBuffer":{"type":"Buffer","data":[17,190,221,219,56,31,41,65,232,220,141,210,90,118,234,53,166,86,122,55]},"announce":[],"urlList":[]}}