{"title":"Jazz - Coleman Hawkins 30s&amp;40s (1st&amp;BestJazzSax)","uid":4130976,"size":729695101,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:12a75dc82bc955c9629cc2ef7a2fdcf15b8d49c6&amp;dn=Jazz+-+Coleman+Hawkins+30s%2640s+%281st%26BestJazzSax%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"tamroi","files":138,"time":1208032794,"description":"Just fits a 700mb CD.\n1934-39 Europe; 1939-45 NewYork; 1945 LosAngeles ; 1949 Paris.\n\n     Coleman Hawkins was the first important tenor saxophonist and he remains one of the greatest of all time. A consistently modern improviser whose knowledge of chords and harmonies was encyclopedic, Hawkins had a 40-year prime (1925-1965) during which he could hold his own with any competitor.\n\n      By 1934, Coleman Hawkins had tired of the struggling Fletcher Henderson Orchestra and he moved to Europe, spending five years (1934-1939) overseas. He played at first with Jack Hylton's Orchestra in England, and then freelanced throughout the continent.  With World War II coming close, Hawkins returned to the U.S. in 1939. Although Lester Young had emerged with a new style on tenor, Hawkins showed that he was still a dominant force by winning a few heated jam sessions. His recording of &quot;Body and Soul&quot; that year became his most famous record.\n\n      Hawkins kept on working and occasionally recording, and by the mid-'50s was experiencing a renaissance. The up-and-coming Sonny Rollins considered Hawkins his main influence. \n\n       Some of his finest recordings were cut during the first half of the 1940s, including a stunning quartet version of &quot;The Man I Love.&quot; Although he was already a 20-year veteran, Hawkins encouraged the younger bop-oriented musicians and did not need to adjust his harmonically advanced style in order to play with them. He used Thelonious Monk in his 1944 quartet; led the first official bop record session (which included Dizzy Gillespie and Don Byas); had Oscar Pettiford, Miles Davis, and Max Roach as sidemen early in their careers; toured in California with a sextet featuring Howard McGhee; and in 1946, utilized J.J. Johnson and Fats Navarro on record dates.  AMG\n","torrent":{"xt":"urn:btih:12a75dc82bc955c9629cc2ef7a2fdcf15b8d49c6","amp;dn":"Jazz+-+Coleman+Hawkins+30s%2640s+%281st%26BestJazzSax%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12a75dc82bc955c9629cc2ef7a2fdcf15b8d49c6","infoHashBuffer":{"type":"Buffer","data":[18,167,93,200,43,201,85,201,98,156,194,239,122,47,220,241,91,141,73,198]},"announce":[],"urlList":[]}}