{"title":"The Dog Who Knew Too Much - Spencer Quinn.epub","uid":8992931,"size":461097,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12aa95040b014e8005d1011545367d866367a6eb&amp;dn=The+Dog+Who+Knew+Too+Much+-+Spencer+Quinn.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1380834571,"description":"The fourth entry in the irresistible New York Times bestselling mystery series featuring canine narrator Chet and his human companion Bernie, the coolest human/pooch duo this side of Wallace and Gromit. - (Kirkus Reviews).\n\nCombining suspense and intrigue with a wonderfully humorous take on the link between man and beast, Spencer Quinn's exceptional mystery series has captured widespread praise since its New York Times bestselling debut, 'Dog on It'.\n\n'The Dog Who Knew Too Much' marks the duo's triumphant return in a tale that's full of surprises.\n\nBernie is invited to give the keynote speech at the Great Western Private Eye Convention, but it's Chet that the bigshot P.I. in charge has secret plans for. Meanwhile Chet and Bernie are hired to find a kid who has gone missing from a wilderness camp in the high country.\n\nThe boy's mother thinks the boy's father, her ex, has snatched the boy, but Chet makes a find that sends the case in a new and dangerous direction.\n\nAs if that weren't enough, matters get complicated at home when a stray puppy that looks suspiciously like Chet shows up. Affairs of the heart collide with a job that's never been tougher, requiring our two intrepid sleuths to depend on each other as never before.\n\n'The Dog Who Knew Too Much' is classic Spencer Quinn, offering page-turning entertainment that's not just for dog-lovers.","torrent":{"xt":"urn:btih:12aa95040b014e8005d1011545367d866367a6eb","amp;dn":"The+Dog+Who+Knew+Too+Much+-+Spencer+Quinn.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12aa95040b014e8005d1011545367d866367a6eb","infoHashBuffer":{"type":"Buffer","data":[18,170,149,4,11,1,78,128,5,209,1,21,69,54,125,134,99,103,166,235]},"announce":[],"urlList":[]}}