{"title":"Aortic Diseases - Clinical Diagnostic Imaging Atlas{BBS}","uid":6783383,"size":73068281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12da6214e6d49d769e648051060822cefe993e9b&amp;dn=Aortic+Diseases+-+Clinical+Diagnostic+Imaging+Atlas%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1319996280,"description":"The number of cases of aortic disease is on the rise. In fact, 20,000 patients in the United States died from abdominal aortic aneurysms alone. Now, you can detect and treat the many complications associated with aortic disease in time to save many more patients. This title in the brand-new Clinical Diagnostic Imaging Atlas Series offers you authoritative guidance from a well-known cardiologist and imaging expert about when and how to perform the latest diagnostic imaging tests, interpret the results, and effectively treat the emergency. Detailed discussions of hot topics, full-color illustrations, and a DVD of procedural videos, animations, and downloadable image libraries help you provide fast, appropriate treatment for each challenging case you face.\n\n    * Offers detailed advice on when and how to screen for the most prevalent but often difficult-to-diagnose aortic disease to help you improve care and increase survival rates.\n    * Discusses the hottest topics in aortic disease, including imaging of the aorta . acute aortic dissection and late complications . intramural hematomas . thoracic and abdominal aortic aneurysms . TEVAR/EVAR procedures . coarctation of the aorta . traumatic disruption of the aorta . and more that prepare you to quickly diagnose and manage even the most difficult cases.\n    * Presents 101 fully illustrated case presentations with teaching points that make information easy to understand and digest.\n    * Addresses the advantages and limitations of chest radiology, transthoracic and transesophageal echocardiography, cardiac CT, MR, angiography, and nuclear cardiology techniques so you can quickly determine the best imaging approach.\n    * Includes supporting evidence and current AHA/ACC guidelines for more accurate interpretations of your imaging findings.\n    * Uses a consistent, easy-to-follow chapter format that includes topic overview, an outline of imaging/diagnostic options, and case-based examples to make reference easy.\n    * Provides more than 400 full-color illustrations for expert visual guidance.\n    * Includes a bonus DVD containing hundreds of videos of techniques and animations that show you what to look for and how to proceed as well as downloadable image libraries for use in electronic presentations. \n\n\n\n# Hardcover: 374 pages\n# Publisher: Saunders; Har/DVD/Ps edition (December 9, 2008)\n# Language: English\n# ISBN-10: 1416052704\n# ISBN-13: 978-1416052708","torrent":{"xt":"urn:btih:12da6214e6d49d769e648051060822cefe993e9b","amp;dn":"Aortic+Diseases+-+Clinical+Diagnostic+Imaging+Atlas%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12da6214e6d49d769e648051060822cefe993e9b","infoHashBuffer":{"type":"Buffer","data":[18,218,98,20,230,212,157,118,158,100,128,81,6,8,34,206,254,153,62,155]},"announce":[],"urlList":[]}}