{"title":"Manowar - Sign Of The Hammer (1984), [MP3 320 kbps] Heavy metal ","uid":4858257,"size":97347886,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:12effda743c740c555fffc8a6fd19ac72413a3d2&amp;dn=Manowar+-+Sign+Of+The+Hammer+%281984%29%2C+%5BMP3+320+kbps%5D+Heavy+metal+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"year2012","files":8,"time":1240154310,"description":"Manowar - Sign Of The Hammer (1984), [LOSSY MP3 320 kbps] Heavy metal [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Manowar%20-%20Sign%20Of%20The%20Hammer%20(1984)&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=anno2036&amp;sb=1&amp;sd=0&amp;cat=0\n\nManowar - Sign of the Hammer\nby anno2036\n\nCover\n Visit this link: http://upload.wikimedia.org/wikipedia/en/5/5a/ManowarSignofthehammer.jpg\n\nAlbum\nTitle: Sign of the Hammer\nYear:  1984                                    \nGenre: Heavy metal\nLabel: 10 Records\n\nTracklist\n1. All Men Play on 10\n2. Animals\n3. Thor (The Powerhead)\n4. Mountains\n5. Sign of the Hammer\n6. The Oath\n7. Thunderpick\n8. Guyana (Cult of the Damned)\n\nDescription\nfonte:  Visit this link: http://en.wikipedia.org/wiki/Sign_of_the_Hammer\nSign of the Hammer is the fourth album. All tracks written by Joey DeMaio except &quot;The Oath&quot; written by Joey DeMaio and Ross the Boss. \n&quot;Guyana (Cult Of The Damned)&quot; is a song about the 1978 mass suicide led by Jim Jones of the Peoples Temple cult, at Jonestown, northwestern Guyana.\n&quot;Thor (The Powerhead)&quot; is about the Norse God Thor (as the name suggests), destroying the evil of the world and the Giants (enemies of the Gods) as well. The song often brings about the RagnarÃƒÂ¶k, with &quot;Live to fight on that final day&quot; stated many times. The Norse people believed that at the end of the world the Gods and the Giants would battle for control. It is foreseen that the Gods would lose, and many of their deaths have been foretold before the battle. Regardless the Gods still will fight on the final day for the right to control Earth. This song has been covered by Symphonic metal band Therion on the album Crowning of Atlantis.'\n\nReview\nfonte:  Visit this link: http://truemetal.it/reviews.php?op=albumreview&amp;id=90\nIl 1984 ÃƒÂ¨ stato un anno molto produttivo per i Manowar, prima hanno pubblicato Hail to England, successivamente Sign of the Hammer.\nQuesto album inizia con due pezzi di heavy classico, all'americana. All Men Play On Ten ÃƒÂ¨ un tributo all'etichetta del momento, la 10 Records, e allo stesso tempo il manifesto del leit motiv dell'esistenza manowariana, ossia la lotta al false metal. Eric Adams ci canta a squarciagola che i Manowar non si piegheranno mai e poi mai alle esigenze dei produttori e delle mode, e che nessuno li comprerÃƒÂ  mai.\n\n&quot;... it's more to me than just a job, and while I'm playing\nYou won't get robbed\nNobody tells a man how to play, it just ain't that way&quot;\n\n&quot;... per me ÃƒÂ¨ molto piÃƒÂ¹ che un normale lavoro, quando io suono\nnon ti deruberÃƒÂ², nessuno puÃƒÂ² dire a un uomo come suonare, non ÃƒÂ¨ cosÃƒÂ¬ che funziona&quot;\n\nLa canzone ÃƒÂ¨ orecchiabile, gradevole, anche se piuttosto semplicina. Animals invece ÃƒÂ¨ una delle canzoni piÃƒÂ¹ insignificanti mai prodotte dalla band americana, quindi soprassiedo dal commentarla.\n\nLo spettacolo di Sign of The Hammer inizia con Thor.\nJoey &amp; Co. scomodano niente meno che la mitologia nordica, e narrano una battaglia di mostri, giganti e uomini, che assomiglia molto al Ragnarok, la battaglia finale. Eric in formissima per tutto il pezzo, interpreta alla grande, e finisce con un impressionante acuto da 31 secondi, a dimostrare, se ancora ce ne fosse stato bisogno, che lui ÃƒÂ¨ il piÃƒÂ¹ grande cantante della storia del metal.\n\nIn Mountains si cambia ritmo diverse volte, passando dal lento molto atmosferico, a un midtempo, alla marcia. Eric dimostra che non ha solo polmoni, ma anche una voce calda e carica, oltre che una grande espressivitÃƒÂ  e una carica interpretativa seconda a nessuno. Bello l'accompagnamento, il ritornello ÃƒÂ¨ a dir poco suggestivo. Il testo ÃƒÂ¨ affascinante, una poetica metafora sulla montagna, e la sfida alla maestÃƒÂ  delle altezze, laddove solo le aquile possono volare.\n\nUna sfuriata sotto il segno di Mjolner, ci annuncia Sign of the Hammer, title track, che sorprendentemente non ha niente a che vedere con Thor e Odino, ma che mitizza la band, in una novella Eneide, consegnando ai Manowar l'immortalitÃƒÂ , e il ruolo di alfieri della vendetta degli Dei.\nNonostante il testo abbastanza banale, il Bridge non fa il tempo a finire e giÃƒÂ  sto cantando &quot;Sign of the Hammer be my guide&quot;. Vi assicuro che dal vivo Eric fa veramente il mitico 'wuh' sul microfono, anche se non tante volte come nella versione da studio! Siamo di fronte al piÃƒÂ¹ classico heavy/speed americano, non fosse per testi, bridge e ritornello che sono epicissimi e trascinanti.\n\nThe Oath ÃƒÂ¨ il mio pezzo preferito e, come sempre vado in controtendenza, infatti il mio preferito in Battle hymns ÃƒÂ¨ Dark Avenger, pensate un po'.\nS'inizia con una sfuriata sulla batteria del vecchio Scott, dopodichÃƒÂ© il ritmo si stabilizza e inizia un testo leggermente delirante. A grandi linee si parla di un impegno di battaglia contro un determinato popolo, o una determinata setta. Se non fosse per strane affermazioni sui draghi, mi parrebbe di capire che si parla di un comandante romano, dei tempi della repressione anti cristiana, che si appresta a far stragi tra i profeti e i loro seguaci.\nCome non mai i testi di Joey (e Ross, in questo caso) sono criptici, e non si capisce se lo siano per eccesso di ermetica sapienza, o per l'opposto contrario. Ma tanto che ce ne frega, ciÃƒÂ² che conta ÃƒÂ¨ la musica! I suoni sono selvaggi e incessanti, la voce carica, cattiva, violenta, il basso ai massimi livelli, il carisma ÃƒÂ¨ tanto che alla fine si canta &quot;I swore the Oath&quot; giurando di battagliare contro qualsiasi nemico, pur di seguire i Kings Of Metal.\nInutile dirlo, Eric Adams ci stupisce l'ennesima volta, provate un po' ad ascoltarlo quando, dopo l'assolo, URLa\n&quot;Burning embers of the second death will come in the night&quot;.\nFarebbe paura perfino ai demoni dell'oltretomba.\n\nVi segnalo 2 strofe che nessuno ha mai saputo interpretare:\n&quot;Priests and Kings, the alpha and Omega, poison bites\nFalse Prophets and deceivers, swing from the trees&quot;\n\n&quot;Preti e Re, l'Alpha e l'Omega, (danno?) morsi velenosi\nFalsi profeti e ingannatori volteggiano dagli (sugli) alberi.&quot;\n\nEric URLa &quot;Swing from the trees&quot; con molta convinzione, che vorrÃƒÂ  significare?\n\nThunderpick rappresenta ciÃƒÂ² che non puÃƒÂ² mancare in un sano album dei Manowar: l'assolo di basso. Chiariamoci, il basso di Joey non ÃƒÂ¨ un basso normale. Si tratta di 4 corde di chitarra ravvicinate, raccolte in fondo al manico e suonate velocissimamente col plettro.\nCon questo strumento dal suono unico, Joey ci ha regalato grandi momenti di musica, ma a volte ciofeche terribili, come nel caso della insulsa Black Arrows (Hail To England).\nThunderpick per fortuna ÃƒÂ¨ forse il piÃƒÂ¹ bello dei pezzi per solo basso di Mister De Maio: tecnico, ma anche melodico ed epico, vale la pena ascoltarlo.\n\nIl gran finale dell'album, che purtroppo dura troppo poco, si materializza con Guyana (cult of the damned). Si tratta, a mia memoria, del primo testo 'impegnato' dei Manowar, non l'unico, perchÃƒÂ© un secondo pezzo del genere potrebbe essere ritenuto &quot;Spirit Horse of the Cherokee&quot;, col quale i Manowar si schierano in difesa del popolo e della cultura indiano.\n\nAntefatto: il 18 novembre del 1978, in una radura nella foresta della Guyana, il reverendo Jim Jones ordinÃƒÂ² ai 911 membri della sua setta di uccidersi bevendo un intruglio al cianuro.\nCerto che l'armageddon fosse imminente, oppure desideroso di sperimentare le sue tecniche di manipolazione delle masse, temute perfino dai servizi segreti americani, Jones diede il macabro ordine, e a morire non furono solo adulti consenzienti, perchÃƒÂ¨ il veleno fu propinato anche ai bambini della comunitÃƒÂ .\nI cultisti avevano ricevuto il lavaggio del cervello da mister Jones, che a sua volta si sarebbe tolto la vita sparandosi alla testa, anche se si sospetta che qualcun altrogli abbia dato il benservito.\nJones prese il suo posto di diritto nell'iconografia americana dei malvagi per eccellenza, affianco a gente del calibro di Charles Manson.\n\nCome avete capito, Guyana parla del reverendo Jones e della setta dei suicidi. Io avevo approfondito, la questione ben prima di sentire questo pezzo, e vi assicuro che i testi, la musica e la passione del cantato di Eric sono in grado di suscitare grandi emozioni, e di calarci nei panni di un membro nella setta, nel momento di immolarsi agli ordini del carismatico manipolatore.\n\nMaestoso attacco di basso, un arpeggio magistrale che c'introduce ad una marcia epica, che lascia il posto ad altri cambi di tempo, che di volta in volta sottolineano la drammaticitÃƒÂ  dei cori.\nUn grande pezzo, degno di concludere un grande album, e una grande era Manowar.\n\nCome accade in tutti i primi album, la band miscela heavy classico americano e heavy metal epico, con lo stile inconfondibile e unico che tutti conosciamo.\nSign Of The Hammer ÃƒÂ¨ l'ultimo album dei 'vecchi' Manowar. Anche un sordo puÃƒÂ² capire, infatti, che, dopo l'anomalo e rockeggiante Fighting the World, da Kings of Metal le cose sono cambiate parecchio, il sound della band ha iniziato a prendere una piega molto piÃƒÂ¹ power e 'moderna', abbandonando progressivamente i suoni piÃƒÂ¹ classici.\nA dimostrazione che non solo io la penso cosÃƒÂ¬, ma anche la band, basta che guardiate la divisione delle canzoni tra i due cd di Hell on Stage. Il CD 1 rappresenta i vecchi Manowar, il CD 2 i nuovi Manowar.\n\nNon sta a me disputare su quale ciclo sia il migliore, anche perchÃƒÂ© quello attuale ÃƒÂ¨ ancora ben lungi dal concludersi. Ma una cosa ÃƒÂ¨ certa: Sign of the Hammer rappresenta l'apoteosi del vecchio stile Manowar. Il suono ÃƒÂ¨ metallico come non mai, la produzione ÃƒÂ¨ grezza, ma la voce ÃƒÂ¨ tagliente, pura, potente, altissima, le distorsioni sono metalliche e cattive, l'originale basso di Mister De Maio viaggia alla grande. Il mix di pezzi lenti e veloci ÃƒÂ¨ dimostrazione della maturitÃƒÂ  raggiunta dalla band, che non scade mai nella banalitÃƒÂ , e non teme critiche o confronti, ma come sempre prosegue a testa alta per la propria strada. Acquisto consigliatissimo.\n\nBiography\nfonte:  Visit this link: http://it.wikipedia.org/wiki/Manowar\nI Manowar sono una band heavy metal nata ad Auburn, New York, nel 1980 dall'incontro tra il bassista del gruppo Joey DeMaio e il chitarrista Ross the Boss.\nIl nome del gruppo deriva da un termine usato nell'inglese arcaico, per l'appunto man o' war o man-o-war, che indicava una tipologia di antica nave da guerra a vela. Un'altra possibile traduzione ÃƒÂ¨ quella che intende man-o'-war una contrazione di man of war letteralmente uomo di guerra. I temi ricorrenti delle loro canzoni sono la mitologia, la guerra, la lealtÃƒÂ  e l'onore. I testi delle loro canzoni presentano quasi sempre elogi sulla musica heavy metal, che ÃƒÂ¨ visto non solo come un semplice genere musicale, ma come un vero e proprio stile di vita, di cui i Manowar si vantano di essere gli unici seguaci e portatori della parola.\nI Manowar sono tra i gruppi antesignani e fondatori del sottogenere epic metal; pionieristico in tal senso ÃƒÂ¨ soprattutto l'album Into Glory Ride, pubblicato nel 1983. Il gruppo detiene anche un vasto numero di record. In particolare rivendicano il titolo di &quot;band piÃƒÂ¹ rumorosa del mondo&quot; (precedentemente appartenuto ai MotÃƒÂ¶rhead) grazie al Guinness dei primati che ha registrato questo fatto. La band ÃƒÂ¨ infatti giunta a quota 129.5 decibel attraverso uno speciale equipaggiamento costruito da John &quot;Dawk&quot; Stillwell. Inoltre sono stati la prima band metal a includere argomenti di guerra, spade e metallo sia nelle loro canzoni che nelle loro copertine, a costruirsi un set di amplificatori e chitarre da sÃƒÂ© e su propria misura, ad aver registrato un album in Dolby 5.1 e detengono il record per il concerto metal piÃƒÂ¹ lungo della storia, con una prestazione di 5 ore ed 1 minuto in cui hanno eseguito oltre 50 brani.\n\nFormat\nMP3 - 320 Kbps - 44 kHz\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:12effda743c740c555fffc8a6fd19ac72413a3d2","amp;dn":"Manowar+-+Sign+Of+The+Hammer+%281984%29%2C+%5BMP3+320+kbps%5D+Heavy+metal+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12effda743c740c555fffc8a6fd19ac72413a3d2","infoHashBuffer":{"type":"Buffer","data":[18,239,253,167,67,199,64,197,85,255,252,138,111,209,154,199,36,19,163,210]},"announce":[],"urlList":[]}}