{"title":"Linux Operations and Administration","uid":7954848,"size":7928493,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:130e1d875dc18e20445684ef2065264e2329dca5&amp;dn=Linux+Operations+and+Administration+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Jenson100","files":-1,"time":1356386640,"description":"Overview -\nLinux Operations and Administration\nProduct Details\n\n    Pub. Date: July 2012\n    Publisher: Cengage Learning\n    Sales Rank: 589,613\n\n    ISBN-13: 9781111035303\n    ISBN: 111103530X\n\nSynopsis\n\nLINUX OPERATIONS AND ADMINISTRATION introduces readers to Linux operations and system administration through a unified installation, using virtual machines. This text is more effective than those that take a professional approach because it eliminates confusion from working with differing hardware configurations, while allowing users to test interoperability between Linux and Windows. Detailed, yet reader-friendly, Linux Operations and Administration makes it easy to learn Linux and practice it with helpful in-text features like learning objectives and key terms, as well as items for self assessment such as review questions, hands-on activities, and case projects.\nBiography\n\nAlfred Basta is a professor of Mathematics, Cryptography and Information Security. He is a professional speaker on topics in Internet Security, Networking, and Cryptography. Alfred is a member of many associations including the Mathematical Association of America.\n\nDustin A. Finamore has 14 years of experience with the United States Air Force (USAF), where he developed and taught UNIX security and UNIX advanced administration courses. As an airman, he installed, configured, and maintained intelligence computer systems worldwide. He is a graduate of Bellevue University and is currently an instructor at Virginia College, where he teaches Linux courses, among others.\n","torrent":{"xt":"urn:btih:130e1d875dc18e20445684ef2065264e2329dca5","amp;dn":"Linux+Operations+and+Administration+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"130e1d875dc18e20445684ef2065264e2329dca5","infoHashBuffer":{"type":"Buffer","data":[19,14,29,135,93,193,142,32,68,86,132,239,32,101,38,78,35,41,220,165]},"announce":[],"urlList":[]}}