{"title":"Encyclopedia of Geomorphology (Vol. 1) (Iradins)","uid":7301283,"size":17326577,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13b24d8290118eb01e3075170b45d48ee278f37f&amp;dn=Encyclopedia+of+Geomorphology+%28Vol.+1%29+%28Iradins%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"iradins","files":-1,"time":1338045169,"description":"Encyclopedia of Geomorphology (Volume 1) [Hardcover]\n\nAndrew Goudie (Editor)\n\nPublication Date: December 29, 2003 | ISBN-10: 041527298X | ISBN-13: 978-0415272988\n\nGeomorphology, the discipline which analyzes the history and nature of the earth's surface, deals with the landforms produced by erosion, weathering, deposition, transport and tectonic processes. In recent decades there have been major developments in the discipline and these are reflected in this major Encyclopedia, the first such reference work in the field to be published for thirty-five years.\n\nEncyclopedia of Geomorphology has been produced in association with the International Association of Geomorphologists (IAG) and has a truly global perspective. The entries have been written by an international editorial team of contributors, drawn from over thirty countries, who are all among the leading experts in the discipline.\n\nIn two lavishly illustrated volumes, Encyclopedia contains nearly 700 alphabetically organized entries to provide a comprehensive guide both to specific landforms and to the major types of geomorphological processes that create them. The Encyclopedia also demonstrates the major developments that have taken place in recent years in our knowledge of tectonic and climatic changes and in the use of new techniques such as modelling, remote sensing and process measurement. Older concepts, however, are not forgotten and provide an historical perspective on the development of ideas. Both accessible and authoritative, Encyclopedia of Geomorphology is destined to become the definitive resource for students, researchers and applied practitioners in the field of geomorphology and the cognate disciplines of geography, earth science, sedimentology and environmental science.","torrent":{"xt":"urn:btih:13b24d8290118eb01e3075170b45d48ee278f37f","amp;dn":"Encyclopedia+of+Geomorphology+%28Vol.+1%29+%28Iradins%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13b24d8290118eb01e3075170b45d48ee278f37f","infoHashBuffer":{"type":"Buffer","data":[19,178,77,130,144,17,142,176,30,48,117,23,11,69,212,142,226,120,243,127]},"announce":[],"urlList":[]}}