{"title":"Sherwood Fleming - Blues, Blues, Blues (2015) [FLAC]","uid":12522392,"size":181571726,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:13f4c9f1af54674eff378c25b79444c75f929d17&amp;dn=Sherwood+Fleming+-+Blues%2C+Blues%2C+Blues+%282015%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bluesmax","files":32,"time":1443907003,"description":"\nSherwood Fleming with The Moeller Brothers - Blues, Blues, Blues\r\nLabel: Dynaflow Records\r\nCountry: US\r\nReleased: 2015\r\nGenre: Blues\r\nStyle: modern electric Blues\r\n\r\n\r\nTracklist:\r\n\r\n1. Blues Blues\r\n2. Bold Soul Brother (Bold Soul Sister)\r\n3. Goin Back Home\r\n4. Gotta Hold On\r\n5. History\r\n6. Jailbait\r\n7. Lay it on the Line\r\n8. My Time\r\n9. Non Support Blues\r\n10. Three O clock in the Morning \r\n\r\n\r\nSherwood Fleming grew up in and around Lula in the Mississippi Delta. In 1956, when he was 20, Fleming confounded the geographical stereotype by migrating to Los Angeles rather than Chicago to seek fame and fortune in the music business. There, he found tough sledding, supporting himself as a trash man until finally getting into the studio to cut a 45 each for C&amp;F and Highland in 1968 and another for Kent in 1970. However, his career failed to take off and after a self-produced single on Sound Tround in 1980, he left the scene. Then, nearly 35 years later, he was heard singing at his Santa Monica church, which led him to hook up with producer Eddie Stout to cut this disc for the fledgling Dynaflow imprint.\r\n\r\nThe disc was recorded in Austin with brothers Johnny (guitar) and Jason (drums) Moeller, Nick Connolly on keyboards, Burly Manor on bass and Kaz Kazanoff on sax. Needless to say, that's an ace unit, and they provide sterling support for Fleming as he covers songs from such diverse sources as Ike &amp; Tina Turner, Andre Williams and Jimmy Hughes, as well as from West Coast contemporaries Tiny Powell, King Solomon and Frank Patt. Fleming also revisits his own Goin Back Home, No Life for a Working Man, Good Woman and Blues Blues, raps on History, a poem he wrote in response to the Rodney King beating, and closes the set in the best traditional fashion with an unaccompanied Trouble of the World.\r\n\r\nGiven the quality of his material and the strength of his voice, it's genuinely puzzling that Fleming's career fizzled out so quickly. So, here we have yet another chapter in the better late than never saga and a very strong contender for comeback of the year.  - Reviewed June 2015 by Jim DeKoster - Living Blues Magazine","torrent":{"xt":"urn:btih:13f4c9f1af54674eff378c25b79444c75f929d17","amp;dn":"Sherwood+Fleming+-+Blues%2C+Blues%2C+Blues+%282015%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13f4c9f1af54674eff378c25b79444c75f929d17","infoHashBuffer":{"type":"Buffer","data":[19,244,201,241,175,84,103,78,255,55,140,37,183,148,68,199,95,146,157,23]},"announce":[],"urlList":[]}}