{"title":"Skywalker: Highs and Lows on the Pacific Crest Trail","uid":8558990,"size":903391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14bc55b7efb11e79681285048f641ae7b8a32d8e&amp;dn=Skywalker%3A+Highs+and+Lows+on+the+Pacific+Crest+Trail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1370836760,"description":"\nBill Walker, &quot;Skywalker: Highs and Lows on the Pacific Crest Trail&quot;\nISBN: 1453862234 | 2010 | EPUB\n\nThe Pacific Crest National Scenic Trail (PCT )is the perfect place for an average person to do something extraordinary. Bill Walker (&quot;Skywalker&quot;), who stands 6'11&quot;, might seem like anything but average. Yet in a brutally honest tone, he lays to bare all his considerable weaknesses and fears. Among these are crushing weight loss and fatigue, along with a fear of getting lost or a bear stealing his food. Nonetheless, he is bound and determined to hike the PCT, which at 2,663 miles, runs all the way from Mexico to Canada.\n\nThe PCT's calling card is its stunning beauty. It has a diversity of geography unequaled by any footpath in the world. Haunting and beckoning the PCT hiker are the implacable desert, the towering majesty of the so-called High Sierra, and the ruggedly bleak, northern Cascade range. Indeed, the PCT hiker faces much greater extremes of terrain and climate than on the famed Appalachian Trail. Completing this demanding challenge calls for overwhelming clarity of purpose. Walker's signature characteristic as a writer is his real talent in capturing people (&quot;Skywalker's humor, his delight in human foibles appeal to a broad audience.&quot;--Jeff Minnick, Smoky Mountain Book News). Obviously, he is a people person because he runs into and vividly describes a truly colorful cast of characters from seemingly all walks of American life. Among these are Uber Bitch, Shit Bag, and Serial Killer; the reader learns how these hikers ended up with their names (hint: blunders).\n","torrent":{"xt":"urn:btih:14bc55b7efb11e79681285048f641ae7b8a32d8e","amp;dn":"Skywalker%3A+Highs+and+Lows+on+the+Pacific+Crest+Trail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14bc55b7efb11e79681285048f641ae7b8a32d8e","infoHashBuffer":{"type":"Buffer","data":[20,188,85,183,239,177,30,121,104,18,133,4,143,100,26,231,184,163,45,142]},"announce":[],"urlList":[]}}