{"title":"What If? - Volume 1","uid":5055151,"size":401365131,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:156428aecd71a0f9289a088a62ce50873967a5f2&amp;dn=What+If%3F+-+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":15,"time":1250372848,"description":"Audio Books : General : MP3/64Kbps : English\n \n\n\nWhat If? - Volume 1\n\nEssays by: Steven Amrbose, David McCullough, John Keegan and more...\nEdited by Robert Cowley\nNarrated by John Cunningham\n\n\n\n\nCounterfactuals - what-if scenarios - fueled countless bull sessions in smoke-filled dorm rooms in the 1960s. What if Sitting Bull had had a machine gun at Little Big Horn? What if Attila the Hun had had a time machine? What if Columbus had landed in India after all? \n\nSome of those dorm-room speculators grew up to be historians, and their generation (along with a few younger and older scholars) makes a strong showing in this anthology of essays, in which the what-ifs are substantially more plausible. \n\nWhat if Hitler had not attacked Russia when he did? He might have moved into the Middle East and secured the oil supplies the Third Reich so badly needed, helping it retain its power in Europe. What if D-Day had been a failure? The Soviet Union might have controlled all of Europe. What if Sennacherib had pressed the siege of Jerusalem in 701 B.C.? Then the nascent, monotheistic Jewish religion might never have taken hold among the people of Judah - and the daughter religions of Christianity and Islam would never have been born.\n\nSo suggest some of the many first-rate contributors to this collection, which grew from a special issue of MHQ: The Quarterly Journal of Military History. One of them is classicist Josiah Ober, who suggests that if Alexander the Great had died at the age of 21 instead of 32, Greece would have been swallowed up by Persia and Rome, and the modern Western world would have a much different sensibility - and probably little idea of democratic government. \n\nStill other contributors are Stephen E. Ambrose, Caleb Carr, John Keegan, David McCullough, and James McPherson, who examine a range of scenarios populated by dozens of historical figures, including Sir Walter Raleigh, Chiang Kai-shek, Robert E. Lee, Benito Mussolini, and Themistocles. The result is a fascinating exercise in historical speculation, one that emphasizes the importance of accident and of roads not taken in the evolution of human societies across time.\n\n\n\nEnjoy and Seed!!\n\n\nPS. I have already uploaded Volume 2","torrent":{"xt":"urn:btih:156428aecd71a0f9289a088a62ce50873967a5f2","amp;dn":"What+If%3F+-+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"156428aecd71a0f9289a088a62ce50873967a5f2","infoHashBuffer":{"type":"Buffer","data":[21,100,40,174,205,113,160,249,40,154,8,138,98,206,80,135,57,103,165,242]},"announce":[],"urlList":[]}}