{"title":"Under The Dome Episode 2 (720p).mp4","uid":10720941,"size":404163849,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:16233c226b7498bb214b85a2aa050ba78ce5d9bf&amp;dn=Under+The+Dome+Episode+2+%28720p%29.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"regishare","files":1,"time":1407482012,"description":"When Barbie realizes he left his dog tags at the cabin where he killed Julia's husband Peter (R. Keith Harris), he heads back to retrieve them but is ambushed by Junior who believes Angie is sexually involved with him. At the radio station, Dodee and Phil pick up a military frequency discussing the dome and Julia commandeers the microphone to broadcast the information. While exploring, Joe and his friend Ben notice that the military is testing to see if water can get through the dome and find out that a small amount can seep through. Meanwhile, Big Jim has Reverend Coggins (Ned Bellamy) destroy the propane shipment records at Duke's house, but Coggins accidentally starts a large fire while burning the evidence. Linda hears Coggins yell for help and pulls him out of the house, but the fire spreads when a nearby propane tank explodes, forcing the town to rally together to form a bucket brigade. Big Jim, who had ignored Coggins' cries for help before anyone arrived on the scene, uses a tractor to contain the fire. Moments later however, a hysterical Deputy Paul Randolph (Kevin Sizemore) shoots his gun at the dome, but the bullet ricochets off it and kills Deputy Freddy (Joe Knezevich).","torrent":{"xt":"urn:btih:16233c226b7498bb214b85a2aa050ba78ce5d9bf","amp;dn":"Under+The+Dome+Episode+2+%28720p%29.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16233c226b7498bb214b85a2aa050ba78ce5d9bf","infoHashBuffer":{"type":"Buffer","data":[22,35,60,34,107,116,152,187,33,75,133,162,170,5,11,167,140,229,217,191]},"announce":[],"urlList":[]}}