{"title":"Ten_Inch_Hero.avi","uid":4472989,"size":573744640,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:169f45477dc23a96c13c8a0f3513e2aff63b18c0&amp;dn=Ten_Inch_Hero.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chris_linds","files":1,"time":1225214260,"description":"Ten Inch Hero (USA - 2007)\ncomedy, drama, romance\n\nDirector - David Mackay\n\nStarring:\n\nElisabeth Harnois as Piper,\n\nClea DuVall as Jen,\n\nSean Patrick Flannery as Noah,\n\nJensen Ackles as Priestly, \n\nDanneel Harris as Tish,\n\nAlice Kridge as Zo,\n\nJohn Doe as Trucker\n\nFour friends deal with their love lives and learn about themselves while working in a funky sandwich shop in Santa Cruz, California.\n\nWith the poignant humor and heart of Diner, The Breakfast Club, and Mystic Pizza, here comes Ten Inch Hero much more than just a sandwich, its a story about finding love where you least expect it.\n\nSex, love and laughs are part of the everyday life in this hip little sub shop in Santa Cruz. For the group of friends who work there, it&amp;#039;s an oasis on the complex journey through relationships, a place where they have each other to lean on as they find their way.\n\nPiper (Elizabeth Harnois), an accomplished artist, comes to town in search of the child she gave up for adoption years earlier, but is surprised at what she finds.\n\nTish (Danneel Harris) is a knockout... and a nymphomaniac. But when will she learn that sex is more than a weapon and find true love?\n\nThe irreverent and horny Priestly (Jensen Ackles) dispenses free-wheeling comic advice to everyone, but how long can he hide his own feelings?\n\nShy Jen (Clea DuVall) watches life pass by, afraid to reach out, except through her e-mail romance with a mysterious stranger. Maybe after Piper and Tish teach her a few things, she&amp;#039;ll be ready to meet her online lover in person.\n\nTrucker (John Doe), a surfer child of the 60s, knows about life. He owns the sub shop, after all. So why does he need his young staff to help him discover the love of his life?\n\nThe sign out front says it all: Help Wanted normal people need not apply.\n\n--Synopsis copied from http://www.teninchhero.com/story.htm \n","torrent":{"xt":"urn:btih:169f45477dc23a96c13c8a0f3513e2aff63b18c0","amp;dn":"Ten_Inch_Hero.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"169f45477dc23a96c13c8a0f3513e2aff63b18c0","infoHashBuffer":{"type":"Buffer","data":[22,159,69,71,125,194,58,150,193,60,138,15,53,19,226,175,246,59,24,192]},"announce":[],"urlList":[]}}