{"title":"Nanoengineering - Global Approaches to Health and Safety Issues","uid":15429537,"size":20311741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16e7fb1b6b69d1f97f8f41ee67fbf92828845e2e&amp;dn=Nanoengineering+-+Global+Approaches+to+Health+and+Safety+Issues&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469709173,"description":"Nanoengineering - Global Approaches to Health and Safety Issues - Patricia I. Dolez (Elsevier, 2015).pdf\r\n\r\nNanoengineering: Global Approaches to Health and Safety Issues provides a global vision on the impact of engineered nanomaterials both for the consumer/general public and in occupational settings. The book also presents a hint on what can be expected for the future from nanomaterials and their effects on our lives, both at home and at work. In addition, users will find valuable information on nanomaterials' irreplaceable value and their risks for health, safety, and environmental issues. Case studies illustrate key points and provide information on important processes.\r\n\r\n\r\n\r\nProvides a global vision on the different aspects related to nanosafety and a synthesis of the information available\r\nGives all the information required for precision decision-making in a single book, offering both general public and occupational aspects\r\nContains separate chapters on each subject written by world-renowned contributors\r\nPresents a complete vision of the problem, with perspectives on global approaches\r\nIncludes case studies that illustrate important processes","torrent":{"xt":"urn:btih:16e7fb1b6b69d1f97f8f41ee67fbf92828845e2e","amp;dn":"Nanoengineering+-+Global+Approaches+to+Health+and+Safety+Issues","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16e7fb1b6b69d1f97f8f41ee67fbf92828845e2e","infoHashBuffer":{"type":"Buffer","data":[22,231,251,27,107,105,209,249,127,143,65,238,103,251,249,40,40,132,94,46]},"announce":[],"urlList":[]}}