{"title":"Forensic Science (2008) - (Malestrom)","uid":5050277,"size":20145103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1783af572bf735472e356baa6b0739ccc2cb4ca3&amp;dn=Forensic+Science+%282008%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1250162584,"description":"\n\nAyn Embar-seddon, Allan D. Pass &quot;Forensic Science&quot;\nSalem Press | 2008-10-17 | ISBN : 1587654239 | Pages: 1056 | PDF\n\nThis is a comprehensive reference source on the theory, techniques, and application of the various forensic sciences.The past decade has seen an explosion of interest in the application of scientific techniques to investigations of crime. Television audiences have developed a seemingly insatiable appetite for shows such as CSI: Crime Scene Investigation and Cold Case that go into the minutiae of how forensic techniques are used to solve crimes. &quot;Forensic Science&quot; examines this subject with a factual approach, while also addressing the kinds of topics that figure prominently in the media and offering up-to-date material in a rapidly changing field.Scope and coverage: &quot;Forensic Science&quot; approaches its subject from multiple directions. One of the primary approaches is from the points of view of forensic investigators. In addition to its core essays on sub specialties and allied fields, the set has essays on specific types of investigations, such as arson, homicide, and computer crime; both general and specific investigative techniques, such as autopsies, ballistics, chromatography, crime scene photography, fingerprint analysis, and polygraph analysis; specialized equipment, such as bomb and nuclear detection devices; and types of evidence, such as fire debris, fibers and filaments, glass, and blood residue and stains.A second broad approach taken by &quot;Forensic Science&quot; is its coverage of the role of forensic science in the American legal system.","torrent":{"xt":"urn:btih:1783af572bf735472e356baa6b0739ccc2cb4ca3","amp;dn":"Forensic+Science+%282008%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1783af572bf735472e356baa6b0739ccc2cb4ca3","infoHashBuffer":{"type":"Buffer","data":[23,131,175,87,43,247,53,71,46,53,107,170,107,7,57,204,194,203,76,163]},"announce":[],"urlList":[]}}