{"title":"Eric Burdon &amp; The Animals - Winds Of Change","uid":4758173,"size":85431447,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:17e245a6a4c6eb09116e8c0cc7d05ab827103168&amp;dn=Eric+Burdon+%26+The+Animals+-+Winds+Of+Change&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"butcherboys","files":-1,"time":1236564370,"description":"Artist: Eric Burdon &amp; The Animals\nAlbum: Winds Of Change\nRelease: 1967\nGenre: Psychedelic Rock\nBitrate: 256\nFile Size: 81.4MB\n======================================\n\nTrack List:\n\n1. Eric Burdon &amp; The Animals - Winds Of Change (4:00)\n2. Eric Burdon &amp; The Animals - Poem By The Sea (2:15)\n3. Eric Burdon &amp; The Animals - Paint It Black (6:00)\n4. Eric Burdon &amp; The Animals - The Black Plague (6:03)\n5. Eric Burdon &amp; The Animals - Yes I Am Experienced (3:45)\n6. Eric Burdon &amp; The Animals - San Franciscan Nights (3:23)\n7. Eric Burdon &amp; The Animals - Woman (5:26)\n8. Eric Burdon &amp; The Animals - Hotel Hell (4:53)\n9. Eric Burdon &amp; The Animals - Good Times (3:03)\n10. Eric Burdon &amp; The Animals - Anything (3:25)\n11. Eric Burdon &amp; The Animals - It's All Meat (2:05)\n\n========================================\n\nThe Animals were an English music group of the 1960s known in the United States as part of the British Invasion. Known for their gritty, bluesy sound and deep-voiced frontman Eric Burdon, as exemplified by their signature songs &quot;The House of the Rising Sun&quot; and &quot;We Gotta Get Out Of This Place&quot;, the band balanced tough, rock-edged pop singles against rhythm and blues-oriented album material. The Animals underwent numerous personnel changes and emerged as an exponent of psychedelic rock before dissolving at the end of the decade. They had a comeback in 1983 and started a world tour. In early 1984 the band disbanded.\n\nFormed in Newcastle upon Tyne during 1962 and 1963 when Burdon joined the Alan Price Rhythm and Blues Combo, the original line-up comprised Eric Burdon (vocals), Alan Price (organ and keyboards), Hilton Valentine (guitar), John Steel (drums), and Bryan &quot;Chas&quot; Chandler (bass).\n\nThey were dubbed &quot;animals&quot; because of their wild stage act and the name stuck. The Animals' moderate success in their hometown and a connection with Yardbirds manager Giorgio Gomelsky motivated them to move to London in 1964, in time to be grouped with the British Invasion. They performed fiery versions of the staple rhythm and blues repertoire (Jimmy Reed, John Lee Hooker, Nina Simone, etc). Signed to the UK Columbia subsidiary of EMI, a rocking version of the standard &quot;Baby Let Me Follow You Down&quot; (retitled &quot;Baby Let Me Take You Home&quot;) was their first single. It was followed in June 1964 by the transatlantic number one hit &quot;House of the Rising Sun&quot;. Burdon's howling vocals and the dramatic arrangement created arguably the first folk rock hit. Whether the arrangement was inspired by Bob Dylan's version of the song (which in turn was inspired by folk singer Dave Van Ronk) or by blues singer Josh White's (who recorded it twice in 1944 and 1949) or by singer/pianist Nina Simone (who recorded it in 1962 on Nina at the Village Gate, predating Dylan's interpretation) remains a dispute, as does whether all five Animals deserved credit for the arrangement and not just Price.\n\nThe Animals' two-year chart career, masterminded by producer Mickie Most, featured singles that were intense, gritty pop covers such as Sam Cooke's &quot;Bring It On Home To Me&quot; and the Nina Simone number &quot;Don't Let Me Be Misunderstood&quot;. In contrast their album tracks stayed with rhythm and blues, with Hooker's &quot;Boom Boom&quot; and Ray Charles' &quot;I Believe to My Soul&quot; being notable examples. Burdon's powerful, deep voice and the use of keyboards as much as or more than guitars were two elements that made the Animals' sound stand out.\n\nBy May 1965 the group was starting to feel internal pressures. Price left due to personal and musical differences as well as a fear of flying on tour; he went on to a successful career as a solo artist and with the Alan Price Set. Mickey Gallagher filled in for him on keyboards for a short time until Dave Rowberry replaced him and was on hand for the hit working-class anthems &quot;We Gotta Get out of This Place&quot; and &quot;It's My Life&quot;. Around that time, an Animals Big Band made a one-time appearance.\n\nMany of The Animals' hits had come from Brill Building songwriters recruited by Most; the group, and Burdon in particular, felt this too restrictive. As 1965 ended, the group switched to Decca Records and producer Tom Wilson, who gave them more artistic freedom. In early 1966 MGM Records, their American label, collected their hits on The Best of The Animals; it became their best-selling album in the US. In February 1966 Steel left and was replaced by Barry Jenkins; a leftover cover of Goffin-King's &quot;Don't Bring Me Down&quot; was the last hit as The Animals. For the single &quot;See See Rider&quot; they changed the name into Eric Burdon &amp; The Animals. In September they disbanded and Burdon recorded a solo album, called Eric Is Here.\n\nBy this time their business affairs &quot;were in a total shambles&quot; according to Chandler (who went on to manage Jimi Hendrix) and the group disbanded. Even by the standards of the day when artists tended to be financially naÃƒÂ¯ve the Animals made very little money, eventually claiming mismanagement and theft on the part of their manager Michael Jeffery.\n\n========================================\n","torrent":{"xt":"urn:btih:17e245a6a4c6eb09116e8c0cc7d05ab827103168","amp;dn":"Eric+Burdon+%26+The+Animals+-+Winds+Of+Change","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17e245a6a4c6eb09116e8c0cc7d05ab827103168","infoHashBuffer":{"type":"Buffer","data":[23,226,69,166,164,198,235,9,17,110,140,12,199,208,90,184,39,16,49,104]},"announce":[],"urlList":[]}}