{"title":"FINAL FANTASY XIII 1.0.0 [Full] (Japanese) Android","uid":11812511,"size":4187098,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:18075e390ce1041422ee561d24432eef3e5bf916&amp;dn=FINAL+FANTASY+XIII+1.0.0+%5BFull%5D+%28Japanese%29+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".BONE.","files":1,"time":1428939389,"description":"Description\n********************\nâ—‡ â—† Final Fantasy series 13th installment, first series, &quot;FINAL FANTASY XIII&quot; appeared! â—† â—‡\nDraw the human beings of the story that Aragau the fate of two of the world of utopia Cocoon floating in the sky and wilderness pulse on the stage!\nCool hero speedy Lightning battle, and, please enjoy the magnificent unknown world of adventure!\n- FFXIII -\n(Download trial Play Free / Basic play surcharge)\n\n********************\nâ–¼ â–³ this app is a &quot;cloud game apps&quot; â–³ â–¼\n[Notes of Terms of Use]\nThis application, during game play, you always streaming communication will occur. with stable 3Mbps more effective bandwidth, please use in WiFi connection environment.\nAlways, please confirm the operation before you buy free trial play (30 minutes). Correspondence is not possible to cancel and refund, etc. after purchase.\n\n--------------------\nâ—† â—† prologue\nAnd Utopia &quot;Cocoon&quot; that floats in the sky wilderness &quot;pulse&quot; -.\nPeople who live in Cocoon, the benefit of such presence &quot;Farsi&quot; like God beyond human knowledge, is committed to what handicapped not lived, had a life in peace and stability the world.\nHowever, there are things that Cocoon of people are afraid only one.\n&quot;World&quot; pulse &quot;that is referred to as the lower bound.&quot; -\nCocoon and Pulse never not to intersect the world, therefore Cocoon of people nothing is informed about the pulse, has just been told the threat of pulse as lore.\n... Until that incident occurs\n--------------------\nâ—† features of the game â—†\nWhen Encounter in contact with the enemy field battle starts. Battle in the flow of time in real time, the character will act by consuming to go ATB (active time battle) gauge accumulated over time.\n\nÂ· ATB - active time battle -\nThe command input for each slot. Or aim a continuous attack, as soon determined to be either aim a powerful attack of players at once consume multiple slot!\nÂ· OPTIMA SYSTEM - Optima system -\nInstantly switching the role called different roles, I will Ojiyo to ever-changing tactical situation!\nÂ· SUMMON SYSTEM - Summoned Beast System -\nMovement at their own intention, fight servitor us. Its power is further accelerated by the &quot;driving mode&quot;!\n\nBasicly you need good internet speed is a cloud game like playing pc games on onlive","torrent":{"xt":"urn:btih:18075e390ce1041422ee561d24432eef3e5bf916","amp;dn":"FINAL+FANTASY+XIII+1.0.0+%5BFull%5D+%28Japanese%29+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18075e390ce1041422ee561d24432eef3e5bf916","infoHashBuffer":{"type":"Buffer","data":[24,7,94,57,12,225,4,20,34,238,86,29,36,67,46,239,62,91,249,22]},"announce":[],"urlList":[]}}