{"title":"Ultimate Deadpool 2014","uid":11558054,"size":8132249485,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:180f241801e1cc260b8d7f3e5d76defb1ee55fbc&amp;dn=Ultimate+Deadpool+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"silverass","files":406,"time":1416849534,"description":"Hi!\n\nThis would be collection of all Deadpool comics not including his appearances in other comics.\nI'm sure I missed something since there are so many comics but I gave it a best shot.\n\nThis collection is intended for people who would like to start with the mighty Deadpool and don't know where to begin and what order should they take. There are many Deadpool comic collection already on the internet but mine is most organized ;)\n\nComics in longer series are in suggested order (mainly by time of publication) so most of the references to older material should be understandable.\nThis page should guide you a little bit: http://marvel.wikia.com/Deadpool_Comic_Books\nThere are some overlapping but what can we do? :) In the last comics (Deadpool marvel now) after comic number 026 there is whole comic that should (and can) be read before you should continue to number 027.\n\nShorter series are not in order since they mostly don't fit nicely in the canonical stories (Well that's my opinion and I don't give a damn if you don't agree). Smart read should read them later after he/she reads main series and will have the need to fill the void :)\n\nOne shots can be read any time, some make sense and are canonical some are not. You decide.\n\nThat's it. Hopefully you will enjoy Deadpool\n\nPlease seed &amp; buy real comics if they are available in your country","torrent":{"xt":"urn:btih:180f241801e1cc260b8d7f3e5d76defb1ee55fbc","amp;dn":"Ultimate+Deadpool+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"180f241801e1cc260b8d7f3e5d76defb1ee55fbc","infoHashBuffer":{"type":"Buffer","data":[24,15,36,24,1,225,204,38,11,141,127,62,93,118,222,251,30,229,95,188]},"announce":[],"urlList":[]}}