{"title":"EnigmaT Set Rips { Cuts } - May 15th, 2014","uid":10154398,"size":1167633579,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1878aca2bc3f1bacbce740b98c29f92f0521443f&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+15th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EnigmaT","files":141,"time":1400141910,"description":"A.V.E.R. &amp; Hailey - My Soul (Original Mix) (Cut From Feel Set)-enTc\nActive Limbic - Karahana (Chris Voro Remix) (Cut From Downey Set)-enTc\nAdam Aesalon - Edmbox (Cut From Bolier Set)-enTc\nAddictive Glance - Crisi (Cut From Barone Set)-enTc\nAERO 21 Feat. Svenja - Polar Lights (AERO 21s DYNAMICA Mix) (Cut From Arctic Moon Set)-enTc\nAERO 21 feat. Svenja - Polar Lights (Etasonic Remix) (Cut From Uplift Set)-enTc\nAERO 21 Feat. Svenja - Polar Lights (UDM Remix) (Cut From A&amp;F Set)-enTc\nAirzoom - A Little Peace (Edit) (Cut From Uplift Set)-enTc\nAlex Metric &amp; Jacques Lu Cont feat. Malin - Safe With You (Marcus Marr Unsafe Remix) (Set Rip)-enTc\nAlexander Turok - A Good Start (Cut From Styller Set)-enTc\nAlexx Rave - Multiplex (Original Mix) (Cut From Feel Set)-enTc\nAly &amp; Fila - Lost Language (Hazem Beltagui Bootleg) (Cut From A&amp;F Set)-enTc\nAmos &amp; Riot Night - Beyond Belief (Final Master) (Cut From Saux Set)-enTc\nAndy Tau - Into The Void (BlackWhyte Remix) (Cut From Tasev Set)-enTc\nAnske pres. Aqsua - Aquatic (Original Mix) (Cut From Arctic Moon Set)-enTc\nArctic Moon - Starlight In The Dark (Original Mix) (Cut From Arctic Moon Set)-enTc\nArmeen i.n.b - Amber (UDM Remix) (Cut From Saux Set)-enTc\nAssaf &amp; Dan Chase - Static (Original Mix) (Cut From Antillas Set)-enTc\nAstaeus - When We Connect (Original Mix) (Cut From Akira Set)-enTc\nAudiko - The Gift (Original Mix) (Cut From Feel Set)-enTc\nAvesta - Rollercoaster (Original Mix) (Cut From Quintino Set)-enTc\nAvrora - Travel In Space (Original Mix) (Cut From Angel Ace Set)-enTc\nBanvox - Connection (Dirtyloud Remix) (Cut From Page Set)-enTc\nBanvox - Connection (Original Mix) (Cut From Oakenfold Set)-enTc\nBeatsole - Infinite (Michael Retouch Remix) (Cut From Romel Set)-enTc\nBen Remember - Moving Hearts (Cut From Juventa Set)-enTc\nBisbetic - Dinosaur (Original Mix) (Cut From Gold Set)-enTc\nCharly Darker - War Paint (Cut From Bolier Set)-enTc\nCiro Visone - Fighter (Original Mix) (Cut From ReOrder Set)-enTc\nCrusy - Noidem (Original Mix) (Cut From Gold Set)-enTc\nDan Chase feat. Laura Aqui - Little Pieces (Dan Chase Uplifting Mix) (Set Rip)-enTc\nDaniel Rise - Victoria (Gary Afterlife Remix) (Cut From Feel Set)-enTc\nDark Fusion - Native (Original Mix) (Cut From Bostock Set)-enTc\nDavid Mayne - Palladium (Jeremy Rowlett Remix) (Cut From Styller Set)-enTc\nDavid Moleon - Navagando In The Cosmos (Cut From Rees Set)-enTc\nDisclosure feat. Sam Smith - Latch (Oliver Heldens Remix) (Cut From Bolier Set)-enTc\nDJ Massymo Tn - The Last Goodbye (Vintage Colors Club Mix) (Cut From Feel Set)-enTc\nDmitry KO &amp; Jochen Miller - We Back (Cut From First State Set)-enTc\nDustin Zahn - Calm Like A Bomb (Original Mix) (Cut From Halliwell Set)-enTc\nEddie Bitar feat. Christina Novelli - Start Again (Cut From Bitar Set)-enTc\nEDU Kristoffer Ljungberg - Outbreak (Pierre in the Air Remix) (Cut From Juventa Set)-enTc\nEmre Yildiz - Passions (Cut From A&amp;F Set)-enTc\nEwan Rill - Fastic (Monojoke Remix) (Cut From Barone Set)-enTc\nFacepalm - Tsampika Reloaded (Original Mix) (Cut From Styller Set)-enTc\nFranz Novotny - Falling Skies (Dave Winnel Remix) (Cut From Gold Set)-enTc\nGai Barone &amp; Nico Parisi - Perla (Thorin Remix) (Cut From Barone Set)-enTc\nGarrido &amp; Hanski feat. Erin - Run (Dub Mix) (Cut From Hulsmans Set)-enTc\nGlobal Influence - Beautiful Girl (Original Mix) (Cut From OzzyXPM Set)-enTc\nGrasse - Newton's Cradle (Original Mix) (Cut From Tangle Set)-enTc\nHoll &amp; Rush - No Traces (Cut From Ferry Set)-enTc\nIhor Mihal - Slumber (Original Mix) (Cut From LEON Set)-enTc\nIl Santo featuring Eighty - Summertime (Roy Malakian Remix) (Cut From Pit Set)-enTc\nIndila - Derniere Danse (Spark7 Insane Bootleg) (Cut From Feel Set)-enTc\nIrregular Synth - In The Middle Of Drama (Cut From Graham Set)-enTc\nIrregular Synth - Seven Hundred (Cut From Graham Set)-enTc\nIshome - Eva (Tvarsovsky Remix) (Cut From Ruben Set)-enTc\nJacoo - Reincarnation (Cut From Barone Set)-enTc\nJason Ross - Burma (-FiXeD- Cut From Oakenfold Set)-enTc\nJay Hardway - Bootcamp (Cut From Bolier Set)-enTc\nJedmar - Maharaja (Cut From Uplift Set)-enTc\nJewelz &amp; Scott Sparks - Dope (Cut From First State Set)-enTc\nJOEYSUKI - Aftermovie (Jonathan Pitch Remix) (Cut From Feel Set)-enTc\nJohn Askew - Giving You Acid (Harmonic Rush On Salvia Remix) (Cut From Romel Set)-enTc\nJohn Christian &amp; IndYana - Never Sleep (Official Dreamfields Anthem) (Club Mix) (Set Rip)-enTc\nJohn Christian - Next Level (Nicky Romero Edit) (Cut From W&amp;W Set)-enTc\nJohn Gregory - BAM (Cut From Lynam Set)-enTc\nJohn Newall - Grand Central (Cut From Jong Set)-enTc\nJordan Suckley &amp; Binary Finary - It Gets Me (Brock &amp; Ryan Remix) (Cut From Oakenfold Set)-enTc\nKenshin &amp; Zex - Summer Breeze (Original Mix) (Cut From Feel Set)-enTc\nKiesza - Hideaway (Anakyn Remix) (Cut From First State Set)-enTc\nKinetica - Jupiter Landing (Original Mix) (Cut From Burrows Set)-enTc\nKoka - 2k14 (Cut From Ruben Set)-enTc\nKonstantin Sibold - Madeline (Cut From Graham Set)-enTc\nLisa Lashes &amp; Tasso - Tempestuous (Allen &amp; Envy Remix) (Cut From Lynam Set)-enTc\nLost Witness feat. Tiff Lacey - Love Again (Another World Dub Mix) (Cut From Uplift Set)-enTc\nLostly - Almost Home (Cut From A&amp;F Set)-enTc\nMajlo - The Past (Original Mix) (Cut From Feel Set)-enTc\nMark L - Lawbreaker (Fjer Vizzuett Remix) (Cut From Lynam Set)-enTc\nMartin Libsen - Angel of Hope (Original Mix) (Cut From ReOrder Set)-enTc\nMatierro &amp; Dean Elbaz - Leverage (Original Mix) (Cut From Gold Set)-enTc\nMekka - The Inner Light (Cut From Downey Set)-enTc\nMEM - Do It Like That (Original Mix) (Cut From Faruk Set)-enTc\nMichael Berklin - Cresco (lian July Remix) (Cut From Ruben Set)-enTc\nMike Saint-Jules - Space Renegade (Cut From Ferry Set)-enTc\nMimax - Sibling (Original Mix) (Cut From Styller Set)-enTc\nMostfa &amp; Mostfa - Only A Memory (Cut From A&amp;F Set)-enTc\nMostfa &amp; Mostfa Vs. Emanuele Congeddu - Sacred Mountain (Cut From OzzyXPM Set)-enTc\nMr Probz - Waves (Miami Rockets &amp; Nicola Fasano) (Cut From Gold Set)-enTc\nNick Callaghan &amp; Craig Meichan - Rectify (Nick Callaghan Remix) (Cut From Romel Set)-enTc\nNick Callan - Tomorrow Never Comes (Cut From Assaf Set)-enTc\nNoon &amp; Morgan - Shake it (Original Mix) (Cut From Burrows Set)-enTc\nnouvo nude Feat. Mayu Wakisaka - Beautiful Days (Cut From Young Free Set)-enTc\nOliver Koletzki &amp; Nord - After All (Cut From Graham Set)-enTc\nOpen Source - GRUB (Roket Remix) (Cut From Lynam Set)-enTc\nOrment - Hope of Dreams (Cut From Uplift Set)-enTc\nOrment - Hope of Dreams (Original Mix) (Cut From Romel Set)-enTc\nPaul Denton - The Middle (Amir Hussain Remix) (Cut From A&amp;F Set)-enTc\nPaul Oakenfold - Ready Steady Go (Shane Halcon &amp; Somna Remix) (Cut From Somna Set)-enTc\nPaul Oakenfold - Ready Steady Go (Shane Halcon vs Somna Remix) (Set Rip)-enTc\nPaul Rigel - Far Way (Original Mix) (Cut From OzzyXPM Set)-enTc\nPelari - Mori (Cut From Page Set)-enTc\nPelari - Mori (Original Mix) (Cut From Quintino Set)-enTc\nQuintino - Go Hard (Original Mix) (Cut From Gold Set)-enTc\nQuivver - Ain't Nothing Goin On But The Rent (Cut From Graham Set)-enTc\nReconceal - Never Planned (Airborn Remix) (Cut From ReOrder Set)-enTc\nReflection Soul - Constellation (Original Mix) (Cut From Barone Set)-enTc\nRischaad - Time (Original Mix) (Cut From Solarstone Set)-enTc\nRodg - Office Gossip (Cut From Juventa Set)-enTc\nRodg - Office Gossip (Cut From Ruben Set)-enTc\nScot Project - Derb Common (Part 2) (Cut From Marlo Set)-enTc\nSimos Taglas - Water Stone (Alfredo Calderini Remix) (Cut From J00F Set)-enTc\nSolarstone &amp; JES - Like A Waterfall (Pure Mix) (Cut From Solarstone Set)-enTc\nSolid Stone - Furious (Cut From Graham Set)-enTc\nSomna &amp; Yang feat. Michele C - Chasing Stars (Cut From Somna Set)-enTc\nSoundLift - Flying Higher (Duduk Mix) (Cut From Uplift Set)-enTc\nSpeed Limit vs. Cooldozer - Rainbow (Cut From Bolier Set)-enTc\nSpy - The Coriolis Effect (Original Mix) (Cut From OzzyXPM Set)-enTc\nStadiumx &amp; Taylr Renee - Howl At The Moon (Roondabit Acoustic Intro Edit) (Cut From Xabi Set)-enTc\nSunflare - 140BPM (Witness45 138BPM Remix) (Cut From A&amp;F Set)-enTc\nTasso - L.R.H. (Chris Porter Remix) (Cut From Tangle Set)-enTc\nThe Advent &amp; Industrialyzer - Coma (Cut From Rees Set)-enTc\nThe Odd Chaps feat. jACQ - Wisdom (Original Mix) (Cut From Young Free Set)-enTc\nThe Quadrobe - Phunktified (Billy Seal Remix) (Cut From Arctic Moon Set)-enTc\nThe Script - Falling To Pieces (Sied van Riel &amp; David Forbes Remix) (Cut From Ruben Set)-enTc\nTiesto - Ten Seconds Before Sunrise (Craft Integrated Bootleg) (Cut From MadCore Set)-enTc\nTiesto featuring Kirsty Hawkshaw - Just Be (Stereojackers v Mark Loverush Remix) (Cut From Feel Set)-enTc\nTim Iron - Time Machine (Kenneth Thomas Edit) (Cut From Palagano Set)-enTc\nTom Swoon Feat. Niclas Lundin - Otherside (-SHORT- Cut From W&amp;W Set)-enTc\nTom Swoon Feat. Niclas Lundin - Otherside (Cut From First State Set)-enTc\nTomas Heredia - Way Out (Cut From Graham Set)-enTc\nTommy Trash - Lord Of The Trance (Original Mix) (Cut From Halliwell Set)-enTc\nTony Junior - Wake Up (Cut From Xabi Set)-enTc\nTrancEye - Demonica (Touchstone Remix) (Cut From Burrows Set)-enTc\nTritonal feat. ID - Satellite (Original Mix) (Cut From Tritonal Set)-enTc\nTube Miller feat. Szen - Winding Road (Original Mix) (Cut From Feel Set)-enTc\nUla - Amaterasu (Katylyst Remix) (Cut From Magikgate Set)-enTc\nUla - World of Dreams (Cut From Uplift Set)-enTc\nUltraviolence - Reverse (Cut From Lynam Set)-enTc\nWay Out West - Mind Circus (Alan Banks Remix) (Cut From Solarstone Set)-enTc\nWill Atkinson pres. Darkboy- Atkinsane (Mark Sherry Remix) (Cut From Suckley Set)-enTc\nY.V.E. 48 - On The Road (Cut From Ruben Set)-enTc\n","torrent":{"xt":"urn:btih:1878aca2bc3f1bacbce740b98c29f92f0521443f","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+May+15th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1878aca2bc3f1bacbce740b98c29f92f0521443f","infoHashBuffer":{"type":"Buffer","data":[24,120,172,162,188,63,27,172,188,231,64,185,140,41,249,47,5,33,68,63]},"announce":[],"urlList":[]}}