{"title":"Homeworld Remastered Collection Update 20150323 - RELOADED","uid":11775385,"size":1381527044,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:18cebd5f392d526d29edb9fa5586aa4d1159e623&amp;dn=Homeworld+Remastered+Collection+Update+20150323+-+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dauphong","files":16,"time":1427262154,"description":" Note: This is a cumulative update, you only need original game release\n  properly installed to apply this update.\n\n  Tips:\n\n  * Game may need admin rights when launched from some locations.\n  * Each game may be started without using the launcher if it fails for some\n    reason.\n  \n  --\n\t\t\n  Experience the epic space strategy games that redefined the RTS genre. \n  Control your fleet and build an armada across more than 30 single-player \n  missions. Choose unit types, fleet formations and flight tactics for each \n  strategic situation. Utilize advanced research to construct ships ranging \n  from light fighters to huge carriers and everything in between. \n\n  The Homeworld games have been painstakingly re-mastered with key members of \n  the original development team and taking critical influence and assistance \n  from the passionate fan community. The Homeworld Remastered Collection \n  introduces Relic's acclaimed space strategy games Homeworld and Homeworld 2 \n  to modern players and operating systems using the newest sophisticated \n  graphics rendering technology, plus a fully remastered score and new, high \n  fidelity voice recordings by the original actors. \n\n  As a free bonus, this collection also includes original, non-remastered \n  versions of Homeworld Classic and Homeworld 2 Classic, preserving the \n  purest form of the original releases with compatibility for modern \n  operating systems. \n\n  Key Features:\n\n  * Build and battle with more than 100 space ships \n  * Updated high-res textures and models \n  * New graphical effects \n  * Support for HD, UHD, and 4K resolutions \n  * New audio mix using original source effects and music \n  * Cinematic scenes recreated in beautiful high fidelity by original artists \n  * Mod support and mod tools \n  * Bonus archival versions of Homeworld Classic and Homeworld 2 classic, \n    preserving the purest form of the original releases with compatibility for \n    modern operating systems \n  * Access to the Homeworld Remastered Steam Multiplayer Beta beginning \n    February 25: play Homeworld races against Homeworld 2 races with up to \n    eight players on 23 maps, plus brand new game modes\n\n\n             ÃŸ ÃœÃŸÃŸÃœ ÃœÃŸ   Â²ÃœÃœ  ÃœÃŸÃŸÃœ Â²   Â²   ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ Â²ÃœÃœ  ÃœÃŸÃŸ  ÃœÃŸ\n  ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ Ã› Ã›  Â² ÃŸÃŸÃŸÃ› Ã›  Ãœ Ã›ÃŸÃŸÂ² Ã›   Ã›   Ã›  Â² Ã›  Â² Ã›  Ãœ Â²ÃŸ Ãœ ÃŸÃŸÃŸÃ› ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ\n             ÃŸ ÃŸ     ÃŸÃŸ   ÃŸÃŸÃŸ ÃŸ    ÃŸÃŸÃŸ ÃŸÃŸÃŸ ÃŸ     ÃŸÃŸ   ÃŸÃŸÃŸ ÃŸÃŸÃŸÃŸ  ÃŸÃŸ\n\n\n  1. Unrar.\n  2. Install the update to where the game is installed.\n  3. Copy over the cracked content from the /Crack directory to your game\n     install directory.\n  4. Play the game.\n  5. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:18cebd5f392d526d29edb9fa5586aa4d1159e623","amp;dn":"Homeworld+Remastered+Collection+Update+20150323+-+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18cebd5f392d526d29edb9fa5586aa4d1159e623","infoHashBuffer":{"type":"Buffer","data":[24,206,189,95,57,45,82,109,41,237,185,250,85,134,170,77,17,89,230,35]},"announce":[],"urlList":[]}}