{"title":"Bell Orchestre - As Seen through Windows (2009) V0","uid":5536911,"size":97099524,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:18f7aa4da2709dd0c2f4e1894c60d4eea47ee106&amp;dn=Bell+Orchestre+-+As+Seen+through+Windows+%282009%29+V0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"junah","files":12,"time":1273099801,"description":"The second helping from Montreal's Bell Orchestre holds true to the Canadian instrumentalists' penchant for melodic/atonal slabs of cinematic chamber rock, but this time around they've reigned in the jerky, less-developed aspects of their work, allowing for a smooth, though still volatile blend of post-punk, classical crossover, and straight-up experimental rock. As Seen Through Windows employs much of the same instrumentation as 2005's Recording a Tape the Colour of the Light (strings, brass, drums, guitar, keyboards, bass), but where their debut relied on visceral live performance to paint its audio images, Windows bends each instrument to its will, distressing, texturizing, and squeezing out every sonic option using both organic and electronic means. From the muted, warmly distorted horns that serve as opener &quot;Stripes,&quot; the spine to the manic &quot;Gaze,&quot; which explodes out like an amplifier crash into a late-'70s cop drama theme, to the My Morning Jacket-inspired closer &quot;Air Lines/Land Lines,&quot; the Bell Orchestre imbue each track with both dexterity and playfulness, rarely stopping long enough to commit wholeheartedly to one or the other -- &quot;Bucephalus Bouncing Ball&quot; may lean a little too hard on distorted drums, but it goes from Battles-esque math-jam to triumphant and majestic in just under three minutes. While this may frustrate some listeners looking for a tow rope, it makes for a far more rewarding run for those willing to endure every bump and glide. ~ James Christopher Monger\n\nYear: 2009\nBitrate: V0","torrent":{"xt":"urn:btih:18f7aa4da2709dd0c2f4e1894c60d4eea47ee106","amp;dn":"Bell+Orchestre+-+As+Seen+through+Windows+%282009%29+V0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18f7aa4da2709dd0c2f4e1894c60d4eea47ee106","infoHashBuffer":{"type":"Buffer","data":[24,247,170,77,162,112,157,208,194,244,225,137,76,96,212,238,164,126,225,6]},"announce":[],"urlList":[]}}