{"title":"The Athena Project by Brad Thor epub","uid":9421967,"size":980429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:191ab66c7fea732344189c9cddd81573c6ff0086&amp;dn=The+Athena+Project+by+Brad+Thor+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1388606058,"description":"Overview:\n\nThe world?s most elite counterterrorism unit has just taken its game to an entirely new level. And not a moment too soon . .\nFrom behind the rows of razor wire, a new breed of counterterrorism operator has emerged.\n\nJust as skilled, just as fearsome, and just as deadly as their colleagues, Delta Force?s newest members have only one thing setting them apart?their gender. Part of a top-secret, all-female program codenamed The Athena Project, four of Delta?s best and brightest women are about to undertake one of the nation?s deadliest assignments.\n\nWhen a terrorist attack in Rome kills more than twenty Americans, Athena Team members Gretchen Casey, Julie Ericsson,\n\nMegan Rhodes, and Alex Cooper are tasked with hunting down the Venetian arms dealer responsible for providing the explosives. But there is more to the story than anyone knows.\n\nIn the jungles of South America, a young U.S. intelligence officer has made a grisly discovery. Surrounded by monoliths covered with Runic symbols, one of America?s greatest fears appears to have come true. Simultaneously in Colorado, a foreign spy is close to penetrating the mysterious secret the U.S. government has hidden beneath Denver International Airport.\n\nAs the women close in on their target, they will soon learn that another attack?one of unimaginable proportions?has already been set in motion, and the greatest threat they face may be the secrets kept by their own government.\n\nGenre:  Thriller","torrent":{"xt":"urn:btih:191ab66c7fea732344189c9cddd81573c6ff0086","amp;dn":"The+Athena+Project+by+Brad+Thor+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"191ab66c7fea732344189c9cddd81573c6ff0086","infoHashBuffer":{"type":"Buffer","data":[25,26,182,108,127,234,115,35,68,24,156,156,221,216,21,115,198,255,0,134]},"announce":[],"urlList":[]}}