{"title":"DECODING THE PAST: SECRETS OF THE KORAN","uid":9974158,"size":485473062,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:19368af7046fcdae4b0435fdc868a204e5039289&amp;dn=DECODING+THE+PAST%3A+SECRETS+OF+THE+KORAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"DownUpx2","files":1,"time":1397671936,"description":"The Koran is one of the most important works ever written. For almost one billion people worldwide, it is the Holy Scripture, the word of God and his prophet. For others, it is a historical artifact that has left an indelible imprint on the world. DECODING THE PAST: SECRETS OF THE KORAN probes the heart of the work that many outside Islam find mysterious. This feature-length program examines the history of the verses and their implications for modern times, as wel as the striking similarities and differences between the Koran and the Bible. Trace the influence of the Koran from the Golden Age of Islam to the modern rise of jihadism, and hear from top Islamic scholars and holy men as they share their insights into the work that lies at the foundation of one of the world's great religions. THE HISTORY CHANNEL provides the perfect guide to understanding the fundamental work that has shaped the Muslim faith for over 1,400 years, and will long continue to influence modern history. DVD Features: &quot;Muhammad&quot; Episode of the Award-Winning A&amp;E Series BIOGRAPHY; Interactive Menus; Scene Selection","torrent":{"xt":"urn:btih:19368af7046fcdae4b0435fdc868a204e5039289","amp;dn":"DECODING+THE+PAST%3A+SECRETS+OF+THE+KORAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19368af7046fcdae4b0435fdc868a204e5039289","infoHashBuffer":{"type":"Buffer","data":[25,54,138,247,4,111,205,174,75,4,53,253,200,104,162,4,229,3,146,137]},"announce":[],"urlList":[]}}