{"title":"Why Race Matters (2005) by Michael Levin","uid":13128348,"size":2085538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a8c44e7a7b8a332736b830eb07591b96758bc62&amp;dn=Why+Race+Matters+%282005%29+by+Michael+Levin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1451813906,"description":"Why Race Matters - Race Differences and What They Mean [First New Century Books Edition] (1997; 2005) by Michael Levin.epub\r\n\r\nSUMMARY:\r\n\r\nOpposing the denial of race differences and the claim that they do not matter anyway, Michael Levin explains why these differences do matter. He summarizes what has been written about the differences in intelligence and temperament, and, more important, explores their larger significance. Finding significant genetic difference between races, Levin unflinchingly considers the broad social and philosophical implications of these variations. No one making an effort to think clearly about race can ignore Why Race Matters.\r\n\r\nMichael Levin’s 1997 masterpiece quickly became a classic, and just as quickly went out of print. Used copies of the hardcover edition sold for up to $500.00! New Century Foundation secured the publishing rights, and now offers this affordable electronic edition. It includes every word of the original, plus a new foreword by Jared Taylor, editor of American Renaissance.\r\n\r\nREVIEWS:\r\n\r\n&quot;Philosopher Michael Levin has delivered one of the most authoritative and incisive treatises on the importance of race ever written.&quot; --J. Philippe Rushton, University of Western Ontario\r\n\r\n&quot;Why Race Matters does exactly what the title promises—it removes all illusions about the insignificance of race.&quot; --Jared Taylor, editor, American Renaissance\r\n\r\n&quot;Levin’s mastery of the subject is evinced in his book’s amazingly broad and detailed scope and analytical depth.&quot; --Arthur R. Jensen, U.C. Berkeley\r\n\r\nAUTHOR:\r\n\r\nMichael Levin was born in Brooklyn, NY, in 1943. He attended Stuyvesant High School, Michigan State University, and Columbia University, where he received his Ph.D. in Philosophy in 1969. He teaches at the College of the City of New York (CCNY) and the Graduate Center of the City University of New York. His position at CCNY was threatened in 1991 when attempts were made to revoke his tenure because of his public statements related to race differences. These efforts were turned back by a Federal court decision. Prof. Levin has written four books, including Feminism and Freedom in 1987, and is currently at work on a book about free will. He has published widely in professional journals, magazines and newspapers. He is the father of two grown sons, and currently lives with his wife in New York City. He has run in five New York City marathons, most recently in 2004. While Prof. Levin's professional interests focus on epistemology and metaphysics, he thinks philosophy can also help clarify more down-to-earth issues. His interest in group differences was sparked by both the emergence of feminism, which denied obvious facts about the sexes in the name of patently unfair demands on men, and by the denial of the very existence of &quot;intelligence&quot; in the name of equality.\r\n\r\nDETAILS:\r\n\r\nPaperback: 415 pages\r\nPublisher: New Century Books (November 15, 2005)\r\nISBN-10: 0965638359\r\nISBN-13: 978-0965638357","torrent":{"xt":"urn:btih:1a8c44e7a7b8a332736b830eb07591b96758bc62","amp;dn":"Why+Race+Matters+%282005%29+by+Michael+Levin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a8c44e7a7b8a332736b830eb07591b96758bc62","infoHashBuffer":{"type":"Buffer","data":[26,140,68,231,167,184,163,50,115,107,131,14,176,117,145,185,103,88,188,98]},"announce":[],"urlList":[]}}