{"title":"Star Wars: The Blackened Mantle (Prequel Edit / Re-write 1080p)","uid":11890065,"size":2524478287,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:1be8cf9d0122be36585f8f907fd1bedbdf173b89&amp;dn=Star+Wars%3A+The+Blackened+Mantle+%28Prequel+Edit+%2F+Re-write+1080p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DLunar","files":1,"time":1430965683,"description":"The Star Wars prequel trilogy (Episodes I-III). Re-edited in 1080p, interwoven, and entirely rewritten using English subtitles over Japanese audio. A story you haven't seen.\n\n&quot;Star Wars: The Blackened Mantle&quot; chronicles the rise of a young Jedi named Anakin Skywalker. Haunted by vivid and prophetic nightmares since he was a slave on Tatooine, Anakin is trained to find peace through the Force by his friend and mentor, Jedi Master Obi-Wan Kenobi - until an act of brutal violence shatters Anakin's fragile grip on his own perilous gift.\n\nThis three-year project was inspired by a challenge unwittingly issued by Peter Sciretta of /Film: was Topher Grace's 85-minute recut trilogy genuinely the &quot;best possible edit of the Star Wars prequels given the footage released and available?&quot; To test that claim, the creators of this film turned away from the original English footage - and the original script - and pursued an option based on new research showing how our minds integrate written subtitles with spoken language. This was the result.\n\nNOTE: Unlike many other fan-edits of the prequels, &quot;The Blackened Mantle&quot; is not simply three separate films glued back-to-back with the fat cut out. It has proper dramatic pacing, new character arcs, reworked image quality, and a heavily modified plot constructed from a brand new, non-chronological script. It is not necessarily compatible with any Star Wars canon other than the original film trilogy (such as the fantastic &quot;Clone Wars&quot; animated series). Apologies go out to fluent Japanese speakers, who will likely not be able to watch the film without muting the audio.\n\nThis is a fan-made, not-for-profit edit of the Star Wars prequels. The creators have no affiliation with Twentieth Century Fox, Lucasfilm Ltd., or Walt Disney Studios","torrent":{"xt":"urn:btih:1be8cf9d0122be36585f8f907fd1bedbdf173b89","amp;dn":"Star+Wars%3A+The+Blackened+Mantle+%28Prequel+Edit+%2F+Re-write+1080p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1be8cf9d0122be36585f8f907fd1bedbdf173b89","infoHashBuffer":{"type":"Buffer","data":[27,232,207,157,1,34,190,54,88,95,143,144,127,209,190,219,223,23,59,137]},"announce":[],"urlList":[]}}