{"title":"Expert PHP and MySQL [NepsterJay]","uid":7523218,"size":13637140,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ca9bde26231660db75bab5fce75ec4c0753ce88&amp;dn=Expert+PHP+and+MySQL+%5BNepsterJay%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"NepsterJay","files":1,"time":1344696055,"description":"Best practices and expert techniques for even the most demanding MySQL-driven PHP applications\n\nPHP is the world's most popular, general-purpose, open-source scripting language and MySQL is the world's most popular open-source database. This expert-level book begins with a brief overview of the two technologies and quickly moves on to coverage of advanced programming techniques, as well as the exciting new features of the PHP 5.3 release.\n\nWritten by three of PHP and MySQL experts and veteran authors, this resource focuses on best practices and expert techniques that can be applied to the most difficult MySQL-driven PHP applications. The authors share design patterns and tools that they themselves have tested in order to save you valuable time usually spent on figuring things out via trial and error.\n\n* Reveals best practices and advanced techniques for handling challenges you may face with MySQL-driven PHP apps\n* Reviews practical data reporting techniques for separating business logic from presentation\n* Explains how to obtain improved performance and flexibility through caching, multi-tasking, PHP extensions, and MySQL user defined functions\n* Discusses security, optimization, and debugging\n* Shares author-tested design patterns and tools to save you time and effort\n\nPacked with helpful examples and indispensable advice, this book shares tips and tricks that you can immediately apply to your projects.\n\nAbout the Author\nAndrew Curioso is a senior software engineer at MyVBO (Virtual Business Office) creating an innovative and scalable infrastructure for Rich Internet Applications using PHP and MySQL.\n\nRonald Bradford is a technology strategist and advisor specializing in MySQL, Drizzle and related web technologies. With a primary focus on architecture, design, performance analysis and scalability of web applications, his consulting portfolio ranges from Internet startups to Fortune 500 companies.\n\nPatrick Galbraith is a principal software engineer at Lycos, adding new PHP and MySQL offerings for Tripod Users, switching remaining apps using Oracle to MySQL as well as other interesting projects.\n\nProduct Details\nPaperback: 626 pages\nPublisher: Wrox; 1 edition (March 29, 2010)\nLanguage: English\nISBN-10: 0470563125\nISBN-13: 978-0470563120\n","torrent":{"xt":"urn:btih:1ca9bde26231660db75bab5fce75ec4c0753ce88","amp;dn":"Expert+PHP+and+MySQL+%5BNepsterJay%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ca9bde26231660db75bab5fce75ec4c0753ce88","infoHashBuffer":{"type":"Buffer","data":[28,169,189,226,98,49,102,13,183,91,171,95,206,117,236,76,7,83,206,136]},"announce":[],"urlList":[]}}