{"title":"Nanomaterials - A Guide to Fabrication and Applications","uid":15398030,"size":17607084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e124b970a4a6cbe9bcbd44b94ebf252d5db65a7&amp;dn=Nanomaterials+-+A+Guide+to+Fabrication+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469417507,"description":"Nanomaterials - A Guide to Fabrication and Applications - S. Krishnamoorthy, K. Iniewski (CRC, 2016).pdf\r\n\r\nNanomaterials are being incorporated into products all around us, having an incredible impact on durability, strength, functionality, and other material properties. There are a vast number of nanomaterials presently available, and new formulations and chemistries are being announced daily.\r\n\r\nNanomaterials: A Guide to Fabrication and Applications provides product developers, researchers, and materials scientists with a handy resource for understanding the range of options and materials currently available. Covering a variety of nanomaterials and their applications, this practical reference:\r\n\r\nDiscusses the scale of nanomaterials and nanomachines, focusing on integrated circuits (ICs) and microelectromechanical systems (MEMS)\r\nOffers insight into different nanomaterials’ interactions with chemical reactions, biological processes, and the environment\r\nExamines the mechanical properties of nanomaterials and potential treatments to enhance the nanomaterials’ performance\r\nDetails recent accomplishments in the use of nanomaterials to create new forms of electronic devices\r\nExplores the optical properties of certain nanomaterials and the nanomaterials’ use in optimizing lasers and optical absorbers\r\nDescribes an energy storage application as well as how nanomaterials from waste products may be used to improve capacitors\r\nFeaturing contributions from experts around the globe, Nanomaterials: A Guide to Fabrication and Applications serves as a springboard for the discovery of new applications of nanomaterials","torrent":{"xt":"urn:btih:1e124b970a4a6cbe9bcbd44b94ebf252d5db65a7","amp;dn":"Nanomaterials+-+A+Guide+to+Fabrication+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e124b970a4a6cbe9bcbd44b94ebf252d5db65a7","infoHashBuffer":{"type":"Buffer","data":[30,18,75,151,10,74,108,190,155,203,212,75,148,235,242,82,213,219,101,167]},"announce":[],"urlList":[]}}