{"title":"Potato Biology and Biotechnology: Advances and Perspectives","uid":8308900,"size":3004680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e53509931edab3fb342fa8a4a4596b6aca4a066&amp;dn=Potato+Biology+and+Biotechnology%3A+Advances+and+Perspectives&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1364428380,"description":"Book Description\nPublication Date: August 14, 2007 | ISBN-10: 0444510184 | ISBN-13: 978-0444510181 | Edition: 1\nIn the past 15-20 years major discoveries have been concluded on potato biology and biotechnology. Important new tools have been developed in the area of molecular genetics, and our understanding of potato physiology has been revolutionized due to amenability of the potato to genetic transformation. This technology has impacted our understanding of the molecular basis of plant-pathogen interaction and has also opened new opportunities for the use of the potato in a variety of non-food biotechnological purposes.\n\nThis book covers the potato world market as it expands further into the new millennium. Authors stress the overriding need for stable yields to eliminate human hunger and poverty, while considering solutions to enhance global production and distribution. It comprehensively describes genetics and genetic resources, plant growth and development, response to the environment, tuber quality, pests and diseases, biotechnology and crop management. Potato Biology is the most valuable reference available for all professionals involved in the potato industry, plant biologists and agronomists. \n\nÂ· Offers an understanding of the social, economic and market factors that influence production and distribution\nÂ· Discusses developments and useful traits in transgenic biology and genetic engineering \nÂ· The first reference entirely devoted to understanding new advances in potato biology and biotechnology\n","torrent":{"xt":"urn:btih:1e53509931edab3fb342fa8a4a4596b6aca4a066","amp;dn":"Potato+Biology+and+Biotechnology%3A+Advances+and+Perspectives","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e53509931edab3fb342fa8a4a4596b6aca4a066","infoHashBuffer":{"type":"Buffer","data":[30,83,80,153,49,237,171,63,179,66,250,138,74,69,150,182,172,164,160,102]},"announce":[],"urlList":[]}}