{"title":"Thermal.Properties.of.Green.Polymers.and.Biocomposites.by.Tatsuk","uid":7089065,"size":4464069,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e71853b5d1dd5a9bbfa0c2fbf54b55f4035f7c0&amp;dn=Thermal.Properties.of.Green.Polymers.and.Biocomposites.by.Tatsuk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"betadoctor","files":-1,"time":1331300805,"description":"1st edition (October 29, 2004) | ISBN: 1402019076 | Pages: 331 | PDF | 4.78 MB\n\nEnvironmentally compatible polymers (green polymers) are the key to sustainable developments for our rich and convenient life. In order to develop green polymers, it is essential to understand that nature constructs a variety of materials that can be used. Plant materials such as cellulose, hemicellulose and lignin are the largest organic resources.\n\nThermal Properties of Green Polymers and Biocomposites is unique in that it introduces thermal analysis applicable to green polymers and provides fundamental thermal properties of cellulose, polysaccharides and lignin. The book includes over 370 figures concerning thermal properties of green polymers with detailed experimental conditions. It also introduces newly patented environmentally compatible green polymers. Thermal properties provided include: thermogravimetry (TG), differential thermal analysis (DTA), differential scanning calorimetry (DSC), thermomechanometry (TMA) and dynamic mechanical analysis (DMA). This book covers two domains:\n\n* Fundamentals of thermal properties of cellulose, polysaccharides and lignin (Chapters 3 to 5);\n* Developments of new biocompatible polymers derived from plant materials (Chapters 6 to 8).\n\nThis book is aimed at advanced users and specialists who are interested in green polymers and who utilize thermal analyses for the above polymers, especially in research laboratories, both academic and industrial.","torrent":{"xt":"urn:btih:1e71853b5d1dd5a9bbfa0c2fbf54b55f4035f7c0","amp;dn":"Thermal.Properties.of.Green.Polymers.and.Biocomposites.by.Tatsuk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e71853b5d1dd5a9bbfa0c2fbf54b55f4035f7c0","infoHashBuffer":{"type":"Buffer","data":[30,113,133,59,93,29,213,169,187,250,12,47,191,84,181,95,64,53,247,192]},"announce":[],"urlList":[]}}