{"title":"Daniel Defoe - Robinson Crusoe","uid":4800397,"size":589066283,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1f3500d23c125b1cd86d0cd8c876e13fdd0c9ff1&amp;dn=Daniel+Defoe+-+Robinson+Crusoe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"g-roid","files":-1,"time":1238018193,"description":"DANIEL DEFOE\nRobinson Crusoe\n\n&quot;In all the time of my solitary life, I never felt so earnest, so strong a desire after the society of my fellow-creatures, or so deep a regret at want of it&quot; -- Robinson Crusoe\n \nWidely regarded as the first English novel, Daniel Defoe's &quot;Robinson Crusoe&quot; is one of the most popular and influential adventure stories of all time. This classic tale of shipwreck and survival on an uninhabited island has inspired countless imitations. In his own words, Robinson Crusoe tells of the terrible storm that drowned all his shipmates and left him marooned on a deserted island. Forced to overcome d~pair, doubt, and self-pity, he struggles to create a life for himself in the wilderness. His vivid adventures include a fierce battle with cannibals and his rescue of Friday, the man who becomes his trusted companion. Full of enchanting detail and daring heroics, Robinson Crusoe is a celebration of courage, patience, ingenuity, and hard work.\n \nDaniel Defoe (1660-1731) was an English novelist, pamphleteer, and journalist, whose most famous work is Robinson Crusoe. Defoe was one of the first to write stories about believable characters in realistic situations using simple prose. Among his other well-known works are &quot;Moll Flanders&quot;, &quot;A Journal of the Plague Year&quot;, and &quot;Captain Jack&quot;.\n \nSimon Vance has recorded over 400 audiobooks, including &quot;Market Forces&quot; by Richard K. Morgan, for which he earned a coveted Audie Award; &quot;A Tale of Two Cities&quot; by Charles Dickens; and &quot;Frankenstein, or The Modem Prometheus&quot; by Mary Shelley. He has also received sixteen Earphones Awards from AudioFile magazine.\n\nApproximately 10.5 hours from 8 Audio CDs at 128 kbps in MP3 format. Also includes the eBook in PDF format. \n","torrent":{"xt":"urn:btih:1f3500d23c125b1cd86d0cd8c876e13fdd0c9ff1","amp;dn":"Daniel+Defoe+-+Robinson+Crusoe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f3500d23c125b1cd86d0cd8c876e13fdd0c9ff1","infoHashBuffer":{"type":"Buffer","data":[31,53,0,210,60,18,91,28,216,109,12,216,200,118,225,63,221,12,159,241]},"announce":[],"urlList":[]}}