{"title":"Serif DrawPlus X8 14.0.1.21 -CORE","uid":12703918,"size":545817547,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1f8a6407262ca29ec065977387774a3e0e2ab048&amp;dn=Serif+DrawPlus+X8+14.0.1.21+-CORE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jovo_bih","files":1,"time":1446808711,"description":"*******************************************\r\nSerif DrawPlus X8 14.0.1.21 + Keymaker-CORE\r\n*******************************************\r\n\r\nRelease date: 29/10/2015\r\n\r\nChange the way you draw digital artwork forever.\r\nEnjoy a whole host of new features to help you create incredible artwork that everyone will love in the new DrawPlus X8.\r\n\r\nDefining the lines\r\n------------------\r\n\r\nEnjoy a new way of drawing lines onto your digital canvas using B-Splines, one of our most requested new features. It’s quicker, easier and more natural than ever before. Simply click each point and manipulate the curves to create your perfect drawings.\r\n\r\nDrawPlus X8 provides greater line accuracy too. A new hairline option gives you all the precision you need when working with intricate designs and lines. Hairlines allow you to output the thinnest possible line width, perfect for special printing cases, such as producing artwork for cutters.\r\n\r\nMaking shapes from your lines is so easy too, as they simply lock together - as if by magic! You’ll have complete control, and be able to create the most unique and fantastic designs using these intuitive line tools.\r\n\r\nShaping your creativity\r\n-----------------------\r\n\r\nQuickshapes are so easy to create, and can be used for a variety of tasks, such as stand-out logos and designs for you or your business. Duplicate, rotate and space any shape or design with just one click using the new Replicate Tool, and make drawings with multiple images so quickly and easily, which is perfect for posters, flyers, greeting cards and so much more.\r\n\r\nResizing multiple objects is now even more intuitive with the Smart Sizing feature that allows you to manipulate the size of the objects, without losing their original position. This is a fantastic tool to use when making charts, flowcharts and diagrams, so objects can be resized without disrupting the overall layout, creating a lot less work for you in the long run.\r\n\r\nWhen designing logos, you can take advantage of the improved contours feature to create a stunning offset effect, making your company’s logo stand out above the competition.\r\n\r\nDraw it, fill it\r\n----------------\r\n\r\nFilling in shapes, and even incomplete shapes with any colour has never been easier with the new Flood Fill tool. With just a few simple clicks you can accurately fill an object or collection of lines without any complicated processes. It’s perfect for filling in auto-traced pictures, such as black and white sketches that would usually take a lot of time and effort to fill in accurately.\r\n\r\nStunning Pattern Fills\r\n----------------------\r\n\r\nEver dreamt of filling shapes with your own custom patterns made from any design or drawing? Well now you can with DrawPlus X8’s intuitive Vector Pattern Fills! Easily add preset fills, hatching or your own custom pattern fills. Perfect for sketches or technical drawings such as maps.\r\n\r\nEasily import and export\r\n------------------------\r\n\r\nDrawPlus X8 gives you the most professional output, now including CMYK effects and new native EPS export. There are so many options to choose from too; with colour space control, transparency details and options to output text as curves or to embed fonts. And don’t worry, PDF import is only a few clicks away, making sure all of your important documents can be opened in one place\r\n\r\nPaint like a Pro\r\n----------------\r\n\r\nPainting and sketching has been enhanced further in DrawPlus X8 with a new set of brushes available at your creative fingertips. Enjoy new charcoal, pen and sponge brush effects, which are great for blurring, smudging, or sharpening, healing or erasing elements of your design to produce the perfect digital artwork.\r\n\r\nSlideshows that make an impact\r\n------------------------------\r\n\r\nCreating a stand-out presentation or slideshow that’ll impress has never been easier. Make an impact using the new Rostrum Slide Show feature that allows you to add simple but stunning effects, such as pan and zoom to make smooth transitions between each section and then export as a movie or flash file to share with others.\r\n\r\nCreate the perfect picture\r\n--------------------------\r\n\r\nVisually stunning photo art is so easy to create in DrawPlus X8 with photo effects like no other drawing software. The powerful PhotoLab has more creative possibilities than ever before, including the new Clone tool plus Vibrancy, Split Tone and Clarity filters allowing you to further enhance your photos and create breathtaking imagery.\r\n\r\nAdding the finishing touches to your artwork is now easier as you have finer control over settings when converting your drawings to a picture and apply a full range of image effects to your designs to take your digital art even further.\r\n\r\nHomepage http://www.serif.com/drawplus/","torrent":{"xt":"urn:btih:1f8a6407262ca29ec065977387774a3e0e2ab048","amp;dn":"Serif+DrawPlus+X8+14.0.1.21+-CORE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f8a6407262ca29ec065977387774a3e0e2ab048","infoHashBuffer":{"type":"Buffer","data":[31,138,100,7,38,44,162,158,192,101,151,115,135,119,74,62,14,42,176,72]},"announce":[],"urlList":[]}}