{"title":"Valuing Life: Humanizing the Regulatory State (2014) pdf","uid":11405470,"size":836656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f921f91135309860587d49d33b9f69f7ac43ae0&amp;dn=Valuing+Life%3A+Humanizing+the+Regulatory+State+%282014%29+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1415472686,"description":"In Valuing Life, Cass R. Sunstein draws on his firsthand experience as the Administrator of OIRA from 2009 to 2012, to argue that we can humanize regulation - and save lives in the process. As OIRA Administrator, Sunstein oversaw regulation in a broad variety of areas, including national security, immigration, energy, environmental protection, and education. This background allows him to describe OIRA and how it works - and how it can work better - from an on-the-ground perspective. Using real-world examples, many of them drawn from today's headlines, Sunstein makes a compelling case for improving cost-benefit analysis, a longtime cornerstone of regulatory decision-making in this country, and for taking account of variables that are hard to quantify, such as dignity and privacy. He also shows how regulatory decisions about health, safety, and life itself can benefit from taking into account behavioral and psychological studies, including new findings about what scares us, and what does not. By better accounting for people's fallibility, Sunstein argues, we can create regulation that is simultaneously more human and more likely to achieve its goals. In this highly readable synthesis of insights from law, policy, economics, and psychology, Sunstein breaks down the intricacies of the regulatory system and offers a new way of thinking about regulation that incorporates human dignity","torrent":{"xt":"urn:btih:1f921f91135309860587d49d33b9f69f7ac43ae0","amp;dn":"Valuing+Life%3A+Humanizing+the+Regulatory+State+%282014%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f921f91135309860587d49d33b9f69f7ac43ae0","infoHashBuffer":{"type":"Buffer","data":[31,146,31,145,19,83,9,134,5,135,212,157,51,185,246,159,122,196,58,224]},"announce":[],"urlList":[]}}