{"title":"To Kill a Mockingbird - Harper Lee-viny","uid":6408104,"size":1073290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:202d3501e3ddb0738bd85acfbb68dd4bf289eda0&amp;dn=To+Kill+a+Mockingbird+-+Harper+Lee-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1305881834,"description":"To Kill a Mockingbird - Harper Lee-viny\n\n&quot;Shoot all the bluejays you want, if you can hit 'em, but remember it's a sin to kill a mockingbird.&quot;\n\nA lawyer's advice to his children as he defends the real mockingbird of Harper Lee's classic novel; a black man charged with the rape of a white girl. Through the young eyes of Scout and Jem Finch, Harper Lee explores with rich humor and unswerving honesty the irrationality of adult attitudes toward race and class in the Deep South of the 1930s. The conscience of a town steeped in prejudice, violence, and hypocrisy is pricked by the stamina and quiet heroism of one man's struggle for justice; but the weight of history will only tolerate so much.\n\nOne of the best-loved classics of all time, To Kill a Mockingbird has earned many distinctions since its original publication in 1960. It has won the Pulitzer Prize, been translated into more than forty languages, sold more than forty million copies worldwide, and been made into an enormously popular movie. It was also named the best novel of the twentieth century by librarians across the country (Library Journal). HarperCollins is proud to celebrate the fiftieth anniversary of the book's publication with this special hardcover edition","torrent":{"xt":"urn:btih:202d3501e3ddb0738bd85acfbb68dd4bf289eda0","amp;dn":"To+Kill+a+Mockingbird+-+Harper+Lee-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"202d3501e3ddb0738bd85acfbb68dd4bf289eda0","infoHashBuffer":{"type":"Buffer","data":[32,45,53,1,227,221,176,115,139,216,90,207,187,104,221,75,242,137,237,160]},"announce":[],"urlList":[]}}