{"title":"The Diodes - Tired Of... (Greatest Hits) 1998 [FLAC] - Kitlope","uid":6929546,"size":557264701,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:20ce0b1baf4aefeb02be625d19fbeb11315b2816&amp;dn=The+Diodes+-+Tired+Of...+%28Greatest+Hits%29+1998+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":29,"time":1325612831,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 20CE0B1BAF4AEFEB02BE625D19FBEB11315B2816\nFile Size: 531.44 MB\nYear: 1998\nLabels: Crash &amp; Burn, CBS Records, Bongo Beat\nCatalog #: EK 80320\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nThe Diodes are a Canadian punk/new wave band formed in 1976. They released five albums: Diodes (1977), Released (1979), Action-Reaction (1980), Survivors (1982), and Time/Damage Live 1978 (2010). One of the first Toronto bands playing that style of music, The Diodes helped foster the scene in the city.\n\nAlong with manager Ralph Alfonso, The Diodes opened the first Canadian punk nightclub in 1977, called Crash 'n' Burn, where many of the city's punk bands at that time played. The first band to play the club was The Nerves, on a bill with The Diodes. The club was closed at the end of the summer of 1977 due to complaints by the Liberal Party of Ontario (the principal tenants of the building). The club was the subject of a movie by experimental filmmaker Ross McLaren Crash 'n' Burn. Footage of the club also exists in the CBC Television archives because it was the subject of a TV special in 1977. The band put out their first record at this time, a single featuring Bruce Eves and Amerigo Maras of the Centre For Experimental Art and Communication. Mickey Skin of all-girl punk band, The Curse, spews profanity on one side; the Diodes provide musical backing on the other. It was released on the Crash and Burn label. One side was called &quot;War,&quot; the other &quot;Raw,&quot; and was one of the first punk records to come out of Toronto. This single was actually an issue of the CEAC Newsletter (published by the Centre For Experimental Art and Communication, the owners of the building that housed the Crash 'n' Burn club).\n\nIn the January 9, 1978 issue of Maclean's magazine, the Diodes were featured on the cover and included in the article, &quot;The Class of '78: Introducing the New Elite.&quot; They were touted as the Canadians &quot;we'll soon be talking about.&quot; Others included in this elite group included Wayne Gretzky and Conrad Black.[1]\n\nThe band brought up punk acts from the east coast of the U.S. to share the bill, such as The Dead Boys, and joined Toronto punk bands The Viletones, Teenage Head, and The Curse to perform in the United States at CBGB. The Diodes toured the U.S. east coast during the blizzard of 1978; performing in New York City, Boston, and other cities. On January 20, 1978 they opened for the Ramones and Runaways at the Aragon Ballroom in Chicago to an encore. In the early 1980s, the band performed concerts in Los Angeles and San Francisco. They also toured across Canada with U2 and Split Enz.\n\nIn 1981, John Catto and Paul Robinson moved to London, England to launch a short-lived version of The Diodes with a new rhythm section consisting of bassist Steve Robinson (ex-Barracudas) and drummer Richard Citroen (ex-Loved Ones). An album of new material was recorded, but remains unreleased. This version of The Diodes toured Ontario in 1982, to promote the group's 4th album, Survivors, a compilation of unreleased outtakes, demos, and live recordings (from the first two albums and live with John Hamilton on drums, plus demo recordings with Mike Lengyell on drums).\n\nUpon returning to England, the group metamorphosed into High Noon (consisting of John Catto, Paul Robinson, Steve Robinson, David Buckley (ex-Barracudas, backing vocals), and drummer Rick Zsigmond) in 1983. High Noon lasted until 1985 and were regulars playing around the London scene including headlining The Embassy club and the Marquee Club on Wardour Street. The band also recorded sessions which remain unreleased. High Noon peaked playing an Anti Heroin charity gig at The Moonlight Club in West Hampstead supported by The Stone Roses which culminated in a Jam session including High Noon, The Stone Roses, and Pete Townshend playing the songs, &quot;Substitute&quot; and &quot;The Kids are Alright&quot;. The group gradually disbanded with each member going his own way, and singer Paul Robinson and guitarist John Catto remaining in London, England.\n\n&quot;Tired Of Waking Up Tired&quot; was listed at #23 in the book, The Top 100 Canadian Singles, by Bob Mersereau, published by Goose Lane Editions, Oct. 2010.[2]\n\nOn July 2, 2011, The Diodes were voted &quot;Best Toronto Band. Ever&quot; in a contest run by The Toronto Star. Readers voted for them over the course of a month, beating out such peers as Rush, The Tragically Hip, Martha &amp; The Muffins, and others\n\nIn 1998, Sony Music released Tired of Waking Up Tired: The Best of The Diodes on CD , and in 1999, the band reunited in 1999 to perform one song on The Mike Bullard Show to promote that CD. On May 24, 2007, The Diodes (Robinson, Mackay, Catto) played the Cavern Club in Liverpool as part of the International Pop Overthrow Festival. On May 25, 2007, they did an afternoon concert at Lennon's Bar in Liverpool, also as part of the festival. On June 9, 2007, the original lineup from the first album (Robinson, Mackay, Catto, Hamilton) reunited for 30th anniversary concerts for the NXNE festival. They performed a free afternoon concert at Dundas Square and a midnight show at Sneaky Dees. A live vinyl album of a 1978 concert, Time Damage was released on Rave Up Records (Italy) in February, 2010. Action-Reaction is now on iTunes on Bongo Beat Records (including bonus tracks from the Survivors album) and the physical cd will be out Jan, 2012.\n\nThe original 1977 line-up (Robinson, Catto, Mackay, Hamilton) re-united again in 2010 for touring and recording. They performed at The Horseshoe (Toronto), Call The Office (London), Starlight (Waterloo), This Ain't Hollywood (Hamilton), Road to Ruins Festival (Rome, Italy), Pop Corn Club (Venice, Italy), and The Sound Of Music Festival (Burlington, Canada; with The New York Dolls). The 1977 line-up toured Canada again in November, 2011, but added original 1976 drummer Bent Rasmussen (also of Johnny &amp; The G-Rays) behind the kit while John Hamilton could finally play his album keyboard parts live. The Diodes also presented awards at the 2011 Hamilton Music Awards on Nov 19 and also Nov 20.\n\nA documentary about the band Circa 1977:The Diodes was directed by Aldo Erdic and premiered at NXNE 2010.\n\n\n\n\n\n\nTired Of Waking Up Tired  1998\n\n\nTracks:\n\n\n\n1. Noise \n2. Red Rubber Ball \n3. Child Star \n4. Tennis(Again) \n5. Blonde Fever \n6. Plastic Girls\n7. Death In The Suburbs \n8. Behind Those Eyes\n9. Midnight Movie Star \n10. We're Ripped \n11. China Doll \n12. Shapes Of Things To Come \n13. Time Damage \n14. Headache \n15. Burn Down Your Daddy's House\n16. Teenage Nation \n17. Photographs From Mars \n18. Madhouse \n19. Mercenary Flight \n20. Tired Of Waking Up Tired \n21. Jenny's In A Sleep World \n22. Weekend \n23. No Right To Make Me Bleed \n24. Terminal Rock \n25. Dead On Arrival \n\n\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:20ce0b1baf4aefeb02be625d19fbeb11315b2816","amp;dn":"The+Diodes+-+Tired+Of...+%28Greatest+Hits%29+1998+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ce0b1baf4aefeb02be625d19fbeb11315b2816","infoHashBuffer":{"type":"Buffer","data":[32,206,11,27,175,74,239,235,2,190,98,93,25,251,235,17,49,91,40,22]},"announce":[],"urlList":[]}}