{"title":"Skepticism - Complete Discography","uid":7328921,"size":692342195,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20d8dc8d0706148e171130f89853fb849c3f895a&amp;dn=Skepticism+-+Complete+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Ytklyx15","files":30,"time":1338847083,"description":"Skepticism is a funeral doom metal band from Finland. Formed in 1991, they are regarded as one of the pioneers of the genre.\n\nStarting out with a death metal sound on their first 7&quot;, Skepticism soon began to evolve into a more distinctive style, a combination of slow doom metal and death metal with prolific use of keyboards, especially using an organ sound. The keyboards intend to create a depressive sound, rather than the gothic sound that many metal bands using keyboards tend to focus on. This style was first heard on the Aeothe Kaear demo (1994), which was still up-tempo compared to the material that was to follow. The debut full-length Stormcrowfleet took that style a step further, consisting of six long and slow tracks with an average length of nearly ten minutes each.\n\nAfter this, the band released its first 'pair', an EP and album which are thematically connected: Ethere (1997) and Lead and Aether (1998). In 1999, Aes was released, a one-track EP lasting almost 28 minutes, and another departure into different stylistic territory from the band. A variety of musical themes are explored before the song turns back upon itself and returns to the opening theme.\n\nThe band's latest releases were contained in the second 'pair', The Process of Farmakon (2002) and Farmakon (2003). These releases involve another slight departure from earlier releases, by introducing more elements of dissonance and experimentation. Their 2008 release is called Alloy.\n\nAlbums:\nStormcrowfleet\nLead and Aether\nFarmakon\nAlloy\n\nEPs:\nEthere\nAes\nThe Process of Farmakon","torrent":{"xt":"urn:btih:20d8dc8d0706148e171130f89853fb849c3f895a","amp;dn":"Skepticism+-+Complete+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20d8dc8d0706148e171130f89853fb849c3f895a","infoHashBuffer":{"type":"Buffer","data":[32,216,220,141,7,6,20,142,23,17,48,248,152,83,251,132,156,63,137,90]},"announce":[],"urlList":[]}}