{"title":"Kay Starr - 3 Albums","uid":4181155,"size":221565285,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20f285a802cafa54da9e59ee026e960ac388bba3&amp;dn=Kay+Starr+-+3+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mingy2","files":39,"time":1210416341,"description":"\nShe was born Katherine Laverne Starks on a reservation in Dougherty, Oklahoma. Her father, Harry, was a full-blooded Iroquois Indian; her mother, Annie, was of mixed Irish and American Indian heritage. When her father got a job installing water sprinkler systems for the Automatical Sprinkler Company, the family moved to Dallas, Texas. There, her mother raised chickens, whom Kay used to serenade in the coop. Kay&amp;#039;s aunt Nora was impressed by her 7-year-old niece&amp;#039;s singing and arranged for her to sing on a Dallas radio station, WRR. First she took a talent competition by storm, finishing 3rd one week and placing first every week thereafter. Eventually she had her own 15-minute show. She sang pop and &quot;hillbilly&quot; songs with a piano accompaniment. By age 10 she was making $3 a night, which was quite a salary in the Depression days.\n\nWhen Kay&amp;#039;s father changed jobs, the family moved to Memphis, Tennessee, where she continued performing on the radio. She sang &quot;Western swing music,&quot; still mostly a mix of country and pop. During this time at Memphis radio station WMPS,misspellings in her fan mail inspired her and her parents to change her name to &quot;Kay Starr.&quot;\n\nAt 15, she was chosen to sing with the Joe Venuti orchestra. Venuti had a contract to play in the Peabody Hotel in Memphis which called for his band to feature a girl singer, which he did not have. Venuti&amp;#039;s road manager heard Kay Starr on the radio and suggested her to Venuti. She was still in junior high school and her parents insisted on a midnight curfew.\n\nAlthough she had brief stints in 1939 with Bob Crosby and Glenn Miller (who hired her in July of that year when his regular singer, Marion Hutton, was sick), she spent most of her next few years with Venuti, until he dissolved his band in 1942. It was, however, with Miller that she cut her first record: &quot;Baby Me&quot;/&quot;Love with a Capital You.&quot; It was not a great success, in part because the band played in a key more appropriate for Marion Hutton that, unfortunately, did not suit Kay&amp;#039;s vocal range.\n\nAfter finishing high school, she moved to Los Angeles and signed with Wingy Manone&amp;#039;s band; then from 1943 to 1945 she sang with Charlie Barnet&amp;#039;s band. She then retired for a year because she developed pneumonia and later developed nodes on her vocal cords, and lost her voice as a result of fatigue and overwork.\n\nIn 1946 she became a soloist, and in 1947 signed a solo contract with Capitol Records. Capitol had a number of other female singers signed up (such as Peggy Lee, Ella Mae Morse, Jo Stafford, and Margaret Whiting), so it was hard to find her a niche. In 1948 when the American Federation of Musicians was threatening a strike, Capitol wanted to have all its singers record a lot of songs for future release. Since she was junior to all these other artists, every song she wanted to sing got offered to all the others, leaving her a list of old songs from earlier in the century, which nobody else wanted to record.\n\nAround 1950 Starr made a trip back home to Dougherty and heard a fiddle recording of Pee Wee King&amp;#039;s song, &quot;Bonaparte&amp;#039;s Retreat&quot;. She liked it so much that she wanted to record it, and contacted Roy Acuff&amp;#039;s publishing house in Nashville, Tennessee, and spoke to Acuff directly. He was happy to let her record it, but it took a while for her to make clear that she was a singer, not a fiddler, and therefore needed to have some lyrics written. Eventually Acuff came up with a new lyric, and &quot;Bonaparte&amp;#039;s Retreat&quot; became her biggest hit up to that point, with close to a million sales.\n\nIn 1955, she signed with RCA Victor Records. However, at this time, traditional pop music was being superseded by rock and roll, and Kay had only one hit, which is sometimes considered her attempt to sing rock and roll and sometimes as a song making fun of it, &quot;The Rock And Roll Waltz&quot;. She stayed at RCA Victor until 1959, then returned to Capitol.\n\nMost of her songs have jazz influences, and, like Frankie Laine and Johnnie Ray, are sung in a style that sound decidedly close to the rock and roll songs that follow. These include her smash hits &quot;Wheel of Fortune&quot; (her biggest hit, number one for 10 weeks), &quot;Side by Side&quot;, &quot;The Man Upstairs&quot;, and &quot;Rock and Roll Waltz&quot;. One of her biggest hits was her cover version of &quot;The Man with the Bag&quot;, a Christmas song, which can be heard non-stop every holiday season in stores, restaurants, and on the radio. Her career declined in the late 1950s but she continued to work.\n\nIn 2006 a remix by Stuhr of Starr&amp;#039;s vocal of the classic &quot;I&amp;#039;ve Got My Love to Keep Me Warm&quot; was used in a commercial for Telus.\n\nAs of 2007 she resides in Bel Air, California; married six times, she has a daughter and a grandchild.\n\n\n\n\n\n\n\n\nKay Starr - Jazz Singer 1960\n\n\n\n\n\n\n01 - I Never Knew (I Could Love Anybody Like I&amp;#039;m Loving You)\n02 - My Man\n03 - Breezing Along With The Breeze\n04 - All By Myself\n05 - Hard Hearted Hannah\n06 - Me Too\n07 - Happy Days And Lonely Nights\n08 - I Only Wanted A Buddy, Not A Sweetheart\n09 - Hummin&amp;#039; To Myself\n10 - My Honey&amp;#039;s Lovin&amp;#039; Arms\n11 - Sunday\n12 - (I Would Do) Anything For You\n\nArranged And Conducted By Van Alexander\n\n\n\nKay Starr - I Cry By Night 1962\n\n\n\n01 - I&amp;#039;m Alone Because I Love You\n02 - I Cry By Night\n03 - Baby, Won&amp;#039;t You Please Come Home\n04 - More Than You Know\n05 - Lover Man (Oh, Where Can You Be?)\n06 - My Kinda Love\n07 - It Had To Be You\n08 - Whispering Grass\n09 - Nevertheless\n10 - What Do You See In Her?\n11 - P.S. I Love You\n12 - I&amp;#039;m Still In Love With You\n\n\nKay Starr - Losers, Weepers 1960\n\n\n01 - You Always Hurt The One You Love\n02 - I Should Care\n03 - I&amp;#039;m A Fool To Care\n04 - Don&amp;#039;t Take Your Love From Me\n05 - When I Lost You\n06 - Only Forever\n07 - Gonna Get A Guy\n08 - Please Don&amp;#039;t Talk About Me When I&amp;#039;m Gone\n09 - I Miss You So\n10 - A Faded Summer Love\n11 - When A Woman Loves A Man\n12 - Into Each Life Some Rain Must Fall","torrent":{"xt":"urn:btih:20f285a802cafa54da9e59ee026e960ac388bba3","amp;dn":"Kay+Starr+-+3+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f285a802cafa54da9e59ee026e960ac388bba3","infoHashBuffer":{"type":"Buffer","data":[32,242,133,168,2,202,250,84,218,158,89,238,2,110,150,10,195,136,187,163]},"announce":[],"urlList":[]}}