{"title":"Core Concepts in Supramolecular Chemistry and Nanochemistry","uid":15390106,"size":4182823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2127598150c922f5c1b27ff29e6121c3a70215fd&amp;dn=Core+Concepts+in+Supramolecular+Chemistry+and+Nanochemistry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469325644,"description":"Core Concepts in Supramolecular Chemistry and Nanochemistry - Jonathan W. Steed et al. (Wiley, 2007).pdf\r\n\r\nSupramolecular chemistry and nanochemistry are two strongly interrelated cutting edge frontiers in research in the chemical sciences. The results of recent work in the area are now an increasing part of modern degree courses and hugely important to researchers.\r\nCore Concepts in Supramolecular Chemistry and Nanochemistry clearly outlines the fundamentals that underlie supramolecular chemistry and nanochemistry and takes an umbrella view of the whole area. This concise textbook traces the fascinating modern practice of the chemistry of the non-covalent bond from its fundamental origins through to it expression in the emergence of nanochemistry.\r\n\r\nFusing synthetic materials and supramolecular chemistry with crystal engineering and the emerging principles of nanotechnology, the book is an ideal introduction to current chemical thought for researchers and a superb resource for students entering these exciting areas for the first time. The book builds from first principles rather than adopting a review style and includes key references to guide the reader through influential work. \r\n\r\nsupplementary website featuring powerpoint slides of the figures in the book\r\nfurther references in each chapter\r\nbuilds from first principles rather than adopting a review style\r\nincludes chapter on nanochemistry clear diagrams to highlight basic principles","torrent":{"xt":"urn:btih:2127598150c922f5c1b27ff29e6121c3a70215fd","amp;dn":"Core+Concepts+in+Supramolecular+Chemistry+and+Nanochemistry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2127598150c922f5c1b27ff29e6121c3a70215fd","infoHashBuffer":{"type":"Buffer","data":[33,39,89,129,80,201,34,245,193,178,127,242,158,97,33,195,167,2,21,253]},"announce":[],"urlList":[]}}