{"title":"Juicy Lucy Get A Whiff A This(rock)(mp3@320)[rogercc]","uid":6934417,"size":84089813,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:214564fe9c7127e3b2e46f41f7d0e32dcb59be54&amp;dn=Juicy+Lucy+Get+A+Whiff+A+This%28rock%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":9,"time":1325770429,"description":"JUICY LUCY GET A WHIFF A THIS\nLabel Repertoire\nOrig Year 1971\nFormat:Mp3@320cbr\n\nThe 1971 third album from the US blues-rockers (formed from the ashes of the great '60s garage band the Misunderstood) featured more raucous vocals, raw guitars and wailing horns on tracks like Harvest , Mr. Skin , Midnight Rider , Big Lil , Future Days and others.\n\nJuicy Lucy's third album in 18 months, and the third to draw as much attention for its artwork as its contents, would prove to be the band's last. Although a fourth Juicy Lucy album would appear in 1972, not a single founding member was left on board. Get a Whiff of This itself was very much the son of its predecessor, still locked firmly into a country groove (the twanging &quot;Mr. A. Jones,&quot; the fast-pickin' &quot;Jessica&quot;), but looking out toward more unexpected pastures. The funky &quot;Big Lil.&quot; and the blistering antiwar anthem &quot;Midnight Sun&quot; were both strong inclusions, while a take on the Allmans' &quot;Midnight Rider&quot; remains one of that particular anthem's most dynamic revisions. Despite at least half an album's worth of highlights, however, still there was nothing that really leaped out and grabbed the listener -- and nothing that could ever displace the band's debut from its sacred spot on the turntable, a fate that Glenn Campbell admitted he predicted when he conjured up that most distinctive title. It was his way of saying &quot;the whole thing stinks.\n\nTracklist:\n\n01 Mr. Skin 3:42\n02 Midnight Sun 3:42\n03 Midnight Rider 3:13\n04 Harvest 4:13\n05 Mr. A. Jones 3:06\n06 Sunday Morning 3:50\n07 Big Lil. 4:32\n08 Jessica 4:05\n09 Future Days 4:06\n\nPersonnel:\nGlenn Ross Campbell (vocals, guitar); Paul Williams (vocals, keyboards, percussion); Micky Moody (guitar); Chris Mercer (saxophone, piano, organ, keyboards); Rod Coombes (drums).","torrent":{"xt":"urn:btih:214564fe9c7127e3b2e46f41f7d0e32dcb59be54","amp;dn":"Juicy+Lucy+Get+A+Whiff+A+This%28rock%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214564fe9c7127e3b2e46f41f7d0e32dcb59be54","infoHashBuffer":{"type":"Buffer","data":[33,69,100,254,156,113,39,227,178,228,111,65,247,208,227,45,203,89,190,84]},"announce":[],"urlList":[]}}