{"title":"Audio Book, Kathy Reichs - Deja Dead","uid":3951531,"size":402756573,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:214d2810e7d1b4d0097b186dd5277595f7067f11&amp;dn=Audio+Book%2C+Kathy+Reichs+-+Deja+Dead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"door1952","files":22,"time":1198886876,"description":"Audio Cassette rip, 56Kbps, MP3.\n\nA superb new writer introduces her intrepid heroine to crime fiction. Dr. Tempe Brennan, a trowel-packing forensic anthropologist from North Carolina, works in Montreal&amp;#039;s Laboratoire de Medecine Legale examining recovered bodies to help police solve missing-persons cases and murders. It&amp;#039;s clear to Tempe that the remains of several women killed and savagely mutilated point to a sadistic serial killer, but she can&amp;#039;t convince the police. Determined to prevent more brutal deaths, she sleuths solo, tracking her quarry through Montreal&amp;#039;s seedy underworld of hookers, where her anthropologist friend Gabby, doing her own scary research, is being stalked by a creep. Despite her ability to work among fetid, putrefying smells that &quot;leap out and grab&quot; and her &quot;go-to-hell attitude&quot; with seasoned cops, Tempe is as vulnerable as a soft Carolina morning. When a grinning skull is planted in her garden, her investigation turns personal and escalates to an intense and satisfying conclusion. Except for imparting an excess of lab information, Reichs, also a forensic anthropologist, drives the pace at a heady clip. A first-class writer, she dazzles readers with sensory imagery that is apt, fresh, and funny (e.g., &quot;fingers felt cold and limp, like carrots kept too long in a cooler bin&quot;). Recommended for all fiction collections, this read is sure to be in demand.\n","torrent":{"xt":"urn:btih:214d2810e7d1b4d0097b186dd5277595f7067f11","amp;dn":"Audio+Book%2C+Kathy+Reichs+-+Deja+Dead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"214d2810e7d1b4d0097b186dd5277595f7067f11","infoHashBuffer":{"type":"Buffer","data":[33,77,40,16,231,209,180,208,9,123,24,109,213,39,117,149,247,6,127,17]},"announce":[],"urlList":[]}}