{"title":"Baahubali-The Beginning.(2015)-DVD.Rip-HEVC AAC-5.1-745 MB-[DDR]","uid":12529834,"size":780863146,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:21914fa53964e84b6f36173f4a0cd0d625dab20e&amp;dn=Baahubali-The+Beginning.%282015%29-DVD.Rip-HEVC+AAC-5.1-745+MB-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":2,"time":1444225751,"description":"DDR Presents\r\n\r\n\r\nbahubali-The beginning(2015)\r\n(A film by SS Rajamouli)\r\n\r\nHindi - DVD rip - 720x304p (2.35:1)- 745 Mb - x.265.AAC (2 Ch) - 2 Hrs:33 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/b4K \nhttp://extraimago.com/image/b4g \nhttp://extraimago.com/image/b4Z \nhttp://extraimago.com/image/b4e \nhttp://extraimago.com/image/b4B \nhttp://extraimago.com/image/b4C \nhttp://extraimago.com/image/b4p \nhttp://extraimago.com/image/b4r \nhttp://extraimago.com/image/b4G \nhttp://extraimago.com/image/b4P \nhttp://extraimago.com/image/b4Y \nhttp://extraimago.com/image/b4X\r\n\r\nTech Specifications: \r\n \nhttp://extraimago.com/image/b44\r\n\r\nSynopsis:\r\nShivudu (Prabhas), an orphan brought up by some village folk, Sanga (Rohini) and her husband, has become a daredevil of a young man. One day, after climbing a waterfall at the risk of his life, he meets a lissom young lass Avanthika(Tamannaah)and they fall in love. She belongs to a rebel group fighting against the king bhallava Deva (Rana Dagubatti) and he joins her. Together they go to Mahismati to rescue the queen mother Devasena (Anushka Shetty).\r\n\r\nThere they learn that Shiva is really the son of the late Amarendra Deva, the rightful King and brother of bhallala Deva.\r\n\r\nThe rest of the film is a flashback, telling us the story of the great battles fought by the two brothers bhallala Deva and Amarendra and how bhallala Deva managed to usurp the throne.\r\n\r\nComments:\r\nThe first thing that strikes you when watching this movie are the breathtaking graphics. The story itself is not much to wrte home about. We have heard/seen it a hundred times over. but the action scenes, the war scenes are spectacles never seen before in an Indian movie. And they are not short scenes either. In reality, they make up more than half the movie! Digital cinematography, Extensive use of Computer Graphics, virtual reality and all the buzzwords that you have heard about are here, in a pot pourri that makes this movie an unbelievable fantasy!\r\n\r\nIts not a film where rationality has any place. The story is unreal, the scenes are unreal, the magic tricks is obviously unreal, the sets are unreal. but who is complaining? Its a two and a half hours of edge of your seat excitement with clever trick after trick to hold your attention.\r\n\r\nTechnically, I doubt if I have seen a better film from India. It would be on par with a Game of Thrones, which has clearly influenced the opening sequence. Everything is on a gigantic scale, so much so that you start thinking on those scales and your mind refuses to go back to humdrum rational thought.\r\n\r\nActing is ordinary, the storyline almost ridiculous and Art and costumes mundane. There are numerous silly mistakes (Avanthika's bracelet keeps changing from her left to right hand and back for example), and some sequences that defy the laws of physics (see the shadows of the stones thrown by the catapults) and impossible geography (snow mountains, a torrent of a river and a hot desert terrain all next to each other)! but these are supplanted by the technical excellence and by some very good editing.\r\n\r\nOverall a film which will take you into oblivion, suspend your logical faculties and thrust scene after scene of unbelievable visual splendour at you for hours.\r\n\r\n\r\nUploader's Notes:\r\nI wish the DVD mastering was as good as the technical capabilities of the filmmaker, but unfortunately this is a very poory made DVD. I am surprised that the frame size varies thoughout the film and I had to cut up the video into seven parts to correct different frame sizes. There are still one or two places where you will see black top or bottom lines, but at least they are not as jarring as before! The video itself is poorly mastered and the detail available has been masked by diffused colours.\r\n\r\nWe have cleaned up the clip(s), enhanced details and I think brought out the beauty of the original video. There was a hint of grain that had been masked, which we have been able to enhance. The original color scheme has been left intact, but the colours look more vivid because of the detail enhancing.\r\n\r\nThe 10-bit HEVC recording helped control the slight blocking we noticed in the video, primarily in the action scenes. It also allows us to compress the video to just less that 745 Mb for a 2:39 minutes movie. The video quality is much better than that of the original DVD.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDb Link: \nhttp://www.imdb.com/title/tt2631186/","torrent":{"xt":"urn:btih:21914fa53964e84b6f36173f4a0cd0d625dab20e","amp;dn":"Baahubali-The+Beginning.%282015%29-DVD.Rip-HEVC+AAC-5.1-745+MB-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21914fa53964e84b6f36173f4a0cd0d625dab20e","infoHashBuffer":{"type":"Buffer","data":[33,145,79,165,57,100,232,75,111,54,23,63,74,12,208,214,37,218,178,14]},"announce":[],"urlList":[]}}