{"title":"Steven Nadler - A Book Forged in Hell [on Spinoza] (2011)","uid":8489896,"size":996388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21be6c94615be82a1994b2e43c9ace4377f85801&amp;dn=Steven+Nadler+-+A+Book+Forged+in+Hell+%5Bon+Spinoza%5D+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1368978747,"description":"Steven Nadler - A Book Forged in Hell: Spinoza's Scandalous Treatise and the Birth of the Secular Age (Princeton University Press, 2011).\n\nISBN: 9780691139890 | 304 pages | PDF\n\n\nWhen it appeared in 1670, Baruch Spinoza's Theological-Political Treatise was denounced as the most dangerous book ever published -- &quot;godless,&quot; &quot;full of abominations,&quot; &quot;a book forged in hell . . . by the devil himself.&quot; Religious and secular authorities saw it as a threat to faith, social and political harmony, and everyday morality, and its author was almost universally regarded as a religious subversive and political radical who sought to spread atheism throughout Europe. Yet Spinoza's book has contributed as much as the Declaration of Independence or Thomas Paine's Common Sense to modern liberal, secular, and democratic thinking. In A Book Forged in Hell, Steven Nadler tells the fascinating story of this extraordinary book: its radical claims and their background in the philosophical, religious, and political tensions of the Dutch Golden Age, as well as the vitriolic reaction these ideas inspired.\n\nIt is not hard to see why Spinoza's Treatise was so important or so controversial, or why the uproar it caused is one of the most significant events in European intellectual history. In the book, Spinoza became the first to argue that the Bible is not literally the word of God but rather a work of human literature; that true religion has nothing to do with theology, liturgical ceremonies, or sectarian dogma; and that religious authorities should have no role in governing a modern state. He also denied the reality of miracles and divine providence, reinterpreted the nature of prophecy, and made an eloquent plea for toleration and democracy.\n\nA vivid story of incendiary ideas and vicious backlash, A Book Forged in Hell will interest anyone who is curious about the origin of some of our most cherished modern beliefs.\n\n\nReviews\n\n&quot;In this clearly written and accessible book, Nadler offers up a historical and philosophical analysis of Spinoza's Theological-Political Treatise. . . . Each chapter not only focuses on sections of the Treatise but also explains the historical context of the Treatise and why many saw it as such a dangerous and corrupting book. . . . [Nadler] has definitely succeeded in writing an extremely rewarding and engaging book.&quot; -- Library Journal\n\n&quot;A groundbreaking analysis of an incendiary text.&quot; -- Booklist\n\n&quot;Steven Nadler's new study of the Treatise, A Book Forged in Hell, succeeds. . . While his tasks are primarily expository and contextual, Nadler, who is the author of the standard biography of Spinoza, puts forward a substantive thesis as well. . . . Guided by this set of claims, Nadler takes us through the Treatise in a detailed but seamless account of Spinoza's arguments and aims. One measure of his integrity, indeed, is that while endorsing the common portrayal of Spinoza as a founder of modern secularism, Nadler is sensitive to some of the ways in which Spinoza is not to be taken as the harbinger of the secular mindset. In fact, A Book Forged in Hell raises the important question of how appropriate it is to view Spinoza as a philosophical founder of contemporary secularism and especially of contemporary liberalism. It also raises the question of whether Spinoza should be understood as a Jewish thinker, if so, to what extent.&quot; -- Zachary Micah Gartenberg, Jewish Review of Books\n\n\n==============================\n\n\nFor a copy of the Theological-Political Treatise and other works by Spinoza, see:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8414940/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8414940/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:21be6c94615be82a1994b2e43c9ace4377f85801","amp;dn":"Steven+Nadler+-+A+Book+Forged+in+Hell+%5Bon+Spinoza%5D+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21be6c94615be82a1994b2e43c9ace4377f85801","infoHashBuffer":{"type":"Buffer","data":[33,190,108,148,97,91,232,42,25,148,178,228,60,154,206,67,119,248,88,1]},"announce":[],"urlList":[]}}