{"title":"Introduction to Quality and Safety Education for Nurses [PDF] [S","uid":11078286,"size":3333111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2286beb114ee29c95fc49c6b944aeac9697cc840&amp;dn=Introduction+to+Quality+and+Safety+Education+for+Nurses+%5BPDF%5D+%5BS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"0xmovva","files":2,"time":1411364030,"description":"Author:y Patricia Kelly, Beth A. Vottero, Carolyn Christie-McAuliffe \nPaperback: 496 pages\nPublisher: Springer Publishing Company; 1 edition (March 14, 2014)\nLanguage: English\nISBN-10: 0826121837\nISBN-13: 978-0826121837\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_______________________________________________________________________________\n\n\nThis is the first undergraduate textbook to provide a comprehensive overview of essential knowledge, skill, and attitudes about safety in nursing practice. It reflects the six areas of nursing competencies as developed by the Quality and Safety Education Program for Nurses (QSEN) initiative, which are currently required content in undergraduate nursing programs. Using an inter-professional focus, the book addresses the fundamental knowledge required of entry-level nurses in each of the six QSEN areas: quality improvement, patient safety, teamwork and collaboration, evidence-based practice, informatics, and patient-centered care.\n\nThe book includes all of the content required for nursing programs to be accredited by AACN or NLN. Contributors include nurse educators, faculty, researchers, administrators, case managers, quality improvement practitioners, and entrepreneurs of nursing as well as physicians and librarians from throughout the U.S. Readers will be privy to the unique perspectives of different health care partners who provide real life examples from an inter-professional team perspective. These include pharmacists, lawyers, physicians, librarians, quality improvement nurses, radiology technologists, nurse practitioners, hospital board members, patients, and others. Each chapter includes objectives, opening scenarios, case studies, critical thinking exercises, key terms, NCLEX-style questions, photos, tables, figures, web resources, recommendations for additional reading, and PowerPoint slides. An important feature of the book is the listing of QSEN competencies and the associated knowledge, skills, and attitudes (KSA) in the Appendix.\n\nKey Features:\n\nComprises the only undergraduate text to address the six areas of requisite nursing competencies as developed by the QSEN initiative\nProvides a strong foundation for safe, evidence-based care\nPresents an inter-professional approach that reflects health care today\nSupports teaching with PowerPoint slides, critical thinking exercises, case studies, and rationales for review questions\nIncludes objectives, critical thinking exercises, case studies, real world interviews, tables, figures, visuals, and suggested readings in each chapter","torrent":{"xt":"urn:btih:2286beb114ee29c95fc49c6b944aeac9697cc840","amp;dn":"Introduction+to+Quality+and+Safety+Education+for+Nurses+%5BPDF%5D+%5BS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2286beb114ee29c95fc49c6b944aeac9697cc840","infoHashBuffer":{"type":"Buffer","data":[34,134,190,177,20,238,41,201,95,196,156,107,148,74,234,201,105,124,200,64]},"announce":[],"urlList":[]}}