{"title":"Wilson Pickett - Hey Jude (1969) [ape] Duana Allman","uid":11548304,"size":200681373,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:22d16c1010fe55230be642b84e2c2c4230676206&amp;dn=Wilson+Pickett+-+Hey+Jude+%281969%29+%5Bape%5D+Duana+Allman+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Eugene_Debs","files":-1,"time":1416757021,"description":"\n\nWilson Pickett and the Muscle Shoals session crew with whom he cut most of his best work thankfully had the good sense to not try to go psychedelic when the pop charts went all day-glo in the late 1960's, but that's not to say they didn't make an effort to change with the times. On Hey Jude, Pickett and producer Rick Hall decided to throw a couple of recent rock covers into the mix, and while Pickett's version of &quot;Hey Jude&quot; suggests that he isn't entirely sure what it is he's singing about, he still belts it out with his typical level of commitment and builds up to a proper fury at the end; he sounds more comfortable with the neo-biker bombast of &quot;Born To Be Wild&quot;, a combination of artist and material that works far better than anyone would have a right to expect. But the most notable change in Pickett's approach for this album was the addition of Duane Allman on guitar; his wirey, blues-accented leads don't overpower the album, but they add a noticeably harder texture to the sound, and that seems to suit Pickett, one of the toughest soul shouters of his time, just fine. Most of the Hey Jude is dominated by hard Southern soul numbers like &quot;A Man and a Half&quot; and &quot;Toe Hold&quot;, and Pickett, one of the most dependable performers on the 1960's soul scene, gives a typically con brio performance on all ten tracks, and the sharp report of the horn section and Allman's blistering guitar makes for music just as potent as the wail of the lead singer, which is not an accomplishment to be sneered at.\n\n\n1 Save Me (Greer, Jackson) 2:37\n2 Hey Jude (Lennon, McCartney) 4:07\n3 Back in Your Arms (Chambers, Jackson, Leakes) 2:57\n4 Toe Hold (Hayes, Porter) 2:50\n5 Night Owl (Covay) 2:22\n6 My Own Style of Loving (Fame, Jackson, Leakes, Moore) 2:44\n7 A Man and a Half (Chambers, Jackson, Leakes) 2:52\n8 Sit Down and Talk This Over (Pcikett, Pickett, Womack) 2:21\n9 Search Your Heart (Jackson, Moore) 2:46\n10 Born to Be Wild (Bonfire) 2:46\n11 People Make the World (Womack) 2:46 \n\nWilson Pickett - vocals\nSweet Inspirations - background vocals\nDuane Allman - guitar\nBarry Beckett - organ \nDavid Hood - bass\nRoger Hawkins - drums\nAlbert Lowe - guitar\nMarvell Thomas - organ\nJerry Jammot - bass\nJames Johnson - guitar","torrent":{"xt":"urn:btih:22d16c1010fe55230be642b84e2c2c4230676206","amp;dn":"Wilson+Pickett+-+Hey+Jude+%281969%29+%5Bape%5D+Duana+Allman+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22d16c1010fe55230be642b84e2c2c4230676206","infoHashBuffer":{"type":"Buffer","data":[34,209,108,16,16,254,85,35,11,230,66,184,78,44,44,66,48,103,98,6]},"announce":[],"urlList":[]}}