{"title":"Bush - Sixteen Stone and Bonus Live EP [FLAC] - Kitlope","uid":4612494,"size":585773024,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2332409c08445f07249795a49b5fa28cfb8ad733&amp;dn=Bush+-+Sixteen+Stone+and+Bonus+Live+EP+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":24,"time":1230685100,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 2332409C08445F07249795A49B5FA28CFB8AD733\nFile Size: 559 Mb\nYear: 1994\nLabel: Trauma / Interscope / Atlantic\nCatalog #: INTSD - 90000\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nBush is a British post-grunge band, formed in London in 1992. Their debut album was the self-released Sixteen Stone in 1994. They have sold well over 10 million records in the United States. The band, while hugely successful in the United States, was less well known in their native UK and enjoyed only marginal success there.[1]\nThe group chose the name &quot;Bush&quot; because they used to live in Shepherd's Bush, London. In Canada, they were once known as Bushx, because the 1970s band Bush, led by Domenic Troiano, owned the Canadian rights to the name. In April 1997, it was announced that Troiano had agreed to let them use the name Bush in Canada without the exponent x, in exchange for donating $20,000 each to the Starlight Children's Foundation and the Canadian Music Therapy Trust Fund.\n\nIn 1992, British guitarist Nigel Pulsford had left his band, King Blank, after they recorded two albums without much success; he met Gavin Rossdale, who had achieved little success with his previous, short-lived band, Midnight. The two formed a new band, then called Future Primitive, and recruited bassist Dave Parsons (formerly of the punk rock band The Partisans and the somewhat successful pop band Transvision Vamp) and drummer Robin Goodridge to complete the lineup. They soon changed their name to Bush. The United States was at the height of the grunge movement, but Britain had yet to produce a popular grunge band. Bush was on the verge of becoming that band.\n\n\n\n\nBreakthrough success with Sixteen Stone: 1994-1995\n\nBush's debut album, Sixteen Stone, featured several singles. Initial singles &quot;Everything Zen,&quot; and &quot;Little Things&quot; did not sell well at first. However, with their third single, &quot;Comedown&quot; the band quickly saw great success in the United States. The song reached number one for two weeks Modern Rock Tracks as well as the U.S. top 40. The following single &quot;Glycerine&quot; was probably one of their most well known songs. Despite its elusive lyrics, the song is truly about heroin abuse, using such verses as &quot;and when we rise its like strawberry fields&quot; among others to refer to the use of the drug. It received much airplay and sold many singles in America. The band followed with &quot;Machinehead&quot; which reached the top 5 of the Modern Rock Tracks chart and narrowly missed the top 40. As a result of the success of &quot;Comedown,&quot; &quot;Glycerine,&quot; and &quot;Machinehead,&quot; the first two singles from the album began to see airplay and reached the top 40, bringing the album's total to four top 40 hits. With the many hits from Sixteen Stone including regular airplay on radio and MTV along with a performance on Saturday Night Live the album went platinum multiple times, having now sold six million copies in America, poising Bush's follow-up for massive commercial popularity.[/quote]\n\n\n\n\n\nSixteen Stone\n\n\nSixteen Stone is the debut album of British post-grunge band Bush. Released in 1994 through Trauma Records, it boasted numerous successful singles and is widely regarded as group's most popular album.\n\nOn the Billboard Music Charts (North America), Sixteen Stone peaked at #4 on the Heatseekers and Billboard 200 charts. The album spawned 5 Top 40 singles. After about a half of year of promotion for Sixteen Stone the album began to sell wildly, once &quot;Comedown&quot; and &quot;Glycerine&quot; struck America. However when the band became popular, many critics and audiences across the globe downed the band for sounding too much like Seattle rockers Nirvana, and Soundgarden. In later years Bush would distance themselves from the familiar grunge sounds with experimental releases such as The Science of Things, and Deconstructed.\n\nIn the UK, a stone is a unit of weight that equals 14 pounds. Therefore, sixteen stone means 224 pounds or about 102 kilograms. When asked why lead singer Gavin Rossdale chose the name &quot;Sixteen Stone&quot; for the name of their album, he said: &quot;Once upon a time there was a lonely man... my friend, who called a phone number advertising a '21 year Scandinavian beauty, new in town.' When she arrived, she was forty years old and sixteen stone...&quot;\n\nIn the booklet of Sixteen Stone, there is a heart and a dedication to Rupert and Julie, two of Gavin's friends who died in a tragic boating accident along the Thames in England.\n\nThe CD and case have a picture of what looks like a bush or mop head flying through the air. This is actually Gavin's dog named Winston. A Puli, a breed of dog with dreadlock like cords, that has been tossed in the air or is jumping. Beck used the same effect in 1996 with a Komondor, a nearly identical looking dog, on his album Odelay which looks like a mop jumping a hurdle.\n\n\n\nTracks: \n\n1.\t&quot;Everything Zen&quot; - 4:38 \n2.\t&quot;Swim&quot; - 4:56 \n3.\t&quot;Bomb&quot; - 3:23 \n4.\t&quot;Little Things&quot; - 4:24 \n5.\t&quot;Comedown&quot; - 5:27 \n6.\t&quot;Body&quot; - 5:43 \n7.\t&quot;Machinehead&quot; - 4:16 \n8.\t&quot;Testosterone&quot; - 4:20 \n9.\t&quot;Monkey&quot; - 4:01 \n10.\t&quot;Glycerine&quot; - 4:27 \n11.\t&quot;Alien&quot; - 6:34 \n12.\t&quot;X-Girlfriend&quot; - 0:45\n\n\n\nBonus Disc (Live) \n  \n1.\tSwim\n2.\tAlien\n3.\tBomb\n4.\tLittle Things\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:2332409c08445f07249795a49b5fa28cfb8ad733","amp;dn":"Bush+-+Sixteen+Stone+and+Bonus+Live+EP+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2332409c08445f07249795a49b5fa28cfb8ad733","infoHashBuffer":{"type":"Buffer","data":[35,50,64,156,8,68,95,7,36,151,149,164,155,95,162,140,251,138,215,51]},"announce":[],"urlList":[]}}