{"title":"The Big Bang Theory Season 01-05","uid":7428253,"size":9626889774,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:234b5d32184da02d249356a9d8371ff45875d17a&amp;dn=The+Big+Bang+Theory+Season+01-05+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RummyKid","files":219,"time":1341869681,"description":"The Big Bang Theory is an American sitcom created by Chuck Lorre and Bill Prady, both of whom serve as executive producers on the show, along with Steven Molaro. All three also serve as head writers. It premiered on CBS on September 24, 2007.\n\n\n\n\n\nLeonard Hofstadter and Sheldon Cooper are both brilliant physicists working at Cal Tech in Pasadena, California. They are colleagues, best friends, and roommates, although in all capacities their relationship is always tested primarily by Sheldon's regimented, deeply eccentric, and non-conventional ways. They are also friends with their Cal Tech colleagues mechanical engineer Howard Wolowitz and astrophysicist Rajesh Koothrappali. The foursome spend their time working on their individual work projects, playing video games, watching science-fiction movies, or reading comic books. As they are self-professed nerds, all have little or no luck with popular women. When Penny, a pretty woman and an aspiring actress originally from Omaha, moves into the apartment next to Leonard and Sheldon's, Leonard has another aspiration in life, namely to get Penny to be his girlfriend.","torrent":{"xt":"urn:btih:234b5d32184da02d249356a9d8371ff45875d17a","amp;dn":"The+Big+Bang+Theory+Season+01-05+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"234b5d32184da02d249356a9d8371ff45875d17a","infoHashBuffer":{"type":"Buffer","data":[35,75,93,50,24,77,160,45,36,147,86,169,216,55,31,244,88,117,209,122]},"announce":[],"urlList":[]}}