{"title":"Third Ear Band - Alchemy","uid":5535120,"size":315553174,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2376aa8e88c8a1e4bee7229f12bab921c124f2e1&amp;dn=Third+Ear+Band+-+Alchemy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nmoscar","files":8,"time":1273047770,"description":"Enjoy!\n\nAllmusic:\n\nStarted in 1968 by percussionist Glen Sweeney and reedist Paul Minns, Third Ear Band was formed from the ashes of a previous Sweeney  project, the psych band Hydrogen Juke Box. While generally overlooked in the history of British and improvised music, Third Ear Band developed a distinctive and aesthetically important sound -- equal parts Indian, psychedelic, and minimalist -- dubbed &quot;electric-acid-raga&quot; by Sweeney. Alchemy, their first release, is a wonderful record. With shorter tracks than found on later albums, Third Ear Band here makes excursions into improvised chamber music. In the opener, &quot;Mosaic,&quot; which is at seven minutes one of the longest cuts, guitar meets recorder and violin in a disharmonic free jazz summit that fades away before building into a trancy mini-crescendo. On &quot;Stone Circle,&quot; recorder lines interweave over an unadorned drum's repetitive rhythm. At times the recorder lines are so fluid and unnatural they sound like they're being played backwards -- which indeed they just might be. Generally the remainder of the tracks run the course between half-structured improv and droning chaos. Comparisons could be drawn to Soft Machine or the Dream Syndicate, but neither quite has the sense of &quot;collective first&quot; nor the repetitive insistence of Third Ear Band. The songs, to quote Sweeney  again, are &quot;alike or unlike as trees.&quot; For those even vaguely interested in the history of innovative music, Alchemy is worth hunting down. \n\nAll Apple Lossless (ALAC) (average 850kbps)","torrent":{"xt":"urn:btih:2376aa8e88c8a1e4bee7229f12bab921c124f2e1","amp;dn":"Third+Ear+Band+-+Alchemy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2376aa8e88c8a1e4bee7229f12bab921c124f2e1","infoHashBuffer":{"type":"Buffer","data":[35,118,170,142,136,200,161,228,190,231,34,159,18,186,185,33,193,36,242,225]},"announce":[],"urlList":[]}}