{"title":"Phyllis Illari - Causality. Philosophical Theory Meets Scientifi","uid":11223214,"size":1907956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23e855bb7e9ed01691baa1788b8c73f5bd61264e&amp;dn=Phyllis+Illari+-+Causality.+Philosophical+Theory+Meets+Scientifi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1413410096,"description":"Description\nProduct Details\nBook Title: Causality: Philosophical Theory meets Scientific Practice\t\nBook Author: Phyllis Illari (Author), Federica Russo (Author)\nHardcover: 336 pages\nPublisher: Oxford University Press (December 2, 2014)\nLanguage: English\nISBN-10: 0199662673\nISBN-13: 978-0199662678\n\nBook Description\nPublication Date: December 2, 2014\nHead hits cause brain damage - but not always. Should we ban sport to protect athletes? Exposure to electromagnetic fields is strongly associated with cancer development - does that mean exposure causes cancer? Should we encourage old fashioned communication instead of mobile phones to reduce cancer rates? According to popular wisdom, the Mediterranean diet keeps you healthy. Is this belief scientifically sound? Should public health bodies encourage consumption of fresh fruit and vegetables? Severe financial constraints on research and public policy, media pressure, and public anxiety make such questions of immense current concern not just to philosophers but to scientists, governments, public bodies, and the general public.\n\nIn the last decade there has been an explosion of theorizing about causality in philosophy, and also in the sciences. This literature is both fascinating and important, but it is involved and highly technical. This makes it inaccessible to many who would like to use it, philosophers and scientists alike.\n\nThis book is an introduction to philosophy of causality - one that is highly accessible: to scientists unacquainted with philosophy, to philosophers unacquainted with science, and to anyone else lost in the labyrinth of philosophical theories of causality. It presents key philosophical accounts, concepts and methods, using examples from the sciences to show how to apply philosophical debates to scientific problems.\n\nAbout the Authors\nPhyllis Illari is Lecturer in Philosophy of Science in the Science and Technology Studies department at University College London. Before joining UCL in 2013, she finished a project on Information Quality with Luciano Floridi, and previously completed a project on Mechanisms and Causality with Jon Williamson. She is primarily research active in the philosophy of science, particularly the philosophy of causality and the philosophy of information. She is on the editorial board of the journal Philosophy and Technology, and on the committee of the British Society for the Philosophy of Science. She is the author of numerous articles in the philosophy of science and edited volumes and special issues on causality in the sciences, including Causality in the Sciences (OUP 2011) with Federica Russo and Jon Williamson. Since 2008, she and Federica Russo have been members of the Steering Committee of the 'Causality in the Sciences' conference series.\n\nFederica Russo is Researcher in Philosophy of Science and Technology at the University of Ferrara (Italy) and has visited the Centre for Philosophy of Natural and Social Science (London School of Economics) from April 2004 to January 2005 and the Center for Philosophy of Science (Pittsburgh) from January to April 2009. She is interested in causality and probability in the social, biomedical and policy sciences, as well as in the philosophical, legal, and social, implications of technology. Federica is part of the editorial board of the journals Philosophy and Technology and Topoi. She is the author of Causality and causal modelling in the social sciences. Measuring variations (Springer, 2009), and of numerous articles (sole or co-authored) on causality in the social, biomedical, and policy sciences. She has edited several volumes in philosophy of science and technology, including Causality in the Sciences (OUP 2011) with Phyllis Illari and Jon Williamson","torrent":{"xt":"urn:btih:23e855bb7e9ed01691baa1788b8c73f5bd61264e","amp;dn":"Phyllis+Illari+-+Causality.+Philosophical+Theory+Meets+Scientifi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23e855bb7e9ed01691baa1788b8c73f5bd61264e","infoHashBuffer":{"type":"Buffer","data":[35,232,85,187,126,158,208,22,145,186,161,120,139,140,115,245,189,97,38,78]},"announce":[],"urlList":[]}}