{"title":"Las Pastillas Del Abuelo - Por Colectora (2005) WMA320","uid":6103213,"size":158391785,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2556e0eefa5368d36b963a8b01743024ffe4df4e&amp;dn=Las+Pastillas+Del+Abuelo+-+Por+Colectora+%282005%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1295056222,"description":"Las Pastillas del Abuelo es una banda musical argentina. Se caracteriza principalmente por la fusiÃƒÂ³n de Rock con estilos musicales como reggae, candombe, chacarera, country y otros. Otra de las caracterÃƒÂ­sticas principales es que sus integrantes cursan, o han cursado, carreras afines con el instrumento que ejecutan en escuelas de mÃƒÂºsica de Buenos Aires, y ademÃƒÂ¡s varios de ellos se desempeÃƒÂ±an como profesores particulares. La banda representa el mayor ÃƒÂ©xito que pudo conseguir una banda under en la argentina despuÃƒÂ©s del incidente de RepÃƒÂºblica CromaÃƒÂ±ÃƒÂ³n.\n\nLa banda se formÃƒÂ³ en noviembre de 2002 y, luego de algunos cambios de formaciÃƒÂ³n, quedÃƒÂ³ con la alineaciÃƒÂ³n actual. Debutaron en mayo de 2003 en Sadem y en julio habÃƒÂ­an conseguido grabar su primer demo. Toda la difusiÃƒÂ³n inicial de la banda se dio por internet, consiguiendo una gran cantidad de popularidad con su tema &quot;El Sensei&quot;, ÃƒÂ©l cual llegÃƒÂ³ a encabezar los rankings de canciones mÃƒÂ¡s bajadas. Esa canciÃƒÂ³n no fue incluida en ninguna de las grabaciones &quot;oficiales&quot; de la banda ni forma parte del repertorio habitual en vivo.\n\nEn septiembre de 2005 grabaron su primer disco: &quot;Por colectora&quot;. Con doce temas, es una demostraciÃƒÂ³n de la variedad de estilos que la banda ofrece: rock, country, jazz, reggae, chacarera y candombe y con letras que tratan de situaciones cotidianas, como la amistad, el amor y los vicios.\n\nGracias a un concurso radial( &quot;El Bombardeo del Demo&quot; del programa &quot;Day Tripper&quot; de la Rock &amp; Pop) ,que les permitÃƒÂ­a a las bandas under darse a conocer, Las Pastillas tuvieron la oportunidad de presentarse en el Pepsi Music del 2005 y, en el verano del 2006, tocaron en el cierre del Gesell Rock como teloneros de Las Pelotas.\n\nel 31 de marzo de 2006 en &quot;El Teatro&quot; de Colegiales, en Buenos Aires, y debido a que se agotaron las entradas 15 dÃƒÂ­as antes se agregÃƒÂ³ otra fecha para dos dÃƒÂ­as despuÃƒÂ©s, el domingo 2 de abril, en el mismo lugar. Casi 3.000 personas se sumaron viernes y domingo para ver a la banda, que nunca antes habÃƒÂ­a tocado ante tal cantidad de pÃƒÂºblico propio. Eso mismo se repitiÃƒÂ³ durante el 16 y 18 de junio en El Teatro Flores, el cual cuenta con una capacidad mayor, y permitiÃƒÂ³ que sean 4.000 los espectadores que pudieran disfrutar del show.\n\nLa presencia de ÃƒÂ©sta banda en el Pepsi Music se repitiÃƒÂ³ durante 2006.\n\nLos dÃƒÂ­as 10, 11 y 12 de noviembre de 2006 Las Pastillas presentaron su segundo disco en El Teatro Colegiales. La grabaciÃƒÂ³n se realizÃƒÂ³ en los estudios Circo Beat (de Fito PÃƒÂ¡ez).Las entradas se agotaron rapidamente. El disco tuvo dos cortes de difusiÃƒÂ³n: &quot;Oportunistas&quot; y &quot;Tantas Escaleras&quot;.\n\nEl 2007 la banda se presentÃƒÂ³ en los festivales de Burzaco y Arrecifes, y luego de un show en Gualeguay se iniciÃƒÂ³ la Gira por la Costa, con shows diarios en Tandil, San Bernardo, San Clemente, Mar del Plata, Necochea y Villa Gesell.\n\nLuego de unas vacaciones, en Febrero estuvieron en el CosquÃƒÂ­n Rock y en el OlavarrÃƒÂ­a Rock, para luego continuar con shows en Mendoza, ParanÃƒÂ¡,Navarro, ChascomÃƒÂºs y ZÃƒÂ¡rate. En Abril Las Pastillas volvieron para hacer una Gira por el Sur, con presentaciones consecutivas en NeuquÃƒÂ©n, Plaza Huincul, JunÃƒÂ­n de los Andes y Bariloche.\n\nEl reencuentro con el pÃƒÂºblico porteÃƒÂ±o se produjo, de regreso de esa gira, en &quot;El Teatro&quot; de Flores, con dos shows con localidades agotadas que obligaron a armar una tercera fecha. En mayo de 2007 se presentÃƒÂ³ en Internet, en el sitio YouTube, el primer video de Las Pastillas, con el tema &quot;Oportunistas&quot;. Luego se presentan por varias ciudades como Rosario, Cordoba, Santa fe, Las Heras,etc. De regreso a Capital se produce otro Hecho de importancia: la banda se presenta en el teatro de Flores 7 veces en el mes de agosto con localidades agotadas. MÃƒÂ¡s de 12.000 personas concurrieron a los shows.\n\nLuego de la gira por la Costa AtlÃƒÂ¡ntica y CÃƒÂ³rdoba, la banda se presentÃƒÂ³ el 11 de abril en el Luna Park, con localidades agotadas un mes antes del concierto. Casi 9000 personas presenciaron el show el cual contÃƒÂ³ con un repertorio de 34 canciones\n\nEl tercer disco oficial de la banda, fue presentado en agosto de 2008 en el Estadio Malvinas Argentinas de Argentinos Juniors. El material, grabado en los estudios &quot;Del Abasto&quot; y &quot;El Abastito&quot;, tuvo a la banda y a TucÃƒÂ¡n Bossa como productores artÃƒÂ­sticos. El Estadio Malvinas Argentinas de Argentinos Juniors volviÃƒÂ³ a recibirlos en noviembre, despidiendo asÃƒÂ­ el aÃƒÂ±o en Capital Federal.\n\nLuego, actuaron en un recital gratuito organizado por el gobierno de la Ciudad AutÃƒÂ³noma de Buenos Aires. Siguieron presentando el recital en diversas partes del paÃƒÂ­s (Rosario, NeuquÃƒÂ©n, Bariloche, Comodoro Rivadavia, Mendoza, Quilmes, CÃƒÂ³rdoba, Santiago del Estero, TucumÃƒÂ¡n, Brandsen, Mar del Plata, Nueve de Julio y varios paradores de la costa argentina) e incluso salieron por primera vez del paÃƒÂ­s, cuando tocaron en Montevideo, Uruguay.\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Jose.wma                                                    \n02 - Solo Dios.wma                                               \n03 - PeldaÃƒÂ±o.wma                                                 \n04 - Saber Cuando Parar (Candombe 1).wma                         \n05 - Cubano.wma                                                  \n06 - Skalipso.wma                                                \n07 - Cerveza.wma                                                 \n08 - Oscarcito.wma                                               \n09 - Perdido (Chakarera).wma                                     \n10 - Lo+Fino.wma                                                 \n11 - La Casada.wma                                               \n12 - Resulta Imposible (Candombe 2).wma \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:2556e0eefa5368d36b963a8b01743024ffe4df4e","amp;dn":"Las+Pastillas+Del+Abuelo+-+Por+Colectora+%282005%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2556e0eefa5368d36b963a8b01743024ffe4df4e","infoHashBuffer":{"type":"Buffer","data":[37,86,224,238,250,83,104,211,107,150,58,139,1,116,48,36,255,228,223,78]},"announce":[],"urlList":[]}}