{"title":"The M16 (Osprey Weapon 14)","uid":7833746,"size":4725213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25ee9021b75ce36ccf47be7471f3ec12fdaabcc0&amp;dn=The+M16+%28Osprey+Weapon+14%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1353141472,"description":"Book Description:\n\nRelease Date: December 20, 2011  | Series: Weapon (Book 14)\n\nThe M16 was first introduced in 1958 and was revolutionary for its time as it was made of lightweight materials including special aluminium and plastics, which had previously not been used in mainstream weapons. It was first adopted by US Special Forces and airborne troops in 1962 before it was issued to Army and Marine units serving in the Vietnam War (1955-1975). Its use spread throughout the following decades and a number of variants including submachine and carbine versions were also fielded. It was not only the rifle itself that proved revolutionary. The 5.56x45mm cartridge was also ground-breaking and was eventually adopted as the standard NATO cartridge. As a result it is now amongst the three most used combat cartridges in the world while over 10 million M16s and variants have been produced making it one of the most successful American handheld weapons in history . But despite its undeniable success the M16 is not without its detractors. Indeed, the &quot;black rifle&quot;, as it is known, is one of the most controversial rifles ever introduced with a long history of design defects, ruggedness issues, cleaning difficulties and reliability problems leading to endless technical refinements. The story is not over either. The M16 is still in production to this day ensuring that its use in future conflicts as well as its impact on world affairs is assured. This volume, written by a Vietnam Special Forces veteran, provides a technical history of the M16 and the struggle to perfect it together with an assessment of its impact on the battlefield drawing on over a decade's combat experience with the rifle.\n\nContents:\n Introduction\n Development \n Use \n Impact \n Conclusion \n Bibliography","torrent":{"xt":"urn:btih:25ee9021b75ce36ccf47be7471f3ec12fdaabcc0","amp;dn":"The+M16+%28Osprey+Weapon+14%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ee9021b75ce36ccf47be7471f3ec12fdaabcc0","infoHashBuffer":{"type":"Buffer","data":[37,238,144,33,183,92,227,108,207,71,190,116,113,243,236,18,253,170,188,192]},"announce":[],"urlList":[]}}