{"title":"BDSM Erotica Bundle","uid":10640549,"size":461795,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25f266fb24556b186547798fb82b38f5f8fe85b4&amp;dn=BDSM+Erotica+Bundle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mikakay","files":-1,"time":1406445468,"description":"EPUB format\n\nHot bundle of 10 steamy BDSM erotica stories. Featuring the rich and powerful men and women of Orange County, California. \n\nThe Night Guard \nRachel is a young woman attending college during the day and working as a security guard during the night. She likes her job as it allows her to focus on her homework. She isn't bothered by anyone except herself. She is incredibly attracted to James Killebrew, a rich executive who works on her floor. Rachel only sees him once in a while, when he works late, and she tries to savor every encounter. \n\nOne night, during her regular patrol, she enters James' office and what she encounters will change her life forever... \n\nThe Wife \nVeronica's marriage is tough. Her husband, Thomas, is the chief marketing officer for Ellis enterprises and a workaholic. She almost never sees him. They haven't had sex in a long time. She spends her days distracting herself from her loneliness. She's thought a few times about having an affair but the idea scares her. \n\nThe only man she'd seriously consider having an affair with is Joel, her husband's friend. Joel is almost the complete opposite of Thomas. He has long hair, plays in a band, spends his days surfing. He's also a mystery to Veronica and she is desperately trying to figure him out. One day she gets her wish as Joel comes over while Thomas is at work does something that changes the fabric of their relationship forever. \n\nThe Waitress \nVeronica's marriage is tough. Her husband, Thomas, is the chief marketing officer for Ellis enterprises and a workaholic. She almost never sees him. They haven't had sex in a long time. She spends her days distracting herself from her loneliness. She's thought a few times about having an affair but the idea scares her. \n\nThe only man she'd seriously consider having an affair with is Joel, her husband's friend. Joel is almost the complete opposite of Thomas. He has long hair, plays in a band, spends his days surfing. He's also a mystery to Veronica and she is desperately trying to figure him out. One day she gets her wish as Joel comes over while Thomas is at work does something that changes the fabric of their relationship forever. \n\nThe Vet \nAshley loved animals since she was a little child. Becoming a veterinarian was a natural step for her. She loves what she does and she loves the city she lives in--San Juan Capistrano. \n\nShe does have trouble focusing on her work sometimes and it is when Emilio Quinn brings his dogs in. She has a huge crush on him and sometimes thinks there's more to Emilio's comments and touches, but he is married and she refuses to have an affair with a married man. When she finds out that Emilio had divorced she can't help but be happy. \n\nOne night Emilio calls her. There's an emergency with one of his dogs. Ashley gladly comes over, not just to help his dog but to find out if there's something more between them... \n\nThe Assistant \nKelsey just got the opportunity of a lifetime - an interview for the position of a personal assistant to a serial entrepreneur Dominic Reyes. His reputation is well known. He is strict and domineering, but all of his assistants who passed his training went on to become incredibly successful entrepreneurs in their own right. Kelsey thinks she's got what it takes. But she doesn't know what Dominic's training entails. She has tried to contact his previous assistants and they have been incredibly secretive. \n\nShe wants to succeeded and she will do whatever it takes to work for Dominic. What she doesn't yet realize is how far she will need to go to complete her training... \n\nAnd more!","torrent":{"xt":"urn:btih:25f266fb24556b186547798fb82b38f5f8fe85b4","amp;dn":"BDSM+Erotica+Bundle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25f266fb24556b186547798fb82b38f5f8fe85b4","infoHashBuffer":{"type":"Buffer","data":[37,242,102,251,36,85,107,24,101,71,121,143,184,43,56,245,248,254,133,180]},"announce":[],"urlList":[]}}