{"title":"Doug Sahm - Doug Sahm and Band [1973][EAC,log,cue. FLAC]","uid":8924324,"size":283889479,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2613b019aebb32d7f22772167fd6a24091472d4b&amp;dn=Doug+Sahm+-+Doug+Sahm+and+Band+%5B1973%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1379329192,"description":"Artist:Doug Sahm\nRelease:Doug Sahm and Band\nReleased: 1973 \nLabel: 2006 - Collectors' Choice Music\nCatalog#: CCM-706\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana\n\n\n1. (Is Anybody Going to) San Antone\n2. It's Gonna Be Easy\n3. Your Friends\n4. Poison Love\n5. Wallflower\n6. Dealer's Blues\n7. Faded Love\n8. Blues Stay Away from Me\n9. Papa Ain't Salty\n10. Me and Paul\n11. Don't Turn Around\n12. I Get Off\n\nDoug Sahm began his solo career in 1972, after the Sir Douglas Quintet finished its contract with Smash/Mercury and after Atlantic Records co-owner/producer Jerry Wexler convinced him to sign to his label. Wexler gave the Texas maverick the chance to cut a star-studded, big-budget album, shuffling him off to New York where Wexler and Arif Mardin helmed a series of sessions with an ever-revolving cast of musicians featuring Bob Dylan, Dr. John, David &quot;Fathead&quot; Newman, David Bromberg, and Flaco Jimenez, in addition to such Sir Doug stalwarts as Augie Meyers and the rhythm section of bassist Jack Barber and drummer George Rains (all but the latter were in the last incarnation of the Quintet, raising the question of whether the group was indeed finished or not, but such is the nature of Sahm's discography). This group cut a lot of material, which was whittled down to the 12-track album Doug Sahm and Band, released in early 1973. At the time, the record received a push from the label and was generally disparaged because of those very all-stars on whose back it was sold, but the years have been kind indeed to the album, and it stands among Sahm's best. Indeed, the heart of the album is not at all far removed from those latter-day Sir Douglas Quintet albums on Mercury, which isn't much of a stretch since Sahm never really strayed from his signature blend of rock &amp; roll, blues, country, and Tejano, but the bigger band and bigger production give the music a different feel -- one that's as loose as the best Quintet material, but off-handedly accomplished and slyly freewheeling. Original reviews noted that there was an overtly country direction on And Band, but that's not really true on an album that has Western swing and rambling country-rock like &quot;Blues Stay Away from Me&quot; and the anthemic &quot;(Is Anybody Going To) San Antone&quot; jutting up against pure blues in &quot;Your Friends&quot; and &quot;Papa Ain't Salty,&quot; let alone loose-limbed rockers like &quot;Dealer's Blues&quot; and &quot;I Get Off&quot; or the skipping Tejano &quot;Poison Love,&quot; fueled by Jimenez's addictive accordion.\n\nThese are all convincing arguments that the larger band allowed Sahm to indulge in all of his passions, to the extent of devoting full tracks to each of his favorite sounds -- something that was a bit different than the Quintet records, which usually mixed it all up so it was impossible to tell where one influence ended and another began. That's still true on And Band -- for instance, witness the brilliant cover of Willie Nelson's &quot;Me and Paul,&quot; a country song goosed by soulful horns and delivered in a delirious drawl from Sir Doug -- but much of the album finds that signature Sahm sprawl being punctuated by style-specific detours where Sahm seizes the opportunity to stretch out as much as his guests seize the opportunity to jam with this American musical visionary. These are all characteristics of a jam session, which these sessions essentially were -- after all, on this album he only penned three out of the 12 songs -- but relying on covers also points out how Doug Sahm sounds so much like himself, he makes other people's tunes sound as if he wrote them himself. Again, that's something that was true throughout his career, but here it is in sharper relief than most of his records due to the nature of the sessions. And while it's arguable whether this is better than latter-day Sir Douglas Quintet albums -- or such mid-'70s records as Groover's Paradise or Texas Rock for Country Rollers for that matter -- there's no question that this is music that is vividly, excitedly alive and captures Sahm at a peak. It's pretty much irresistible.","torrent":{"xt":"urn:btih:2613b019aebb32d7f22772167fd6a24091472d4b","amp;dn":"Doug+Sahm+-+Doug+Sahm+and+Band+%5B1973%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2613b019aebb32d7f22772167fd6a24091472d4b","infoHashBuffer":{"type":"Buffer","data":[38,19,176,25,174,187,50,215,242,39,114,22,127,214,162,64,145,71,45,75]},"announce":[],"urlList":[]}}