{"title":"Appel_A.W._Modern_compiler_implementation_in_ML__1999.djvu","uid":8654256,"size":5482557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2619dd12e100e36a78428d4887c6fe210f60fd6c&amp;dn=Appel_A.W._Modern_compiler_implementation_in_ML__1999.djvu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"moebanzor","files":1,"time":1373177068,"description":"Modern Compiler Implementation in ML\nAndrew W Appel\n\nPublication Date: July 8, 2004 | ISBN-10: 0521607647 | ISBN-13: 978-0521607643\nThis new, expanded textbook describes all phases of a modern compiler: lexical analysis, parsing, abstract syntax, semantic actions, intermediate representations, instruction selection via tree matching, dataflow analysis, graph-coloring register allocation, and runtime systems. It includes good coverage of current techniques in code generation and register allocation, as well as functional and object-oriented languages, that are missing from most books. In addition, more advanced chapters are now included so that it can be used as the basis for two-semester or graduate course. The most accepted and successful techniques are described in a concise way, rather than as an exhaustive catalog of every possible variant. Detailed descriptions of the interfaces between modules of a compiler are illustrated with actual C header files. The first part of the book, Fundamentals of Compilation, is suitable for a one-semester first course in compiler design. The second part, Advanced Topics, which includes the advanced chapters, covers the compilation of object-oriented and functional languages, garbage collection, loop optimizations, SSA form, loop scheduling, and optimization for cache-memory hierarchies.\n","torrent":{"xt":"urn:btih:2619dd12e100e36a78428d4887c6fe210f60fd6c","amp;dn":"Appel_A.W._Modern_compiler_implementation_in_ML__1999.djvu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2619dd12e100e36a78428d4887c6fe210f60fd6c","infoHashBuffer":{"type":"Buffer","data":[38,25,221,18,225,0,227,106,120,66,141,72,135,198,254,33,15,96,253,108]},"announce":[],"urlList":[]}}