{"title":"101 Things I Learned in Film School &amp;ndash; Neil Landau ","uid":10750871,"size":3599002,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:261de758b4897e596b2b0083db0141f6aca910b8&amp;dn=101+Things+I+Learned+in+Film+School+%26ndash%3B+Neil+Landau+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1407871151,"description":"What are the essentials of screenplay structure? What's the difference between plot, story, and theme? What's the best camera angle to convey inner psychology? How are movie finances structured? \n\nThese questions and more are answered in this exquisitely packaged book by Neil Landau, an experienced screenwriter and script consultant to the major movie studios. Presented in the familiar format of the popular 101 THINGS I LEARNEDÂ® book series, 101 THINGS I LEARNED IN FILM SCHOOL's two-page, illustrated lessons will engage, inform, and inspire film school students, amateur filmmakers, high school grads, industry professionals, and casual aficionados.\n\nAbout the Author\nNeil Landau's credits include writing and producing for Universal Pictures, Disney, Columbia Pictures, and 20th Century Fox. He is the screenwriter of the teen comedy &quot;Don't Tell Mom the Babysitter's Dead&quot; and has worked on such diverse projects as &quot;Melrose Place,&quot; &quot;Doogie Howser MD,&quot; and MTV's &quot;Undressed.&quot; He recently completed his second book, The Screenwriter's Roadmap (Focal Press, 2012). He teaches at the University of Southern California School of Cinematic Arts. \n\nMatthew Frederick is an architect, urban designer, and the creator of the 101 THINGS I LEARNEDÂ® book series. He has taught architecture, urban design, and urban planning at a number of colleges and universities. He lives in Hudson, New York.","torrent":{"xt":"urn:btih:261de758b4897e596b2b0083db0141f6aca910b8","amp;dn":"101+Things+I+Learned+in+Film+School+%26ndash%3B+Neil+Landau+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"261de758b4897e596b2b0083db0141f6aca910b8","infoHashBuffer":{"type":"Buffer","data":[38,29,231,88,180,137,126,89,107,43,0,131,219,1,65,246,172,169,16,184]},"announce":[],"urlList":[]}}