{"title":"Bill Bryson- I'm a Stranger Here Myself - abridged","uid":3797901,"size":316551345,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:262ba93d667c67c69baa7168a909a303ef8bba4e&amp;dn=Bill+Bryson-+I%5C%27m+a+Stranger+Here+Myself+-+abridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"microwavspam","files":1,"time":1189123560,"description":"Read by the Author.\n128kbps\n44 kHz\nMP3 Format\n5cd in total\n\nENJOY!\n\n\n\n\nSynopses\nPublisher Comments:\nThe master humorist and bestselling author of A Walk in the Woods now guides us on an affectionate, hysterically funny tour of America&amp;#039;s most outrageous absurdities.\n\nAfter living in Britain for two decades, Bill Bryson recently moved back to the United States with his English wife and four children (he had read somewhere that nearly three million Americans believed they had been abducted by aliens ? as he later put it, &quot;it was clear my people needed me&quot;). They were greeted by a new-and-improved America that boasts microwave pancakes, twenty-four-hour dental-floss hotlines, and the staunch conviction that ice is not a luxury item.\n\nDelivering the brilliant comic musings that are a Bryson hallmark, I&amp;#039;m a Stranger Here Myself recounts his sometimes disconcerting reunion with the land of his birth. From motels (&quot;one of those things ? airline food is another ? that I get excited about and should know better&quot;) to careless barbers (&quot;in the mirror I am confronted with an image that brings to mind a lemon meringue pie with ears&quot;), I&amp;#039;m a Stranger Here Myself chronicles the quirkiest aspects of life in America, right down to our hardware-store lingo, tax-return instructions, and vulnerability to home injury (&quot;statistically in New Hampshire I am far more likely to be hurt by my ceiling or underpants than by a stranger&quot;).\n\nAlong the way Bill Bryson also reveals his rules for life (#1: It is not permitted to be both slow and stupid. You must choose one or the other); delivers the commencement address to a local high school (&quot;I&amp;#039;ve learned that if you touch a surface to see if it&amp;#039;s hot, it will be&quot;); and manages to make friends with a skunk. The result is a book filled with hysterical scenes of one man&amp;#039;s attempt to reacquaint himself with his own country, but it is also an extended, if at times bemused, love letter to the homeland he has returned to after twenty years away.","torrent":{"xt":"urn:btih:262ba93d667c67c69baa7168a909a303ef8bba4e","amp;dn":"Bill+Bryson-+I%5C%27m+a+Stranger+Here+Myself+-+abridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"262ba93d667c67c69baa7168a909a303ef8bba4e","infoHashBuffer":{"type":"Buffer","data":[38,43,169,61,102,124,103,198,155,170,113,104,169,9,163,3,239,139,186,78]},"announce":[],"urlList":[]}}