{"title":"White Identity (2011) by Samuel Jared Taylor","uid":10976686,"size":519060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26c11faf96edf1718734b9d79725713a9c865251&amp;dn=White+Identity+%282011%29+by+Samuel+Jared+Taylor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1409835684,"description":"White Identity - Racial Consciousness in the 21st Century (2011) by Samuel Jared Taylor.epub\n\nTen years in the making, this book is the sequel to Jared Taylor's seminal Paved With Good Intentions. In White Identity, Taylor systematically marshals the data to show that:\n\nPeople of all races pay lip service to the ideal of integration but generally prefer to remain apart.\n\nStudy after scientific study suggests that racial identity is an inherent part of human nature.\n\nDiversity of race, language, religion, etc. is not a strength for America but a source of chronic tension and conflict.\n\nNon-whites--especially blacks and Hispanics but now even Asians--openly take pride in their race and put group interests ahead of those of the country as a whole.\n\nOnly whites continue to believe that it is possible or even desirable to transcend race and try to make the United States a nation in which race does not matter.\n\nTaylor argues that America must reassess dated assumptions, and that we need policies based on a realistic understanding of race, not on fantasies.\n\nMost provocatively, Taylor argues that whites must exercise the same rights as other groups--that they must be unafraid of considering their own legitimate interests. He concludes by warning whites that if they do not defend their interests they will be marginalized by groups that do not hesitate to assert themselves, numerically and culturally.\n\nThe culmination of 25 years of writing about race, immigration, and America's future, this is Jared Taylor's best and most complete statement of why it is vitally important for whites to defend their legitimate group interests.\n\n344 pages\nPublisher: New Century Books; First edition (May 19, 2011)\nLanguage: English\nISBN-10: 0965638391\nISBN-13: 978-0965638395","torrent":{"xt":"urn:btih:26c11faf96edf1718734b9d79725713a9c865251","amp;dn":"White+Identity+%282011%29+by+Samuel+Jared+Taylor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26c11faf96edf1718734b9d79725713a9c865251","infoHashBuffer":{"type":"Buffer","data":[38,193,31,175,150,237,241,113,135,52,185,215,151,37,113,58,156,134,82,81]},"announce":[],"urlList":[]}}