{"title":"Strategy: A History","uid":9297310,"size":5457956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26d5866d86f12f81a579ec4a41e239664ad74f5b&amp;dn=Strategy%3A+A+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prabhu_","files":2,"time":1386177004,"description":"Strategy: A History\n\nby Lawrence Freedman\n &lt;a href=&quot;\nhttps://global.oup.com/academic/covers/pop-up/9780199325153&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://global.oup.com/academic/covers/pop-up/9780199325153&lt;/a&gt;\n\nabout book :-\n\nIn Strategy: A History, Sir Lawrence Freedman, one of the world's leading authorities on war and international politics, captures the vast history of strategic thinking, in a consistently engaging and insightful account of how strategy came to pervade every aspect of our lives. \n\nThe range of Freedman's narrative is extraordinary, moving from the surprisingly advanced strategy practiced in primate groups, to the opposing strategies of Achilles and Odysseus in The Iliad, the strategic advice of Sun Tzu and Machiavelli, the great military innovations of Baron Henri de Jomini and Carl von Clausewitz, the grounding of revolutionary strategy in class struggles by Marx, the insights into corporate strategy found in Peter Drucker and Alfred Sloan, and the contributions of the leading social scientists working on strategy today. The core issue at the heart of strategy, the author notes, is whether it is possible to manipulate and shape our environment rather than simply become the victim of forces beyond one's control. Time and again, Freedman demonstrates that the inherent unpredictability of this environment-subject to chance events, the efforts of opponents, the missteps of friends-provides strategy with its challenge and its drama. Armies or corporations or nations rarely move from one predictable state of affairs to another, but instead feel their way through a series of states, each one not quite what was anticipated, requiring a reappraisal of the original strategy, including its ultimate objective. Thus the picture of strategy that emerges in this book is one that is fluid and flexible, governed by the starting point, not the end point. \n\nA brilliant overview of the most prominent strategic theories in history, from David's use of deception against Goliath, to the modern use of game theory in economics, this masterful volume sums up a lifetime of reflection on strategy.\n\nAbout the Author :-\n\nLawrence Freedman has been Professor of War Studies at King's College London since 1982, and Vice-Principal since 2003. Elected a Fellow of the British Academy in 1995 and awarded the CBE in 1996, he was appointed Official Historian of the Falklands Campaign in 1997. He was awarded the KCMG in 2003. In June 2009 he was appointed to serve as a member of the official inquiry into Britain and the 2003 Iraq War. Professor Freedman has written extensively on nuclear strategy and the cold war, as well as commentating regularly on contemporary security issues. His most recent book, A Choice of Enemies: America Confronts the Middle East, won the 2009 Lionel Gelber Prize and Duke of Westminster Medal for Military Literature.\n &lt;a href=&quot;\nhttp://www.prospectmagazine.co.uk/wp-content/uploads/2013/11/Lawrence-Freedman--300x206.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.prospectmagazine.co.uk/wp-content/uploads/2013/11/Lawrence-Freedman--300x206.jpg&lt;/a&gt;\n\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n\n","torrent":{"xt":"urn:btih:26d5866d86f12f81a579ec4a41e239664ad74f5b","amp;dn":"Strategy%3A+A+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26d5866d86f12f81a579ec4a41e239664ad74f5b","infoHashBuffer":{"type":"Buffer","data":[38,213,134,109,134,241,47,129,165,121,236,74,65,226,57,102,74,215,79,91]},"announce":[],"urlList":[]}}