{"title":"9/11 The Road To Tyranny [DVD - NTSC - Alex Jones - NWO - Illumi","uid":3611566,"size":4681416704,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:270a10bb42484248d6453fddf3c8efe9edac3ac6&amp;dn=9%2F11+The+Road+To+Tyranny+%5BDVD+-+NTSC+-+Alex+Jones+-+NWO+-+Illumi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lkobescak","files":1,"time":1170688561,"description":"9/11: The Road to Tyranny\n------------------------- \n\n\n* Dozens of FBI and Defense Intelligence Agents were threatened with arrest by the Federal Government if they got in the way of Al-Qaeda operations. \n\n* How the CIA trained, funded and protected Bin Laden. \n\n* That impeachment lawyer David Schippers watrned congress and the justice department of the impending terrorist attacks. (The film includes an exclusive interview with Schippers on the Alex Jones Show just 2 weeks after the attacks. Schippers has since been threatened with arrest if he continues to speak out, and is begging the media and the American People to get this story out) \n\n* How the bloodthirsty globalists are using the terrorist attacks to scare the population into accepting high-tech slavery and a New World Order Police State. \n\n* How the recently declassified top-secret Northwoods Document written by the Joint Chiefs of Staff laid out the plans to bomb Washington and to hijack airplanes as a pretext for war. \n\n* Bill Clintons involvement in the Oklahoma City Bombing and how it was carried out by intelligence agencies to be blamed on the right-wing. \n\n* How the FBI ordered their informants to cook the bomb and train the drivers in the first World Trade Center attack in 1993. \n\n* Why the USA PATRIOT ACT is unconstitutional and un-American. \n\n* Why the government leaves our borders wide-open but tells us to give up our liberties for security and that more terrorist attacks are imminent. \n\n* FBI training manuals that are being given to police departments that state that christians, gun owners, and *Those who make frequent references to the US Constitution* are terrorists. \n\n* The unfolding cashless society biometric control-grid. \n\n* And much, much more... \n\n\nRun Time 2 hrs 22 minutes\n\n\nTo Purchase this or other Alex Jones Videos, please visit\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO and the great threat to you can be found ator www.prisonplanet.com\n\n------------------------------------------------------------------------ \n","torrent":{"xt":"urn:btih:270a10bb42484248d6453fddf3c8efe9edac3ac6","amp;dn":"9%2F11+The+Road+To+Tyranny+%5BDVD+-+NTSC+-+Alex+Jones+-+NWO+-+Illumi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"270a10bb42484248d6453fddf3c8efe9edac3ac6","infoHashBuffer":{"type":"Buffer","data":[39,10,16,187,66,72,66,72,214,69,63,221,243,200,239,233,237,172,58,198]},"announce":[],"urlList":[]}}