{"title":"Ethnic Conflicts: Their Biological Roots in Ethnic Nepotism","uid":10896531,"size":7629491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:280d4f10be1374f0403f703e5991b8fe8c557b56&amp;dn=Ethnic+Conflicts%3A+Their+Biological+Roots+in+Ethnic+Nepotism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1409159093,"description":"Ethnic Conflicts - Their Biological Roots in Ethnic Nepotism (2012) by Tatu Vanhanen.pdf\n\nIn recent decades ethnic conflict has killed many millions and diminished the lives of many more. In Ethnic Conflicts: Their Biological Roots in Ethnic Nepotism Tatu Vanhanen turns his attention to this vital subject following his ground-breaking studies of democratization and economic development.\n\nThis is a replication on the global stage of his widely cited 1991 study of ethnic conflict in India. It is an evolutionary analysis that combines nuance and quantitative rigor. Vanhanen's starting assumption, that all humans share a common human nature in which nepotism can extend to ethnic kin, is already far ahead of culture-based analyses.\n\nMarshalling data on 176 contemporary societies, Vanhanen finds that 66% of global variation in ethnic conflict is explained by heterogeneity. This is the sort of robust result that comes from using palpable biological variables. There are many other causes of ethnic conflict but none as strong as ethnic diversity. Per capita income, level of human development, and level of democratization explain only between 6% and 16% of variation. Vanhanen concludes that because the predisposition to ethnic nepotism is engraved in the human genome, ethnic conflict will continue into the future. \n\n326 pages\nPublisher: Ulster Institute for Social Research (November 30, 2012)\nISBN-10: 0957391315\nISBN-13: 978-0957391314","torrent":{"xt":"urn:btih:280d4f10be1374f0403f703e5991b8fe8c557b56","amp;dn":"Ethnic+Conflicts%3A+Their+Biological+Roots+in+Ethnic+Nepotism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"280d4f10be1374f0403f703e5991b8fe8c557b56","infoHashBuffer":{"type":"Buffer","data":[40,13,79,16,190,19,116,240,64,63,112,62,89,145,184,254,140,85,123,86]},"announce":[],"urlList":[]}}