{"title":"James Hollis - Through the Dark Wood (Psychology Audiobook)","uid":11441818,"size":213676890,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2827eb6fe95af96cf3ec81fba1e9b4623d9a58dc&amp;dn=James+Hollis+-+Through+the+Dark+Wood+%28Psychology+Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":7,"time":1415816574,"description":"Through the Dark Wood (Audio Learning Course)\n\nAuthor: James Hollis\nFrom The Jung Center Houston \n\nRunning time: 7 1/4 hours\n\n\nHave you ever looked at your career, your relationships, or your role in life and wondered, &quot;Is this why I'm really here?&quot; \n\nIf so, then you are ready for your &quot;midlife crisis&quot; - the pivotal time when you have the opportunity to become the person your soul seeks to be.\n\n&quot;When the illusions of our youth begin to crumble,&quot; explains James Hollis, &quot;we reach a turning point that the poet Dante called the 'dark wood.'&quot; \n\nWith Through the Dark Wood, this author and Jungian analyst reveals the steps we all must take on our road to true maturity, meaning, and fulfillment.\nHow do you know when you've reached the &quot;second half&quot; of life? \n\nAccording to Hollis, the first sign comes when you feel dissatisfied by where you are today - and hear a call from within to live a more purposeful life. \n\nThis marks the collision between your &quot;False Self,&quot; created from the expectations of others, and your instinctive &quot;True Self.&quot; \n\nDrawing upon his experiences with hundreds of clients, Hollis provides an essential map for traversing the universal challenges of midlife, such as building genuine relationships, cultivating a mature spirituality, and letting go of old beliefs that no longer serve you.\n\n\n&quot;The second half of life isn't about looking for easy answers,&quot; James Hollis says. &quot;It's about honestly exploring the questions that bring richness and value to your life.&quot; \n\nWith Through the Dark Wood, this penetrating thinker shares a lifetime of insights about how to navigate your life's most turbulent passages - and emerge from the darkness wiser, stronger, and in greater harmony with our soul's purpose","torrent":{"xt":"urn:btih:2827eb6fe95af96cf3ec81fba1e9b4623d9a58dc","amp;dn":"James+Hollis+-+Through+the+Dark+Wood+%28Psychology+Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2827eb6fe95af96cf3ec81fba1e9b4623d9a58dc","infoHashBuffer":{"type":"Buffer","data":[40,39,235,111,233,90,249,108,243,236,129,251,161,233,180,98,61,154,88,220]},"announce":[],"urlList":[]}}