{"title":"Edmond Jabes - A Foreigner Carrying in the Crook of His Arm a Ti","uid":10174094,"size":1735632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:282b1a2b016d625dfe5c2d1e18525c5893932757&amp;dn=Edmond+Jabes+-+A+Foreigner+Carrying+in+the+Crook+of+His+Arm+a+Ti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1400447359,"description":"Edmond Jabes - A Foreigner Carrying in the Crook of His Arm a Tiny Book (Wesleyan UP, 1993; first published in French in 1989). Translated by Rosmarie Waldrop. 115 pp.\n\nBy request; the only book I can find by this writer. This is a reprocessed version of an older scan, with the usual changes: pages split &amp; centered; processed with clearscan; metadata &amp; bookmarks added. Thanks to the original scanner.\n\n\nreviews:\n\nFrom Publishers Weekly\n\nIn this illuminating philosophical book, Jabes, who died in 1991 and lived in France after being forced to leave Egypt with other native-born Jews during the Suez War, ruminates on the link between being Jewish and being mislabeled as a foreigner. It is also an indictment of bigotry. Jabes writes, &quot;the basic racist is the man who refuses himself as he is. . . . The antisemite can never forgive the Jews for being capable of self-realization. . . .&quot; Elsewhere he observes in verse on his own experience of exile: &quot;I left a land not mine / for another, not mine either. / I took refuge in a word of ink with the book for space, / word from nowhere, obscure word of the desert.&quot; His seamless style brings to mind both religious and French existential writings, although some musings reach heights too abstract to follow: &quot;We must from now on grant citizen's rights to the foreigner's new name: the foreign I. / Foreign Me, foreign You designated by the I.&quot; Here, too, Jabes (The Book of Questions) evokes powerful images of the desert to underscore a mood of isolation and comments wisely about aging and power. \n\n\nFrom Library Journal\n\nJabes's last book is a response to the increasing racism in France that he witnessed before his death in 1991. The author, himself a foreigner who was exiled from Egypt after the Suez crisis in 1956, identifies with the &quot;wandering Jew.&quot; Jabes attests that the writer is the most foreign of the foreign and takes refuge in the book, which can never deport him. But any book is inevitably doomed to failure because it emulates a mythic, unattainable book. Jabes establishes a dialog between several interlocutors who pose unanswerable questions about life and its meaning. Readers unfamiliar with Jabes's style will not enjoy this book; however, knowledgeable readers will relish Jabes's new ways of writing poetry and his insights on existence and meaning. Waldrop's translation is readable and natural. Recommended for scholars, poets, and Jabes fans.\n","torrent":{"xt":"urn:btih:282b1a2b016d625dfe5c2d1e18525c5893932757","amp;dn":"Edmond+Jabes+-+A+Foreigner+Carrying+in+the+Crook+of+His+Arm+a+Ti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"282b1a2b016d625dfe5c2d1e18525c5893932757","infoHashBuffer":{"type":"Buffer","data":[40,43,26,43,1,109,98,93,254,92,45,30,24,82,92,88,147,147,39,87]},"announce":[],"urlList":[]}}