{"title":"The Toxic Avenger part 2 - (UNCUT) DVDRIP","uid":4163996,"size":1183224874,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2882d130aa0c3dbe65c9adda1d88d0a7aaafcaf6&amp;dn=The+Toxic+Avenger+part+2+-+%28UNCUT%29+DVDRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"circlensess","files":1,"time":1209514089,"description":" &lt;a href=&quot;http://img245.imageshack.us/my.php?image=toxie2hm8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img245.imageshack.us/my.php?image=toxie2hm8.jpg&lt;/a&gt;\n\nThe Toxic Avenger part 2 (UNCUT) DVDRIP.Midgard666..avi\t\n\nPlot: The Toxic Avenger is lured to Tokyo, Japan by the evil corporation Apocalypse Inc. So while the Toxic Avenger is fighting crime in Tokyo...\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0098503/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0098503/&lt;/a&gt;\n\nAnother great Troma Movie \n\nHaving rid Tromaville of crime, the Toxic Avenger sets his sight on a new foe - the evil multinational corporation Apocalypse, Inc., who pan to to transform Tromaville into the &quot;Toxic Waste Capital of the World.&quot; They hatch a plan to lure Toxie to Japan in search of his father as they take over Tromaville. Can Toxie save his father (and master the ancient art of Sumo) and return from Tokyo in time to stop the evil executives... or is it already too late?\n\n\n\n\nDivx\nMovie Size: 1.10GB\nMovie Length: 01:42:54\nVideo Width x Height: 640 x 480\nVideo FPS/Bitrate: 25 / 1520 kbit/s\nAudio Bitrate: 320 Kbit/s\nAudio Channels: 2 (Stereo)\nLanguage: English\n\nNot as good as the first but still awesome fun!, 20 December 2006\n\nAuthor: LoneWolfAndCub from Australia \n\nThe Toxic Avenger is a hilarious, fun, gory and exciting picture that really has it all. I didn&amp;#039;t hear a lot of good things about the second tale of Toxie which was really bad to hear. Most of this negative attitude was centered around the &quot;unrated&quot; DVD that was actually heavily edited. Luckily the one I got was the true Director&amp;#039;s Cut that ran around 106 minutes. This one had pretty much everything the first one had but the main thing that annoyed me was the change of actors. It just wasn&amp;#039;t the same, the actors from the first weren&amp;#039;t good but they brought a charm to the characters.\n\nThe plot in this one is crazier than that of the first. This time The Toxic Avenger is lured into Tokyo, Japan by Apocalypse Inc. While he is fighting crime in Tokyo Apocalypse Inc. is reeking havoc in Tromaville. As usual, it&amp;#039;s up to Toxie to save the day.\n\nThe &quot;unrated&quot; version, as talked about before, apparently omits all the gore. And boy, there&amp;#039;s a lot of it. We see plenty of great, gory stuff like intestines getting blown out of a guy&amp;#039;s stomach from severe wheelchair trauma, roses being shoved into a man&amp;#039;s eyes, someone getting chopped into sushi and much, much more. And the effects are actually really good.\n\nPlease, don&amp;#039;t go into this seriously, take your brain out and watch it. It&amp;#039;s a lot of fun and it should please Troma fans and gorehounds alike! 3/5.\n\nEnjoy a second helping ","torrent":{"xt":"urn:btih:2882d130aa0c3dbe65c9adda1d88d0a7aaafcaf6","amp;dn":"The+Toxic+Avenger+part+2+-+%28UNCUT%29+DVDRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2882d130aa0c3dbe65c9adda1d88d0a7aaafcaf6","infoHashBuffer":{"type":"Buffer","data":[40,130,209,48,170,12,61,190,101,201,173,218,29,136,208,167,170,175,202,246]},"announce":[],"urlList":[]}}