{"title":"Penguins Spy in the Huddle Complete EN SUB x265 720p [MPup]","uid":12359336,"size":1345639988,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:298bdc6fb334bdeb51f844648b6d5b324f3eb26b&amp;dn=Penguins+Spy+in+the+Huddle+Complete+EN+SUB+x265+720p+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"makinapufterpup","files":6,"time":1441512356,"description":"Penguins Spy in the Huddle Complete EN SUB x265 720p WEBRIP [MPup] Narrator David Tennant\n\nFormat: HVEC\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nPenguins - Spy in the Huddle spends nearly a year in their close company of penguins, deploying 50 spycams to capture as never before the true character of these birds.\n\n[img]http://extraimago.com/images/2015/09/06/7009adfa7e8d181178b6f41fdeb45553.png[/img]\n\nPenguins.Spy.in.the.Huddle.s01e01.The.Journey\n\nPenguins as they have never been seen before. From the freezing Antarctic to the scorching tropics, 50 spy cameras capture unique footage of three extraordinary species.\n\nEmperor penguins cross a treacherous frozen sea to reach their breeding grounds, and on the way one becomes lost in a blizzard. Once there, the females flipper flight over the males and those that succeed waddle-walk with their partners. They must lay their eggs without touching the ice, but it is the males that face the greatest challenge - overwintering alone in the coldest place on earth.\n\nRockhoppers brave the world's stormiest seas, only to come ashore and face a daunting assault up a 300-foot cliff, hopping most of the way up. Having laid their eggs, these plucky birds face airborne attacks from skuas and vultures.\nHumboldts are a strange tropical penguin that have rarely been filmed. To reach their desert nests they negotiate 20,000 predatory sea lions, dodge vampire bats and battle half a million sharp-beaked seabirds.\n\nThe hard work for all the penguins finally pays off when their tiny, vulnerable chicks begin to hatch.\n\nAmong the spy cameras capturing unique behaviour is a technological first - robotic penguins with cameras for eyes.\n\nPenguins.Spy.in.the.Huddle.s01e02.First.Steps\n\nWatched by spycams, chicks are hatching out all over. Male emperors form an identity parade before handing over their newborns to the returning females. The mothers shuffle into a huddle to protect their offspring from a blizzard. Outside, one tiny chick doesn't make it and lies frozen by his mother. Chickcam films the young ones walking on their mothers' feet and taking their own first unsteady steps. Females without young try to kidnap the new arrivals and giant petrels force the chicks to huddle for protection.\n\nOn the Falklands, rockhopper chicks meet some unruly neighbours - king cormorants. Predatory vultures are seen off by a penguin army. Caracara birds grab an eggcam and film the aerial shots of the colony! Parents take a rock shower and even 'chimney climb' to their own private spa. The chicks face more predators and bereaved parents plan a chicknap.\n\nIn Peru, Humboldt chicks emerge into the desert. The adults leave their burrow plastered in mud and needing a bath. They're joined in the waves by Humboltcam and boisterous fur seals. Home alone, the chicks shoot gulls with projectile poo and the colony faces a huge cormorant invasion.\n\nThe chicks are learning to become adult penguins.\n\nPenguins.Spy.in.the.Huddle.s01e03.Growing.Up\n\nThe chicks are growing up fast and becoming increasingly independent. Emperor and rockhopper chicks are placed in a creche as their parents go fishing. The Humboldts are left in their burrows as the adults enjoy a soft landing of feathers by a beach swarming with cormorants.\n\nPacked in a huddle, the emperor chicks have to be identity-checked before they are fed, and their parents are swamped by hungry impostors. Giant petrels are an ever-present danger, while vampire bats target the Humboldts. As the young grow bigger and preen out baby fluff, they sport punk hairdos. The emperor chicks go skating on a newly formed ice rink, while the rockhopper chicks practise jumping skills.\n\nEventually all the chicks leave for the sea, tackling the same hazards as their parents before them, from sea lions to predatory birds, high cliffs to glaciers. All face huge challenges. There are plenty of surprises along the way, but soon the chicks discover their true home - the sea.\n\nFrom egg to adolescent, spycams have been with the young penguins through their tough early months. They are with them as they leave. It will be years before they follow in their parents' footsteps and return to breed","torrent":{"xt":"urn:btih:298bdc6fb334bdeb51f844648b6d5b324f3eb26b","amp;dn":"Penguins+Spy+in+the+Huddle+Complete+EN+SUB+x265+720p+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298bdc6fb334bdeb51f844648b6d5b324f3eb26b","infoHashBuffer":{"type":"Buffer","data":[41,139,220,111,179,52,189,235,81,248,68,100,139,109,91,50,79,62,178,107]},"announce":[],"urlList":[]}}