{"title":"The Encyclopedia of Biblical Errancy by C. Dennis McKinsey","uid":8516498,"size":30649468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:298f8e48ed8891886cabb41542d2cf81c6b865d1&amp;dn=The+Encyclopedia+of+Biblical+Errancy+by+C.+Dennis+McKinsey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kundalini666","files":1,"time":1369754530,"description":"This important new volume is the most comprehensive critique of the Bible ever written.\n\nAuthor C. Dennis McKinsey believes that Americans have only seen or heard the good things about the Bible, without any exposure to its many shortcomings. McKinsey argues that the lack of criticism of biblical writings has wrongly affected millions of people in their beliefs, allowing many to believe the Bible to be the infallible word of God. He maintains that it is becoming imperative not only that the Bible's inadequacies be exposed, but that its negative teachings be corrected.\n\nMcKinsey thinks the Bible is a deceptively inaccurate conglomeration of mythology and folklore masquerading as a valid picture of historical reality. In The Encyclopedia of Biblical Errancy, McKinsey strives to tell both the good and the bad of biblical writings with the most comprehensive and thoroughly-researched expos? of the Bible's many errors, contradictions, and fallacies. Loaded with thousands of biblical citations, The Encyclopedia of Biblical Errancy vividly proves the Bible to be its own worst enemy.","torrent":{"xt":"urn:btih:298f8e48ed8891886cabb41542d2cf81c6b865d1","amp;dn":"The+Encyclopedia+of+Biblical+Errancy+by+C.+Dennis+McKinsey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298f8e48ed8891886cabb41542d2cf81c6b865d1","infoHashBuffer":{"type":"Buffer","data":[41,143,142,72,237,136,145,136,108,171,180,21,66,210,207,129,198,184,101,209]},"announce":[],"urlList":[]}}