{"title":"Luiz BonfÃƒÂ¡ - O ViolÃƒÂ£o e o Samba (1962) [Jazz Latin][flac][scho","uid":5039022,"size":191112485,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:29c94c6c8ca2e5d3fd13e8a9c77d3e3fe12c8af0&amp;dn=Luiz+Bonf%C3%83%C2%A1+-+O+Viol%C3%83%C2%A3o+e+o+Samba+%281962%29+%5BJazz+Latin%5D%5Bflac%5D%5Bscho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":8,"time":1249281236,"description":"Luiz BonfÃƒÂ¡ - O ViolÃƒÂ£o e o Samba \nYear: 1962\nQuality: flac (single file) with cue\n\nLuiz Floriano BonfÃƒÂ¡ (October 17, 1922 - January 12, 2001) was a Brazilian guitarist and composer best known for the compositions he penned for the film Black Orpheus. \n\nBonfÃƒÂ¡ was born on October 17, 1922 in Rio de Janeiro.  He began teaching himself to play guitar as a child; he studied in Rio with Uruguayan classical guitarist IsaÃƒÂ­as SÃƒÂ¡vio from the age of twelve.  These weekly lessons entailed a long, harsh commute by rail and on foot from his family home in the western rural outskirts of Rio de Janeiro to the teacher's home in the hills of Santa Teresa.  Given BonfÃƒÂ¡'s extraordinary dedication and talent for the guitar, SÃƒÂ¡vio excused the youngster's inability to pay for his lessons. \n\nBonfÃƒÂ¡ first gained widespread exposure in Brazil in 1947 when he was featured on Rio's RÃƒÂ¡dio Nacional, then an important showcase for up-and-coming talent.  He was a member of the vocal group Quitandinha Serenaders in the late 1940s.  Some of his compositions were recorded and performed by Brazilian crooner Dick Farney in the 1950s.  It was through Farney that BonfÃƒÂ¡ was introduced to Antonio Carlos Jobim and Vinicius de Moraes, the leading songwriting team behind the worldwide explosion of Brazilian jazz/pop music in the late 1950s and 1960s.  BonfÃƒÂ¡ collaborated with these and with other prominent Brazilian musicians and artists in productions of de Moraes' anthological play Orfeu da ConceiÃƒÂ§ÃƒÂ£o, which several years later gave origin to Marcel Camus' legendary film &quot;Black Orpheus&quot; (Orfeu Negro in Portuguese).  In the burgeoning days of Rio de Janeiro's thriving jazz scene, it was commonplace for musicians, artists, and dramatists to collaborate in such theatrical presentations.  BonfÃƒÂ¡ wrote some of the original music featured in the film, including the numbers &quot;Samba de Orfeu&quot; and his most famous composition, &quot;ManhÃƒÂ£ de Carnaval&quot; (translated to English as &quot;A Day in the Life of a Fool&quot; ), which has been among the top ten standards played worldwide, according to The Guinness Book of World Records. \n\nAs a composer and performer, BonfÃƒÂ¡ was at heart an exponent of the bold, lyrical, lushly orchestrated, and emotionally charged samba-canÃƒÂ§ÃƒÂ£o style that predated the arrival of JoÃƒÂ£o Gilberto's more refined and subdued bossa nova style.  Jobim, JoÃƒÂ£o Donato, Dorival Caymmi, and other contemporaries were also essentially samba-canÃƒÂ§ÃƒÂ£o musicians until the sudden, massive popularity of the young Gilberto's unique style of guitar playing and expressively muted vocals transformed the music of the day into the music of the future.  Camus' film and Gilberto's and Jobim's collaborations with American jazzmen such as Stan Getz and Charlie Byrd did much to bring Brazilian popular music to the attention of the world, and BonfÃƒÂ¡ became a highly visible ambassador of Brazilian music in the United States beginning with the famous November 1962 Bossa Nova concert at New York's Carnegie Hall. \n\nBonfÃƒÂ¡ lived in the USA from the early 1960s until 1975.  He worked with American musicians such as Quincy Jones, George Benson, Stan Getz, and Frank Sinatra, recording several albums while in United States.  Elvis Presley sang a BonfÃƒÂ¡ composition, &quot;Almost in Love&quot;, in the 1968 MGM film &quot;Live a Little, Love a Little&quot;.  BonfÃƒÂ¡ remained well-connected in the US after returning to Brazil, but his profile receded into relative obscurity during his final decades.  His last album, 1997's &quot;Almost in Love&quot;, was a collaboration with Brazilian singer Ithamara Koorax. \n\nBonfÃƒÂ¡ died in Rio de Janeiro on January 12, 2001 from prostate cancer complicated by ischemia.  He was 78 years old. \n\nIn 2005, Smithsonian Folkways Recordings released an album of BonfÃƒÂ¡'s work, entitled, &quot;Solo in Rio 1959&quot;, which included previously unreleased material from the original recording session. \n\nIn 2008, Universal Music France released a coffee table book containing two CDs which included previously unreleased material of &quot;Black Orpheus&quot; soundtrack, and a DVD.  Also in 2008, Universal Music released &quot;The Brazilian Scene&quot; , &quot;Braziliana&quot; and &quot;Black Orpheus&quot; celebrating the 50th anniversary of the bossa nova. \n\nBonfÃƒÂ¡'s major legacy continues to be his compositions from the &quot;Black Orpheus&quot; soundtrack, most notably the instantly recognizable bossa nova classic &quot;ManhÃƒÂ£ de Carnaval. &quot; But BonfÃƒÂ¡'s huge discography also attests to his uniquely inventive mastery of Brazilian jazz guitar.  BonfÃƒÂ¡'s guitar style was brassier and more penetrating than that of his major contemporary, JoÃƒÂ£o Gilberto, and BonfÃƒÂ¡ was a frequent and adept soloist whereas Gilberto plays his own suave, intricate brand of rhythm guitar almost exclusively.  BonfÃƒÂ¡ often played solo guitar in a polyphonic style, harmonizing melody lines in a manner similar to that made famous by Wes Montgomery in the USA, or playing lead and rhythm parts simultaneously.  As a composer and as a guitarist, BonfÃƒÂ¡ played a pivotal role in bridging the incumbent samba-canÃƒÂ§ÃƒÂ£o style with the innovations of the bossa nova movement.  ~ wikipedia\n\nLuiz BonfÃƒÂ¡ - O ViolÃƒÂ£o e o Samba Tracklisting:\n01  InquietaÃƒÂ§ÃƒÂ£o (2:27)\n02  Nossos Momentos (2:35)\n03  Meu Nome ÃƒÂ© NinguÃƒÂ©m (1:45)\n04  Lamento No Morro (2:10)\n05  Pastorinhas (2:40)\n06  Voce Chegou Sorrindo (2:26)\n07  MurmÃƒÂºrio (2:31)\n08  Liberdade Demais (1:56)\n09  Amor Em Brasilia (2:19)\n10  Saudade Da Bahia (Longing For Bahia) (2:30)\n11  Copacabana (2:03)\n12  Amor De SolidÃƒÂ£o (2:43)\n\namazing Japanese fan's link featuring BonfÃƒÂ¡'s prodigious recorded output can be found here:  &lt;a href=&quot;\nhttp://www.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.&lt;/a&gt; kanji. zinbun. kyoto-u. ac. jp/~yasuoka/Bonfa/","torrent":{"xt":"urn:btih:29c94c6c8ca2e5d3fd13e8a9c77d3e3fe12c8af0","amp;dn":"Luiz+Bonf%C3%83%C2%A1+-+O+Viol%C3%83%C2%A3o+e+o+Samba+%281962%29+%5BJazz+Latin%5D%5Bflac%5D%5Bscho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c94c6c8ca2e5d3fd13e8a9c77d3e3fe12c8af0","infoHashBuffer":{"type":"Buffer","data":[41,201,76,108,140,162,229,211,253,19,232,169,199,125,62,63,225,44,138,240]},"announce":[],"urlList":[]}}