{"title":"Primal Fetish Night Raven's Dark Addiction 720p","uid":12402325,"size":1105536616,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2a0489fd8f4551de294108056212605c5ca7337e&amp;dn=Primal+Fetish+Night+Raven%27s+Dark+Addiction+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"TKTh3K1ng","files":2,"time":1442045136,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/CMv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/CMv&lt;/a&gt;\n\nNight Raven is investigating the disappearance of numerous superheroines and persons listed on the &quot;Enhanced Meta-Human&quot; directory. HQ has directed her to hide inside an exclusive night club until after closing to see if she can find any clues as many leads indicate suspicious activity. She changes from her undercover party girl dress into her uniform which the agency has stashed for her\n\nNight Raven is taken with a rag by a skilled enemy that got the drop on her. She doesn't drop easy, she is resistant to most incapacitating agents, but this time she is overcome. Night Raven wakes up with warm liquid being poured down her throat and finds herself bound with her number one suspect Gregorian Grigio looming over her\n\n&quot;Do you think you are going to get me drunk?&quot; she asks with confident disdain\n\nBut Grigio mocks her, he knows about her super healing and metabolism. But the cocktail he is giving her is harmless...to &quot;real humans&quot; it might as well be club soda. On superheroines it will have the affect of wiping way inhibitions, inducing euphoria, and having agonizing withdrawals. Now Night Raven's powers work against her. her body neutralizes the compound so quickly she goes from lust-filled ecstasy to shivering agony in minutes\n\nShe tires to resist but after a while Girgio has her begging for another sip. Over and over she goes through the cycle with Grigio taking greater and greater advantage","torrent":{"xt":"urn:btih:2a0489fd8f4551de294108056212605c5ca7337e","amp;dn":"Primal+Fetish+Night+Raven%27s+Dark+Addiction+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a0489fd8f4551de294108056212605c5ca7337e","infoHashBuffer":{"type":"Buffer","data":[42,4,137,253,143,69,81,222,41,65,8,5,98,18,96,92,92,167,51,126]},"announce":[],"urlList":[]}}