{"title":"ACDC - Let There Be Rock (1977) WMA320","uid":6092696,"size":106133976,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2ad510ea3618b7492ec00868d32b8a8dae08efed&amp;dn=ACDC+-+Let+There+Be+Rock+%281977%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1294631194,"description":"In my humble opinion, this is, by far, AC/DC's best album. It is rawer, faster, heavier, nastier and more brutal than &quot;High Voltage&quot; or any other album by them, and I'm sure that, at the time, not too many thought that was possible. \n\n1. Go Down-5/5. Excellent upbeat, hard driving song with very sexually charged lyrics. You can almost imagine Bon Scott saying these things to the women he would meet. This song has a driving beat that doesn't let up. \n2. Dog Eat Dog-5/5. Another great, heavy, upbeat song. The lyrics are one of Bon Scott's best and actually had something to say besides his typical rock 'n' roll lyrics. One of the best. \n3. Let There Be Rock-5/5. Another signature AC/DC song. The lyrics to this are the best ever for AC/DC. Although this song is long, it never wears you down because the fast beat never slows down. One of their best ever. \n4. Bad Boy Boogie-4/5. A little bluesy, with a bit of a dancy feel to it. One of the weaker songs on here, but still great. \n5. Problem Child-3/5. This is one of my least favorite songs ever by AC/DC. I wish that &quot;Crabsody In Blue&quot; would have been put on here instead as it was on the Australian release. It's just a bit too long and a little boring. \n6. Overdose-4/5. Heavy riffing with an excellent vocal delivery from Bon Scott. Hard driving rocker, if a bit too long. \n7. Hell Ain't A Bad Place To Be-5/5. Another fantastic heavy rocker. Hard driving and full of attitude. One of the best on the album. \n8. Whole Lotta Rosie-5/5. My personal favorite AC/DC song ever. This song is fast and furious, nasty and sexy, driving and relentless. This has AC/DC's best guitar riff and Bon Scott's best vocal delivery. Absolutely perfect! \n\nThis is the most furious, raw and heavy album that AC/DC ever created. The songs definetly live up to the great title. I consider this one of rock's greatest albums ever, whether you are an AC/DC fan or not. \n\nby D. Haralson\n\nTRACKLIST:\n\n01 - Go Down.wma                                                 \n02 - Dog Eat Dog.wma                                             \n03 - Let There Be Rock.wma                                       \n04 - Bad Boy Boogie.wma                                          \n05 - Problem Child.wma                                           \n06 - Overdose.wma                                                \n07 - Hell Ain't A Bad Place To Be.wma                            \n08 - Whole Lotta Rosie.wma                                       \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:2ad510ea3618b7492ec00868d32b8a8dae08efed","amp;dn":"ACDC+-+Let+There+Be+Rock+%281977%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ad510ea3618b7492ec00868d32b8a8dae08efed","infoHashBuffer":{"type":"Buffer","data":[42,213,16,234,54,24,183,73,46,192,8,104,211,43,138,141,174,8,239,237]},"announce":[],"urlList":[]}}