{"title":"The World at War - 12. Whirlwind (Bombing Germany 1939-1944).avi","uid":3712936,"size":734011392,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2aee58d4d7464630c4e9fe7716ddd6691246a923&amp;dn=The+World+at+War+-+12.+Whirlwind+%28Bombing+Germany+1939-1944%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aelfinn","files":1,"time":1181744028,"description":"The World at War - 12. Whirlwind (Bombing Germany 1939-1944)\n\nPart 12 of the 26-episode series. 52:11 min., Xvid/MP3, 592x448, ~1770 Kbps.\n(All 26 episodes upcoming, including the oft-missing ep. 10.\nSeeding will be appr. every other day, initially in super-seed mode, so you&amp;#039;d better share.)\n\nAmazon.co.uk Review\nWhen this epic series was first broadcast in 1973 it redefined the gold standard for television documentary; it remains the benchmark by which all factual programming must judge itself. Originally shown as 26 one-hour programmes, The World at War set out to tell the story of the Second World War through the testimony of key participants. The result is a unique and unrepeatable event, for many of the eyewitnesses captured on film did not have long left to live: the programme-makers were only just in time. Each hour-long programme is carefully structured to focus on a key theme or campaign, from the rise of Nazi Germany to Hitler&amp;#039;s downfall and the onset of the Cold War. There are no academic &quot;talking heads&quot; here to spell out an official version of history; the narration, delivered with wonderful gravitas by Sir Laurence Olivier, is kept to a minimum. The show&amp;#039;s great coup was to allow the participants to speak for themselves. Painstaking research in the archives of the Imperial War Museum also unearthed a vast quantity of newsreel footage, including on occasion the cameraman&amp;#039;s original raw rushes which present an unvarnished and never-before-seen picture of important events. Carl Davis&amp;#039; portentous main title theme and score underlines the grand scale of the enterprise. The original 26 episodes were supplemented three years later by six special programmes (narrated by Eric Porter), bringing the total running time to a truly epic 32 hours. --Mark Walker","torrent":{"xt":"urn:btih:2aee58d4d7464630c4e9fe7716ddd6691246a923","amp;dn":"The+World+at+War+-+12.+Whirlwind+%28Bombing+Germany+1939-1944%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aee58d4d7464630c4e9fe7716ddd6691246a923","infoHashBuffer":{"type":"Buffer","data":[42,238,88,212,215,70,70,48,196,233,254,119,22,221,214,105,18,70,169,35]},"announce":[],"urlList":[]}}