{"title":"An Introduction to Archaeological Chemistry","uid":9778584,"size":10667788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b18eb2402b48a58e02b24755a0d5b3fffd040ab&amp;dn=An+Introduction+to+Archaeological+Chemistry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1395072591,"description":"\n T. Douglas Price, James H. Burton, &quot;An Introduction to Archaeological Chemistry&quot; \n 2010 | pages: 345 | ISBN: 1441963758 | PDF | 10,2 mb\n\n Archaeological chemistry is a subject of great importance to the study and methodology of archaeology. This comprehensive text covers the subject with a full range of case studies, materials, and research methods. With twenty years of experience teaching the subject, the authors offer straightforward coverage of archaeological chemistry, a subject that can be intimidating for many archaeologists who do not already have a background in the hard sciences. With clear explanations and informative illustrations, the authors have created a highly approachable text, which will help readers overcome that intimidation. Topics covered included: Materials (rock, pottery, bone, charcoal, soils, metals, and others), Instruments (microscopes, NAA, spectrometers, mass spectrometers, GC/MS, XRF &amp; XRD, Case Studies (Provinience, Sediments, Diet Reconstruction, Past Human Movement, Organic Residues). The detailed coverage and clear language will make this useful as an introduction to the study of archaeological chemistry, as well as a useful resource for years after that introduction.\n\n","torrent":{"xt":"urn:btih:2b18eb2402b48a58e02b24755a0d5b3fffd040ab","amp;dn":"An+Introduction+to+Archaeological+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b18eb2402b48a58e02b24755a0d5b3fffd040ab","infoHashBuffer":{"type":"Buffer","data":[43,24,235,36,2,180,138,88,224,43,36,117,90,13,91,63,255,208,64,171]},"announce":[],"urlList":[]}}