{"title":"The Bible: A Deadly Book - Dr. Peter S. Ruckman","uid":10345872,"size":15699406,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b3e9ac78360102a339c7b8238b02951522a48e1&amp;dn=The+Bible%3A+A+Deadly+Book+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1402602060,"description":"This work is a sequel to both &quot;Israel: A Deadly Piece of Dirt&quot; and &quot;The Holy Scriptures vs. the Holy Koran.&quot; Its purpose is to prove that the UN cannot proceed one step futher in its plan to integrate all races, cultures, nations, and religions into a one-world totalitarian Marxist system under the leadership of Satan incarnate (the Antichrist) until they get rid of one Book: the Authorized Version of the Holy Bible. This book shows you exactly why the Holy Bible (AV 1611) is considered to be the greatest &quot;hate literature&quot; in the world. This work contains four appendices with additional material on Mohammed as a prophet, the contrast between Jesus and Mohammed, contradictions and errors in the Koran, and the place of the &quot;Holy&quot; Hadith in Islam.\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy Scriptures.","torrent":{"xt":"urn:btih:2b3e9ac78360102a339c7b8238b02951522a48e1","amp;dn":"The+Bible%3A+A+Deadly+Book+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b3e9ac78360102a339c7b8238b02951522a48e1","infoHashBuffer":{"type":"Buffer","data":[43,62,154,199,131,96,16,42,51,156,123,130,56,176,41,81,82,42,72,225]},"announce":[],"urlList":[]}}