{"title":"Martin Gilbert - The Holocaust [64] Unabridged","uid":8771747,"size":992337223,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2bd9ac0e75cff294096650508e5e39fa9cd6b754&amp;dn=Martin+Gilbert+-+The+Holocaust+%5B64%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1375469131,"description":"Martin Gilbert - The Holocaust: The History of the Jews of Europe During the Second World War\n\nRead by David Case, 64 kbps, Unabridged\n\nNOTE - This is an old rip from Demonoid that doesn't appear to have been made available anywhere else. Thanks to the OP.\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/the-holocaust-martin-gilbert/1112082335?ean=9780805003482&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/the-holocaust-martin-gilbert/1112082335?ean=9780805003482&lt;/a&gt;\n\nOVERVIEW\n\nA poignant introduction by the author (official biographer of Winston Churchill) is followed by his instructive analysis of anti-Semitism in Europe, from Martin Luther's venomous fulminations against Jews to the motivating power of anti-Semitism in the National Socialist movement. Hitler's &quot;final solution&quot; began formally within hours of the German invasion of Russia, a campaign that, as Gilbert shows, provided an opportunity for genocide hitherto lacking. With a relentless accumulation of detail and eyewitness accounts, he writes of the systematic efficiency of the Nazi attempt to destroy European Jewry and the widespread disbelief that such could be happening. Though the figure of Adolf Hitler remains in the background, such executives as Himmler, Eichmann and Mengele are very much in evidence throughout the gripping narrative (there is new material on the latter's labors at Auschwitz). An element in the historical tragedy that Gilbert stresses is the deliberate destruction of children one of Mengele's principal interests which the author calls &quot;the new barbarism.&quot; The narrative reaches its dreadful climax with the convergence on the death camps of the Allied and Soviet armies, a time when &quot;rescue and slaughter marched hand in hand.&quot; A particularly disturbing section deals with outbreaks of anti-Semitism after the German surrender. On July 4, 1946, for instance more than a year after V-E Day 42 Jews were massacred by Poles in the town of Kielce. Gilbert brings within the pages of this volume all the major substantiated evidence of Jewish resistance throughout the war, plus many examples of Gentiles risking their lives to protect Hitler's prey.\n\nReview - Fritz Stern [1986] of &quot;Foreign Affairs&quot;\n &lt;a href=&quot;\nhttp://www.foreignaffairs.com/articles/40693/fritz-stern/the-holocaust-a-history-of-the-jews-of-europe-during-the-second-&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.foreignaffairs.com/articles/40693/fritz-stern/the-holocaust-a-history-of-the-jews-of-europe-during-the-second-&lt;/a&gt;\n\nA monument to humanity as it was caught in the terror of leering, relentless inhumanity. Each scene is palpable in its horror, each moment records the suffering of the victim and the sadism of the tormentor (German or East European). Here are the voices of the near-dead or of those closest to them, a record of absolute defenselessness, yet with instances of courage, defiance, decency and betrayal. This is not the story of the cold-blooded machine of destruction but of immediate, individual murder, of the killing of children, of such terror and degradation that even guard dogs cringed to do what SS men carried out. Here are the voices of the victims, culled from many available sources, but assembled as never before in a chorus of biblical pain.\n\nGilbert, the distinguished British historian, has created this monument, but not a history-the title notwithstanding. He writes with scant attention to existing literature or deeper questions. He contends, for example, that the worst occurred when &quot;Germany was supreme. And with her supremacy came the thirst for Jewish blood.&quot; But did not the systematic murder coincide with Germany's defeat before Moscow? Gilbert says almost nothing about the complicity or knowledge of the German army, though he refers to the murder of Soviet prisoners of war. The early chapters try to sketch the historical background but are marred by factual errors.","torrent":{"xt":"urn:btih:2bd9ac0e75cff294096650508e5e39fa9cd6b754","amp;dn":"Martin+Gilbert+-+The+Holocaust+%5B64%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd9ac0e75cff294096650508e5e39fa9cd6b754","infoHashBuffer":{"type":"Buffer","data":[43,217,172,14,117,207,242,148,9,102,80,80,142,94,57,250,156,214,183,84]},"announce":[],"urlList":[]}}