{"title":"Andrew Blake - Five Stars (2009) - Dita Von Teese,Sasha Grey, Ar","uid":4959371,"size":2218924159,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2bfef91b2ffd6ca8eb4028ba0147c7606f74ad34&amp;dn=Andrew+Blake+-+Five+Stars+%282009%29+-+Dita+Von+Teese%2CSasha+Grey%2C+Ar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"pure_screens","files":333,"time":1245250141,"description":"Andrew Blake - Five Stars\n\n\n\n\n\nscreens CD #1: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/1447/five-stars-cd1.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/1447/five-stars-cd1.html&lt;/a&gt;\n\n\nscreens CD #2: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/1448/five-stars-cd2.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/1448/five-stars-cd2.html&lt;/a&gt;\n\n\nscreens CD #3: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/1449/five-stars-cd3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/1449/five-stars-cd3.html&lt;/a&gt;\n\n\n\nDVD-covers: &lt;a href=&quot;\nhttp://www.jam-hot.com/pictures/1450/five-stars-covers.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jam-hot.com/pictures/1450/five-stars-covers.html&lt;/a&gt;\n\n\n\n\n\n\nThis unique collection of some of Andrew Blake's most memorable scenes stars five of the most recognizable women ever to work in the adult industry.\n\n\nStarring:\nJanine Lindemulder, Dita Von Teese, Tera Patrick, Sasha Grey, Aria Giovanni\n\n\nReleased: 2009\nCountry: USA\nGenre: Vignettes, Compilation\nDirector: Andrew Blake\nStudio: Studio A Entertainment, INC.\n\nDuration: 01:59:00\nVideo:    XVID 640x464 29.97fps 3076Kbps\nAudio:    MP3, MPEG Audio Layer 3 48000Hz stereo 124Kbps\n\n\n2,400+ torrents: \n(ALWAYS with honest screens &amp; detailed info)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\nREVIEW:\n\nAndrew Blake has been at the porno movie game a long time now, his first feature, Night Trips, now twenty years old. The multiple AVN Award winning director has now compiled what is basically a 'greatest hits' package compiling eighteen scenes from his last decade or so of filmmaking, each one starring one of five performers (hence the name, Five Stars). Janine Lindenmulder, Dita Von Tease, Tera Patrick, Sasha Grey and Aria Giovanni are the five beauties who get the spotlight here, though cameos from the likes of Anita Blond, Regina Hall, Dahlia Grey, Justine Joli, Faith Leon, Kim Wilde, Claire Adams and a few others round out the cast nicely. Like much of the director's work, there's no heterosexual action at all to be found - this is all solo and girl on girl material shot with his eye for classy production values and slick cinematography. It's a lot like Michael Ninn's 'artcore' style, though where Ninn would eventually go full on gonzo with his Neo Pornographia series, Blake hasn't ever quite gone that hard and still shots softer stuff in addition to some more recent harder efforts. This disc is a nice mix of both.\n\nHere's a look:\n\nScene 1 - Dita In Distress: From Pin-Ups 2, this scene features sexy Dita Von Tease laying in bed and looking fine. A few other girls, one of whom is Aria, come in and start pulling her fifties era lingerie off of her. They gag her, bind her hands, and slap her ass. They rough up her breasts and rub her pussy and then spank her with a paddle.\n\nScene 2 - Aria's Golden Globes: This scene is from Aria. Aria Giovanni looks fantastic showing off her lovely breasts that periodically pop out of her black cocktail dress. She struts on the couch and then the camera cuts to the bed where she lies topless. She spreads her legs and rubs herself as we cut back and forth between the tease on the couch and the tease on the bed.\n\nScene 3 - Tera's Slice Fruit: This scene, from Aroused, lies Tera Patrick on the floor where she plays with her breasts and pussy while she fantasizes about two other woman rubbing their bodies. The three of them join together and touch each other, and the two girls rub some sliced watermelon all over Tera's body and then lick it off of her.\n\nScene 4 - Janine - Expensive Whores: This scene from Expensive Whores stars Janine, Kym Wilde and Mr. X and is set inside a lavish mansion. The girls make out, using their tongues a lot, while X watches, and then Kim eats Janine out. Janine returns the favor to end the scene.\n\nScene 5 - Sasha - Gold Redemption: Sasha is bound in a 'Christ pose' with a crown of thorns on her head, wearing some gold negligee. Another woman is fucking her with a dildo, and after a few minutes of that she pulls it out and makes Sasha suck it off.\n\nScene 6 - Dita - High Heeled Dildo: This scene, also from Pin Ups 2, stars Dita Von Tease, Anita Blond and Temptress. The three are in the same room wearing old school lingerie. Blond is holding a high heel shoe with a dildo built into it. Dita takes the shoe and puts it on Blond while Temptress watches and masturbates. Blond then fucks Dita's pussy with it.\n\nScene 7 - Aria - Wet Lips: Aria walks down the stairs and finds s pretty blond friend. They make out and the camera cuts between a few different scenes, one of which is Aria all alone, another shows her getting out of a pool. The blond rubs Aria's pussy and they get naked and kiss. In the bit where she's getting out of the pool another woman uses a riding crop on Aria's pussy and in the solo scene Aria is masturbating.\n\nScene 8 - Tera - Cleavage: This scene, from Aroused pits Tera Patrick against Dahlia Grey and Victoria. Tera and Dahlia make out and touch one another while Victoria watches. There's a lot of leg worship here and tongue kissing that eventually leads into some titty play and pussy licking.\n\nScene 9 - Janine - Ice Dildo: This famous scene from Hidden Obsessions finds Janine outside enjoying the weather while indoors we see her making out with Julia Ann. Janine finds a dildo made of ice and indoors the girls play with it and fuck it as it melts inside of them while outside Janine masturbates under the sun.\n\nScene 10 - Sasha - Leg Carousel: This scene from the movie of the same name stars Sasha Grey, Faith Leon and Claire Adams. It's shot in black and white and when it starts Claire is bound and hanging from the ceiling. Sasha sits on her and rides her like a carousel and then Faith climbs on top too and the three of them slowly spin.\n\nScene 11 - Dita - Corset Glamour: This scene allows Dita to strut her stuff and rub herself with a riding crop as the camera shows off how her corset exemplifies some of her finest assets, cutting back and forth between Dita and a masturbating blond onlooker wearing a top hat and riding a cane. The girls move in on one another and touch each other's breasts and then Dita fucks her friend with a glass dildo.\n\nScene 12 - Aria - Smoking: Justine Joli watches herself smoke in a mirror. Aria walks into the room and watches her, and then starts to touch her. They rub their breasts against one another and suck on one another's nipples. Justine's pants come down and Aria kisses her pussy before Justine returns the favor. These messy girls get lipstick all over each other. It's a wonderful thing.\n\nScene 13 - Janine - Pink Fetish: Janine is sitting on the stairs all by herself in this scene from Hidden Obsessions. She fingers herself as the camera cuts back and forth between her and two women in lingerie making out and playing with a riding crop (the dark haired one being Janine in a wig). Janine gets bound and gagged and spanked and then she turns the tables and does the same to her light haired companion before they make out and fuck each other with the riding crop.\n\nScene 14 - Sasha - Cinematic Manipulation: Sasha and Faith Leon are in a dressing room. The cameras are rolling as the cameraman watches them kiss. They play with each other's nipples and kiss. Faith rubs Sasha's pussy and plays with her ass cheeks before briefly slipping a finger inside her snatch. Sasha pays her back by eating her pussy.\n\nScene 15 - Dita - 50's Bedroom: This quick scene lets Dita walk around and show off her vintage boudoir duds. She spreads her legs and fingers herself for the camera, instantly making the world a much better place to live in.\n\nScene 16 - Dita - Up-skirt: This scene, from Pin Ups 2, again stars Dita along with Anita Blond, this time joined by Nina. The girls don various vintage outfits as the camera looks up their skirts and down their blouses as they play with one another. Dita's pussy gets rubbed and her tits get played with and Blake wisely puts her at the center of attention here as her dark hair and porcelain skin contrasts nicely with the other two blondes.\n\nScene 17 - Sasha - High Strung: Sasha is bound and hanging from the ceiling while Claire Adams stands below her and spins her around slowly, enjoying looking at her body.\n\nScene 18 - Aria - Breast Diva: The movie closes out with Aria, back on the couch in her black cocktail dress showing off her great tits and playing with her feet, which she uses to tweak her nipples before the movie cuts to black and ends.\n\nBlake shoots his smut very carefully and paces it well, placing it against some interesting music and setting his scenes in interesting locations. While some of this stuff would definitely been hotter had we been able to hear the girls doing their thing, Blake really has had the privilege of working with some of the best looking women in the industry and that, in and of itself, keeps the heat level nice and high.\nThe DVD\n\nVideo:\n\nThe video quality on this release varies from scene to scene but generally the picture quality is quite good, even if its non-anamorphic (which does make sense considering some scenes were shot fullframe and some widescreen - though some 16x9 window-boxing could have fixed this issue). Colors are nice and crisp, black levels are generally strong and there aren't any obvious issues with compression artifacts or edge enhancement to complain about. Blake's cinematography is always top notch so it's nice to see the visuals represented so nicely on this DVD.\nSound:\n\nThe sound mix is a decent Dolby Digital 2.0 Stereo track. Most of Blake's work is shot without sound, meaning that there's only music overtop, no actual live audio, and the material presented on this DVD is no exception. The score used throughout sounds good, however. There isn't a ton of channel separation but there doesn't really need to be. There's a nice clarity to the mix and the levels are nicely balanced.\nExtras:\n\nThe primary extra on this disc, and really the main reason a lot of Blake fans will probably want to check it out, is the commentary track from Blake himself, who recorded the commentary from his studio in California. He talks about how each scene was shot, makes notes about each of the performers he used and talks about the different features that this scenes were taken from. He notes who is still in the business and who has 'disappeared' and he talks about where he shot a lot of this material and what he was going for with much of the imagery. Blake comes across as an intelligent and likeable man and fans of his work should definitely give this track a shot as it's got a lot of good information about Blake, his stable of performers, and his career as an adult filmmaker. There's very little dead air here, Blake has a lot to say about his work, and thankfully the bulk of it is actually pretty interesting.\n\nAside from the commentary, look for some stylish menus, chapter selection, and trailers for House Pets and Paid Companions.\nFinal Thoughts:\n\nThe AV snob in me regrets the fact that the disc isn't anamorphic but that complaint aside, Studio A has done a very nice job with this release. Blake's unique take on fetishism and erotica might not be for all tastes (it'll be too softcore for some I'm sure) but for those who do appreciate his classy and inspired work, this release comes highly recommended.\n\n\n\n.\n","torrent":{"xt":"urn:btih:2bfef91b2ffd6ca8eb4028ba0147c7606f74ad34","amp;dn":"Andrew+Blake+-+Five+Stars+%282009%29+-+Dita+Von+Teese%2CSasha+Grey%2C+Ar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bfef91b2ffd6ca8eb4028ba0147c7606f74ad34","infoHashBuffer":{"type":"Buffer","data":[43,254,249,27,47,253,108,168,235,64,40,186,1,71,199,96,111,116,173,52]},"announce":[],"urlList":[]}}