{"title":"HAITI - Les 101 Nations du Vaudou (Voodoo Drums)","uid":4414629,"size":126859598,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c2990171a1944cc70ea6d15f9ffa62fc5d7cf94&amp;dn=HAITI+-+Les+101+Nations+du+Vaudou+%28Voodoo+Drums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":39,"time":1222449024,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\n\nHAITIAN VOODOO\n\nIn Haitian Vodou (SÃƒÆ’Ã‚Â¨vis Lwa in Creole or &quot;Service to the Spirits&quot;), \nthere are strong elements from the Bakongo of Central Africa and the \nIgbo and Yoruba of Nigeria, although many different nations of Africa \nhave representation in the liturgy of the SÃƒÆ’Ã‚Â¨vis Lwa. An often \noverlooked yet significant element was that of the TaÃƒÆ’Ã‚Â­no Indians, \nvenerated as the indigenous population (and hence, a form of ancestors) \nof the island now known as Hispaniola. The TaÃƒÆ’Ã‚Â­no contributed considerable \ninfluence to the belief system of Haitian Vodou, most notably the Petro \n(Petwo in Creole) sect, a sect of the religion with virtually no \ncounterpart and origin from the African continent. Characterized by the \naggression of the loas, the sect bears influence from the zemis of \nAmerindian folklore. A large and significant portion of Haitian Vodou most \noften overlooked by scholars, until recently is the Kongo component. The \nentire Northern area of Haiti is especially influenced by Kongo practice. \nIn the North, it is more often called Kongo Rite or Lemba, from the Lemba \nrites of the Loango area and Mayombe. In the south, Kongo influence is \ncalled Petwo (Petro). Many loas or lwas (also a Kikongo term) are of Kongo \norigin such as Basimbi, Lemba, etc.\n\nHaitian creole forms of Vodou exist in Haiti, the Dominican Republic, \nparts of Cuba, the United States, and other places that Haitian immigrants \ndispersed to over the years. However, it is important to note that the Vodun \nreligion (separate from Haitian Vodou) existed in the United States, having \nbeen brought over by West Africans enslaved in America, specifically from \nthe Ewe, Fon, Mina, Kabaye, and Nago groups. Some of its more enduring forms \nstill exist in the Gullah Islands. There is a re-emergence of these Vodun \ntraditions in America, which maintains the same ritual and cosmological \nelements as is practiced in West Africa. These and other African-diasporic \nreligions such as Lukumi or Regla de Ocha (also known as SanterÃƒÆ’Ã‚Â­a) in Cuba, \nCandomblÃƒÆ’Ã‚Â© and Umbanda in Brazil, all religions that evolved among descendants \nof transplanted Africans in the Americas.\n\n(Wikipedia)\n\nHiQuality: 320Kbps + detailed booklet","torrent":{"xt":"urn:btih:2c2990171a1944cc70ea6d15f9ffa62fc5d7cf94","amp;dn":"HAITI+-+Les+101+Nations+du+Vaudou+%28Voodoo+Drums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c2990171a1944cc70ea6d15f9ffa62fc5d7cf94","infoHashBuffer":{"type":"Buffer","data":[44,41,144,23,26,25,68,204,112,234,109,21,249,255,166,47,197,215,207,148]},"announce":[],"urlList":[]}}