{"title":"Caballos salvajes","uid":3593876,"size":4534644736,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2c94feea9aa7d499d7219b49779b876c6c489981&amp;dn=Caballos+salvajes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"owen1218","files":11,"time":1168472710,"description":"An unlikely pair of outlaws take to the highway and become criminal folk heroes in this satiric comedy. Jose (Hector Alterio) is a 70-year-old anarchist who deposited $15,000 in a bank 20 years ago and wants to withdraw the money; however, he doesn&amp;#039;t have the paperwork, and the bank staff keeps giving him the runaround. So he takes drastic measures: he arrives at the bank one day with a gun, and, pointing the pistol at his head, he announces that he&amp;#039;ll blow his brains out if he doesn&amp;#039;t get his money. Pedro (Leonardo Sbaraglia), a 23-year-old clerk working at the bank, is unhappy with his job and his life, and he impulsively announces that Jose has taken him hostage; they end up leaving the bank with $500,000, and they hit the road with both cops and reporters following their trail. Jose and Pedro seem like an odd team at first, but friendship and respect grow between them as they travel the backroads, spending some of the money, handing some of it out to poor people along the way, and sending occasional videotaped messages to the media. They also pick up a woman named Ana (Cecilia Dopazo), whose tough demeanor is intimidating but fits the situation perfectly; Pedro soon finds himself attracted to her as she joins in their low-level crime spree. Caballos Salvajes was the debut feature from Argentinean director Marcelo Pineyro, who became one of the most acclaimed young directors in South America on the basis of this and his second film, Cenizas del Paraiso. \n\n~ Mark Deming, All Movie Guide","torrent":{"xt":"urn:btih:2c94feea9aa7d499d7219b49779b876c6c489981","amp;dn":"Caballos+salvajes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c94feea9aa7d499d7219b49779b876c6c489981","infoHashBuffer":{"type":"Buffer","data":[44,148,254,234,154,167,212,153,215,33,155,73,119,155,135,108,108,72,153,129]},"announce":[],"urlList":[]}}