{"title":"The Trace - Murder Mystery Game V 1.2.0.ipa","uid":11797667,"size":128816827,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:2cb6fca87c814f06d5d1213d66f1c6ff562115a6&amp;dn=The+Trace+-+Murder+Mystery+Game+V+1.2.0.ipa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zxfghfg","files":1,"time":1428244327,"description":"Ever wanted to play at being Sherlock Holmes or Miss Marple, solving puzzles, finding clues and leading the investigation into the crime that needs to be deciphered? The Trace is an immersive murder mystery puzzle adventure game that will pit your wits against a baffling crime that needs solving and a case that needs answers!\n\nDiscover clues, find the leads and reveal the proof, become a detective, solve the mystery and unravel your next case! Was it an accident or was it murder? Delve into the science of forensics, examine the scene of the crime, chase the leads that you uncover and find the truth you need.\n\nPlay detective and lead the investigation into an intriguing case, exploring crime scenes and searching for clues. Find forensic evidence and study fingerprints to piece together the proof of what really happened.\n\nPlay the game, follow leads, study the clues to unravel the puzzles and solve the crime! Was it really suicide, or something more sinister? Find the evidence and proof that leads you to know that it was really murder most foul!\n\n*** Important - This game runs best on newer devices. For the optimal gameplay experience we strongly recommend that you do not install this game on iPhone 4. ***\n\nFEATURES\n\n- Explore highly detailed 3D environments throughout your investigation.\n\n- Interact with hundreds of objects to discover clues in the case and find the leads to uncover the truth behind the mystery and expose the real culprits!\n\n- Scan seemingly ordinary items to find hidden forensics and evidence to solve the puzzles.\n\n- Collect clues, become an accomplished detective and make your deductions.\n\n- Enjoy a game that draws you into a story driven plot full of mystery from David Varela (Sherlock: The Network). Was it murder in the dining room with an iron bar? What does Alex in forensics say about the fingerprints and ballistics evidence, is it elementary or is there a twist? Only you can decide!\n\n- Captivating atmospheric music &amp; sound that truly immerses you in the case and your investigations. Headphones strongly recommended!\n\n- Intuitive gesture control as you play; feel like a real detective as you unravel the puzzles. Find the evidence that provides the proof to solve the mystery and uncover the crime.\n\n- Available in English, French, Italian, German and Spanish.\n\n- Supports Metal rendering and iCloud saved games.\n\nBecome the greatest sleuth, analyzing the baffling mysteries that leave others scratching their heads with your logical reasoning and adept use of the study of forensics. The crime, the case, the puzzles, the clues, the proof, the mystery is all waiting for you to solve.\n\nAre you ready to lead the investigation and play detective? Channel your inner Sherlock and play The Trace!\n\nSOCIAL MEDIA\nFollow us:&amp; #SolveTheTrace\nLike us:\nGot questions? Email &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;285b5d5858475a5c685a4d444d465c444d5b5b064b47065d43&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nABOUT RELENTLESS\nBAFTA-award-winning studio, creators of Murder Files, Enigma Express and Buzz!\n\nFind out more about The Trace or our other games: www.relentless.co.uk\nFollow us: @relentless_SW","torrent":{"xt":"urn:btih:2cb6fca87c814f06d5d1213d66f1c6ff562115a6","amp;dn":"The+Trace+-+Murder+Mystery+Game+V+1.2.0.ipa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cb6fca87c814f06d5d1213d66f1c6ff562115a6","infoHashBuffer":{"type":"Buffer","data":[44,182,252,168,124,129,79,6,213,209,33,61,102,241,198,255,86,33,21,166]},"announce":[],"urlList":[]}}