{"title":"Write to TV: Out of Your Head and onto the Screen - Martie Cook","uid":14736796,"size":2927574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ce280fde529605a39eb7962e3244a73c215d629&amp;dn=Write+to+TV%3A+Out+of+Your+Head+and+onto+the+Screen+-+Martie+Cook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":1,"time":1464641293,"description":"Learn to craft smart, original stories and scripts for a variety of television formats and genres, including comedy, drama, pilots, animation, made-for-TV movies, late night, and reality television. \r\n\r\nHear directly from studio and network executives, agents, and managers on what they’re looking for in new writers and how to avoid common pitfalls. Gain access to sample outlines, script pages, checklists, and countless other invaluable resources that will help you break into the industry and put you on the path to immediate success.\r\n\r\nIn Write to TV, Second Edition industry veteran Martie Cook offers practical advice on writing innovative television scripts that will allow you to finally get that big idea out of your head and onto the screen. This new edition has been updated to include:\r\n\r\nTips and techniques from industry vets Jay Leno, Norman Lear, Paul Haggis, David Magee, Susan Rovner, Tal Rabinowitz, Jonathan Littman, Peter Jankowski, Steve Stark, and Doug Herzog that you can immediately apply to your own projects\r\n\r\nExpanded coverage of writing pilots, pitching, writing webisodes, writing for tweens, writing for late night, and rewriting\r\nUseful advice for navigating the confusing television hierarchy, including how to network, get an agent, land that first writing job, and even &quot;do lunch&quot;\r\n25 new interviews with writers and producers of hit shows such as New Girl, Parks and Recreation, The Blacklist, Curb Your Enthusiasm, CSI, The Tonight Show Starring Jimmy Fallon, and many more\r\n\r\nAn all new companion website (www.writetotv.com) featuring blog updates, industry trends, a Q&amp;A discussion forum with the author, and many other resources","torrent":{"xt":"urn:btih:2ce280fde529605a39eb7962e3244a73c215d629","amp;dn":"Write+to+TV%3A+Out+of+Your+Head+and+onto+the+Screen+-+Martie+Cook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ce280fde529605a39eb7962e3244a73c215d629","infoHashBuffer":{"type":"Buffer","data":[44,226,128,253,229,41,96,90,57,235,121,98,227,36,74,115,194,21,214,41]},"announce":[],"urlList":[]}}