{"title":"RealtimeBondage--Bella Rossi totally destroyed! Brutal bondage, ","uid":10431902,"size":2053210909,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2ce9e8bbe40cd4f615f22f92bc82ed26880c7d4b&amp;dn=RealtimeBondage--Bella+Rossi+totally+destroyed%21+Brutal+bondage%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"merzedes","files":-1,"time":1403809699,"description":"\nBella Rossi gets totally destroyed! Brutal bondage, epic deepthroat, ANAL &amp; multiple orgasms! | Bella Rossi\n\nJune 24, 2014\n\n\nHigh MP4 only.\n\n\nBella Rossi is a beautiful package, all boobs and butt. Her curves, killer smile and lush hair inspire us. They inspire us to bind her down in strict bondage and fuck her into a limp puddle of undone flesh. It takes top shelf pussy to be able to survive a live Sexuallybroken show and only the toughest are selected. Bella is one such top shelf pussy.\n\nBound over backwards in a brutal back arch on a custom made wooden bondage device, Bella is well and truly fucked. Her big breasts are firmly bound and jut out and upwards to the ceiling. A industrial strength fucking machine is deeply wedged inside her pierced pussy. Her mouth hole is open wide and ready for the cock. Her oiled body is polished to a high gleam, bringing out those outrageous curves. It is time. We step out and simply own the back of her tonsils. One after another the cocks run a train on her face. All the while the fucking machine owns her pussy. Bella is tag teamed without mercy, both ends stuffed full up to the brim.\n\nSexuallybroken live shows are without mercy. Bella is quickly broken down and we are only getting started. The fucking machine rips orgasm after orgasm out of her restrained pussy. All the while, the cocks are reshaping her throat. Bella is completely overwhelmed. We throw in the vibrator to complete the overwhelming of her senses. This is just the first position and Bella is already totally blasted. Time for round two.\n\nMoving quickly, we throw Bella into a classic &quot;fuck me&quot; position, on her back with toes pointed to the ceiling. She is bolted into another custom made wooden bondage device that leaves her holes wide open and ready for use. The fucking machine has been using her pussy with brutal purpose, we want at that ass. The device holds Bella firmly in place as the cocks chinese fingertrap her. BBC pours down her throat as we pummel her pussy, before moving on to sliding home balls deep in her tight asshole. Bella is reduced to a bag of holes for our use, a cock sheath to be filled.\n\nWe have plowed every hole she has, and Bella is now a babbling, drool covered twitching pile of porn girl. And we are only half way done. We finger blast a few squirting orgasms out of her pierced pussy as Bella moans uncontrollably, leaking from all of her holes. She will not be forgetting today anytime soon. If she can remember anything after all those orgasms that is... \n \nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2014/06_24brossi6/RealTimeBondage--Bella-Rossi-gets-totally-destroyed-Brutal-bondage-epic-deepthroat-ANAL-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2014/06_24brossi6/RealTimeBondage--Bella-Rossi-gets-totally-destroyed-Brutal-bondage-epic-deepthroat-ANAL-multiple-orgasms.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:2ce9e8bbe40cd4f615f22f92bc82ed26880c7d4b","amp;dn":"RealtimeBondage--Bella+Rossi+totally+destroyed%21+Brutal+bondage%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ce9e8bbe40cd4f615f22f92bc82ed26880c7d4b","infoHashBuffer":{"type":"Buffer","data":[44,233,232,187,228,12,212,246,21,242,47,146,188,130,237,38,136,12,125,75]},"announce":[],"urlList":[]}}