{"title":"[FakeAgentUK] Sophie (1087 / 05.16.2014)","uid":10161301,"size":989598243,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2cfdc6a6a9e9354eb77d92ad8b0b39032c57ab01&amp;dn=%5BFakeAgentUK%5D+Sophie+%281087+%2F+05.16.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":1,"time":1400299612,"description":"[FakeAgentUK] Sophie (1087 / 05.16.2014)\n\nMost girls that come to me usually know what they want, whether it's catwalk, glamour or porn. Now today's petite blonde bombshell didn't have a fucking clue. The only thing she read on my rag ad was ?Quick, easy cash? Well darling there's only one thing on offer for that. PORN. She was a little bit taken back when I laid this out, but after a bit of tom tit... You know, 2 grand, exotic locations, she couldn't wait to get her clothes off. Frankly neither could I. Lovely fresh 22yr old, perfect skin, petite frame, natural titties and a great arse. Couldn't fault it. Whilst initially she was a bit apprehensive, this inhibition soon vanished as she was thrashing around on my sofa bringing her self to a peachy orgasmic state. Good girl. Wasn't long before she was once again cumming on my fingers. Dripping wet. After I gave her some cock swallowing tests I thought I'd see how nasty she would get, so I got her tongue to work on my arse. Wow, good effort, I love a good rimming and she did one hell of a job. So naturally I repaid the favour and ate her pussy, where once again her body was shaking with pleasure. This bird was a right fire cracker and by this point she was dripping pussy juice everywhere. So I set Sergeant Stiff to purpose, fucking her with all my might and manoeuvring her into all sorts of positions. This, as you know, leads to the white brigade being on full alert. So I pulled out, got her on her knees and blasted wads of hot cum all over her face. My balls were well and truly drained. Job done. Enjoy.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=p06to4pojj6qa8z00r42.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=p06to4pojj6qa8z00r42.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5f8npy66is7x18nz87ne.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5f8npy66is7x18nz87ne.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2cfdc6a6a9e9354eb77d92ad8b0b39032c57ab01","amp;dn":"%5BFakeAgentUK%5D+Sophie+%281087+%2F+05.16.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cfdc6a6a9e9354eb77d92ad8b0b39032c57ab01","infoHashBuffer":{"type":"Buffer","data":[44,253,198,166,169,233,53,78,183,125,146,173,139,11,57,3,44,87,171,1]},"announce":[],"urlList":[]}}