{"title":"DiskWarrior 4.1 Bootable CD + Instructions + Desktop Application","uid":4870814,"size":275842135,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2dd0dc1dc3ddeac6ac9b91c5bfa337880dec5f4d&amp;dn=DiskWarrior+4.1+Bootable+CD+%2B+Instructions+%2B+Desktop+Application&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tompic823","files":1,"time":1240794093,"description":"I couldn't find this anywhere so I figured I would put it up. This is currently the newest version of Alsoft's widely popluar Disk Warrior. It supports OS X 10.5 Leopard and all previous version of OS X.\n\nTo use this as a bootable cd/dvd just open Disk Utility, click burn, select the .DMG image and let it burn. Then reboot your mac and hold down the c key (may be different for your model) to boot from this cd. \n\nIf you want to use this as an application within OS X then drag the app from within the mounted dmg to your desktop and then enter serial RR428887 or RH294197. And don't forget to leave a comment about how this works for you.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nJust a little info from Alsoft's website:\n\n\nWhat is DiskWarrior?\nDiskWarrior is the safest, most technologically advanced, most powerful utility to eliminate directory damage available for any computer.\n\nDiskWarrior uses a different approach to disk directory repair than other programs.\nDiskWarrior is not a disk repair program in the conventional sense. Instead of patching the original directory, it uses a patent-pending technology to quickly build a new replacement directory using data recovered from the original directory, thereby recovering files, folders and documents that you thought were lost and that no other program could recover.\n\nHow does DiskWarrior recover data no one else can?\nAt Alsoft, we know that the most important thing when you are attempting to repair your disks is getting your data back. That's why the first thing DiskWarrior does is scavenge your original directory to find all the file data it can. It then uses this data to build an entirely new replacement directory.\n\nDiskWarrior is the only product that finds all of your data.\nIts patent-pending method always results in a perfectly rebuilt directory without any errors and that contains all of your file and folder data.","torrent":{"xt":"urn:btih:2dd0dc1dc3ddeac6ac9b91c5bfa337880dec5f4d","amp;dn":"DiskWarrior+4.1+Bootable+CD+%2B+Instructions+%2B+Desktop+Application","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dd0dc1dc3ddeac6ac9b91c5bfa337880dec5f4d","infoHashBuffer":{"type":"Buffer","data":[45,208,220,29,195,221,234,198,172,155,145,197,191,163,55,136,13,236,95,77]},"announce":[],"urlList":[]}}