{"title":"Gary Paulsen Collection","uid":6808722,"size":2145955,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2dfe57b0fc5a0a72f1e4b5439e07524893abf3cd&amp;dn=Gary+Paulsen+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TrexWarrior","files":-1,"time":1320964057,"description":"Haven't seen a complete Gary Paulsen torrent anywhere so I figured I would share my collection. This includes the entire Hatchet series of Brian Robeson. It also has two other Gary Paulsen books included Notes from the dog, and woods runner. I have loved these books since I was a kid and just want to pass them on. \n\nHATCHET\n\nBook Description\nSince it was first published in 1987, the story of thirteen-year-old Brian Robeson's survival following a plane crash has become a modern classic. Stranded in the desolate wilderness, Brian uses his instincts and his hatchet to stay alive for fifty-four harrowing days.\nThis twentieth-anniversary edition of Hatchet contains a new introduction and sidebar commentary by Gary Paulsen, written especially for this volume. Drew Willis's detailed pen-and-ink illustrations complement the descriptions in the text and add a new dimension to the book. This handsome edition of the Newbery Honor book will be treasured by Hatchet fans as well as by readers encountering Brian's unforgettable story for the first time.\n\nTHE RIVER\n\nBrian Robeson, a 13 year old boy who spent 54 days surviving alone in the Canadian wilderness the previous summer, is hired by the government to repeat his actions again by living in the woods with only a knife and surviving only by his wits, so the military can learn his survival techniques. Though reluctant at first, Brian eventually agrees. This time, instead of being alone, Brian is accompanied by Derek Holtzer, a government psychologist, as the the two set off for a remote Canadian location.\nThough the government insisted the duo take emergency supplies, Brian insists they abandon everything but a folding saw and an emergency radio, saying that it would be impossible to eat bugs and sleep in the rain if a tent and prepared food is within reach. During their stay, things take a grim turn when their camp is struck by lightning, which knocks Derek into a coma and destroys the radio. Knowing that Derek will die of dehydration long before anyone finds them, Brian builds a raft in a desperate bid to bring Derek down the river to Brannock's Trading Post for emergency aid.\n\nBRIANS WINTER\n\nAt the end of Hatchet, thirteen-year-old Brian Robeson, who has been trapped in the Canadian wilderness after a plane accident, decides to dive for supplies from the submerged aircraft. He almost drowns. He recovers, among other things, an emergency transmitter. Within hours, a pilot receives the beacon and rescues him. The book ends with a note that Brian, who learns wilderness survival through trial and error, probably would not have survived the upcoming harsh winter.\nPaulsen says that many readers wrote to him, complaining about the deus ex machina ending. In response, Paulsen wrote Brian's Winter, which explores what would have happened if Brian had not activated the transmitter.\n\nBRIANS RETURN\n\nSixteen year old Brian Robeson does not like his life in the city. When he gets in a fight with a boy his age, he responds as if he were being attacked in the wild and badly injures the boy. He is stopped by the police and sent to a counselor named Caleb. After talking to Brian, Caleb realizes that there is nothing wrong with him. After talking for a while, Caleb makes Brian realize how much he misses the woods. Brian eventually realizes that he can't live in the city anymore. After compiling a list of materials, Brian returns to the wild. After a while Brian meets an old man named Billy. Brian tells him about an incident when he was about to kill a deer but decided against it. Billy tells him it's his &quot;medicine deer&quot; and to always listen to it. Later Billy leaves but gives him the tail of a deer. Brian later encounters a bear but is able to scare it off. Later Brian decides not to go to the Smallhorns and to stay in the bush.\n\nBRIANS HUNT\n\nBrian, who is now sixteen years old, is canoeing through the Canadian wilderness. He realizes that the woods are now his home and he will never be happy in modern society, with its noise, pollution, and fake people. He now spends his time in the wild, hunting, fishing, and home schooling himself. While Brian does not miss human contact, he finds his thoughts frequently turning to Kay-gwa-daush (also known as Susan), the teenage daughter of the Cree family who rescued him at the end of Brian's Winter. Though he has only seen her photograph, her family has described her as an adventurous, self-reliant young woman, and Brian wonders if she might be a kindred spirit.\nWhile canoeing, Brian finds a seriously wounded Malamute dog, which he nurses back to health. The dog is clearly domesticated, and Brian begins to worry that whatever maimed the dog may have done the same to her owners. He remembers his Cree friends and decides to go check on them.\nWhen Brian reaches their cabin, he finds that it was a bear that had killed the parents and apparently chased Susan into hiding. Brian returns her to her home, radios for help, and buries the family. The authorities arrive to take Susan to relatives in Winnipeg. Brian, along with the dog, stays behind in order to hunt down and kill the bear, knowing very well that the hunt could cost him his life.\nBrian uses his skills he had learned in past books like Hatchet and Brian's Winter, searches for the bear that killed his friends. But soon, the hunter becomes the hunted. Brian finds bear tracks on an island and begins to follow them. He later realizes that he was walking in a circle. The bear is actually hunting Brian. The next day, instead of moving on, he waits for the bear, and after a hard fought battle with the bear, Brian is triumphant.","torrent":{"xt":"urn:btih:2dfe57b0fc5a0a72f1e4b5439e07524893abf3cd","amp;dn":"Gary+Paulsen+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dfe57b0fc5a0a72f1e4b5439e07524893abf3cd","infoHashBuffer":{"type":"Buffer","data":[45,254,87,176,252,90,10,114,241,228,181,67,158,7,82,72,147,171,243,205]},"announce":[],"urlList":[]}}