{"title":"The Russian Revolution","uid":11798923,"size":7832640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2dff13c8d3a6717dcf4556861e9d5747ab502a4f&amp;dn=The+Russian+Revolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1428293432,"description":"The Russian Revolution had a decisive impact on the history of the twentieth century. Now, following the collapse of the Soviet regime and the opening of its archives, it is possible to step back and see the full picture of this event for the first time.\n\nImpeccable in its scholarship and objectivity, this superb volume tells the gripping story of a Marxist revolution that was intended to transform the world, but instead visited enormous suffering on the Russian people, and, like the French Revolution before it, ended up devouring its own children. The author offers insightful descriptions of the February and October Revolutions of 1917, the Civil War, the interlude of NEP, Stalin's &quot;revolution from above,&quot; the various Five-Year Plans, and the Great Purges-all treated as discrete episodes in a twenty-year process of revolution. The book incorporates data from archives that were previously inaccessible not only to Western but also to Soviet historians, as well as drawing on important recent Russian publications such as the memoirs of one of the great survivors of Soviet politics, Vyacheslav Molotov. In the Select Bibliography, the author highlights the most important of the recent scholarly works, directing readers to the burgeoning Western scholarship on the Russian Revolution in the last ten to fifteen years.\n\nShelia Fitzpatrick is an internationally known expert on Soviet history. This lively and readable Third Edition uses newly available Soviet archival material and the latest Russian and Western research to provide an authoritative, compact account of one of the key events of modern history","torrent":{"xt":"urn:btih:2dff13c8d3a6717dcf4556861e9d5747ab502a4f","amp;dn":"The+Russian+Revolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dff13c8d3a6717dcf4556861e9d5747ab502a4f","infoHashBuffer":{"type":"Buffer","data":[45,255,19,200,211,166,113,125,207,69,86,134,30,157,87,71,171,80,42,79]},"announce":[],"urlList":[]}}