{"title":"James Moody - Return From Overbrook (1956-8) [Jazz][mp3 320][sch","uid":6116248,"size":159903249,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2e5d02200274a4cfc60309c0a6d253cc612993c0&amp;dn=James+Moody+-+Return+From+Overbrook+%281956-8%29+%5BJazz%5D%5Bmp3+320%5D%5Bsch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":30,"time":1295565672,"description":"James Moody - Return From Overbrook \nDate: 1950's\nAudio CD: March 12, 1996 \nLabel: Grp Records \nQuality: CBR 320 kbps\n\nTwo of James Moody's better albums from the 1950's are reissued in full on this single Chess CD: Last Train From Overbrook and Flute 'N The Blues. The former session features Moody (on tenor, alto and flute) backed by ten horns and a four-piece rhythm section on a variety of strong straightahead material (including the title cut, &quot;What's New,&quot; &quot;Tico-Tico&quot; and &quot;The Moody One&quot;) while the latter is a septet outing that also has solos by trumpeter Johnny Coles, trombonist William Shepherd and baritonist Pee Wee Moore along with three memorable vocals from Eddie Jefferson. Recommended. ~ Scott Yanow\n\nThis 1996 US CD on MCA/Chess/GRP 18102 features two whole albums by James Moody which were on Leonard and Phil Chess's Jazz label offshoot &quot;Argo&quot;. It breaks down as follows (63:54 minutes): \n\nTracks 1 to 10 are &quot;Last Train From Overbrook&quot;, a 1958 USA-Only LP on Argo 637 [Mono] \nTracks 11 to 20 are &quot;Flute N' The Blues&quot;, a 1956 USA-Only LP on Argo 603 [Mono] \n\nThe 1st generation analogue master tapes have been remastered by one of Universal's top engineers ERICK LABSON and the sound quality is superb throughout. The 16-page booklet has a preamble by Dave Usher (Argo and Chess producer) and further liner notes by Bob Blumenthal (a Jazz critic for The Boston Globe) - it also pictures album sleeves and label close-ups and has discography information on the sessions where known. \n\nMoody was primarily an Alto and Tenor Saxophone player, but he also excelled on the flute. His session men included Johnny Coles on Trumpet, William Sheppard on Trombone, Numa &quot;Pee Wee&quot; Moore on Baritone Sax with Jimmy Boyd on Piano, John Lathan on Bass and Clarence Johnston on Drums. The &quot;Last Train From Overbrook&quot; album is entirely instrumental, but three tracks from &quot;Flute 'N The Blues&quot; - &quot;Birdland Story&quot;, &quot;Parker's Mood&quot; (lyrics above) and &quot;I Cover The Waterfront&quot; feature Eddie Jefferson on scat vocals. \n\nThe title comes from his turbulent stay at the &quot;Overbrook&quot; Mental Institution in New Jersey and the music is imbibed with his journey of redemption from that awful place and mindset. \n\nNow in his late 80's, Georgia-born James Moody played in the USA as late as 2009 and this CD reissue certainly shows why he's still such a draw. \nIt's now quite a rare disc, but well worth seeking out - especially given the wonderful sound quality. \n\nPS: Erick Labson has over 900 mastering, audio restoration and remastering credits to his name (including almost all of the huge Chess catalogue) and if you click on the 'Tag' marked &quot;Erick Labson Remasters&quot; attached to this review, you will see a pictorial list of over 80 other titles that he's been involving in (I've also reviewed many of them). ~ Mark Berry, Reckless Records Store, London\n\n\nJames Moody (alto, tenor sax)\nJohnny Coles (trumpet)\nEddie Jefferson (vocals)\nJunior Mance (piano)\nNuma Moore (baritone sax)\nWilliam Shepherd (trombone)\nSonny Cohn (trumpet)\nBill Atkins (alto sax)\nRed Holt (drums)\nOthers\n\nJames Moody - Return From Overbrook Tracks:\n01  Last Train From Overbrook\n02  Don't Worry 'Bout Me\n03  Why Don't You\n04  I'm Free a.k.a. What's New?\n05  Tico-Tico\n06  There She Goes\n07  All The Things Your Are\n08  Brother Yusef\n09  Yvonne\n10  The Moody One\n11  Flute 'n The Blues\n12  Birdland Story\n13  It Could Happen To You\n14  I Cover The Waterfront\n15  Body And Soul\n16  Breaking The Blues\n17  Parker's Mood\n18  Easy Living\n19  Boo's Tune\n20  Richard's Blues","torrent":{"xt":"urn:btih:2e5d02200274a4cfc60309c0a6d253cc612993c0","amp;dn":"James+Moody+-+Return+From+Overbrook+%281956-8%29+%5BJazz%5D%5Bmp3+320%5D%5Bsch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e5d02200274a4cfc60309c0a6d253cc612993c0","infoHashBuffer":{"type":"Buffer","data":[46,93,2,32,2,116,164,207,198,3,9,192,166,210,83,204,97,41,147,192]},"announce":[],"urlList":[]}}