{"title":"Crazy English","uid":4708781,"size":10960998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e8dc9883f4194db6bc90b61c9e4ce10ddad447f&amp;dn=Crazy+English&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"timnehguy","files":2,"time":1233946223,"description":"Crazy English, by Richard Lederer     \nPDF, 189 pp.\n\nFrom the book - \n\nLet's face it - English is a crazy language. There is no egg in eggplant nor ham in hamburger; neither apple nor pine in pineapple. English muffins weren't invented in England or French fries in France. Sweetmeats are candies while sweetbreads, which aren't sweet, are meat. \n\nWe take English for granted. But if we explore its paradoxes, we find that quicksand can work slowly, boxing rings are square and a guinea pig is neither from Guinea nor is it a pig. And why is it that writers write but fingers don't fing, grocers don't groce and hammers don't ham? If the plural of tooth is teeth, why isn't the plural of booth beeth? One goose, 2 geese. So one moose, 2 meese? One index, 2 indices? Doesn't it seem crazy that you can make amends but not one amend. If you have a bunch of odds and ends and get rid of all but one of them, what do you call it? If teachers taught, why didn't preachers praught? \n\nIf a vegetarian eats vegetables, what does a humanitarian eat? Sometimes I think all the English speakers should be committed to an asylum for the verbally insane. In what language do people recite at a play and play at a recital? Ship by truck and send cargo by ship? Have noses that run and feet that smell? How can a slim chance and a fat chance be the same, while a wise man and a wise guy are opposites? \n\nYou have to marvel at the unique lunacy of a language in which your house can burn up as it burns down, in which you fill in a form by filling it out and in which, an alarm goes off by going on. \n\nCheck my torrents for reference works on English and other topics.  ","torrent":{"xt":"urn:btih:2e8dc9883f4194db6bc90b61c9e4ce10ddad447f","amp;dn":"Crazy+English","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e8dc9883f4194db6bc90b61c9e4ce10ddad447f","infoHashBuffer":{"type":"Buffer","data":[46,141,201,136,63,65,148,219,107,201,11,97,201,228,206,16,221,173,68,127]},"announce":[],"urlList":[]}}