{"title":"[FemaleAgent] Fernando (12.02.2014)","uid":11620259,"size":692450002,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2ea236acb3edba8fb47ea4b3847f772eb389c648&amp;dn=%5BFemaleAgent%5D+Fernando+%2812.02.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":1,"time":1417536796,"description":"[FemaleAgent] Fernando (12.02.2014)\n\nFernando (31 mins). What a body this guy has, as soon as he walked in the room my panties became wetter then a sharks fin. He was stunning, with a body carved out of a block of lust and he was a dancer to boot. There was no way this hunk was leaving until he's shown me his moves and I'd had in my mouth and in my pussy. We stated the interview as normal with some small chat and then I presented him with an unbelievable offer. Lots of money modelling abroad for a long period of time. The problem was, I told him, that I had to choose between him and another guy for the job. He wanted the job badly and asked me what he could do to secure it. Here was my opening and I strolled over to him, sat on his lap and told him he'd have to convince me he was the right man for the job. He understood exactly what I wanted and we were on the sofa in no time with his tongue flicking all over my pussy. I wanted to see what this stud was packing so I pulled his beautiful cock out of his pants and drew him deep into my hot, wet mouth. I was so turned on by now that I needed his cock deep inside me, so I mounted him and began riding the pleasure train. I was in heaven having this amazing man pounding my pussy, but I wanted to be fucked from behind. I always cum in the doggy position. He began to slam into me and an amazingly powerful orgasm shook my whole body, I had to get him to pause whilst the after effects coursed through me. I was weak with pleasure and it thankfully after powering into me some more he spilled his seed all over my amazing ass cheeks. What a superb casting with one of the best studs I've has on this couch.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=slrh5xutkid17q18389t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=slrh5xutkid17q18389t.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8ol6zferm7qp3hwwd6kz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8ol6zferm7qp3hwwd6kz.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2ea236acb3edba8fb47ea4b3847f772eb389c648","amp;dn":"%5BFemaleAgent%5D+Fernando+%2812.02.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ea236acb3edba8fb47ea4b3847f772eb389c648","infoHashBuffer":{"type":"Buffer","data":[46,162,54,172,179,237,186,143,180,126,164,179,132,127,119,46,179,137,198,72]},"announce":[],"urlList":[]}}