{"title":"Tobacco Conspiracy","uid":4861328,"size":593729393,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2eb5bd92861420d104b51cac9c5265ae4c4b12d8&amp;dn=Tobacco+Conspiracy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kayshadog","files":1,"time":1240282499,"description":"The Tobacco Conspiracy: The Backroom Deals of a Deadly Industry. \n\nRipped from DVD to Mpeg\n637 Mb uncompressed\n\nENGLISH ONLY - NO SUBS\n\nNadia Collot (Director). Marie-HÃƒÂ©lÃƒÂ¨ne Ranc (Kuiv Producer). Joanne CarriÃƒÂ¨re (NFB Producer).\nMontreal, PQ: National Film Board of Canada, 2005.\n52 min., \n\n     A Canadian-European collaboration, this film is a no-holds barred attack on the global tobacco industry. Filmmaker Nadia Collot does not apologize for her lack of balance as the accusation is made early in the film that the tobacco industry has been lying to the world for decades. Using proof from tobacco company documents, this film exposes a number of their tactics. \n \n     The tone is set early in the film as Collot attempts to make contact with a number of tobacco company executives. None return her calls, and, when she actually speaks to one, he flatly refuses to comment. The film is filled with statistics such as 13,000 people die from smoking related causes each day. One hundred million smokers died in the 20th century, and the prediction is made that a billion will die in the 21st. A former smoker, Collot admits that it has taken her 20 years to quit. This film is the result of three years of investigation. \n \n     In 1953, the tobacco companies, tired of being at war with each other, met to form a common front. Although they knew then that 94% of lung cancer deaths were smokers, they issued &quot;The Frank Statement&quot; in which they denied that smoking causes cancer. This is described as the biggest public relations campaign in all history. They promised that, if cigarettes proved dangerous, they would be pulled off the market. While a clear lie, there was no political opposition until the 1990s. At a hearing organized by 46 American states, in 1998, each of the seven tobacco company executives who were called to testify deny that nicotine is addictive. The resolution was that they would pay 201 billion dollars to avoid a verdict. They were also forbidden to market to children (in the United States) and to make available to the public all of their documents. No documents could be destroyed until 2008. While they released millions of pages of useless information, dogged research unearthed some interesting admissions: &quot;Nicotine is addictive. We are in the business of selling an addictive drug.&quot; The film shows that the tobacco companies have had a free hand in what they did. When other companies were intrigued by the success of Marlboro cigarettes, they analyzed the contents. They discovered that ammonia had been added to the tobacco in order to increase the nicotine uptake into the body. Instead of reporting this discovery, the other companies also added ammonia to their cigarettes. Dr. William Farone, former director of research for Phillip Morris, states that he initially joined the company to search for ways to make cigarettes safer. After hundreds of millions of dollars were spent to find these ways, none were ever implemented. \n \n     Successes in the battle against the tobacco industry are celebrated in the film. Canada was the first to place graphic warnings on cigarette packages. Since 2001, other countries have followed suit. Increasing the cost of cigarettes, limiting advertising, making youth access more difficult have all had an impact in reducing smoking in young people to 19%. Anti-smoking commercials have become common. \n  \n     Collot shows how despite the restriction on tobacco advertising, the companies have managed to infiltrate their way into movies and television. Following a montage of famous movie scenes which feature smoking, the film states that smoking in movies actually declined over the decades. \n\n     However, since the 1990s, smoking in movies has increased to the point where it is worse now than 50 years ago. Sylvester Stallone was paid $500,000 to show smoking in five of his films. Philip Morris paid to have smoking included in Superman II. There is no smoking in Superman I. The accusation is made that the companies work together to push the limits regarding anti-smoking laws.\n \n     With 70% taxation on cigarettes, governments are in a difficult position. Ministries of Finance find themselves in a conflict with Ministries of Health. In France in the 1960s, it was determined that a cigarette company had no duty to inform about the dangers of smoking because that would have lowered the revenues to the Public Treasury. The French court ruled that, &quot;the health of a 14 year old French citizen was less important than the health of the Treasury.&quot; \n \n     The World Health Organization has come out against smoking and signed a treaty on tobacco control. While this may be a victory, the film shows that this only works in countries where the rules would be enforced. Smuggling cigarettes into poorer countries is another ploy used by the tobacco companies. Cigarettes are given away to the people. Once they are hooked, the smugglers charge and make huge profits. Then the companies show the governments all the lost revenue they could be making. They offer to distribute or even manufacture the products and ensure a steady flow of tax money to the government. Africa has shown a 16% increase in cigarette use. The cigarette companies have pulled out all the stops in Africa - free cigarettes, sports and music sponsorship, Marlboro baby clothes. \n\n     One mother complains that there is no food in the house, but her husband &quot;would rather spend last coins on cigarettes than food for the children.&quot; She asks, &quot;How can I stop him when he is addicted?&quot; The children ask for money with which to buy cigarettes. When they are told no, they turn to theft. Collot claims that the industry is not on the ropes; it is winning. \n\n          This is a hard hitting film. The information provided is documented, expert opinion is provided, and while the bias is clear, denying the message would be a challenge. \n \n     \n \nHighly Recommended.\n\n\nNOTE ADDED; Apr 23/09\n\n       Apparently many people don't like compression in torrents. Please explain why. I've never had a problem that my virus proggy couldn't handle. This is my second torrent and I compressed both believing that smaller is better. I can guarantee this is clean - ripped it myself.\n\n\nCheers.","torrent":{"xt":"urn:btih:2eb5bd92861420d104b51cac9c5265ae4c4b12d8","amp;dn":"Tobacco+Conspiracy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2eb5bd92861420d104b51cac9c5265ae4c4b12d8","infoHashBuffer":{"type":"Buffer","data":[46,181,189,146,134,20,32,209,4,181,28,172,156,82,101,174,76,75,18,216]},"announce":[],"urlList":[]}}