{"title":"Carl Hiaasen - Hoot","uid":4618397,"size":370295758,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2edd2d88dd7f2d94219848219659e3ca60f948ee&amp;dn=Carl+Hiaasen+-+Hoot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"g-roid","files":-1,"time":1230930874,"description":"HOOT\nby CARL HIAASEN\n\nRoy Eberhardt has recently, and unhappily, arrived In Florida. &quot;Disney World Is an armpit,&quot; he states flatly, &quot;compared to Montana.&quot;\n\nRoy's family moves a lot, so he's used to the new-kid drill. Florida bullies are pretty much like bullies everywhere. But Roy finds himself oddly Indebted to the hulking Dana Matherson. If Dana hadn't been sinking his thumbs Into Roy's temples and mashing his face against the school-bus window, Roy might never have spotted the running boy. And the running boy Is the first Interesting thing Roy's seen In Florida. \n\nThe boy was about Roy's age, but he was running away from the school bus. He had no books, no backpack, and, here's the odd part, no shoes.\n\nSensing a mystery, Roy sets himself on the boy's trail. The chase will introduce him to some other intriguing Floridian creatures: potty-trained alligators, a beleaguered construction foreman, some burrowing owls, a fake-fart champion, a renegade eco-avenger, some slippery fish, a sinister pancake PR man, and several extremely poisonous snakes with unnaturally sparkling tails. \nLife in Florida is looking up. \n\nCARL HIAASEN has been writing about Florida since his father gave him a typewriter at age six. Then it was hunt-and-peck stories about neighborhood kickball and softball games, given away to his friends. Now Hiaasen writes columns for the Miami Herald and is the author of many best-selling novels for adults, including &quot;Sick Puppy&quot; and &quot;Basket Case&quot;. &quot;Hoot&quot;, Hiaasen's first novel for young listeners, is full of his trademark satirical wit, revealing the good, the bad, and the screwy state of Florida. \n\nCHAD LOWE, an Emmy Award-winning actor, has starred in such television series as &quot;E.R.&quot;, &quot;Now and Again&quot;, &quot;Law and Order: Special Victims Unit&quot;, &quot;Popular&quot;, and &quot;Melrose Place&quot;. His film credits Include &quot;Unfaithful&quot;, Robin Cook's &quot;Acceptable Risk&quot;, and &quot;Take Me Home: The John Denver Story&quot;.\n\n6 hours, 25 minutes from 6 CDs. In MP3 format.","torrent":{"xt":"urn:btih:2edd2d88dd7f2d94219848219659e3ca60f948ee","amp;dn":"Carl+Hiaasen+-+Hoot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2edd2d88dd7f2d94219848219659e3ca60f948ee","infoHashBuffer":{"type":"Buffer","data":[46,221,45,136,221,127,45,148,33,152,72,33,150,89,227,202,96,249,72,238]},"announce":[],"urlList":[]}}