{"title":"Stations of the Elevated 1981 New York City Subway Graffiti Docu","uid":5332141,"size":262244896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f05cd3e8ca6da4f2389054cdefcbd7792a563d5&amp;dn=Stations+of+the+Elevated+1981+New+York+City+Subway+Graffiti+Docu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"frit0","files":1,"time":1265206366,"description":"I was tempted to add this to the New York City/Times Square Docu pack I posted last week, but it has a radically different feel to it, so here it is on its own. I dunno anything about these kinda flicks so here's reviews from people who allegedly do:\n\nA review:\n\nI saw this, years ago, and NEVER forgot it. The disclaimer should be that this is NOT a music video for Mingus (although I think he would've approved of the outcome, as it is very much in the tradition of his playing) it is also not your standard graffiti or train enthusiast's documentary, but all of these elements come together in this beautiful and patient film. The director repeatedly creates both fascinating and absurd comparisons by focusing on the most subtle details in the landscape. This is a true work of art! There are also some stunning shots of the South Bronx in it's darkest days. Highly recommended for artists working in any medium who are concerned with urban life. \n\n\nQuality is VHS-rip, some audio hissing but the sound mostly covers it, video is great considering source.\n\nProps to extraloll for the original up, dunno who ripped it but props to them as well.","torrent":{"xt":"urn:btih:2f05cd3e8ca6da4f2389054cdefcbd7792a563d5","amp;dn":"Stations+of+the+Elevated+1981+New+York+City+Subway+Graffiti+Docu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f05cd3e8ca6da4f2389054cdefcbd7792a563d5","infoHashBuffer":{"type":"Buffer","data":[47,5,205,62,140,166,218,79,35,137,5,76,222,252,189,119,146,165,99,213]},"announce":[],"urlList":[]}}