{"title":"OpenVMS.HP-C-Alpha-0hqaa_7_1_ssb.zip","uid":5050273,"size":20713818,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:2ff52410d3fdc79f2843be66abfe64cd9bb93424&amp;dn=OpenVMS.HP-C-Alpha-0hqaa_7_1_ssb.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SysManOne","files":1,"time":1250162486,"description":"HP C (formerly Compaq C) is a standard conforming implementation of the C programming language with HP extensions. The HP C compiler runs under the OpenVMS VAX, Alpha, and I64 Operating Systems and generates optimized and position-independent code.\nHP C is a native-mode language product, and is integrated into the Common Language Environments. All OpenVMS system services are available to programs written in HP C. HP C programs can invoke, as functions, modules written in other languages.\nHP C supports Record Management Services (RMS) for sequential file organizations and associated access methods. HP C also supports stream file-access methods common among many C implementations.\nHP C provides extensive standard-conformance checking, as well as many optional code-quality and portability diagnostics, and supports the lint-like features of the HP Source Code Analyzer. The HP Source Code Analyzer allows the programmer to check for consistent function usage throughout a program environment. HP C also generates complete debug and traceback records for use with OpenVMS Debug. Debug allows the C programmer to set breakpoints, examine and modify the contents of user variables, and selectively halt or continue program execution.\nHP C on OpenVMS (Alpha and I64, not VAX) provides IEEE floating-point support as defined by, and in conformance with, the IEEE 754 Standard.","torrent":{"xt":"urn:btih:2ff52410d3fdc79f2843be66abfe64cd9bb93424","amp;dn":"OpenVMS.HP-C-Alpha-0hqaa_7_1_ssb.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff52410d3fdc79f2843be66abfe64cd9bb93424","infoHashBuffer":{"type":"Buffer","data":[47,245,36,16,211,253,199,159,40,67,190,102,171,254,100,205,155,185,52,36]},"announce":[],"urlList":[]}}