{"title":"Everything - A VERY POWERFUL,Small,FAST, USEFUL WINDOWS SEARCH T","uid":6153366,"size":341811,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:300873f2b4ffe607e60b95f2ea502ec2e5fdc9c9&amp;dn=Everything+-+A+VERY+POWERFUL%2CSmall%2CFAST%2C+USEFUL+WINDOWS+SEARCH+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"locobot12","files":1,"time":1296950445,"description":" &lt;a href=&quot;http://www.voidtools.com/faq.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.voidtools.com/faq.php&lt;/a&gt;\n\n\n1 What is &quot;Everything&quot;?\n\n&quot;Everything&quot; is an administrative tool that locates files and folders by filename instantly for Windows.\nUnlike Windows search &quot;Everything&quot; initially displays every file and folder on your computer (hence the name &quot;Everything&quot;).\nYou type in a search filter to limit what files and folders are displayed.\n\n\n1.2 How long will it take to index my files?\n\n&quot;Everything&quot; only uses file and folder names and generally takes a few seconds to build its database.\nA fresh install of Windows XP SP2 (about 20,000 files) will take about 1 second to index.\n1,000,000 files will take about 1 minute.\n\n\n1.3 Does Everything search file contents?\n\nNo, &quot;Everything&quot; does not search file contents, only file and folder names.\n\n\n\n1.4 Does &quot;Everything&quot; hog my system resources?\n\nNo, &quot;Everything&quot; uses very little system resources.\nA fresh install of Windows XP SP2 (about 20,000 files) will use about 3-5mb of ram and less than 1mb of disk space.\n1,000,000 files will use about 45mb of ram and 5mb of disk space.\n\n\n1.5 Does &quot;Everything&quot; monitor file system changes?\n\nYes, &quot;Everything&quot; does monitor file system changes.\nYour search windows will reflect changes made to the file system.\n\n1.6 Is &quot;Everything&quot; free?\n\nYes, &quot;Everything&quot; is Freeware.\nIf you use &quot;Everything&quot; in a commercial environment and find it useful a donation would be appreciated.\n\n1.7 Does &quot;Everything&quot; miss changes made to the file system if it is not running?\n\nNo, &quot;Everything&quot; can be closed and restarted without missing changes made to the file system (even across system restarts).\n&quot;Everything&quot; updates the database when it is started.\n\n1.8 What are the system requirements for &quot;Everything&quot;?\n\n&quot;Everything&quot; will run on Windows 2000, XP, 2003 and Vista and Windows 7\n&quot;Everything&quot; will only locate files and folders on local NTFS volumes.\n&quot;Everything&quot; requires administrative privileges for low level read access to volumes.\n\n1.9 How do I convert a volume to NTFS?\n &lt;a href=&quot;\nhttp://support.microsoft.com/kb/307881&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://support.microsoft.com/kb/307881&lt;/a&gt;\n\n1.10 Can &quot;Everything&quot; index a mapped network drive?\n\nNo, &quot;Everything&quot; only indexes local or removable NTFS volumes.\n\nTo search a networked computer you will need to run Everything on both computers.\nOne computer will need to Start an ETP server.\nThe other computer will need to connect to that ETP server.\n\nTo start an ETP server:\n1. In Everything, On the Tools menu, click Start ETP server.\n\nTo connect to an ETP server:\n1. In Everything, On the Tools menu, click Connect to ETP Server....\n2. Type in the ETP server name.\n3. Type in the ETP server port.\n4. Type in the ETP server user.\n5. Type in the ETP server password.\n6. Click OK.\n\n1.11 How do I install the language pack?\n\nDownload the language pack Everything.lng.zip\nUnzip the language pack into the folder where &quot;Everything&quot; is installed.\nRestart Everything.\nIn &quot;Everything&quot;, On the Tools menu, click Options.\nClick the General tab.\nSelect your language from the Language dropdown list.\nClick OK.\nIn the &quot;language change&quot; popup, Click OK.\nRestart Everything.\n\n1.12 How do I bypass the UAC to run &quot;Everything&quot; with administrative privileges on system startup?\n\nDisable run on system startup in &quot;Everything&quot;.\nFollow the Make Vista launch UAC restricted programs at startup with Task Scheduler guide at &lt;a href=&quot;\nhttp://blogs.techrepublic.com.com/window-on-windows/?p=616&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blogs.techrepublic.com.com/window-on-windows/?p=616&lt;/a&gt;\nMake sure you use -startup in the Add Arguments box\n\n1.13 How do I bypass the UAC to run &quot;Everything&quot; with administrative privileges \n\nwhen I start it from a shortcut ? &lt;a href=&quot;\nhttp://blogs.techrepublic.com.com/window-on-windows/?p=730&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blogs.techrepublic.com.com/window-on-windows/?p=730&lt;/a&gt;\n\n2 Searching\n\n2.1 How do I search for a file or folder?\nType the partial file or folder name into the search edit, the results will appear instantly.\n\n2.2 How do I use boolean operators?\n\nAND is the default boolean operator.\nFor example, here is how to search for foo and bar: foo bar\nTo search for either of two search terms, add a | between the terms.\nFor example, here is how to search for .jpg or .bmp: .jpg | .bmp\nTo exclude something from the search include a ! at the front of the term.\nFor example, here is how to search for abc and not 123: abc !123\n\n2.3 How do I use wildcards?\n\nUsing a * in your search will match any number of any type of character.\nFor example, here is how to search for files and folders that start with e and end with g: e*g\nUsing a ? in your search will match one character.\nFor example, here is how to search for files that have a 2 letter file extension: *.??\n\n2.4 How do I use regex?\n\n|\tA vertical bar separates alternatives. For example, gray|grey can match &quot;gray&quot; or &quot;grey&quot;.\n()\tParentheses are used to define the scope and precedence of the operators (among other uses). For example, gray|grey and gr(a|e)y are equivalent patterns which both describe the set of &quot;gray&quot; and &quot;grey&quot;.\n?\tThe question mark indicates there is zero or one of the preceding element. For example, colou?r matches both &quot;color&quot; and &quot;colour&quot;.\n*\tThe asterisk indicates there are zero or more of the preceding element. For example, ab*c matches &quot;ac&quot;, &quot;abc&quot;, &quot;abbc&quot;, &quot;abbbc&quot;, and so on.\n+\tThe plus sign indicates that there is one or more of the preceding element. For example, ab+c matches &quot;abc&quot;, &quot;abbc&quot;, &quot;abbbc&quot;, and so on, but not &quot;ac&quot;.\n.\tMatches any single character except newlines (exactly which characters are considered newlines is flavor, character encoding, and platform specific, but it is safe to assume that the line feed character is included). Within POSIX bracket expressions, the dot character matches a literal dot. For example, a.c matches &quot;abc&quot;, etc., but [a.c] matches only &quot;a&quot;, &quot;.&quot;, or &quot;c&quot;.\n[ ]\tA bracket expression. Matches a single character that is contained within the brackets. For example, [abc] matches &quot;a&quot;, &quot;b&quot;, or &quot;c&quot;. [a-z] specifies a range which matches any lowercase letter from &quot;a&quot; to &quot;z&quot;. These forms can be mixed: [abcx-z] matches &quot;a&quot;, &quot;b&quot;, &quot;c&quot;, &quot;x&quot;, &quot;y&quot;, and &quot;z&quot;, as does [a-cx-z]\n[^ ]\tMatches a single character that is not contained within the brackets. For example, [^abc] matches any character other than &quot;a&quot;, &quot;b&quot;, or &quot;c&quot;. [^a-z] matches any single character that is not a lowercase letter from &quot;a&quot; to &quot;z&quot;. As above, literal characters and ranges can be mixed.\n^\tMatches the starting position within the string. In line-based tools, it matches the starting position of any line.\n$\tMatches the ending position of the string or the position just before a string-ending newline. In line-based tools, it matches the ending position of any line.\n{m,n}\tMatches the preceding element at least m and not more than n times. For example, a{3,5} matches only &quot;aaa&quot;, &quot;aaaa&quot;, and &quot;aaaaa&quot;. This is not found in a few, older instances of regular expressions.\n2.5 How do I include spaces in my search?\nTo include spaces in your search enclose your search in double quotes.\nFor example, here is how to search for foo&lt;space&gt;bar: &quot;foo bar&quot;\n\n2.6 How do I search for a file type?\nTo search for a file type, type the file extension into the search edit,\nie to search for the mp3 file type, type *.mp3 into the search edit.\nTo search for more than one type of file type use a | to separate file types,\nie *.bmp|*.jpg will search for files with the extension bmp or jpg.\n\n2.7 How do I search for files and folders in a specific location?\nTo search for files and folders in a specific location include a \\ in your search string.\nFor example, here is how to search for all your avis in a downloads folder: downloads\\ .avi\nYou could alternately enable Match Path in the Search menu and include the location in your search string.\nFor example, here is how to search for all your avis in a downloads folder with Match Path enabled: downloads .avi\n\n3 Results\n3.1 How do I jump to a file or folder in the result list?\nMake sure the result list has focus by tabbing to it with the keyboard or clicking in it with the mouse.\nType in the partial or full name of the file or folder you want to jump to.\nFor example, to jump to files or folders begining with &quot;New&quot; type New into the result list.\n\n4 Customizing\n4.1 How can I change the &quot;Everything&quot; icon?\nRequires &quot;Everything&quot; 1.2.0 beta or later.\nCopy your icon file into &quot;Everything&quot;'s installation folder and rename it to &quot;Everything.ico&quot;.\nRestart &quot;Everything&quot;.\n\n4.2 How can I set &quot;Everything&quot; to use an external file manager?\nRequires &quot;Everything&quot; 1.2.0 beta or later.\nExit Everything.\nOpen Everything.ini in &quot;Everything&quot;'s installation folder.\nAdd the following 2 lines to the bottom of the ini:\nopen_folder_command=$exec(&quot;ExternalFileManager.exe&quot; &quot;%1&quot;)\nopen_folder_path_command=$exec(&quot;ExternalFileManager.exe&quot; &quot;$parent(%1)&quot;)\nReplace the text ExternalFileManager.exe with the full path and file name of your file manager executable.\nCheck your external file manager help for any required command line parameters.\nRestart &quot;Everything&quot;.\n","torrent":{"xt":"urn:btih:300873f2b4ffe607e60b95f2ea502ec2e5fdc9c9","amp;dn":"Everything+-+A+VERY+POWERFUL%2CSmall%2CFAST%2C+USEFUL+WINDOWS+SEARCH+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"300873f2b4ffe607e60b95f2ea502ec2e5fdc9c9","infoHashBuffer":{"type":"Buffer","data":[48,8,115,242,180,255,230,7,230,11,149,242,234,80,46,194,229,253,201,201]},"announce":[],"urlList":[]}}