{"title":"TTC - The United States And The Middle East 1914-9-11 - Salim Ya","uid":3362969,"size":360805170,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:30b178479d1b98f231ea3c44d12716cd26e723cf&amp;dn=TTC+-+The+United+States+And+The+Middle+East+1914-9-11+-+Salim+Ya&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tvass","files":145,"time":1122710735,"description":"United States and the Middle East: 1914 to 9/11\n(24 lectures, 30 minutes/lecture)\nCourse No. 8593\n\nTaught by Salim Yaqub\nUniversity of Chicago\nPh.D., Yale University\n\n\n\nCourse Lecture Titles\n  \t\n\n   1. A Meeting of Two Worlds\n   2. Wilson &amp; the Breakup of the Ottoman Empire\n   3. The Interwar Period\n   4. U.S. &amp; the Middle East During World War II\n   5. Origins of the Cold War in the Middle East\n   6. Truman &amp; the Creation of Israel\n   7. Eisenhower, the Cold War &amp; the Middle East\n   8. The Suez Crisis &amp; Arab Nationalism\n   9. Kennedy?Engaging Middle Eastern Nationalism\n  10. Johnson?Taking Sides\n  11. The Six?Day War\n  12. The Nixon Doctrine &amp; the Middle East\n  13. The Yom Kippur War &amp; Kissinger's Diplomacy\n  14. Carter &amp; Camp David\n  15. The Iranian Revolution &amp; the Hostage Crisis\n  16. Era of Limits?Energy Crises of the 1970s\n  17. The Soviet Invasion of Afghanistan\n  18. Reagan &amp; the Middle East\n  19. The First Palestinian Intifada\n  20. The Gulf War\n  21. The Rise &amp; Fall of the Oslo Peace Process\n  22. The United States &amp; the Kurds\n  23. The United States &amp; Osama bin Laden\n  24. September 11 &amp; Its Aftermath\n\n\n\nAt the dawn of World War I, the United States was only a rising power. Our reputation was relatively benign among Middle Easterners, who saw no &quot;imperial ambitions&quot; in our presence and were grateful for the educational and philanthropic services Americans provided.\n\nYet by September 11, 2001, everything had changed. The U.S. had now become a &quot;world colossus so prominent in the political, economic, and cultural life of the Middle East that it was the unquestioned target of those bent on attacking the West for its perceived offenses against Islam.&quot;\n\nHow and why did this transformation come about? And how did each of the factors that make the Middle East so complex contribute to this transformation?\nPlacing Today's Headlines in Historical Context\n\nThis lecture series is a narrative history of U.S. political involvement in the Middle East from World War I to the present day. Presented from a historian's perspective, it is meant to strengthen your ability to place today's headlines into historical context, evaluate what is most likely to happen next, and understand those oncoming events when they do occur.\n\nStep by step, with attention to the viewpoints and motivations of each nation and leader involved, the course explores, over a 90-year span:\n\n    * growing American involvement in the Middle East\n    * the ongoing quest for political independence and self-mastery by Middle Easterners\n    * the difficulty the U.S. has experienced in weighing diverse and conflicting objectives in the region, especially as the Cold War against the Soviet Union intensified\n    * the increasing antagonism between Americans and Middle Easterners that came to such a shocking culmination on September 11, 2001.\n\nOver and over again, these themes surface, expressed in the actions of characters in a history still being written as we watch. America's presidents from Woodrow Wilson to George W. Bush. George Kennan. David Ben-Gurion. Gamal Abdel Nasser. Mohammed Shah Pahlavi. Ariel Sharon. Yasser Arafat. Ayatollah Ruhollah Khomeini. Menachem Begin. Saddam Hussein.\n\nThe course ranges across subjects as diverse as the changing realities of the oil economy, the impact of changing policies as a succession of American presidents bring their own ideas and doctrines to the arena of the Middle East, or the craft of geopolitics played both successfully and not, as Anwar Sadat and Henry Kissinger maneuver during the Yom Kippur War.\n\nDr. Salim Yaqub's background offers a unique opportunity to present the issues of this course from both American and Middle Eastern perspectives (the latter of which are rarely homogenous and often contentious).\n\nDr. Yaqub is also the son of an American mother and a Palestinian father. His father taught at the American University in Beirut, and the family lived in the expatriate American community while Dr. Yaqub was a high school student in the 1970s.\n\nWhen he discusses the epidemic of hostage-taking by Shiite extremists that plagued that community during the Reagan administration, for example, it isn't only from the viewpoint of an academic, but from the experience of someone who personally knew victims of terror.\nChanging U.S. Involvement through Two World Wars\n\nYou learn in this course that many of the seeds of U.S. policy and its dilemmas were planted during the administration of Woodrow Wilson.\n\nIt's fascinating to view, with the benefit of hindsight, the later ramifications of issues like Wilson's endorsement of the Balfour Declaration, and its collision with the concept of national self-determination Wilson advanced in his famous &quot;Fourteen Points.&quot; Or the decisions made at the 1920 San Remo Conference when Europe's victors (with minimal U.S. participation) divided the Ottoman Empire's non-Turkish areas into &quot;mandates&quot; to be temporarily administered by France (Syria and Lebanon) and Great Britain (Iraq, Transjordan, and Palestine) until ready for independence.\n\nOf all the Arab nations east of Egypt, only Saudi Arabia was to receive immediate independence, and the decision caused shock and dismay throughout the Arab world.\n\nBy the time World War II was approaching, the factors that would ultimately have such a tremendous impact on U.S. involvement in the region were beginning to coalesce. Germany's increasingly monstrous policies against the Jews, combined with restrictive immigration policies and existing promises of a homeland in Palestine, were colliding with Middle Easterners' own aspirations for self-determination.\n\nAnd now oil entered the picture: the American embrace of the automobile had made the petroleum in the Middle East vitally important.\n\nAs the course progresses, Professor Yaqub brings together the events and personalities of the next six decades, creating a vivid context against which recent and current history can be understood. Consider three examples:\n\n    * Choosing Iran's Leader. You see Great Britain and the Soviet Union forcing the 1941 abdication of Reza Shah?considered too supportive of Germany?from the throne of Iran in favor of his son, the far more malleable Mohammed Shah Pahlavi. Under this younger Shah's rule an immense American establishment took root in Iran. You see the social tensions that would, combined with the Shah's internal policies, eventually explode during the hostage crisis that doomed Jimmy Carter's presidency.\n    * Creating Israel. Professor Yaqub explains the background leading to the U.N. vote on partition and the creation of a Jewish state. He shows how motivations as mixed as genuine humanitarianism, domestic politics, and simple inertia moved President Truman to direct a U.S. vote in favor of partition. But he notes that President Truman then stood by to let the new state &quot;fight [its] own battle&quot; against the Arabs. The administration's &quot;passivity and ineffectualness&quot; is captured in a public statement by America's ambassador to the U.N., who pleaded with Arabs and Zionists to?and we quote?&quot;settle this problem in a true Christian spirit.&quot;\n    * The U.S. in Iraq and Afghanistan. Ironies in our relations with this region abound:\n                + The United States has fought two wars in Iraq barely more than a decade apart. The history of the Hussein regime and the sometimes ambivalent American policies toward it are explored.\n                + We are fighting a war in Afghanistan whose own roots extend not only to a terrorist attack on our nation but to a revolution in Afghanistan?supported by the U.S.?out of which Osama bin Laden and his al-Queda network were bred. What spurred the rise of this terrorist group in the 1990s?\n\n      Like all the topics into which this course delves, these share something in common. None can really be understood in isolation from the others. The subject of the Middle East and America's relationship to it demands a contextual understanding if today's events?and tomorrow's?are truly to be understood.","torrent":{"xt":"urn:btih:30b178479d1b98f231ea3c44d12716cd26e723cf","amp;dn":"TTC+-+The+United+States+And+The+Middle+East+1914-9-11+-+Salim+Ya","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b178479d1b98f231ea3c44d12716cd26e723cf","infoHashBuffer":{"type":"Buffer","data":[48,177,120,71,157,27,152,242,49,234,60,68,209,39,22,205,38,231,35,207]},"announce":[],"urlList":[]}}