{"title":"Ghost in the Shell-Double Pack [Ntsc-Usa] Ps2 + Ps1 Game","uid":4747167,"size":3124013404,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3202038542944be7beefd735b8ed7f46b2a154bf&amp;dn=Ghost+in+the+Shell-Double+Pack+%5BNtsc-Usa%5D+Ps2+%2B+Ps1+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Big_dude","files":-1,"time":1235941124,"description":"This Torrent contains both games for the Ps2 &amp; Ps1...\n\nGhost in the shell stand alone complex for Ps2.  And Ghost in the Shell for Ps1.\n\n***********************************************************************************\nGhost in the Shell: Stone Alone Complex for Ps2.       Rel. Nov. 08 2004 \n\n\nFormat:\t       DVD5 NTSC-USA\nLang.:\t       English/Russian\nDiscs:          1\nImage:          ISO\nRequirements:   Modded/Chipped ps2, or Swap Magic Disc method. \n\nGames Compressed with Winrar. Both were tested and work.\n\nNote: you can extract winrar formats with 7-Zip, 7-Zip is free.\n\n(You could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.)\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n     &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n     &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nYou will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Try Verbatim DVD+R (Booktype to DVD-ROM), or Tayio Yuden, burn at 8x if its a 16x max. You really can't use Maxell DVD+R for example or some other brand as it more than likely will not work.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Try Swap Magic to load the game.\n\n\nGhost in the shell stand alone complex is very cool! Puts you right into the anime style, with graphics to boot. Great game from its rival of the Ps1 and what a better update. Its worth playing and fun.\n\nNote: Game begins with either russian or english version choose yours, and enjoy. And sometimes when you start up the game after the demo plays if you leave it running for awhile the screen will go blank you have to restart the game.  Nothing major the game is fully working and playable, just something I noticed. Oh and the text that displays as jibberish during the cutscenes is normal its part of the game don't know why that's just how they made it.\n\nGame Description:\n\n*  Use the Major's incredible fighting skills and firepower against deadly\n   cyborgs - multiple high-tech firearms, graceful fighting moves, wall-jumping \n   techniques and even thermal camouflage. \n\n*  Navigate through maze-like levels as you collect enemy ID codes and complete \n   mission objectives.\n \n*  The machine world is at your disposal here -- jack into security cameras to \n   see enemy positions, control tiny robots to reach areas you can't enter \n   and much more.\n \n*  Pay attention to your teammates transmissions -- they include valuable help \n   and advance the web of deceit you'll be facing Control huge cyborg Batou \n   and the naive, hyper Tachikoma insect-tank robots in glorious side missions.\n\nGhost In The Shell: Stand Alone Complex makes you part of a dangerous storyline in the very near future. In 2030, cyborgs are a fact of life and human brains are linked directly to the Internet. In this wired world, the elite force called Section 9 are on the front lines against terrorist cyborgs and &quot;ghost hackers&quot;. When they go after a cyborg arms dealer, they enter deep into a conspiracy of ghost hacking and cybernetic human modification practices. Take control of Section 9 leader Motoko Kusanagi - &quot;The Major&quot; - and take her team to victory! Based on the hit anime.\n\n\n\nBurn the Iso with DVD Decrypter (Dvd Decrypter Included in download) or Nero.\n\nUse good media like Verbatim DVD+R (Booktype it to DVD-ROM) or Tayio Yuden.\n\nPlease seed this when your done, I can't seed 24/7.\n\nAny Problems, questions or comments please don't hestiate to post them.\n\n\nEnjoy! \n\n\n***********************************************************************************\nGhost in the Shell for PS1                                 Rel. 12/03/1997\n\n\nFormat:         CD-R NTSC-USA\nDiscs:   \t       1\nLang.:   \t       English\nImage:\t       MDS/MDF\nRequirements:   Modded/Chipped Ps1, or Ps2. Breaker Pro Boot Cd, \n                Game Enchancer with built-in mod (Allows playing of backups) \n                Or Psx Emulator. (Only need one of these methods).\n\n\nGame was tested and works.\n\n\nGame Description:\n\n3rd person action game based on the Ghost in the Shell original comic by Masamune Shirow rather than Mamoru Oshi's film. You take the role of a new member in Kusanagi's anti-terrorist squad and get to accomplish missions on your Fuchikoma, (a spider-like AI equiped tank) thanks to which you can jump, stick to walls and ceilings and shoot the hell out of terrorists, all from a 1st or 3rd person point of view. As the missions procede a plot starts to surface concerning a giant skyscrapper, the Aereopolis II, which will eventually be solved after 12 single player missions. Other features include a training sequence, 3D stereo sound and wide anamorphic screen mode for 16x9 TVs.\n\n\nGame pics included.\n\nBurn with Alcohol 120% (Included in download). \n\nSet datatype setting to playstation (Write Method Raw/Dao).\n\nBurn at 8x or 4x speed.\n\nUse Good Media like Verbatim Datalife Plus CD-R or Tayio Yuden. \n(Any Verbatim cd-r media will work just fine).\n\nTDK is also a fairly good media but verbatim is probably your best bet for quality.\n\n\nAny Problems, questions, or comments please don't hestiate to post them.\n\n\nPlease seed when done.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:3202038542944be7beefd735b8ed7f46b2a154bf","amp;dn":"Ghost+in+the+Shell-Double+Pack+%5BNtsc-Usa%5D+Ps2+%2B+Ps1+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3202038542944be7beefd735b8ed7f46b2a154bf","infoHashBuffer":{"type":"Buffer","data":[50,2,3,133,66,148,75,231,190,239,215,53,184,237,127,70,178,161,84,191]},"announce":[],"urlList":[]}}