{"title":"Albert King - Born Under A Bad Sign (1967) [FLAC] (MFSL Gold UDC","uid":9438369,"size":191163253,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3208bcb5cd425afe1b64e6a777395ec74a0a6842&amp;dn=Albert+King+-+Born+Under+A+Bad+Sign+%281967%29+%5BFLAC%5D+%28MFSL+Gold+UDC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"gnatwing","files":-1,"time":1388948573,"description":"eac secure cue log scans  \n\nAlbert King - Born Under A Bad Sign (1967) [FLAC] (MFSL Gold UDCD 577)\n\nAlbert King recorded a lot in the early '60s, including some classic sides, but they never quite hit the mark. They never gained a large audience, nor did they really capture the ferocity of his single-string leads. Then he signed with Stax in 1966 and recorded a number of sessions with the house band, Booker T. &amp; the MG's, and everything just clicked. The MG's gave King supple Southern support, providing an excellent contrast to his tightly wound lead guitar, allowing to him to unleash a torrent of blistering guitar runs that were profoundly influential, not just in blues, but in rock &amp; roll (witness Eric Clapton's unabashed copping of King throughout Cream's Disraeli Gears). Initially, these sessions were just released as singles, but they were soon compiled as King's Stax debut, Born Under a Bad Sign. Certainly, the concentration of singles gives the album a consistency -- these were songs devised to get attention -- but, years later, it's astounding how strong this catalog of songs is: &quot;Born Under a Bad Sign,&quot; &quot;Crosscut Saw,&quot; &quot;Oh Pretty Woman,&quot; &quot;The Hunter,&quot; &quot;Personal Manager,&quot; and &quot;Laundromat Blues&quot; form the very foundation of Albert King's musical identity and legacy. Few blues albums are this on a cut-by-cut level; the songs are exceptional and the performances are rich, from King's dynamic playing to the Southern funk of The MG's. It was immediately influential at the time and, over the years, it has only grown in stature as one of the very greatest electric blues albums of all time. ","torrent":{"xt":"urn:btih:3208bcb5cd425afe1b64e6a777395ec74a0a6842","amp;dn":"Albert+King+-+Born+Under+A+Bad+Sign+%281967%29+%5BFLAC%5D+%28MFSL+Gold+UDC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3208bcb5cd425afe1b64e6a777395ec74a0a6842","infoHashBuffer":{"type":"Buffer","data":[50,8,188,181,205,66,90,254,27,100,230,167,119,57,94,199,74,10,104,66]},"announce":[],"urlList":[]}}