{"title":"Thermodynamics of Crystalline States 2nd ed","uid":12014242,"size":4014543,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:322f599c60e0df908f7abf11069dab23ab6442f0&amp;dn=Thermodynamics+of+Crystalline+States+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1434280140,"description":"ISBN 9781461450849\n\nThermodynamics is a well-established discipline of physics for properties of matter in thermal equilibrium with the surroundings. Applying to crystals, however, the laws encounter undefined properties of crystal lattice, which therefore need to be determined for a clear and well-defined description of crystalline states. Thermodynamics of Crystalline States explores the roles played by order variables and dynamic lattices in crystals in a wholly new way.\n\nThe book begins by clarifying basic concepts for stable crystals. Next, binary phase transitions are discussed to study collective motion of order variables, as described mostly as classical phenomena. New to this edition is the examination of magnetic crystals, where magnetic symmetry is essential for magnetic phase transitions. The multi-electron system is also discussed  theoretically, as a quantum-mechanical example, for superconductivity in metallic crystals. Throughout the book, the role played by the lattice is emphasized and studied in-depth.\n\nThermodynamics of Crystalline States is an introductory treatise and textbook on mesoscopic phenomena in solid states, constituting a basic subject in condensed matter physics. While this book serves as a guide for advanced students in physics and material science, it can also be useful as a reference for all professionals in related fields","torrent":{"xt":"urn:btih:322f599c60e0df908f7abf11069dab23ab6442f0","amp;dn":"Thermodynamics+of+Crystalline+States+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"322f599c60e0df908f7abf11069dab23ab6442f0","infoHashBuffer":{"type":"Buffer","data":[50,47,89,156,96,224,223,144,143,122,191,17,6,157,171,35,171,100,66,240]},"announce":[],"urlList":[]}}