{"title":"Frederick Buechner - 16 books","uid":8923535,"size":18549958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32cd6ccda8e6d4964037dcde8e867f6739add5b9&amp;dn=Frederick+Buechner+-+16+books&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":52,"time":1379311219,"description":"Sixteen books by Frederick Buechner -- various formats, most from retail sources.\n\nFiction:\n\n1. The Book of Bebb (pdf)\n2. Brendan (pdf)\n3. Godric (epub, mobi)\n4. On the Road With the Archangel (epub, mobi)\n5. The Son of Laughter (pdf)\n6. The Storm (epub, mobi)\n\nMemoir:\n \n7. Telling Secrets (pdf)\n8. The Longing for Home: Reflections at Midlife (pdf)\n\nSermons:\n\n9. Secrets in the Dark: A Life in Sermons (pdf)\n\nReligion/Inspirational:\n\n10. The Alphabet of Grace (pdf)\n11. Beyond Words: Daily Readings in the ABC's of Faith (pdf)\n12. Listening to Your Life: Daily Meditations (pdf)\n13. A Room Called Remember: Uncollected Pieces (pdf)\n14. Speak What We Feel: Not What We Ought to Say (pdf)\n15. Telling the Truth: The Gospel as Tragedy, Comedy, and Fairy Tale (pdf - scanned)\n16. Whistling in the Dark: A Doubter's Dictionary (pdf)\n\n\nabout the author (from wikipedia):\n\nFrederick Buechner is an American writer and theologian. Born July 11, 1926 in New York City, he is an ordained Presbyterian minister and the author of more than thirty published books thus far. His work encompasses different genres, including fiction, autobiography, essays and sermons, and his career has spanned six decades. Buechner's books have been translated into many languages for publication around the world.\n\nBuechner's work has often been praised for its ability to inspire readers to see the grace in their daily lives. As stated in the London Free Press, &quot;He is one of our great novelists because he is one of our finest religious writers.&quot;\n\nThroughout Buechner's work his hallmark as a theologian and autobiographer is his regard for the appearance of the divine in daily life. By examining the day-to-day workings of his own life, Buechner seeks to find God's hand at work, thus leading his audience by example to similar introspection. The Reverend Samuel Lloyd describes his &quot;capacity to see into the heart of every day,&quot; an ability that reflects the significance of daily events onto the reader's life as well. In the words of the preacher Barbara Brown Taylor: &quot;From [Buechner] I've learned that the only limit to the revelation going on all around me is my willingness to turn aside and look.&quot;","torrent":{"xt":"urn:btih:32cd6ccda8e6d4964037dcde8e867f6739add5b9","amp;dn":"Frederick+Buechner+-+16+books","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32cd6ccda8e6d4964037dcde8e867f6739add5b9","infoHashBuffer":{"type":"Buffer","data":[50,205,108,205,168,230,212,150,64,55,220,222,142,134,127,103,57,173,213,185]},"announce":[],"urlList":[]}}