{"title":"PSI Spies: The True Story of America's Psychic Warfare Progra","uid":5623440,"size":2297693,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:331502b2334b33a1af9f1a34d0724220c8fcc365&amp;dn=PSI+Spies%3A+The+True+Story+of+America%5C%27s+Psychic+Warfare+Progra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Djofullinn","files":1,"time":1276372497,"description":"Editorial Reviews\nProduct Description\nPSI Spies will take you behind the scenes of the U.S. Armys formerly top-secret remote viewing unit to discover how the military has used this psychic ability as a tool, and a weapon. Despite the fact that remote viewing was developed by various tax-supported government agencies, including the CIA, the Defense Intelligence Agency, and even the U.S. Army, a majority of Americans still have never heard of this faculty.\n\nIn the 1970s, with the support of Congress, the Army formed a small unit of remote viewers to spy for America. These soldiers/psychic spies gained penetrating knowledge about a wide variety of subjects. They were consulted to stop a Soviet plot to kill President Ronald Reagan. They mentally prowled the halls of the Kremlin. They probed Iraqs hidden weapons sites in preparation for the 1991 Gulf War.\n\nFrom insights into our future to the continuing mysteries of UFOs and crop circles, no subject has been immune to the military remote viewers--America's Psi Spies.\nFrom the Back Cover\n&quot;In PSI Spies, Jim Marrs has provided the original report on the U.S. Army's use of psychic remote viewing as an intelligence tool. Here's how military remote viewing got its start.&quot;\n--Whitley Strieber, author of Communion and The Grays\n\n&quot;PSI Spies is one of the best books ever written about the U.S. government's top-secret psychic warfare unit. Marrs introduces us to all involved in this covert project and gives a detailed view of the benefits and limitations of applied remote viewing. I highly recommend it.&quot;\n--Simeon Hein, Ph.D., author of Opening Minds","torrent":{"xt":"urn:btih:331502b2334b33a1af9f1a34d0724220c8fcc365","amp;dn":"PSI+Spies%3A+The+True+Story+of+America%5C%27s+Psychic+Warfare+Progra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"331502b2334b33a1af9f1a34d0724220c8fcc365","infoHashBuffer":{"type":"Buffer","data":[51,21,2,178,51,75,51,161,175,159,26,52,208,114,66,32,200,252,195,101]},"announce":[],"urlList":[]}}