{"title":"Meir Shalev - Israeli novelist (3 books)","uid":11279515,"size":8326255,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3372dab24694831e2b3ffa8318429e74f4801b82&amp;dn=Meir+Shalev+-+Israeli+novelist+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"workerbee","files":-1,"time":1414199937,"description":"\nMEIR SHALEV (b. 1948) is a bestselling Israeli author and columnist.  His work has been translated into 26 languages and has been often compared to Gabriel Garcia Marquez for his ability to &quot;create worlds inhabited by the richness of invention and obsessiveness of dreams.  He delivers both startling imagery and passionate, original characters whose destinies we follow through love, loss, laughter and death&quot; (New York Times Book Review).\n\nHis first novel, THE BLUE MOUNTAIN (1988), paints an extraordinary picture of a small community of Ukrainian immigrants as they pioneer a new life in Israel over three generations.  It is one of the of the top 5 bestsellers in Israeli publishing history.  \n\nTHE LOVES OF JUDITH (1994) is a universal story of passion and personal destiny that takes place in a small agricultural village in Palestine in the 1930s.  It is a magical novel of the joys and secrets of village life, of an unconventional family, and the unexpected fruits of love.\n\nA PIGEON AND A BOY (2006) is a novel of two love stories, separated by half a century but connected by one enchanting act of devotion.  During the 1948 War of Independence -- a time when pigeons are still used to deliver battlefield messages -- a gifted young pigeon handler is mortally wounded and in the moments before his death, dispatches one last pigeon to the girl he has loved since adolescence.  Intertwined with this story is the contemporary tale of Yair, who has his own legacy from the 1948 war.  Yair is a tour guide specializing in bird-watching trips who, in middle age, falls in love again with a childhood girlfriend.  His growing passion for her, along with a gift from his mother on her deathbed, becomes the key to a life he thought no longer possible.  The novel is a tale of lovers then and now -- of how deeply we love, of what home is, and why we, like pigeons trained to fly in one direction only, must eventually return to it.\n\n\nThe following books are in ePUB or PDF format as noted:\n\n* THE BLUE MOUNTAIN (Canongate, 2001).  Translated by Hillel Halkin. -- ePUB\n\n* THE LOVES OF JUDITH (Ecco / Schocken, 1999).  Translated by Barbara Harshav. -- ePUB + PDF\n\n* A PIGEON AND A BOY (Schocken, 2007).  Translated by Evan Fallenberg. -- ePUB\n\n_____________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                             &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:3372dab24694831e2b3ffa8318429e74f4801b82","amp;dn":"Meir+Shalev+-+Israeli+novelist+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3372dab24694831e2b3ffa8318429e74f4801b82","infoHashBuffer":{"type":"Buffer","data":[51,114,218,178,70,148,131,30,43,63,250,131,24,66,158,116,244,128,27,130]},"announce":[],"urlList":[]}}