{"title":"The Bhagavad Gita (Read by Tessa Morgan)","uid":4624810,"size":164189301,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:338940e6ca2ff62a511fc79286cd0de5d80124c8&amp;dn=The+Bhagavad+Gita+%28Read+by+Tessa+Morgan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Dr_tumtum","files":35,"time":1231172605,"description":"\nONE OF THE GLORIES of Sanskrit poetry, The Bhagavad Gita is the ancient spiritual text that forms a sublime synthesis of the many strands of Hindu belief. Taken from the Mahabharata epic, it details a dialogue between the divine Krishna and the human warrior Arjuna before a mighty battle in which Arjuna must decide whether to wage war against his own family. Krishna imparts spiritual enlightenment to Arjuna, teaching him the paths of knowledge, devotion, action, and meditation, and helping him to see beyond the temporal to the eternal. This new translation captures both the clarity of Hindu philosophy and the beauty of Sanskrit poetry.\n\n_________________________________________\n\nAbout the Translator:\nJuan Mascaro was born in Majorca, and later studied modern and oriental languages, Sanskrit, Pali and English at Cambridge University. He died in 1987, and was lauded as a great translator of our time. Juan Mascaro was born in Majorca, and later studied modern and oriental languages, Sanskrit, Pali and English at Cambridge University. He died in 1987, and was lauded as one of the greatest translators of our time.","torrent":{"xt":"urn:btih:338940e6ca2ff62a511fc79286cd0de5d80124c8","amp;dn":"The+Bhagavad+Gita+%28Read+by+Tessa+Morgan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338940e6ca2ff62a511fc79286cd0de5d80124c8","infoHashBuffer":{"type":"Buffer","data":[51,137,64,230,202,47,246,42,81,31,199,146,134,205,13,229,216,1,36,200]},"announce":[],"urlList":[]}}