{"title":"Withnail and I (1987) - Extended Version 1080p DTS + All Extras","uid":7980948,"size":9768333901,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:338f26a38fb9d561448f0bfb80f561d051ce5f58&amp;dn=Withnail+and+I+%281987%29+-+Extended+Version+1080p+DTS+%2B+All+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dududus","files":-1,"time":1357173464,"description":"Withnail and I is a 1987 black comedy film produced by HandMade Films. It was written and directed by Bruce Robinson and is based on his life in London in the late 1960s. The main plot follows two unemployed young actors, Withnail and &quot;I&quot; (portrayed by Richard E. Grant and Paul McGann) who live in a squalid flat in Camden Town in 1969 while waiting for their careers to take off. Needing a holiday, they obtain the key to the country cottage in the Lake District belonging to Withnail's flamboyantly gay uncle Monty and drive there. The holiday is less 'recuperative' than they expected. The role of Withnail was Grant's first film and launched him into a successful career. The film also featured performances by Richard Griffiths as Withnail's Uncle Monty and Ralph Brown as Danny the drug dealer. The film has tragic and comic elements (particularly farce) and is notable for its period music and many quotable lines. It has been described as &quot;one of Britain's biggest cult films&quot;. \n\n#29 in BFI's Top 100 British films of all time\n\n\nI have combined the Blu-Ray, the Criterion Edition DVD and the 3 Disc Steelbook Anniversary Edition for the best possible version. A must-have for all true film buffs!\n\nIncludes\n\n-Original Soundtrack (out of print)\n-Script\n-DVD Booklet Scans\n-1080p multipass transfer from Blu-Ray Extended Cut\n-DTS 5.1 Channel remastered audio\n-2 commentaries (from Steelbook edition)\n-Stills from DVD version\n-Magazine scans\n-Wallpaper\n-Withnail and I - The Reunion (audio)\n-Brand new interview with writer-director Bruce Robinson\n-Postcards From Penrith featurette\n-Withnail and Us - 1999 documentary on Withnail and I\n-Legendary &quot;Withnail and I&quot; Drinking game\n-Original Theatrical Trailer\n-Swearathon \n\n\nThe extras are interlaced on the source discs, turn on deinterlacing in VLC for best picture quality.\n\n\nI spent a lot of time putting this together, I hope you enjoy it and please seed!\n\n\nThe joint I'm about to roll requires a craftsman. It can utilise up to 12 skins. It is called a Camberwell Carrot. \t","torrent":{"xt":"urn:btih:338f26a38fb9d561448f0bfb80f561d051ce5f58","amp;dn":"Withnail+and+I+%281987%29+-+Extended+Version+1080p+DTS+%2B+All+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338f26a38fb9d561448f0bfb80f561d051ce5f58","infoHashBuffer":{"type":"Buffer","data":[51,143,38,163,143,185,213,97,68,143,11,251,128,245,97,208,81,206,95,88]},"announce":[],"urlList":[]}}