{"title":"FS2004 &amp; FSX - Christian Grill - TOPCAT v1.06","uid":3870638,"size":1584261,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:33dc796b372aaef3ec36670409959d9f53b77f7c&amp;dn=FS2004+%26+FSX+-+Christian+Grill+-+TOPCAT+v1.06&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"4X-AXG","files":2,"time":1194057192,"description":"TOPCAT is an acronym for Take-Off and Landing Performance Calculation Tool. ItÃƒÂ¢??s a highly realistic, easy-to-use planning tool for all serious Flight Simulator enthusiasts. \n\nItÃƒÂ¢??s a hot day in Frankfurt. You are leaving for a long-range flight New York. There is a light tailwind on runway 25R with light rain. How many passengers can you take today? How much cargo? Can you de-rate on Take-Off (reduce engine thrust)?\nOn landing in New York you have problems with your Flaps. How much runway do you need? Can you make it? \n\nTOPCAT will answer all these questions within a few mouse clicks. \n\nFeatures of TOPCAT \n\n- Microsoft Windows stand-alone application coming with installer and uninstaller \n- Easy to use, user friendly interface \n- Fully functional, unlimited Freeware version (Try-Before-You-Buy) \n- Worldwide database with close to 10.000 airports and 28.000 runways \n- Currently available aircraft (more to come in the future): Boeing 747-400 CF6, Boeing 747-400F CF6, Boeing 747-400 Combi CF6 including an import function for PMDG 747-400 and PMDG 747-400F weight data \n- Includes a Load Manager, Take-Off and Landing Planner (Taking into account various parameters like runway length, runway slope, wind, temperature, runway condition, airport pressure and elevation, etcÃƒÂ¢?Ã‚Â¦) with the option to directly download weather data from online sources (NOAA, IVAO or VATSIM) \n- Calculates all relevant speeds (V1, VR, V2) for Take-Off and Landing and de-rated thrust including Field Limit Weight, Climb Limit Weight, Obstacle Limit Weight, Brake Energy Limit Weight and Tire Speed Limit Weight \n- Take-off and Landing data for abnormal configurations (e.g. Flapless Landing, Inoperative Reversers, etcÃƒÂ¢?Ã‚Â¦) \n- A wide variety of units: kilograms (kg), pounds (lb), meter (m), feet (ft), hPa (hector pascal), inHg (Inches of mercury) for your personal needs \n- Ready-to-Print and Ready-to-Save data \n- Editor to add or modify runways and airports \n\nTake your simulation to the next level!\n\nThis one is for my friend 537 :D come on man, you can do better than this! hiding in VIP..haha what a joke :D and actually mentioning me in your readmes..I feel flattered! LOL","torrent":{"xt":"urn:btih:33dc796b372aaef3ec36670409959d9f53b77f7c","amp;dn":"FS2004+%26+FSX+-+Christian+Grill+-+TOPCAT+v1.06","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33dc796b372aaef3ec36670409959d9f53b77f7c","infoHashBuffer":{"type":"Buffer","data":[51,220,121,107,55,42,174,243,236,54,103,4,9,149,157,159,83,183,127,124]},"announce":[],"urlList":[]}}