{"title":"Seducing Mr Perfect Romantic","uid":9395349,"size":304327910,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:340bb2803635d509c15bd7e15c6fe2abc531f384&amp;dn=Seducing+Mr+Perfect+Romantic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"princez07","files":1,"time":1387969854,"description":"Seducing Mr. Perfect Romantic is a South Korean film, released on December 7, 2006. It was written and directed by Sang-woo Kim and stars Uhm Jung-hwa as Min Joon and Daniel Henney as Robin Heiden.\n\nMin-june (Uhm Jung-hwa) is a believer in true love and always very dedicated to her current boyfriend. However, men always break up with her - her latest boyfriend ends their relationship on her boy friend's birthday. Distracted by the latest break-up, she bumps into a car and a man steps out of it - who turns out to be her new boss, Robin Heiden (Daniel Henney). Heiden has very clear ideas about a relationship and love: both are a game of power and Min-june seeks advice from him, as she doesn't want to get dumped again. However, when she starts to treat men like Heiden treats women, she realizes that she prefers her older behavior, even if that means that she gets dumped again; she doesn't see love as a game of power and never will. Heiden, who has to deal with his own heartbreak, as he loved a woman so much that she had to shoot him to get the message across that she wasn't interested in him, starts to soften at Min-june's attitude towards life. He eventually falls in love with her and both get into a real relationship and a happy ending of their own.\n\nOne of the unique concepts of the movie is that Robin Heiden speaks only English because he finds Korean hard to speak, while Min-june speaks mostly in Korean. The two seem to understand each other perfectly without any outside translation. This was a new style of dialogue for Korean films, and it is partially credited for the film's success.","torrent":{"xt":"urn:btih:340bb2803635d509c15bd7e15c6fe2abc531f384","amp;dn":"Seducing+Mr+Perfect+Romantic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"340bb2803635d509c15bd7e15c6fe2abc531f384","infoHashBuffer":{"type":"Buffer","data":[52,11,178,128,54,53,213,9,193,91,215,225,92,111,226,171,197,49,243,132]},"announce":[],"urlList":[]}}