{"title":"Nature Reviews Drug Discovery - March 2012[Team Nanban][TPB]","uid":7177100,"size":3890979,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:341a0f9abc361fe6378dc2af754deb5740c9e063&amp;dn=Nature+Reviews+Drug+Discovery+-+March+2012%5BTeam+Nanban%5D%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"594mgnav","files":3,"time":1334149780,"description":"Nature Reviews Drug Discovery - March 2012[Team Nanban][TPB]\n\nEnglish | True PDF | 85 pages | 4 MB\n\nDESCRIPTION:\n\nThe number of new drugs approved per billion US dollars invested in research and development (R&amp;D) has declined progressively\nin the past 60 years, despite improvements in scientific and technological inputs into the R&amp;D process. Given the apparent\nlack of impact so far of many solutions to this decline in R&amp;D efficiency, Scannell and colleagues question whether the underlying problems have\nbeen correctly diagnosed and discuss factors they consider to be responsible, with the aim of stimulating further systematic analysis. It is anticipated that\nthe use of biomarkers to match the right drug to the right patient is one strategy that could reduce the size, failure rates and cost of clinical trials.\nIn their Perspective article, Kelloff and Sigman highlight the biomarkers expressed during cancer development and progression, focusing on those\nthat are most relevant for identifying patients who are likely to respond to a specific therapy, and those that are most effective for measuring patient\nresponse. The design of biomarker-based cancer clinical trials and the associated challenges are considered. Accumulating evidence suggests\nthat indicators of immune system activity in cancer patients can also be of prognostic value or be used to predict treatment response. This is\ndiscussed by Galluzzi and colleagues, who review the cellular and molecular mechanisms by which current anticancer agents can activate the immune\nsystem against cancer, and their therapeutic implications. Inappropriate immune system activation has a key role in chronic inflammatory disorders,\na common feature of which is bone loss. Redlich and Smolen review them mechanisms mediating bone loss in such disorders, \nand discuss current and emerging counteractive therapeutic strategies.\n\n\nPLZ SEED AFTER DOWNLOADING...\n\n&quot;SHARING IS CARING&quot;","torrent":{"xt":"urn:btih:341a0f9abc361fe6378dc2af754deb5740c9e063","amp;dn":"Nature+Reviews+Drug+Discovery+-+March+2012%5BTeam+Nanban%5D%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"341a0f9abc361fe6378dc2af754deb5740c9e063","infoHashBuffer":{"type":"Buffer","data":[52,26,15,154,188,54,31,230,55,141,194,175,117,77,235,87,64,201,224,99]},"announce":[],"urlList":[]}}