{"title":"Matthew Barney - Cremaster 1 (1996)","uid":3734932,"size":732371611,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:344218aabc8a87bee2186f287ff859de368c6016&amp;dn=Matthew+Barney+-+Cremaster+1+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Beksinski","files":4,"time":1183808029,"description":"Title: Cremaster 1\nDirector: Matthew Barney\nYear: 1996\nLanguage: n/a\nSubtitles: n/a\nSize: 698 MB (or 715,068 KB or 732,229,632 bytes)\nVideo Codec: Xvid\nVideo Bitrate: 1952 kb/s\nResolution: 704x512 (1.38:1) [=11:8]\nQf: 0.181 bits/pixel\nFramerate: 29.970\nAudio Specs: ac3 (0x2000)\nAudio Bitrate: 448 kb/s (224/ch, stereo) CBR  \nFs: 48000 Hz\nRuntime: 00:40:33 (72,911 fr)\nSource: DVD\n\nDescription: Cremaster 1 is a musical revue performed on the blue Astroturf playing field of Bronco Stadium in Boise, Idaho - Barney&amp;#039;s hometown. Two Goodyear Blimps float above the arena like the airships that often transmit live sporting events via television broadcast. Four air hostesses tend to each blimp. The only sound is soft ambient music, which suggests the hum of the engines. In the middle of each cabin interior sits a white-clothed table, it&amp;#039;s top decorated with an abstract centerpiece sculpted from Vaseline and surrounded by clusters of grapes. In one blimp the grapes are green, in the other they are purple. Under both of these otherwise identical tables resides Goodyear (played by Marti Domination). Inhabiting both blimps simultaneously, this doubled creature sets the narrative in motion. After prying an opening in the tablecloth(s) above her head, she plucks grapes from their stems and pulls them down into her cell. With these grapes, Goodyear produces diagrams that direct the choreographic patterns created by a troupe of dancing girls on the field below. The camera switches back and forth between Goodyear&amp;#039;s drawings and aerial views of the chorus girls moving into formation: their designs shift from parallel lines to the figure of a barbell, from a large circle to an outline of splitting and multiplying cells, and from a horizontally divided field emblem (Barney&amp;#039;s signature motif) to a rendering of an undifferentiated reproductive system (which marks the first six weeks of fetal development). Gliding in time to the musical score, the chorus girls delineate the contours of a still-androgynous gonadal structure, which echoes the shapes of the two blimps overhead, and symbolizes a state of pure potential. &lt;a href=&quot;\nhttp://www.cremaster.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cremaster.net/&lt;/a&gt;\n\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:344218aabc8a87bee2186f287ff859de368c6016","amp;dn":"Matthew+Barney+-+Cremaster+1+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"344218aabc8a87bee2186f287ff859de368c6016","infoHashBuffer":{"type":"Buffer","data":[52,66,24,170,188,138,135,190,226,24,111,40,127,248,89,222,54,140,96,22]},"announce":[],"urlList":[]}}