{"title":"Wedding in Galilee (Michel Khleifi, 1987)","uid":4028578,"size":733995842,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:344d7e152d6bb698d577ca98d1cd40c912a5fb3a&amp;dn=Wedding+in+Galilee+%28Michel+Khleifi%2C+1987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SocialTranslation","files":2,"time":1203044819,"description":"This is the first Palestinian feature film made in Palestine by a Palestinian director.  It is a lyrical, passionate tale of a Palestinian wedding that takes place in an occupied village, and the contemporary tensions, contradictions and hostilities that surround it.  The elder of the village, an old patriarchal Arab mayor, wants his son\\&amp;#039;s wedding to take place with pomp and circumstance, in accordance with tradition, but his village is under martial law, so he needs Israeli approval to break the curfew as the celebrations will take place all night.  He is given this permission, on the condition that the Israeli military governor and his staff be guests of honour at the ceremony.  The Mayor\\&amp;#039;s family is torn apart by his acquiescence to the Israeli governor\\&amp;#039;s condition, with some of the younger men planning to sabotage the party.  The film takes place over two days, with the tension mounting between members of the family pitted against each other in the face of the Israelis, culminating in the groom\\&amp;#039;s failure to consummate his marriage and his attempt to knife his father, whom he blames for his humiliating impotence.\n\nIn Arabic with English subtitles.\n","torrent":{"xt":"urn:btih:344d7e152d6bb698d577ca98d1cd40c912a5fb3a","amp;dn":"Wedding+in+Galilee+%28Michel+Khleifi%2C+1987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"344d7e152d6bb698d577ca98d1cd40c912a5fb3a","infoHashBuffer":{"type":"Buffer","data":[52,77,126,21,45,107,182,152,213,119,202,152,209,205,64,201,18,165,251,58]},"announce":[],"urlList":[]}}