{"title":"One Perfect Day- A Mother and Son's Story of Adoption and Reunio","uid":11207333,"size":4389296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34522e0410d42d025f3ce87f03316da74f7c05cd&amp;dn=One+Perfect+Day-+A+Mother+and+Son%27s+Story+of+Adoption+and+Reunio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1413238513,"description":"The moment Diane Burke, an author and mother of two grown sons, received an unexpected certified letter in the mail, she had no idea her life would be shaken to its core. Memories of a past she had buried more than forty years ago suddenly resurfaced and she wasn't prepared to deal with them.\n\nSteve Orlandi, happily married, father of two and step-father of three, was living the typical middle class American life. But since the age of eight, when he discovered he was adopted, he had led that life dealing with inner questions about his self-identity and genetic history. Always on his mind was one simple, yet complicated and loaded question: Who am I?\n\nIn One Perfect Day, Diane shares with readers how she came to the heartbreaking conclusion to give her baby up for adoption and how this decision has affected her life sense. Through Steve's invaluable perspective, readers will also experience the lengths he traveled to discover his mother's identity and reach out to her, not knowing whether she'd want to meet with him after nearly four decades of separation. It all comes together on one perfect day.\n\nThis book asks and answers the questions: What defines family? What does it mean to forgive? And is it worth the time, energy, and emotional cost to love a stranger?","torrent":{"xt":"urn:btih:34522e0410d42d025f3ce87f03316da74f7c05cd","amp;dn":"One+Perfect+Day-+A+Mother+and+Son%27s+Story+of+Adoption+and+Reunio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34522e0410d42d025f3ce87f03316da74f7c05cd","infoHashBuffer":{"type":"Buffer","data":[52,82,46,4,16,212,45,2,95,60,232,127,3,49,109,167,79,124,5,205]},"announce":[],"urlList":[]}}