{"title":"Allure","uid":8933022,"size":236541671,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:349c1921ad5fba724327cb80deca5b70701d4dfc&amp;dn=Allure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"luvjay","files":43,"time":1379496922,"description":"Allure is a New York-based R&amp;B girl group that formed in the early 1990s as a quartet, now a trio. Original members were Alia Davis, Linnie Belcher, Lalisha McClean and Akissa Mendez.Allure got their chance when they met Poke of the Trackmasters production team, who gave them an audition in 1996. He was impressed and signed the girls to Trackmasters bestowing them with their name, Allure. It was through his help that the girls were able to become the first group signed to Mariah Carey's Crave Records under the name of Allure.\nThey released their debut self-titled album in 1997. The album featured the gold-selling single &quot;Head Over Heels&quot; (featuring Nas) (US #35), &quot;No Question&quot; (featuring LL Cool J), &quot;All Cried Out&quot; (featuring 112), a Lisa Lisa and Cult Jam cover and their biggest hit to date (US #4), and &quot;Last Chance&quot;.\nAfter being released from Mariah Carey's label, Allure signed with MCA Records in 2000, eventually issuing their second album, Sunny Days, in 2001. The album yielded two singles: &quot;Enjoy Yourself&quot; and &quot;Kool Wit Me&quot;. Soon after, member Linnie Belcher left the group, and they signed with NBA player Ron Artest's newly formed label, Tru Warier Records, distributed by Lightyear Entertainment.\nIn 2002, they appeared in the Tom Jones' Mr. Jones album, in the song &quot;The Letter&quot;. The album was produced by Wyclef Jean, Jerry 'Wonder' Duplessis and Jones himself.\nLate 2004 saw the release of their third album, Chapter III, in reference to their lineup change and being their third album. It went unnoticed by the general public, although it did receive considerable press due to Ron Artest's suspension from the NBA that year. Two singles were released as well, 2004's &quot;Uh Oh&quot; featuring reggae artist Elephant Man, and 2005's &quot;I Think I'm In Love&quot; featuring rapper Joe Budden. The album was subsequently released in the UK the following year, featuring a new track (&quot;You Are The Man&quot;) as well as a remix of the single &quot;Hate 2 Luv U&quot;.\nThe Platinum Selling Female R&amp;B Group had started their own independent label, Allure Entertainment which has a partnership with Bridgework Records. In 2012, the group released their first single &quot;Butterflies&quot; after almost a decade of the release of their 3rd album. The song was released as a digital distribution (iTunes, Amazon.com MP3). Allure is currently in the studio finishing up their new album coming out in 2013.\n\n\n\n**Includes**\n\nAllure\n\nSunny Days\n\nChapter III\n\n\n*PLEASE SEED*","torrent":{"xt":"urn:btih:349c1921ad5fba724327cb80deca5b70701d4dfc","amp;dn":"Allure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"349c1921ad5fba724327cb80deca5b70701d4dfc","infoHashBuffer":{"type":"Buffer","data":[52,156,25,33,173,95,186,114,67,39,203,128,222,202,91,112,112,29,77,252]},"announce":[],"urlList":[]}}