{"title":"Autumn in a Jiffy - Gooseberry Patch","uid":12000398,"size":8427032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3554b69c202e2bb18055085349c570a9a3b6590f&amp;dn=Autumn+in+a+Jiffy+-+Gooseberry+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433770659,"description":"There's a nip in the air and the leaves are turning...it's autumn again! Back-to-school, homecoming, hayrides, county fairs, trick-or-treating and Turkey Day...so much fun, but so much to do!\n\nAutumn in a Jiffy is just what you need...over 200 speedy recipes shared by moms like you. Most recipes are made with eight ingredients or less and are perfect for your busy family life.\n\nAre the kids too rushed to eat breakfast? They'll be on their way in no time when you serve up Bubble Breakfast Pizza and Banana-Oat Breakfast Cookies. At lunchtime, Pop's Harvest Chili and Easy Meatball Hoagies will fill hungry tummies.\n\nYou'll find lots of quick ideas for weeknight dinners your family will love...some ready in 30 minutes or less! Put a fresh spin on old favorites with Taco-Filled Peppers and Super-Simple Chicken Manicotti. Jazz up the Thanksgiving table with Sweet &amp; Spicy Broccoli and Slow-Cooker Scalloped Potatoes.\n\nFor tailgating and party snacking, Corn Dog Muffins and Candy Corn Crispy Balls are sure to be a hit. And there's always time for dessert! Tuck Marbled Chocolate Bars into lunchboxes and wow 'em at get-togethers with Autumn Spice Streusel Cake...yum! Look for the sweet and funny family memories sprinkled throughout, plus timesaving kitchen tips and holiday ideas to make every day special","torrent":{"xt":"urn:btih:3554b69c202e2bb18055085349c570a9a3b6590f","amp;dn":"Autumn+in+a+Jiffy+-+Gooseberry+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3554b69c202e2bb18055085349c570a9a3b6590f","infoHashBuffer":{"type":"Buffer","data":[53,84,182,156,32,46,43,177,128,85,8,83,73,197,112,169,163,182,89,15]},"announce":[],"urlList":[]}}