{"title":"Pink Floyd - Wish You Were Here - Q8 to DTS WAV files","uid":4260747,"size":476174380,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:35a55dcf18f30867ebd92dc090282df82ff1fc86&amp;dn=Pink+Floyd+-+Wish+You+Were+Here+-+Q8+to+DTS+WAV+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bhobson333","files":5,"time":1214455643,"description":"This is a modified repost of this torrent:\n &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3943899&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3943899&lt;/a&gt;\n\nI always had a problem with that post because it is in the Nero proprietary format .nrg and I hate having things locked into proprietary formats in my long-term archive.  When I tried to extract the data into WAVs or even .ISO I always had annoying dropouts every 30 seconds or so in the resulting CD.  I only posted the .nrg when I couldn\\&amp;#039;t figure out another way to do it.\n\nI recently thought I might have even lost the true archive because I couldn\\&amp;#039;t produce a disk that didn\\&amp;#039;t have those dropouts.  I never had anyone complain about the post, but I was having trouble with it.\n\nI recently upgraded my computer and got all new hardware and software.  I went back to the original .nrg and extracted WAVs from it.  You should be able to burn these WAVs as an audio CD in any software and come out with a true gem:\n\n**************************************\n\nYOU!! YES YOU!! STAND STILL LADDIE!! This is a DTS CD image. If you\ndon\\&amp;#039;t have a DTS conversion at playback (we\\&amp;#039;re talking NOT your\ncomputer, we\\&amp;#039;re talking your stereo/Home Theatre playback system) then\ndon\\&amp;#039;t download this. All you\\&amp;#039;ll hear is static if you don\\&amp;#039;t have a bona\nfide DTS playback chain, happy and working!**\n\nThis is (as I received it) a Nero CD Image (.nrg).  I tried extracting FLAC or WAV tracks from it and posting it that way, but the resulting disc always had problems (drop-outs) so I\\&amp;#039;m posting it like this.  Let me know if you want the WAVs.\n\nThis is a DTS image of the highly rare Q8 British version of Wish You Were Here by Pink Floyd.  The band originally intended for their audience to hear the album THIS way, but unfortunately QUAD playback didn\\&amp;#039;t take off like people thought it would.  So, this Q8 was definitely an obscure item; in the UK, 8-Track cartridge technology was not a sought-after mainstay of playback like it was in the US circa the 1970\\&amp;#039;s.\n\nThe 1970\\&amp;#039;s British Q8 was an 8-channel, 2 program cartridge. In the US we had 4 programs of stereo; the British cartridge had two programs of Quadrophonic.  Given the source, you can expect that the sound quality will be less than most versions of this album on CD or vinyl. Why post? Because it\\&amp;#039;s TRUE QUADROPHONIC and really must be experienced to be believed, and especially because it is the rare original mix of a landmark album and, as far as I know, the only surround-sound version available.","torrent":{"xt":"urn:btih:35a55dcf18f30867ebd92dc090282df82ff1fc86","amp;dn":"Pink+Floyd+-+Wish+You+Were+Here+-+Q8+to+DTS+WAV+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35a55dcf18f30867ebd92dc090282df82ff1fc86","infoHashBuffer":{"type":"Buffer","data":[53,165,93,207,24,243,8,103,235,217,45,192,144,40,45,248,47,241,252,134]},"announce":[],"urlList":[]}}