{"title":"High Dynamic Range Imaging for Photographers and CG Artists","uid":6506670,"size":32738663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35c80e634b00a7ad1f7bc3042adf9a975fb1c35b&amp;dn=High+Dynamic+Range+Imaging+for+Photographers+and+CG+Artists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheBookie","files":-1,"time":1309447959,"description":"Christian Bloch, The HDRI Handbook: High Dynamic Range Imaging for Photographers and CG Artists\n\nISBN: 1933952059 | 344 pages | PDF | 31,2 MB\n\n\nThe HDRI Handbook reveals the secrets behind High Dynamic Range Imaging (HDRI). This cutting-edge imaging technology is a method to digitally capture and edit all light in a scene. It represents a quantum leap in imaging technology, as revolutionary as the leap from Black &amp; White to Color imaging. If you are serious about photography, you will find that HDRI is the final step that places digital ahead of analog. The old problem of over- and underexposure in analog photography, which was never fully solved, is elegantly bypassed here. A huge variety of subjects can now be photographed for the first time ever.\nHDRI emerged from the movie industry, and was once Hollywood's best kept secret. It is now a mature technology available to everyone. The only problem was that it was poorly documented until now. The HDRI Handbook is the manual that was missing.\n\nMany questions remain open even for the computer graphics gurus that have been using HDRI for years. This is where The HDRI Handbook comes in. Included here is everything you need to build a comprehensive knowledge base that will enable you to become really creative with HDRI. This book is packed with practical hints and tips, software evaluations, workshops, and hands-on tutorials. Whether you are a photographer, 3D artist, compositor, or cinematographer, this book is sure to enlighten you.","torrent":{"xt":"urn:btih:35c80e634b00a7ad1f7bc3042adf9a975fb1c35b","amp;dn":"High+Dynamic+Range+Imaging+for+Photographers+and+CG+Artists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35c80e634b00a7ad1f7bc3042adf9a975fb1c35b","infoHashBuffer":{"type":"Buffer","data":[53,200,14,99,75,0,167,173,31,123,195,4,42,223,154,151,95,177,195,91]},"announce":[],"urlList":[]}}