{"title":"You By Austin Grossman.epub ","uid":8504239,"size":417950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35e5c8c930f5f113174d01f40c9194503af9aab4&amp;dn=You+By+Austin+Grossman.epub+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":1,"time":1369387983,"description":"By Austin Grossman\n\nPublished by Mulholland Books in 2013\n\nTags: fiction\n\nEPUB, 400 pages, English (0316198536)\n\n\nA NOVEL OF MYSTERY, VIDEOGAMES, AND THE PEOPLE WHO CREATE THEM, BY THE BESTSELLING AUTHOR OF SOON I WILL BE INVINCIBLE.\n\nWhen Russell joins Black Arts games, brainchild of two visionary designers who were once his closest friends, he reunites with an eccentric crew of nerds hacking the frontiers of both technology and entertainment. In part, he's finally given up chasing the conventional path that has always seemed just out of reach. But mostly, he needs to know what happened to Simon, the strangest and most gifted friend he ever lost, who died under mysterious circumstances soon after Black Arts' breakout hit.\n\nThen Black Arts' revolutionary next-gen game is threatened by a mysterious software glitch, and Russell finds himself in a race to save his job, Black Arts' legacy, and the people he has grown to care about. The bug is the first clue in a mystery leading back twenty years, through real and virtual worlds, corporate boardrooms and high school computer camp, to a secret that changed a friendship and the history of gaming. The deeper Russell digs, the more dangerous the glitch appears--and soon, Russell comes to realize there's much more is at stake than just one software company's bottom line.","torrent":{"xt":"urn:btih:35e5c8c930f5f113174d01f40c9194503af9aab4","amp;dn":"You+By+Austin+Grossman.epub+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35e5c8c930f5f113174d01f40c9194503af9aab4","infoHashBuffer":{"type":"Buffer","data":[53,229,200,201,48,245,241,19,23,77,1,244,12,145,148,80,58,249,170,180]},"announce":[],"urlList":[]}}