{"title":"Velvet Underground - VU TQMP","uid":4685486,"size":207044421,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3688866eafbf837bdb6931af64182cc1cb3a9a23&amp;dn=Velvet+Underground+-+VU+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":21,"time":1233218323,"description":"When other bands in the sixties were all peace, love, and hippy tree hugging, The Velvet Underground personified the darker side to the era's hedonism. Lou Reed, a native of New York, coupled with John Cale, a welshman from West Glamorgan combined to create such a seminal catalogue of work that, in my opinion, the like of which has yet to be again.\n\nPerhaps it was down to their contrasting backgrounds, Reed being under contract as a songwriter for Pickwick Records, and Cale being a classically trained musician, that bought the group the conflict which was probably more infamous than the band themselves. Combined with Sterling Morrisson, a friend of Reed's from university, on guitar, and Moe Tucker (a friend of Morrisson's kid sister) on drums, the group took their name from a pulp fiction book popular at that time.\nIn 1965 the band met up with Andy Warhol, the pop artist, after a performance at Cafe Bizarre. It was Warhol who introduced the band to the german vocalist Nico, and who encouraged them to join his &quot;Exploding Plastic Inevitable&quot;, a group who produced films, theatre and music at the time. The band produced it's debut album, famous almost as much for the cover which Warhol designed (he is indeed credited as the album's producer), &quot;Andy Warhol&quot; (also known fondly as The Banana Album). However, as usual for the Velvets, things didn't run smoothly, with most record companies rejecting the album, fearful of it's controversial content, and it's lengthy tracks (there was no discernable &quot;single&quot;). It took a year to get the album released, with Verve records finally taking it up and releasing it in 1965. This powerful collection introduced Reed's decidedly urban infatuations, a fascination for street culture and amorality bordering on voyeurism. Reed's talent, however, was greater than mere opportunism. His finely honed understanding of R&amp;B enhanced a graphic lyricism whereby songs about drugs ('I'm Waiting For The Man', 'Heroin'), sado-masochism ('Venus In Furs') or sublimation ('I'll Be Your Mirror') were not only memorable for their subjects, but also as vibrant pop compositions.\n\nNico continued her solo career and had no more to do with the group (beyond the rumour surrounding her relationship with both Reed and Cale) and the Velvets disassociated themselves with Andy Warhol in 1967. The second album, &quot;White Light White Heat&quot; was infused by the internal conflicts within the band, and thus contains a kind of raging intensity. Two extended pieces, 'The Gift' and 'Sister Ray', caught the group at its most radical. The latter performance, a grinding, remorseless, sexual cacophony, was recorded live in the studio at maximum volume, and although Reed later suggested he was trying to approximate the free-jazz of Ornette Coleman, this 17-minute tour de force offers some of John Cale's most inspired atonal instrumental work. However, the relationship between Cale and Reed had now reached breaking point, and Cale was acrimoniously fired from the band, and replaced by Doug Yule, a far more traditional bass player.\n\nThe third album, entitled simply &quot;The Velvet Underground&quot; was a far more subtle, gentler affair, showing a softer side to the band, and also showing to extent to which Lou Reed now retained the control of the band. In 1970, the band released an album full of commercial promise, &quot;Loaded&quot;. Containing one of Reed's most popular compositions &quot;Sweet Jane&quot; (certainly my favourite), and in celebrating pop's rich heritage, offered an optimism rarely heard in previous work. Paradoxically, by the time Loaded was issued, Lou Reed had abandoned the group he had created and Doug Yule, who had encouraged the commercial aspect of the album, now took control, leading several variations on the Velvet Underground name. A poorly received album, Squeeze, confirmed that the definitive unit ended with Reed's departure, so much so that the album is not generally perceived to be part of the Velvets' discography.\nDespite the tribulations endured during its brief lifespan, the Velvets have since become one of rock's most influential groups, especially after a new generation of bands from Bowie to Joy Division, declared their indebtedness. A series of archive releases, including 1969 - The Velvet Underground Live, VU and Another View, add further fuel to the talent and insight that lay within the Velvet Underground and enhance their legendary status. A rumour, followed by an announcement in 1993 that the band, without Doug Yule, had re-formed for a major tour, was greeted with anxious excitement, although subsiquent performances were deemed disappointing. Old wounds were opened between Cale and Reed and no further plans were imminent other than a one-off appearance together following their induction to the Rock And Roll Hall Of Fame in 1996. Sadly, Sterling Morrison died only a few months before the latter event.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se (Simply use the TQMP searchtag :)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:3688866eafbf837bdb6931af64182cc1cb3a9a23","amp;dn":"Velvet+Underground+-+VU+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3688866eafbf837bdb6931af64182cc1cb3a9a23","infoHashBuffer":{"type":"Buffer","data":[54,136,134,110,175,191,131,123,219,105,49,175,100,24,44,193,203,58,154,35]},"announce":[],"urlList":[]}}