{"title":"The Dark Side of Porn  (2005 - Complete Series)","uid":5048741,"size":3569648359,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:372febb63c8c6d6dd9f9bf9edc8fa208ebea9628&amp;dn=The+Dark+Side+of+Porn++%282005+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":9,"uploader":"sheila6","files":10,"time":1249779699,"description":"TV : Documentary : DVD quality : English\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0884766/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0884766/&lt;/a&gt;\n\n\n\nChannel 4 presents a season of documentaries exploring the dark reality of the adult film industry.\n\n01 &quot;Porn Shutdown&quot;\nWhen porn actor Darren James was diagnosed HIV Positive in early 2004, the American porn industry ground to a halt as a 60-day shutdown was declared. Porn Shutdown is a candid and heart-rending film about a time of panic and recrimination in an isolated community.\n\n02 &quot;Diary of a Porn Virgin&quot;\nFollowing the personal journeys of newcomers embarking on a career in adult entertainment. From the initial approach to a glamour agency, to the first photo shoot and HIV test, Diary of a Porn Virgin uncovers the motivations and moral dilemmas faced along the way.\n\n03 &quot;Debbie Does Dallas Uncovered&quot;\nDebbie Does Dallas is one of the highest grossing porn films of all time, but it has left a multitude of unanswered questions in its wake. Who made all the money? What became of the cast members? And what really happened to the film's star, Bambi Woods? A story of organised crime, suicide, murder, a huge undercover FBI sting and several unexplained disappearances.\n\n04 &quot;Death of a Porn Star&quot;\nIn March 2000 porn star Lolo Ferrari was found dead, apparently of a drugs overdose. Suicide was blamed, but her mother refused to accept the verdict and two years later was granted a second autopsy. Featuring candid interviews with Lola's mother, her plastic surgeon and her husband, this is a story of fame, prostitution, hardcore pornography and, possibly, murder.\n\n05 &quot;Amateur Porn&quot; \nExamines what is going on in the British sex industry, where new male actors are lining up to do a job without getting paid.\n\n06 &quot;Me and My Slaves&quot; \nCentered around &quot;Rick&quot;, a BDSM Dominator who wants to quit the job after doing it for 25 years. Over a period of more than a year, Rick talks intimately about his life.\n\n07 &quot;Hunting Emmanuelle&quot; \nFollows the concept of the groundbreaking 1974 movie Emmanuelle, through to its release, its cultural impact, and the large amount of sequels and impersonations.Featuring an interview with Sylvia Kristel.\n\n08 &quot;Does Snuff Exist?&quot; \nInvestigates the truth behind snuff movies.\n\n09 &quot;The Real Animal Farm&quot; \nA look at the story behind the bestiality tape ANIMAL FARM. From its production in early 70's Denmark, to when it was smuggled to the UK and distributed in 1981.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:372febb63c8c6d6dd9f9bf9edc8fa208ebea9628","amp;dn":"The+Dark+Side+of+Porn++%282005+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"372febb63c8c6d6dd9f9bf9edc8fa208ebea9628","infoHashBuffer":{"type":"Buffer","data":[55,47,235,182,60,140,109,109,217,249,191,158,220,143,162,8,235,234,150,40]},"announce":[],"urlList":[]}}