{"title":"Critical Companion to William Shakespeare","uid":4705688,"size":5536306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3744d45793ef0840b364fa476ec62767c9166bd0&amp;dn=Critical+Companion+to+William+Shakespeare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"timnehguy","files":3,"time":1233853760,"description":"Critical Companion to William Shakespeare: \nA Literary Refernce to His Life and Work, \nby Charles Boyce \n\nThere was a problem with my previous attempt to list this. I apologize.\n\nPDF, 1089 pp. (printed in two volumes)\n\nThis revised edition of Shakespeare A to Z: An Essential Guide to His Life and Work, also written by Boyce, has more than 3,000 entries. Like the earlier work, it covers all aspects of Shakespeare and his writings. In place of a single alphabetical arrangement, however, readers will find content organized into several sections. The new arrangement puts Shakespeare's works at center stage and casts the related topics in a supporting role\n\nPart 1, the briefest section at just 7 pages, has biographical material. \n\nPart 2, the longest section, covers all known works. The plays are given extended treatment that averages just over 20 pages. A scene-by-scene synopsis is followed by commentary and discussion of the play's sources, text, and performance history. Subentries identify and discuss all the characters, both major (Romeo) and minor (Serving-man). This is a useful revision; character entries are scattered throughout Shakespeare A to Z, depending on their place in the alphabet. Edward III is covered, since recent scholarship based on statistical analysis of Shakespeare's imagery and language suggests that Shakespeare collaborated on its writing. The commentary that Boyce provides on Edward III and on other plays provides context as well as analysis and will add to the students' understanding of the works. \n\nIn Part 3, generally brief entries cover places both in Shakespeare's works and life; events; sources and influences; historical figures; family, friends, and associates; theaters and acting companies; allusions; literary terms; actors ranging from Shakespeare's contemporaries to Kenneth Branagh and Judi Dench; and more. \n\nAppendixes include a selection of quotations from Shakespeare, arranged by work; a spotty time line; a four-page list of selected reading; and a list of &quot;Contents by Category.&quot; \n\nCheck my torrents for other reference books on Shakespeare and other topics. Also at www.archive.org you can find quite an assortment of unlikely Shakespeare resources.","torrent":{"xt":"urn:btih:3744d45793ef0840b364fa476ec62767c9166bd0","amp;dn":"Critical+Companion+to+William+Shakespeare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3744d45793ef0840b364fa476ec62767c9166bd0","infoHashBuffer":{"type":"Buffer","data":[55,68,212,87,147,239,8,64,179,100,250,71,110,198,39,103,201,22,107,208]},"announce":[],"urlList":[]}}