{"title":"Dominica Phoenix and Kristy Black - A Balanced Diet-Lesbian Foot","uid":13446053,"size":1711856802,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:375720787822fc563ef6231c45cc5f2cbffa3ba2&amp;dn=Dominica+Phoenix+and+Kristy+Black+-+A+Balanced+Diet-Lesbian+Foot&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1454749695,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/G6R\r\n \nhttp://imgsnaps.com/image/G6Y\r\n\r\nDescription:\r\n\r\nProduction year: 12/19/2015, the\r\nGenre: Blonde, Brunette, Natural Tits, Small Tits, Shaved Pussy, Piercing, Tattoo, High Heels, Lesbians, Oral, Kissing, Foot Licking, Foot Fetish, Food Play, Anal Insertion, Foot In Pussy\r\nDuration: 0:34:05\r\n\r\nDescription: Dominica Phoenix and Kristy Black enjoy a healthy pasta dinner and get quite horny during their sexy conversation. The brunette lesbians with natural tits and green eyes might have their mouths full of spaghetti, but their fantasies obsessed with sapphic activities around and on the dinner table. One leads to the other and within minutes, they start stroking their stunning legs and put their hot feet and sexy toes into the dinner bowls. Watch DDF Network's brand new episode of &quot;Hot Legs &amp; Feet&quot; in Full HD and enjoy some closeup lesbian XXX porn pics in the gallery below!\r\nDominica eats veggies off of Kristy's beautiful ankles while the slim Czech babe crams her cunny with Dominica's big toe. The scene heats up when the two lesbian glamour bombshells give each other some foot licking and toe sucking before inserting their big toes into both fuckholes. Kristy enjoys Dominica's toes in her ass while our DSLR lenses capture some outstanding shots of her pierced nipples and curvy young ass! The scene ends with a messy table, messy toes, dirty minds, and two lesbian hotties enjoying some lustful French kissing!","torrent":{"xt":"urn:btih:375720787822fc563ef6231c45cc5f2cbffa3ba2","amp;dn":"Dominica+Phoenix+and+Kristy+Black+-+A+Balanced+Diet-Lesbian+Foot","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"375720787822fc563ef6231c45cc5f2cbffa3ba2","infoHashBuffer":{"type":"Buffer","data":[55,87,32,120,120,34,252,86,62,246,35,28,69,204,95,44,191,250,59,162]},"announce":[],"urlList":[]}}