{"title":"Sniper.Ghost.Warrior.2.Collector's.Edition.Repack.R.G.Revenants","uid":8622503,"size":5714242116,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3782cc88fc31cd6a13cd54b7879a9babd9ccf5c7&amp;dn=Sniper.Ghost.Warrior.2.Collector%27s.Edition.Repack.R.G.Revenants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Taker009","files":26,"time":1372415469,"description":"Sniper.Ghost.Warrior.2.Collector's.Edition.Repack.R.G.Revenants\n\n\n\nRelease date: March 15, 2013\nGenre: Action (Shooter) / 3D / 1st Person\nPublication Type: Repack\nLanguage: English /Russian\nSound language: English /Russian\nCrack: enclosing (sam2k8 / SKIDROW)\n\n\n\n\nSystem Requirements:\n====================\n\nOperating system: Microsoft Â® Windows Â® XP SP3 / Windows Vista â„¢ SP2 / Windows 7 SP1 / Windows 8\nProcessor: Intel Pentium Â® Core 2 Duo 2 GHz or equivalent AMD Athlon Â® 64 X2\nRAM: 2 GB RAM (3 GB for Windows Vista / 7)\nVideo: 3D-graphics adapter with 512 MB ??memory, compatible with DirectX Â® 9.0c (Nvidia 8800GT or ATI 3850HD)\nSound device: compatible with DirectX Â® 9.0c\nHard disk space: 12 GB\n\n\nGame information:\n=================\n\nA ruthless fighter single again goes on the warpath. The second part of the popular action, to gain recognition for players around the world will unfold among the impenetrable jungle, mountain ranges and urban ruins. An impressive selection of the most modern equipment includes thermal and night-vision goggles, which significantly enhance your ability to eliminate the enemy.\n\nLike the first part of the game &quot;Sniper. Ghost Warrior 2 &quot;will offer a variety of ways to achieve this goal. You have to choose your way to victory, whether it's a deadly fire from a sniper rifle at long range or silent murder in the melee. But in any case, will have to take into account the incredibly realistic weather conditions and advanced ballistics. And remember: One Shot - One Kill! After all, snipers, like engineers, they are wrong only once ...\n\n\nSiberian Strike:\n\n\nThe action will unfold in a remote add-Siberian countryside. Open World will offer a variety of approaches to the assignment, players will rely on their own intuition and map.\nIn the distant Siberian town started research laboratory to develop weapons of mass destruction. CIA successfully introduced into the ranks of employees of his agent, but he did not bond out. It is time for drastic methods.\n\nAlong with Anderson, an experienced sniper-operative, players will find themselves in the ranks of &quot;Troop 121&quot; - units created to neutralize threats in the Asia-Pacific region. The main task entrusted to the men - the GPS signal to track the missing agent and gather all the necessary information about what is really going on behind the walls of a secret Russian base.\n\n\nGame features:\n======================\n\nFeel every killing, controlling breathing, and experience the advanced system of ballistics, taking into account the speed and direction of wind, gravity and distance to the target.Use a large arsenal of weapons in detail recreated six sniper rifles, three assault rifles, machine guns and more. Join a realistic sniper battle in single player or multiplayer game in the impenetrable jungles, on mountainsides and in complex urban environments.Enjoy the spectacle of the death of an enemy, thanks to technology CryENGINE 3, watching the flight of the bullet. Perfect hit accompanied by a spectacular view from an attached camera\n\nRepack features:\n======================\n\nDo not cut / no recoded.\nGame Version 1.08.\nAny combination of text and voice language can be used.\nLauncher with simplified settings.\n\nAdditional content:\n\nPre-Order DLC:\nMK 14 EBR\nCollector` s Edition:\nMerinov\nMarine Team Leader\nDiaz\nMaddox\nDSR-1\nVINTOREZ\nMultiplayer Expansion Pack\nSiberian Strike\nWorld Hunter Pack\n\nAverage installation time ~ 20-25 minutes.\nChange Language at the time of Installation by pressing\nsettings/components button.","torrent":{"xt":"urn:btih:3782cc88fc31cd6a13cd54b7879a9babd9ccf5c7","amp;dn":"Sniper.Ghost.Warrior.2.Collector%27s.Edition.Repack.R.G.Revenants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3782cc88fc31cd6a13cd54b7879a9babd9ccf5c7","infoHashBuffer":{"type":"Buffer","data":[55,130,204,136,252,49,205,106,19,205,84,183,135,154,155,171,217,204,245,199]},"announce":[],"urlList":[]}}