{"title":"The Greatest Comeback - Patrick J. Buchanan - Audiobook MP3","uid":11069343,"size":372065089,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:37aac16266916cf0b0994ecfb0c557664886e69c&amp;dn=The+Greatest+Comeback+-+Patrick+J.+Buchanan+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"songotantht97","files":11,"time":1411247542,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Greatest Comeback: How Richard Nixon Rose from Defeat to Create the New Majority\n\nWritten by: Patrick J. Buchanan\nNarrated by: Arthur Morey\nLength: 12 hrs and 52 mins\nFormat: Unabridged\nRelease Date:07-08-14\nProgram Type: Audiobook\n\nPatrick J. Buchanan, best-selling author and senior advisor to Richard Nixon, tells the definitive story of Nixon's resurrection from the political graveyard and his rise to the presidency.\n\nAfter suffering stinging defeats in the 1960 presidential election against John F. Kennedy, and in the 1962 California gubernatorial election, Nixon's career was declared dead by Washington press and politicians alike. Yet on January 20, 1969, just six years after he had said his political life was over, Nixon would stand taking the oath of office as 37th President of the United States. How did Richard Nixon resurrect a ruined career and reunite a shattered and fractured Republican Party to capture the White House?\n\nIn The Greatest Comeback, Patrick J. Buchanan - who, beginning in January 1966, served as one of two staff members to Nixon, and would become a senior advisor in the White House after 1968 - gives a firsthand account of those crucial years in which Nixon reversed his political fortunes during a decade marked by civil rights protests, social revolution, The Vietnam War, the assassinations of JFK, RFK, and Martin Luther King, urban riots, campus anarchy, and the rise of the New Left. Using over 1,000 of his own personal memos to Nixon, with Nixon's scribbled replies back, Buchanan gives listeners an insider's view as Nixon gathers the warring factions of the Republican party - from the conservative base of Barry Goldwater to the liberal wing of Nelson Rockefeller and George Romney, to the New Right legions of an ascendant Ronald Reagan - into the victorious coalition that won him the White House. How Richard Nixon united the party behind him may offer insights into how the Republican Party today can bring together its warring factions.\n\nThe Greatest Comeback is an intimate portrayal of the 37th President and a fascinating fly-on-the-wall account of one of the most remarkable American political stories of the 20th century.\t\t\n","torrent":{"xt":"urn:btih:37aac16266916cf0b0994ecfb0c557664886e69c","amp;dn":"The+Greatest+Comeback+-+Patrick+J.+Buchanan+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37aac16266916cf0b0994ecfb0c557664886e69c","infoHashBuffer":{"type":"Buffer","data":[55,170,193,98,102,145,108,240,176,153,78,207,176,197,87,102,72,134,230,156]},"announce":[],"urlList":[]}}