{"title":"Ian Ironwood - The Manosphere- A New Hope for Masculinity [Epub ","uid":10613131,"size":2515818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37fd8d448a8cf24c677c2c507912455dc8557821&amp;dn=Ian+Ironwood+-+The+Manosphere-+A+New+Hope+for+Masculinity+%5BEpub+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"krystine","files":-1,"time":1406064130,"description":"The Manosphere: A New Hope For Masculinity by Ian Ironwood\n\n\nThe Manosphere is a loose collection of blogs, books, and forums about men, male issues, and masculine interests. Covering areas of this vast &quot;dirty snowball&quot; like Pick Up Artists (PUAs) and Game, Traditional and Christian Conservatives, Wise Old Men, Puerarchs, Alpha Dads, Men's Rights Activists, (MRAs), Men Going Their Own Way (MGTOW) and other facets of masculinity in a post-feminist world, Ironwood has designed this book to be a survey and introduction, not an exhaustive study. Find out why men aren't getting married as much or as early. Find out what your daughter's chances of finding a &quot;good man&quot; really are . . . and figure out what constitutes a &quot;good man&quot;.\n\nAimed squarely at feminism's tropes and misandry, The Manosphere delves deeply into gender relations from the masculine side, and where it takes you may surprise you. Men today are struggling, searching, healing, and fighting . . . but they are more and more coming to the feminism-inspired conclusion that the time has come for them to pursue their interests as men, often independent of women or their interests.\n","torrent":{"xt":"urn:btih:37fd8d448a8cf24c677c2c507912455dc8557821","amp;dn":"Ian+Ironwood+-+The+Manosphere-+A+New+Hope+for+Masculinity+%5BEpub+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37fd8d448a8cf24c677c2c507912455dc8557821","infoHashBuffer":{"type":"Buffer","data":[55,253,141,68,138,140,242,76,103,124,44,80,121,18,69,93,200,85,120,33]},"announce":[],"urlList":[]}}