{"title":"The Faith Healers by James Randi (EPUB, MOBI)","uid":7025830,"size":4312517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3819dbf114b6e0977a769df0342323bf987370c6&amp;dn=The+Faith+Healers+by+James+Randi+%28EPUB%2C+MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Muero","files":-1,"time":1328996935,"description":"James Randi, the celebrated magician, has written a damning indictment of the faith-healing practices of the leading televangelists and others who claim divine healing powers. Randi and his team of researchers attended scores of \\&quot;miracle services\\&quot; and often were pronounced \\&quot;healed\\&quot; of the nonexistent illnesses they claimed. They viewed first-hand the tragedies resulting from the wide-spread belief that faith healing can cure every conceivable disease. The ministries, they discovered, were rife with deception, chicanery, and often outright fraud.\n\nSelf-annointed ministers of God convince the gullible that they have been healed - and that they should pay for the service. The Faith Healers examines in depth the reasons for belief in faith healing and the catastrophic results for the victims of these hoaxes. Included in Randi\\'s book are profiles of a highly profitable \\&quot;psychic dentist\\&quot;, and the \\&quot;Vatican-approved wizard.\\&quot;\n\nPublisher: James Randi Educational Foundation (May 10, 2011)\n\nThis is the official Kindle Edition MOBI, which I converted to EPUB using Calibre. I tested the EPUB in iBooks on my iPad to make sure the conversion settings I used made it appear the same as the MOBI in the Kindle app. Sometimes Calibre conversions can mess up a book\\'s formatting, but you can be confident that this EPUB conversion is just like the original.","torrent":{"xt":"urn:btih:3819dbf114b6e0977a769df0342323bf987370c6","amp;dn":"The+Faith+Healers+by+James+Randi+%28EPUB%2C+MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3819dbf114b6e0977a769df0342323bf987370c6","infoHashBuffer":{"type":"Buffer","data":[56,25,219,241,20,182,224,151,122,118,157,240,52,35,35,191,152,115,112,198]},"announce":[],"urlList":[]}}