{"title":"A Fine Family - Gurcharan Das.epub","uid":9724570,"size":473852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3895f785db48e6761a066fc143f1cf09e27924ce&amp;dn=A+Fine+Family+-+Gurcharan+Das.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1394240021,"description":"This novel set in India is the story of three generations of one family in the midst of a radically transforming world. The head of the household, Bauji, is a prominent lawyer in Lyallpur; he has a distaste for the &quot;bazaar politics&quot; of Mahatma Gandhi and believes in the British system of justice. Bauji is concerned about his favorite daughter, Tara, who chooses to work as a schoolteacher, much to her disadvantage in the marriage market. In 1947, when India gains its independence from Britain, violence breaks out in Lyallpur, situated in the newly created Muslim country of Pakistan. Bauji, his family and millions of non-Muslim Indians are forced to migrate, and thousands are left homeless, raped or dead. After the move, Tara, recently married, gives birth to a son, Arjun, who becomes the hope and the future for the dynasty in the new India. Giving each of the generations its distinct viewpoint, Das sensitively portrays both the life of a clan and a nation reluctantly, painfully, and, in the end, triumphantly adapting to change. First-novelist Das is a playwright and a professional manager of Procter &amp; Gamble India in Bombay. ","torrent":{"xt":"urn:btih:3895f785db48e6761a066fc143f1cf09e27924ce","amp;dn":"A+Fine+Family+-+Gurcharan+Das.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3895f785db48e6761a066fc143f1cf09e27924ce","infoHashBuffer":{"type":"Buffer","data":[56,149,247,133,219,72,230,118,26,6,111,193,67,241,207,9,226,121,36,206]},"announce":[],"urlList":[]}}