{"title":"The Memory of Love - Aminatta Forna.epub","uid":9361064,"size":511817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:390b348047789619dc28485ca06a838053873ba2&amp;dn=The+Memory+of+Love+-+Aminatta+Forna.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387319721,"description":"Adrian Lockheart is a psychologist escaping his life in England. Arriving in Freetown in the wake of civil war, he struggles with the intensity of the heat, dirt and dust, and with the secrets this country hides. Despite the gulf of experience and understanding between them, Adrian finds unexpected friendship in a young surgeon at the hospital, the charismatic Kai Mansaray, and begins to build a new life just as Kai makes plans to leave. In the hospital Adrian encounters an elderly and unwell man, Elias Cole, who is reflecting on his past, not all of it noble. Recorded in a series of notebooks are memories of his youth, the optimism of the first moon landings, and the details of an obsession: Saffia, a woman he loved, and Julius, her fiery, rebellious husband. As their individual stories entwine across two generations in a country torn apart by repression and war, some distances cannot be bridged. The Memory of Love is a towering tale of ordinary people in extraordinary circumstances, superbly realised and beautifully written, horrifying and exhilarating, unflinching and tender, moving and uplifting. It is the story of four lives colliding; a story about friendship, about understanding, absolution and the indelible effects of the past; about journeys and dreams and loss, and about the very nature of love.","torrent":{"xt":"urn:btih:390b348047789619dc28485ca06a838053873ba2","amp;dn":"The+Memory+of+Love+-+Aminatta+Forna.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"390b348047789619dc28485ca06a838053873ba2","infoHashBuffer":{"type":"Buffer","data":[57,11,52,128,71,120,150,25,220,40,72,92,160,106,131,128,83,135,59,162]},"announce":[],"urlList":[]}}