{"title":"Voices of Forgotten Worlds: Music of Indigenous Peoples cd1","uid":4387733,"size":87009106,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39687fd54abaaf671336f5bbe215a4b0f4182923&amp;dn=Voices+of+Forgotten+Worlds%3A+Music+of+Indigenous+Peoples+cd1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":22,"time":1221001321,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\nVoices of Forgotten Worlds: Traditional Music of Indigenous Peoples \n\nConcentrating on vocal traditions, the two-disc set Voices of \nForgotten Worlds delivers cut after cut of wonderful music, \nfrequently in stunning high-fidelity recordings. Producer \nBrook Wentz' sensitive sequencing minimizes the inevitable \ndiscontinuity from one cut to the next. The only flaws would \nseem to be unavoidable with such a diverse and wide-ranging \ncollection: Individual pieces are too short, and they bear no real \nrelation to one another. Things get off to a rousing start with \na Tuvan (south Siberian) song in which the singers form a melody \nof whistling overtones that careens above their voices. From \nthere the set skips through Japanese, South American, Northern \nEuropean, Chinese, South Seas, and Australian examples before \nsettling into an insistent Afghan ghazal and a glorious \ninstrumental Newar celebration from Nepal. Performances from \nGreenland, Mexico, and Azerbaijan give way to the surprising choral \nsinging of the Maori of New Zealand, which seems to bend local \ntradition with harmonies learned from church hymns. Among the \nmore familiar patterned bells of the Balinese gamelan and \notherworldly chanting of Tibetan monks, unique highlights include \na hypnotic pan pipe ensemble from the Solomon Islands; a \nsurprisingly gentle chant from the Kayapo (notoriously warlike \ndenizens of the Amazon jungle); a compelling rapid-fire pulse \nof drums, bells, and a double reed from the Batak people of \nSumatra; and a Wodaabe chorus from Niger, whose sinuous, irregular \nvocal phrases suddenly take form with the addition of hand claps. \nRather than displaying various traditions as artifacts to be studied, \nEllipsis Arts presents them as music to be enjoyed, an approach that \nhas borne fruit in several of the label's top-notch collections. \n~ Ted Greenwald, All Music Guide","torrent":{"xt":"urn:btih:39687fd54abaaf671336f5bbe215a4b0f4182923","amp;dn":"Voices+of+Forgotten+Worlds%3A+Music+of+Indigenous+Peoples+cd1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39687fd54abaaf671336f5bbe215a4b0f4182923","infoHashBuffer":{"type":"Buffer","data":[57,104,127,213,74,186,175,103,19,54,245,187,226,21,164,176,244,24,41,35]},"announce":[],"urlList":[]}}