{"title":"Rage - Jerry Langton.epub","uid":9362584,"size":1845312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3994020041cca3e62faef1fa7d0fd99333b22723&amp;dn=Rage+-+Jerry+Langton.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387349342,"description":"In a quiet working-class neighborhood in east-end Toronto, on an early winter day in November 2003, Johnathon Madden returned home from school only to be bullied and threatened by is older brother, Kevin; Kevin's friend Tim Ferriman; and another teenager. the confrontation turned violent and fatal. Johnathon didn't have the strength or size to protect himself against the frenzied attack of his powerful 250-pound brother.Sibling violence may be as old as time, but this case is particularly disturbing and unsettling.\n\nKevin Madden had problems. This was not news to his family, teachers, principal, social workers, and psychiatrists. but what drove him to commit murder - and why Johnathon? Why were his friends compelled to take part in the bloodletting? What events were going on behind the scenes that played a part in the tragedy?\n\nJerry Langton, author of bestseller Fallen Angel, sets out to answer those questions and look for the clues that drove Kevin Madden over the edge. His investigation takes him onto the streets of Toronto, where he unearths a disturbing teen subculture, into cyberspace, and into the confidence of neighbors and students who knew the Madden Family. Langton reveals shocking testimony from the trials - one of which was declared a mistrial due to the perjury of a witness - and exposes the twisted lives of youth living in a parallel universe where death is met with complacency.","torrent":{"xt":"urn:btih:3994020041cca3e62faef1fa7d0fd99333b22723","amp;dn":"Rage+-+Jerry+Langton.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3994020041cca3e62faef1fa7d0fd99333b22723","infoHashBuffer":{"type":"Buffer","data":[57,148,2,0,65,204,163,230,47,174,241,250,125,15,217,147,51,178,39,35]},"announce":[],"urlList":[]}}