{"title":"Under The Dome (2014) - Inside Chester's Mill One-Hour Special N","uid":10690224,"size":1275060527,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:39a3a7072c7b2557d906b98160d2799627114d50&amp;dn=Under+The+Dome+%282014%29+-+Inside+Chester%27s+Mill+One-Hour+Special+N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Atsiekratsie","files":-1,"time":1407114966,"description":"Under The Dome S02E00 - Inside Chester's Mill 2014 One-Hour Special NL Subs\n\n\nCBS TO AIR ?UNDER THE DOME: INSIDE CHESTER?S MILL,? AN EXCLUSIVE ONE-HOUR SPECIAL LOOKING BACK AT THE FIRST SEASON AND AHEAD TO THE SECOND SEASON PREMIERE, ONMONDAY, JUNE 23\n\nFeatures Interviews with the Cast and Executive Producers and an Advance Sneak Peek at the Season Two Premiere\n\nSeason Two Premieres Monday, June 30 with an Episode Written by Bestselling Author and Executive Producer Stephen King\nThis exclusive one-hour special looks back at the premiere season of the hit summer series, featuring highlights from last season as well as new interviews with the cast and executive producers. In addition, the special will tease what lies ahead for the residents of Chester?s Mill who are still trapped under the mysterious dome with an advance sneak peek at the season two premiere.\n\nUNDER THE DOME returns for its second season Monday, June 30 (10:00-11:00 PM, ET/PT) on the CBS Television Network, with an episode written by bestselling author and executive producer Stephen King.\n\nUNDER THE DOME was last summer?s #1 program and the most-watched scripted summer series premiere in 21 years. UNDER THE DOME is also licensed in 200 markets worldwide by CBS Studios International, and was recently named one of the most-watched dramas in the world by Eurodata TV Worldwide.\n\nUNDER THE DOME stars Mike Vogel, Rachelle Lefevre, Dean Norris, Eddie Cahill, Alexander Koch, Nicholas Strong, Colin Ford, Mackenzie Lintz, Karla Crome, Natalie Martinez and Britt Robertson. It is produced by CBS Television Studios in association with Amblin Television. Steven Spielberg, Stephen King, Neal Baer, Justin Falvey, Darryl Frank, Stacey Snider, Jack Bender and Brian K. Vaughan are executive producers.\n\n[img]http://www.breathecast.com/data/images/full/21074/under-the-dome-season-2.jpg[/img]\n\n\nBron: Under.the.Dome.S02.Special-Inside.Chesters.Mill.720p.HDTV.x264-BAJSKORV[rartv] \nContainer: MP4\nFormaat: X264\nGrootte: 1,25 GB\nAudio: Engels DD5.1\nOndertitels: NL Subs\n\nVertaling en controle: Tinkerbell, Drentje en Bullit","torrent":{"xt":"urn:btih:39a3a7072c7b2557d906b98160d2799627114d50","amp;dn":"Under+The+Dome+%282014%29+-+Inside+Chester%27s+Mill+One-Hour+Special+N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39a3a7072c7b2557d906b98160d2799627114d50","infoHashBuffer":{"type":"Buffer","data":[57,163,167,7,44,123,37,87,217,6,185,129,96,210,121,150,39,17,77,80]},"announce":[],"urlList":[]}}