{"title":"THE SECRET GARDEN","uid":9093293,"size":1555147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a45d6a2f6be2b6303566e7b53af1f40e4f33357&amp;dn=THE+SECRET+GARDEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prabhu_","files":1,"time":1382642063,"description":"The Secret Garden is a novel by Frances Hodgson Burnett. It was initially published in serial format starting in the autumn of 1910, and was first published in its entirety in 1911. It is now one of Burnett's most popular novels, and is considered to be a classic of English children's literature. Several stage and film adaptations have been produced\n\nThe Secret Garden is the book's central symbol, inspired by Burnett's interest in Mary Baker Eddy's Christian Science theories. The secret garden at Misselthwaite Manor is the site of both the near-destruction and the subsequent regeneration of a family. Using the garden motif, Burnett explores the healing power inherent in living things. (H. G. Wells's short story 'The Door in the Wall' described a similarly transforming secret garden.)\n\nThe story constitutes a struggle between common sense and the accepted wisdom of the day, in which common sense wins. Servants and father are seen to do harm by getting caught up in false ideas that come from the doctor who espouses medical practices of the day, though another doctor does take a different view. The children, by their own observations, strengthened by the common-sense of Dickon's family, break free of the imposed regime and triumph.\n\nMary finds that she has a great fear of the out side world and Colin helps her become more aware of the joy of life as he heals.\n\nAnother theme is what today might be called 'positive thinking', and belief in its power to bring about psychological and physical healing. Along with this goes a powerful message about the way in which life circumstances affect the formation of personality. Mary, described as 'sour faced' and 'spoilt' becomes more aware of her own personality when confronted with selfishness and tantrums in the boy Colin. Both are very affected by the simple kindness and understanding of Dickon, and his mother, who live a happy family life despite being poor, with the emphasis on fresh air, exercise and being at one with nature, as well as kind to other people.\nDickon's mother has an old-fashioned down-to-earth approach to life, and what constitutes a good upbringing for children, which comes across the better for being expressed in Yorkshire dialect. Instead of mocking Dickon's dialect, Mary comes to like it and find it soothing and direct, to the extent that both she and Colin make an effort to talk like Dickon at times, strengthening the bond between them and their ability to express emotions.\nBelief in 'magic' also features strongly, though the exact nature of this 'magic' is not made clear, and Colin talks of a career in science where he will discover the nature of magic through experiment and will lecture about it. Christian Science, with its belief in God as a life force rather than a person is clearly an influence here, the author being a follower of the movement.\n\nMaytham Hall in Kent, England, where Burnett lived for a number of years during her marriage is often cited as the inspiration for the book's setting. Burnett kept an extensive garden, including an impressive rose garden. However, it has been noted that besides the garden, Maytham Hall and Misselthwaite Manor are physically very different.\n &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/commons/a/a7/The_Secret_Garden_book_cover_-_Project_Gutenberg_eText_17396.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/commons/a/a7/The_Secret_Garden_book_cover_-_Project_Gutenberg_eText_17396.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3a45d6a2f6be2b6303566e7b53af1f40e4f33357","amp;dn":"THE+SECRET+GARDEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a45d6a2f6be2b6303566e7b53af1f40e4f33357","infoHashBuffer":{"type":"Buffer","data":[58,69,214,162,246,190,43,99,3,86,110,123,83,175,31,64,228,243,51,87]},"announce":[],"urlList":[]}}