{"title":"Pink Floyd - The Final Cut [24bit FLAC] vinyl","uid":10655144,"size":857831279,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3b10db69d83a6834e70725870d52f91d6a9fb670&amp;dn=Pink+Floyd+-+The+Final+Cut+%5B24bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1406660349,"description":"\n  Pink Floyd - The Final Cut [24bit FLAC] vinyl\n\n  Genre: Rock\n  Style: Art Rock, Progressive\n  Source: CBS SONY LP 24AP 2410 Original Pressing (Japan)\n  Codec: FLAC\n  Bit Rate: ~ 2,500 kbps\n  Bit Depth: 24\n  Sample Rate: 96 kHz\n \n  A1 The Post War Dream\n  A2 Your Possible Pasts\n  A3 One of the Few\n  A4 The Hero's Return\n  A5 The Gunner's Dream\n  A6 Paranoid Eyes\n\n  B1 Get Your Filthy Hands Off My Desert\n  B2 The Fletcher Memorial Home\n  B3 Southampton Dock\n  B4 The Final Cut\n  B5 Not Now John\n  B6 Two Suns in the Sunset\n\n  Rip by Dr. Robert\n\n  CBS/Sony Records 25AP 2410\n  Original Japanese Pressing\n  24-bit / 96kHz Vinyl\n\n  Nitty Gritty RCM 1.5\n  Technics SL-1200MK2 Turntable with KAB Fluid Damping\n  Ortofon 2M Black cartridge\n  Pro-Ject Tube Box SE II Preamp\n  Tascam US-144 external USB 2.0 Audiointerface\n  Bias Peak LE 6 recording software\n  iZotope RX Advanced 1.21 for redbook conversion\n  Trader's Little Helper for redbook SBE correction\n\n  The Final Cut extends the autobiography of The Wall, concentrating on Roger Waters' pain when his father died in World War II. Waters spins this off into a treatise on the futility of war, concentrating on the Falkland Islands, setting his blistering condemnations and scathing anger to impossibly subdued music that demands full attention. This is more like a novel than a record, requiring total concentration since shifts in dynamics, orchestration, and instrumentation are used as effect. This means that while this has the texture of classic Pink Floyd, somewhere between the brooding sections of The Wall and the monolithic menace of Animals, there are no songs or hooks to make these radio favorites. The even bent of the arrangements, where the music is used as texture, not music, means that The Final Cut purposely alienates all but the dedicated listener. Several of those listeners maintain that this is among Pink Floyd's finest efforts, and it certainly is an achievement of some kind -- there's not only no other Floyd album quite like it, it has no close comparisons to anybody else's work (apart from Waters' own The Pros and Cons of Hitch Hiking, yet that had a stronger musical core). That doesn't make this easier to embrace, of course, and it's damn near impenetrable in many respects, but with its anger, emphasis on lyrics, and sonic textures, it's clear that it's the album that Waters intended it to be. And it's equally clear that Pink Floyd couldn't have continued in this direction -- Waters had no interest in a group setting anymore, as this record, which is hardly a Floyd album in many respects, illustrates. Distinctive, to be sure, but not easy to love and, depending on your view, not even that easy to admire.","torrent":{"xt":"urn:btih:3b10db69d83a6834e70725870d52f91d6a9fb670","amp;dn":"Pink+Floyd+-+The+Final+Cut+%5B24bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b10db69d83a6834e70725870d52f91d6a9fb670","infoHashBuffer":{"type":"Buffer","data":[59,16,219,105,216,58,104,52,231,7,37,135,13,82,249,29,106,159,182,112]},"announce":[],"urlList":[]}}