{"title":"How to Fail at Almost Everything and Still Win Big_ Kind of the ","uid":9145252,"size":719716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b901ca44ece9e681e2544dc0614136ea21d02e2&amp;dn=How+to+Fail+at+Almost+Everything+and+Still+Win+Big_+Kind+of+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1383582527,"description":"Dilbert creator Scott Adams' funny memoir about his many failures and what they eventually taught him about success\n\nScott Adams has probably failed at more things than anyone you've ever met. So how did he go from hapless office worker and serial failure to the creator of Dilbert, one of the world's most famous comic strips, in just a few years?\n\nNo career guide can offer advice that works for everyone. Your best bet is to study the ways of others who made it big and try to glean some tricks that make sense for you. So here Scott Adams tells how he turned one failure after another - including a corporate career, inventions, investments, and two restaurants - into something successful. Along the way he discovered some unlikely truths. Goals are for losers; systems are for winners. Forget 'passion'; what you need is personal energy.\n\nIn this brilliant book, Adams shows us how to invite failure in, embrace it, then pick its pocket. While you laugh at his failures, you'll discover some helpful ideas for your own path to personal victory. \nGenre: Biography/ Memoirs \n","torrent":{"xt":"urn:btih:3b901ca44ece9e681e2544dc0614136ea21d02e2","amp;dn":"How+to+Fail+at+Almost+Everything+and+Still+Win+Big_+Kind+of+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b901ca44ece9e681e2544dc0614136ea21d02e2","infoHashBuffer":{"type":"Buffer","data":[59,144,28,164,78,206,158,104,30,37,68,220,6,20,19,110,162,29,2,226]},"announce":[],"urlList":[]}}