{"title":"SWF Decompiler Premium 2.2.2.15","uid":6097059,"size":3597197,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3ba7660e857ec8372f27975394148528e723db8a&amp;dn=SWF+Decompiler+Premium+2.2.2.15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"locobot12","files":-1,"time":1294818194,"description":"*cracked by LAXiTy team!\n\n-----------------------------------------------------------------------------------\n\n SWF Decompiler Premium enables you to export FLA data which can easily be edited in native Flash environment and to convert between swf and exe format. SWF Decompiler Premium enables you to export FLA data which can easily be edited in native Flash environment and to convert between swf and exe format. With SWF Decompiler Premium all components (images, sound, action scripts, texts, shapes, frames, fonts, texts, buttons and sprites) can be completely recovered. The player window is innovatively separated from the main panel, which enables users to drag and drop the window wherever they want it to be.\n\nHere are some key features of &quot;SWF Decompiler Premium&quot;:\n- Export data to rebuild FLA file\n- With SWF Decompiler Premium, you can export data from a flash files, and then rebuild FLA files by Macromedia Flash Professional 8 at your will.\n- Export resources\n- SWF Decompiler Premium has an explorer-like interface that helps users to find Flash movies easily.\n- Convert\n- It supports the conversion between SWF and EXE file with high quality.\n- Replace Images and Edit Dynamic Texts\n- SWF Decompiler Premium allows you to replace images of current flash movie with desired images and also allows editing dynamic texts (text, diaphaneity, font, color) at your will.\n- Parse and Decompile\n- It is outstanding in parsing and decompiling Flash movies. It displays all components of a movie in groups (such as Image, Shape, Sound, Font, Text, Button, Sprite, Script and Frame). SWF Decompiler Premium displays the neat code of action script with syntax highlighted, and you can decompile it easily\n- View\n- SWF Decompiler Premium offers a innovative player window separated from the main panel, which enables users to drag and drop the window wherever they want it to be. Besides, it also display detailed information of current movie.\n- Browse\n- SWF Decompiler Premium has an explorer-like interface that helps users to find Flash movies easily\n\nHome Page - http://www.swfdecompiler.net/\n\nSeed and share!\n\nClick on my username for more Softs!!","torrent":{"xt":"urn:btih:3ba7660e857ec8372f27975394148528e723db8a","amp;dn":"SWF+Decompiler+Premium+2.2.2.15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ba7660e857ec8372f27975394148528e723db8a","infoHashBuffer":{"type":"Buffer","data":[59,167,102,14,133,126,200,55,47,39,151,83,148,20,133,40,231,35,219,138]},"announce":[],"urlList":[]}}