{"title":"Local Food Environments: Food Access in America (2014)","uid":10983330,"size":3944138,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bc959e2f430b05bbffd93c0fe1d67a110e9f554&amp;dn=Local+Food+Environments%3A+Food+Access+in+America+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1409887645,"description":"Book Description:\n\nLocal Food Environments: Food Access in America provides information on the complex nature of food delivery systems as well as the historical and political trends that have shaped them over time. The book presents the empirical evidence demonstrating disparities in access to healthy affordable foods across the United States and how these disparities may explain food consumption patterns for some Americans as well as potential risks for diet-related illness.\n\nThe book describes the current body of research surrounding these associations and presents the methodological issues pertinent to this area of public health. Evidence from these studies is placed in context of current and past American food policies that have supported the existing food retail market including the production and retailing of foods and ways in which the consolidation of the food system has affected Americans. Research conducted regarding local food environments in Canada has also been included as a point of comparison.\n\nMethods are discussed as well as the current state of knowledge regarding factors associated with disparities between local food environments, the effect of these disparities on the diets of residents within those communities, and the impact that local food environments have on diet-related health outcomes, such as obesity. Also described are solutions garnered to minimize local food environment inequalities currently being conducted by federal, state, and local government agencies.\n\nAlthough this book focuses on US local food environments, similar issues regarding access to food are concurrently taking place outside of the US. In all chapters, readers are encouraged to critically consider the current research methods as well as recent programs and policies that aim to address local food environments.\n\nProduct Details:\n\nPDF: 352 pages\nPublisher: CRC Press; 1 edition (September 2, 2014)\nLanguage: English\nISBN-10: 1466567783\nISBN-13: 978-1466567788\nAmazon Link:\n\nContent Details:\n\nimage\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:3bc959e2f430b05bbffd93c0fe1d67a110e9f554","amp;dn":"Local+Food+Environments%3A+Food+Access+in+America+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc959e2f430b05bbffd93c0fe1d67a110e9f554","infoHashBuffer":{"type":"Buffer","data":[59,201,89,226,244,48,176,91,191,253,147,192,254,29,103,161,16,233,245,84]},"announce":[],"urlList":[]}}