{"title":"Red Line 7000 (1965)","uid":5476522,"size":986170860,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3c94d4b23e0e6f7a5fa194789a6f6a98b50802d6&amp;dn=Red+Line+7000+%281965%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pumba-kung","files":1,"time":1270177646,"description":"The ultimate auteurist litmus test.\n\n\nPeter Bogdanovich, Arnaud Desplechin, and Quentin Tarantino have all cited this film as a major influence. (See AT LONG LAST LOVE, MY SEX LIFE OR: HOW I GOT INTO THE ARGUMENT, and the Jack Rabbit Slim's portion of PULP FICTION.)\n\nFrom Todd McCarthy's The Grey Fox of Hollywood:\n\n&quot;The foreword to the screenplay, unsigned but betraying evidence of having been written by Hawks, begins as follows: 'RED LINE 7000 is the story of three men and the women who love them. The three stories have little or no connection except that the men are race drivers. THey are those prima donnas who handle incredibly fast combustions of steel and other metals and do it as a virtuoso plays a violin. Racing is the epitome of the dangerous professions, and while in some ways the men are similar in their abilities as men they are vastly different.'&quot;\n\n&quot;Intent upon proving that he could make a commercial film quickly and cheaply, Hawks agreed to a $1.35 million budget...&quot;\n\n&quot;After decades of keeping brand names out of movies, Hollywood was just waking up to the financial potential of product placement in pictures, and Hawks and Jerry Lewis, also at Paramount at the time, led the way... Hawks lined up tie-ins with at least a dozen companies ... Ford, Puroil, Pepsi-Cola, Honda, Rolex, Revell Toys, National Car Rental, and Holiday Inn. Some of the plugs were so blatant as to be embarrassing; after seeing the picture, Pepsi registered a complaint over the way the drink was featured, undoubtedly in reference to the phallic implications of the Pepsi bottles in the romantic scene between Marianna Hill and James Caan.&quot;\n\n&quot;[Possibly] the most underestimated film of the sixties [...]&quot; - Robin Wood\n\n&quot;One of [Hawks's] most intriguing works... To a director like Hawks, who always worked within conventions, such material (of his own devising--his first original screenwriting credit in twenty-five years) provides a stimulation and a challenge.&quot; - Jean-Pierre Coursodon, American Film Directors\n\n&quot;The relationship to death is always conceived thus: a dead man is never death, and death is never more than being absent, more precisely: to be out of frame.&quot; - Serge Daney on RIO LOBO\n\nQuality:\n\nFile Name: redline7000.avi \nFile Size: 930.21 MB \nRuntime: 1:57:36 \n\nVideo codec: DivX 6.0 \nFrame size: 624 x 464 \nFPS: 23.98 \nData Rate: 1071.62 kbits/sec \n\nAudio: MPEG Layer 3, Stereo, 44.100 kHz","torrent":{"xt":"urn:btih:3c94d4b23e0e6f7a5fa194789a6f6a98b50802d6","amp;dn":"Red+Line+7000+%281965%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c94d4b23e0e6f7a5fa194789a6f6a98b50802d6","infoHashBuffer":{"type":"Buffer","data":[60,148,212,178,62,14,111,122,95,161,148,120,154,111,106,152,181,8,2,214]},"announce":[],"urlList":[]}}