{"title":"Arctic Monkeys 24 Bit Vinyl Pack","uid":8861592,"size":5554153705,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3ccbfa9577337c69257a96d80528697b070ffdcf&amp;dn=Arctic+Monkeys+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1377787976,"description":"  Arctic Monkeys 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,600 - 3,200 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,100 Hz\n\n  2006 Whatever People Say I Am, That's What I'm Not (two versions)\n  2007 Favourite Worst Nightmare\n  2007 Brainstorm (10&quot;)\n  2009 Humbug\n  2011 Suck It and See (two versions)\n\n  By distilling the sounds of Franz Ferdinand, the Clash, the Strokes, and the Libertines into a hybrid of swaggering indie rock and danceable neo-punk, Arctic Monkeys became one of the U.K.'s biggest bands of the new millennium. Their meteoric rise began in 2005, when the teenagers fielded offers from major labels and drew a sold-out crowd to the London Astoria, using little more than a self-released EP as bait. Several months later, Whatever People Say I Am, That's What I'm Not became the fastest-selling debut album in British history, entrenching Arctic Monkeys in the same circle as multi-platinum acts like Oasis and Blur.\n\n  Frontman Alex Turner and guitarist Jamie Cook began their music careers in 2001, when the friends both received guitars for Christmas. Two years later, they began performing shows around their native Sheffield with drummer Matt Helders and bassist Andy Nicholson, two fellow students at Stocksbridge High School. A series of demo recordings followed, and Arctic Monkeys' audience swelled as fans circulated those recordings via the Internet. The musicians soon found themselves at the center of a growing media circus, with such outlets as BBC Radio examining the band's music and mounting hype.\n\n  By distributing their homemade material on the Internet, Arctic Monkeys were able to build a sizable fan base without the help of a record label, effectively circumventing the usual road to superstardom. They continued to buck tradition by signing with Domino Records in 2005, eschewing a major label's budget for Domino's D.I.Y. cred and hip roster (which also included Franz Ferdinand, a touchstone for the band's sound). The smart moves paid off as Arctic Monkeys' first two singles -- &quot;I Bet You Look Good on the Dancefloor&quot; and &quot;When the Sun Goes Down&quot; -- both topped the U.K. charts. Critical reception was similarly favorable, but few could have predicted the whirlwind success of the band's debut album, which ousted Oasis' Definitely Maybe as the fastest-selling debut in British history (a record that was broken one year later by Leona Lewis' Spirit). Whatever People Say I Am, That's What I'm Not sold 363,735 copies during its first week alone, transforming Arctic Monkeys from underground stars into mainstream figures.\n\n  Arctic Monkeys' debut sold approximately 300,000 total copies in America -- enough to warrant more media coverage, but notably less than the album's British sales during its first week alone. Nevertheless, their success continued as they released a spring EP, Who the F**k Are Arctic Monkeys, and prepared for a stateside tour. Temporary bassist Nick O'Malley was brought aboard for the band's American shows, while a fatigued Nicholson stayed at home. Nicholson then announced his official departure when the band returned home in June 2006, and O'Malley remained with Arctic Monkeys as a permanent member. That fall, the guys received the 2006 Mercury Prize and donated the accompanying money to an undisclosed charity. Additional accolades included Best British Breakthrough Act at the Brit Awards and Best New Band at the NME Awards. NME also made a bold assertion by deeming the band's debut one of the Top Five British albums ever released.","torrent":{"xt":"urn:btih:3ccbfa9577337c69257a96d80528697b070ffdcf","amp;dn":"Arctic+Monkeys+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ccbfa9577337c69257a96d80528697b070ffdcf","infoHashBuffer":{"type":"Buffer","data":[60,203,250,149,119,51,124,105,37,122,150,216,5,40,105,123,7,15,253,207]},"announce":[],"urlList":[]}}