{"title":"Buzz.Concurso.De.Bolsillo[Spanish][PSP]","uid":4325801,"size":841133989,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3ce4dc39775eeab63ef9b3ba8e63046ca1f00621&amp;dn=Buzz.Concurso.De.Bolsillo%5BSpanish%5D%5BPSP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mois20","files":59,"time":1217758103,"description":"Gracias al lanzamiento del primer Buzz! para PSP, podrÃƒÂ¡s llevarte al presentador mÃƒÂ¡s deslenguado del planeta allÃƒÂ¡ donde tÃƒÂº quieras.\nEl nuevo lanzamiento de Sony Computer Entertainment, Buzz! para PSP, contiene mÃƒÂ¡s de 5000 preguntas acerca de temas tan diversos como mÃƒÂºsica, famosos, televisiÃƒÂ³n, deportes, ciencia, naturaleza, pelÃƒÂ­culas y cultura general, ademÃƒÂ¡s de incluir 1000 fotografÃƒÂ­as y vÃƒÂ­deos que pondrÃƒÂ¡n a prueba tu inteligencia estÃƒÂ©s donde estÃƒÂ©s. Este tÃƒÂ­tulo presenta seis nuevas rondas, diseÃƒÂ±adas especÃƒÂ­ficamente para PSP, entre las que no podÃƒÂ­a faltar el trepidante desafÃƒÂ­o &quot;Apunta y dispara&quot;, el rompecabezas &quot;imagina&quot; y el abrumador &quot;DesafÃƒÂ­o vÃƒÂ­rico&quot;.\nCon el modo &quot;Compartir juego&quot;, tÃƒÂº y tus amigos (hasta cuatro) podrÃƒÂ©is conectar vuestros sistemas PSP y, con una sola copia de Buzz!, comprobar quiÃƒÂ©n es el mÃƒÂ¡s rÃƒÂ¡pido en la vertiginosa ronda &quot;Dedo mÃƒÂ¡s veloz&quot;. Por otro lado, en el modo &quot;Ronda final&quot;, uno de los jugadores (de dos a seis) controlarÃƒÂ¡ el juego y se encargarÃƒÂ¡ de seleccionar las preguntas que plantearÃƒÂ¡ al resto de los participantes. El presentador serÃƒÂ¡ el mismo durante toda la partida y tendrÃƒÂ¡ el poder de conceder (o quitar) puntos a su entera discreciÃƒÂ³n.\nPero Buzz! para PSP no solo destaca por su modalidad multijugador, ya que el modo para un solo usuario es mucho mÃƒÂ¡s largo y entretenido que el de la versiÃƒÂ³n anterior. Este modo cuenta ahora con 15 retos intelectuales diferentes, diseÃƒÂ±ados para medir la amplitud de tus conocimientos. Los jugadores ganarÃƒÂ¡n una medalla de acuerdo con los resultados obtenidos en cada ronda. Hay tres posibilidades: oro, plata y bronce, pero tendrÃƒÂ¡s que ponerte las pilas si quieres hacerte con el primer puesto... AdemÃƒÂ¡s, podrÃƒÂ¡s conseguir una gran variedad de trofeos especiales en funciÃƒÂ³n del nÃƒÂºmero total de respuestas acertadas, o de cuÃƒÂ¡n rÃƒÂ¡pidamente reacciones.\nBuzz! para PSP es la mejor forma de compartir con tus amigos la diversiÃƒÂ³n que te ofrece el sistema PSP, o de poner a prueba tu cultura general tÃƒÂº solito... Perfecto para viajes largos, vacaciones o para estar por casa, con Buzz! pondrÃƒÂ¡s a prueba tus conocimientos durante horas.","torrent":{"xt":"urn:btih:3ce4dc39775eeab63ef9b3ba8e63046ca1f00621","amp;dn":"Buzz.Concurso.De.Bolsillo%5BSpanish%5D%5BPSP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ce4dc39775eeab63ef9b3ba8e63046ca1f00621","infoHashBuffer":{"type":"Buffer","data":[60,228,220,57,119,94,234,182,62,249,179,186,142,99,4,108,161,240,6,33]},"announce":[],"urlList":[]}}