{"title":"Encyclopedia of Solid Earth Geophysics","uid":6547604,"size":78301038,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d0b3dcf80d9676ce0b92fb9e2ca3fde52277f39&amp;dn=Encyclopedia+of+Solid+Earth+Geophysics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"TheBookie","files":-1,"time":1310934472,"description":"Encyclopedia of Solid Earth Geophysics\n\n\nThe past few decades have witnessed the growth of the Earth Sciences in the pursuit of knowledge and understanding of the planet that we live on. This development addresses the challenging endeavor to enrich human lives with the bounties of Nature as well as to preserve the planet for the generations to come. Solid Earth Geophysics aspires to define and quantify the internal structure and processes of the Earth in terms of the principles of physics and forms the intrinsic framework, which other allied disciplines utilize for more specific investigations.\nThe first edition of the Encyclopedia of Solid Earth Geophysics was published in 1989 by Van Nostrand Reinhold publishing company. More than two decades later, this new volume, edited by Prof. Harsh K. Gupta, represents a thoroughly revised and expanded reference work. It brings together more than 200 articles covering established and new concepts of Geophysics across the various sub-disciplines such as Gravity, Geodesy, Geomagnetism, Seismology, Seismics, Deep Earth Processes, Plate Tectonics, Thermal Domains, Computational Methods, etc. in a systematic and consistent format and standard. It is an authoritative and current reference source with extraordinary width of scope. It draws its unique strength from the expert contributions of editors and authors across the globe. It is designed to serve as a valuable and cherished source of information for current and future generations of professionals.\n\n\n","torrent":{"xt":"urn:btih:3d0b3dcf80d9676ce0b92fb9e2ca3fde52277f39","amp;dn":"Encyclopedia+of+Solid+Earth+Geophysics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d0b3dcf80d9676ce0b92fb9e2ca3fde52277f39","infoHashBuffer":{"type":"Buffer","data":[61,11,61,207,128,217,103,108,224,185,47,185,226,202,63,222,82,39,127,57]},"announce":[],"urlList":[]}}