{"title":"Simpo PDF Password Remover v1.2 WinAll Incl Keygen-FALLEN [TorDi","uid":8760238,"size":2404435,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3d334c73e52556d598c92bca14c4ad5e1f2e50ac&amp;dn=Simpo+PDF+Password+Remover+v1.2+WinAll+Incl+Keygen-FALLEN+%5BTorDi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":13,"time":1375229672,"description":"Simpo PDF Password Remover\n\nDirectly remove owner password and crack user password with permission.\n\n-Remove restrictions of printing, copying, extracting\n\n-Decrypt limitations of opening\n\n-Remove password for a batch of PDF files\n\n-Be compatible with Windows 8\n\nSimpo PDF Password Remover is an excellent Windows 8 application to remove PDF Password. With this PDF password remover, you can easily make the PDF copyable, printable and editable by removing the owner password; and decrypt user password restrictions of opening after you unlock the PDF by entering the right password. And you can remove PDF restrictions for a range of PDF files at a time.\n\nFeatues: \n\nRemove PDF password and restrictions\n1. You can directly remove owner password, which prevents PDF from copying, printing and editing, to make the PDF file copyable, printable and editable.\n2. User password is used to restrict access to a PDF file. To decrypt the user password and make the PDF file readable, you need to enter right password to unlock it first.\n\nRemove password for a batch of PDF files\nDecrypt password for a batch of PDF files at a time. You can import up to 200 PDF files and decrypt their password at the same time.\n\nInsert Metadata information\nThis PDF password remover allows you to set password to secure your output PDF with ber 128bit RC4 and AES encryption; at the same time, you could modify PDF's metadata to claim authority.\n\nset password to protect output PDFOther features\nYou can add simple but secure password protection to prevent printing, changing, copying or extracting with owner password, and do not allow opening by setting a user password. Preserve access to electronic long-term archives, by creating the files to ISO 19005-1 compliant PDF/A format documents.\n\n\nOther features\nA) Support multiple PDF formats. Adobe PDF 1.0 - 1.7 formats are supported; B) Support multi language. Now English, Italian, German, French, Hungarian, Spanish, Traditional Chinese and Simplified Chinese are available!\n\nSupported OS:\n\nWindows 8, Windows 7, Windows Vista and Windows XP\n\nHomepage: http://www.simpopdf.com/pdf-password-remover.html\n\nInstallation Instructions:\n\n- Install program.\n- Run keygen, get valid serial to register application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:3d334c73e52556d598c92bca14c4ad5e1f2e50ac","amp;dn":"Simpo+PDF+Password+Remover+v1.2+WinAll+Incl+Keygen-FALLEN+%5BTorDi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d334c73e52556d598c92bca14c4ad5e1f2e50ac","infoHashBuffer":{"type":"Buffer","data":[61,51,76,115,229,37,86,213,152,201,43,202,20,196,173,94,31,46,80,172]},"announce":[],"urlList":[]}}