{"title":"BetterZip v. 2.1.2 pre[K]racked","uid":6829728,"size":7668919,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3d5a5bee160e17e556fbe2f5da9dde392e0edeae&amp;dn=BetterZip+v.+2.1.2+pre%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"polisdavid","files":3,"time":1321744849,"description":"Official Web Site: &lt;a href=&quot; http://macitbetter.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://macitbetter.com/&lt;/a&gt;\n\nBetterZip lets you quickly inspect archives without first extracting their contents.\n\n* Extract Only Files You Really Need: If you only need a few files or\n  folders from a larger archive, you don\\'t have to extract the whole thing.\n  Simply drag the files you need from the BetterZip window to any Finder\n  window or the desktop.\n\n* Open Archives Without Extracting: Not only can BetterZip open\n  archives without first extracting them but you can also search for a file\n  using the iTunes-like interface. BetterZip can open and extract archives \n  with the most common formats: ZIP, SIT, TAR, XAR, GZip, BZip2,\n  RAR, 7-Zip, CPIO, ARJ, LZH/LHA, JAR, WAR, CAB, ISO, CHM,\n  RPM, DEB, NSIS, BIN, HQX.\n\n* Create Archives: Simply drag files and folders from your hard drives, \n  disks, or network places into your new zip file. You no longer have to\n  copy all the files into a temporary folder first. The supported formats are\n  ZIP, TAR, GZip and BZip2 compressed TAR, XAR, 7-ZIP, and RAR\n  (using the external RAR commandline tool). Large archives can also be\n  split.\n\n* Protect Your Data: BetterZip can protect your data with a password and\n  create WinZip compatible AES-256 encrypted archives. 7-zip and rar\n  archives can also be protected.\n\n* Update Archives: Add new or updated files to existing archives.\n  Remove any file or folder from an archive, or even move files around\n  inside the archive as if it were a normal folder.\n\n* Make Archives Compatible: Strip Mac specific files and resource forks\n  from archives for best compatibility with systems like Windows or\n  Linux.\n\nWhat\\'s New\n\nNew Features\n\n* Added a Russian localization.\n\nEnhancements\n\n* Hold down the Cmd key while dropping a folder in the queue window\n  to recursively extract all archives in it.\n\n* Hold down the Alt key while dropping an archive in the queue window \n  to force compression.\n\nBug Fixes\n\n* When starting BetterZip through one of the services in the Services\n  menu, no empty archive window will be opened.\n\n* Fixed a possible crash when quitting BetterZip with the favorites\n  sidebar opened.\n\n* The registration window could lead to an infinite loop under certain\n  circumstances.\n\n* The split size for 7z archives was limited to 4GB.\n\n* Fixed a bug in handling \\&quot;additional options\\&quot; when creating archives.\n\n* Using the option \\&quot;show save panel\\&quot; together with the queue could lock\n  up BetterZip.\n\n* Trailing numbers are no longer cut off from the filename when saving\n  with automatically created archive names.\n\n* Fixed \\&quot;reuse passwords for subsequent archives\\&quot; in queue.\n\nSystem Requirements:\n\nIntel Mac OS version: Mac OS X 10.6 or later\n\n--- PLEASE SEED ---\n\nSorry no image, bayimg is down","torrent":{"xt":"urn:btih:3d5a5bee160e17e556fbe2f5da9dde392e0edeae","amp;dn":"BetterZip+v.+2.1.2+pre%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d5a5bee160e17e556fbe2f5da9dde392e0edeae","infoHashBuffer":{"type":"Buffer","data":[61,90,91,238,22,14,23,229,86,251,226,245,218,157,222,57,46,14,222,174]},"announce":[],"urlList":[]}}