{"title":"Sarah Bettens...Never Say Goodbye(2009)[FLAC]","uid":6619037,"size":222975511,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3dce066305b32b360dc04b1c464dcf36d0c23a7f&amp;dn=Sarah+Bettens...Never+Say+Goodbye%282009%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":16,"time":1313917865,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/drn000/n013/n01374w60jy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/drn000/n013/n01374w60jy.jpg&lt;/a&gt;\n\nNever Say Goodbye [2009]  V2 / VVNL20722\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n\n1 I Can Do Better Than You -Bettens 2:22 \n2 Slow You Down -Bettens 3:16 \n3 Cry Me a River -Hamilton 3:50 \n4 Win Me Over -Bettens 3:13 \n5 Come Over Here -Bettens, Harry 3:12 \n6 I Can't Make You Love Me -Reid, Shamblin 4:22 \n7 Go -Bettens 3:57 \n8 Scream -Bettens, Erez, Gerrard, Swinford 3:54 \n9 Daddy's Gun -Bettens 4:08 \n10 Follow Me Bettens 4:19 \n11 Not an Addict -Bettens, Bettens 5:19 \n\nSince putting K's Choice on hiatus, Bettens has come out as a lesbian and moved to Tennessee. She's also been experimenting with her music by touring with an acoustic trio. Most of this album consists of live tracks recorded during the acoustic Scream to a Whisper Tour of December 2006. The album was sold at Bettens' shows and on her website until its official European release in 2008, and its American release in 2009. The set includes two covers -- Julie London's &quot;Cry Me a River&quot; and Bonnie Raitt's &quot;I Can't Make You Love Me&quot; -- a selection of songs from Scream, her first solo album, and three new tunes, &quot;I Can Do Better Than You,&quot; &quot;Slow You Down,&quot; and &quot;Win Me Over.&quot; The arrangements, most of them played only by piano and standup bass, lend a torchy feel to the set that works well. This is pop music in the mode of the old-fashioned love songs of the '40s, and the subtle arrangements prove how timeless Bettens' music is. &quot;I Can Do Better Than You&quot; has a bluesy, Dixieland feel with a small horn section adding sprightly accents to Bettens' arch vocal. It hammers the nails into the coffin of a dead relationship with sly humor. &quot;Slow You Down&quot; investigates a failed relationship, with Bettens singing to a love who is present in body, but emotionally distant. She sings the song with a world-weary grace, her voice breaking with emotion in places to emphasize the song's emotional tenor. &quot;Win Me Over&quot; shows the happier side of love, although Bettens is far from exuberant as she sings its poignant lyric. The songs from Scream sound even better in their stripped down versions. &quot;Come Over Here&quot; simmers with Bettens' seductive vocal and muted electric guitar, &quot;Scream&quot; is delivered in a whisper with minimal piano backing, while &quot;Follow Me&quot; is a beautiful, inside-out love song, Bettens daring the object of her affection to follow her on her precarious journey to nowhere. Raitt's &quot;I Can't Make You Love Me&quot; and &quot;Cry Me a River&quot; get slow, dramatic readings, full of understated emotion, with &quot;Cry Me a River&quot; particularly moving. &quot;Not an Addict,&quot; the international hit that made K's Choice a supergroup in Europe, works even better as a quiet song. Its ambivalent lyric could be about any self-destructive behavior, drugs, or obsessive love, and it brings the set to a stunning conclusion.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/08/08/sarah-bettens/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/08/08/sarah-bettens/&lt;/a&gt;","torrent":{"xt":"urn:btih:3dce066305b32b360dc04b1c464dcf36d0c23a7f","amp;dn":"Sarah+Bettens...Never+Say+Goodbye%282009%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dce066305b32b360dc04b1c464dcf36d0c23a7f","infoHashBuffer":{"type":"Buffer","data":[61,206,6,99,5,179,43,54,13,192,75,28,70,77,207,54,208,194,58,127]},"announce":[],"urlList":[]}}