{"title":"Victorian Glassworlds (Art Ebook).pdf","uid":8640411,"size":15431648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e66514d4f47b98151749937719ffe253ca69bb9&amp;dn=Victorian+Glassworlds+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1372874221,"description":"Isobel Armstrong, &quot;Victorian Glassworlds: Glass Culture and the Imagination 1830-1880&quot;\nPublisher: University , USA | 2008 | ISBN 0199205205 | PDF | 470 pages | 14.7 MB\n\nIsobel Armstrong's startlingly original and beautifully illustrated book tells the stories that spring from the mass-production of glass in nineteenth-century England. Moving across technology, industry, local history, architecture, literature, print culture, the visual arts, optics, and philosophy, it will transform our understanding of the Victorian period.\nThe mass production of glass in the nineteenth century transformed an ancient material into a modern one, at the same time transforming the environment and the nineteenth-century imagination. It created a new glass culture hitherto inconceivable. Glass culture constituted Victorian modernity. It was made from infinite variations of the prefabricated glass panel, and the lens. The mirror and the window became its formative elements, both the texts and constituents of glass culture. The glassworlds of the century are heterogeneous. They manifest themselves in the technologies of the factory furnace, in the myths of Cinderella and her glass slipper circulated in print media, in the ideologies of the conservatory as building type, in the fantasia of the shopfront, in the production of chandeliers, in the Crystal Palace, and the lens-made images of the magic lantern and microscope. But they were nevertheless governed by two inescapable conditions.\nFirst, to look through glass was to look through the residues of the breath of an unknown artisan, because glass was mass produced by incorporating glassblowing into the division of labour. Second, literally a new medium, glass brought the ambiguity of transparency and the problems of mediation into the everyday. It intervened between seer and seen, incorporating a modern philosophical problem into bodily experience. Thus for poets and novelists glass took on material and ontological, political, and aesthetic meanings.\nReading glass forwards into Bauhaus modernism, Walter Benjamin overlooked an early phase of glass culture where the languages of glass are different. The book charts this phase in three parts. Factory archives, trade union records, and periodicals document the individual manufacturers and artisans who founded glass culture, the industrial tourists who described it, and the systematic politics of window-breaking. Part Two, culminating in glass under glass at the Crystal Palace, reads the glassing of the environment, including the mirror, the window, and controversy round the conservatory, and their inscription in poems and novels. Part Three explores the lens, from optical toys to 'philosophical' instruments as the telescope and microscope were known. \nA meditation on its history and phenomenology, Victorian Glassworlds is a poetics of glass for nineteenth-century modernity.","torrent":{"xt":"urn:btih:3e66514d4f47b98151749937719ffe253ca69bb9","amp;dn":"Victorian+Glassworlds+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e66514d4f47b98151749937719ffe253ca69bb9","infoHashBuffer":{"type":"Buffer","data":[62,102,81,77,79,71,185,129,81,116,153,55,113,159,254,37,60,166,155,185]},"announce":[],"urlList":[]}}