{"title":"&quot;AROMA GYNAIKAS&quot; (Scent of a woman) 1992 with Greek su","uid":9965457,"size":971293138,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ea940c2879e71a3f64cf3a1d6849da4a62df930&amp;dn=%26quot%3BAROMA+GYNAIKAS%26quot%3B+%28Scent+of+a+woman%29+1992+with+Greek+su&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nik51","files":-1,"time":1397562653,"description":"&quot;AROMA GYNAIKAS&quot; (Scent of a woman) 1992 with Greek subs\n\nAristoyrghmatikh tainia toy Martin Brest me ton Al Pacino stin isos koryfaia ermhneia sthn kariera toy (poy toy edose kai to Oscar), poy ypodyetai enan anthropo skliro alla kai tryfero mazi, agenh alla kai gohteftiko, enan anthropo poy exei stamathsei na vlepei to kalo gyro toy kai exei xasei tin orexh gia zoh - kai ton Chris O`Donnell poy apodidei arketa ikanopoihtika to rolo toy pelagomenoy neoy poy  aggizei ta oneira toy kai poy mas thymizei pos yparxoyn akoma anthropoi me axies, poy niazontai kai poy den poylioyntai gia tipota.  \n\nMia istoria me vathia nohmata gia th zoh, poy leipoyn apo to sygxrono kinhmatografo.\nTa dromena kai oi xarakthres exoyn toso polles antifaseis poy den afhnoyn ton theath ametoxo. \n\nOi dialogoi tsakizoyn kokala me th sklhrothta alla kai me thn alitheia toys. Ta pragmata den oraiopoioyntai, alla paroysiazontai opos akrivos einai. Eite kala, eite asxhma. \n\nKai sigoyra mia apo tis kalyteres ermhneies olon ton epoxon, an lavoyme ypopsin mas to vathmo dyskolias toy roloy poy ypodietai. \nMia ermhneia vgalmenh mesa apo thn psyxh toy, me koryfaia thn skhnh toy Tango (sto 1.25'), poy theoreitai mia apo tis koryfaies sto\npagkosmio sinema, eno sto telos sth skhnh toy &quot;dikasthrioy&quot; einai apla kathilotikos.. \n\nMia tainia klasikh. Mia tainia poy oi dialogoi kai to pathos se kanoyn na filosofeis, na skeftesai... kai na Î½Î± vlepeis th zoh me alla matia.  \n\nKALO PASXA SE OLOYS!!\nYpomonh, Kalh theash kai efxaristo prok. gia thn Anaparagogh (Seed).","torrent":{"xt":"urn:btih:3ea940c2879e71a3f64cf3a1d6849da4a62df930","amp;dn":"%26quot%3BAROMA+GYNAIKAS%26quot%3B+%28Scent+of+a+woman%29+1992+with+Greek+su","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ea940c2879e71a3f64cf3a1d6849da4a62df930","infoHashBuffer":{"type":"Buffer","data":[62,169,64,194,135,158,113,163,246,76,243,161,214,132,157,164,166,45,249,48]},"announce":[],"urlList":[]}}