{"title":"Sexually Broken--India Summer mummified suspended upside down, b","uid":9750675,"size":727840050,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3ebd2f23aff6f236a0b9b78cf74a03820a015ea8&amp;dn=Sexually+Broken--India+Summer+mummified+suspended+upside+down%2C+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1394659365,"description":"AVN award winner India Summer mummified &amp; suspended upside down, brutal blindfolded deep throat! | India Summer | Matt Williams\n\nMarch 12, 2014\n\n\nMP4 only.\n\n\nIndia Summer is an AVN award winner, and rightfully so. The energy, stamina and raw sexual passion she brings to her scenes make them distinctly memorable and you do not forget seeing India in action. She is willing to go so much further out there then the average porn girl just blandly coasting through for a paycheck. When we thought up the concept of completely mummifying someone from head to toe, binding in a vibrator, blindfolding them, hanging them upside down and using them like a cock sucking pinata, India Summer was the first person to come to mind. She eagerly jumped at the chance to get to try something as unique as this set up.\n\nMake no mistake, this is a challenging set up. Wrapped up from toes to nose like a BDSM butterfly, the only thing that peeks out is India's mouth hole and nose. She can not see, she can not move, she is completely immobilized. Totally helpless. This is a situation that would make many people panic and bail, and that is before we haul her up by her ankles and hang her upside down at the perfect cock sucking height.\n\nSleek and toned in her black cocoon, with her mouth hole open for the use and the vibrator sending waves of pleasure through her bound body, India is already deep in sexual subspace, and that is before the cocks even hit her throat. One after the other, the dicks run a train on her throat meat. She can not see them coming until they hit her lips and slide in. All she can do is endure and cum. Which she does, over and over. Dizzy, disoriented and upside down makes for the very best orgasms. This bondage butterfly is reborn as a cum slut.\n\nThe cocks own her tonsils and take away the air. The drool and moans flow out as the dicks slide in. Locked in total darkness, India is in an altered reality. When we have had our fill, we leave our butterfly suspended and swaying slightly as a puddle of throat drool forms under her cocoon. India is still cumming, it doesn't look like she will ever be able to stop... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_12isummer3/SexuallyBroken-India-Summer-Matt-Williams-AVN-award-winner-India-Summer-mummified--suspended-upside-down-brutal-blindfolded-deep-throat.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_12isummer3/SexuallyBroken-India-Summer-Matt-Williams-AVN-award-winner-India-Summer-mummified--suspended-upside-down-brutal-blindfolded-deep-throat.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:3ebd2f23aff6f236a0b9b78cf74a03820a015ea8","amp;dn":"Sexually+Broken--India+Summer+mummified+suspended+upside+down%2C+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ebd2f23aff6f236a0b9b78cf74a03820a015ea8","infoHashBuffer":{"type":"Buffer","data":[62,189,47,35,175,246,242,54,160,185,183,140,247,74,3,130,10,1,94,168]},"announce":[],"urlList":[]}}