{"title":"Bill Evans Trio - Live in Buenos Aires Vol 2 (1979) [Jazz][flac]","uid":5820840,"size":271458194,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3f0c1774d699dcf8eb9027958601fb9be8e1e0a6&amp;dn=Bill+Evans+Trio+-+Live+in+Buenos+Aires+Vol+2+%281979%29+%5BJazz%5D%5Bflac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":20,"time":1284039299,"description":"Bill Evans Trio - Live in Buenos Aires Vol 2 - The 1979 Concert \nYear: 1979\nLabel: Yellow Note\nQuality: flac + cue\n\nBill's last concert in Argentina after the wonderfull 1973!. This time with his last and wonderfull trio. He visited several cities such as Rosari, San NicolÃƒÂ¡s and Buenos Aires.  This is the concert recorded  here at Teatro San MartÃƒÂ­n.  (Teatro Municipal General San Martin, Buenos Aires, Argentina, September 27, 1979)\n\nAbout Bill's Life and works:\nUS born jazz pianist Bill Evans' impressionist style became the blueprint for jazz musicians to follow, and his work has been cited as an influence on Herbie Hancock, Pat Metheny, Chick Corea and many more. His classic &quot;Peace Piece&quot; is suggestive of new age pianists such as George Winston.\n\nEvans was taught classical piano by his mother, also picking up the violin and flute. He went on to study music at University, going to New York in the 50s, where he played the club circuit. His reputation spread and he eventually recorded on the albums of a number of established artists including Charles Mingus. Keen to do his own thing he released his debut in 1956, which featured his best known track &quot;Waltz For Debby&quot;. He spent time with The Miles Davis Sextet during which, the pair worked on some ideas - the result, Kind of Blue, has become the best selling acoustic jazz album and features, some suggest, Evans' best performance.\n\nHis second album as leader was the highly praised Everybody Digs Bill Evans. Soon after came his most famous group, the Bill Evans Trio, along with Scott Lafaro and Paul Motian. Their great but brief run included Portrait in Jazz, Explorations, and one of the more renowned live jazz albums ever, Complete Village Vanguard Recordings 1961; however, Lafaro was killed in an accident just 10 days after this concert, an event which affected Evans deeply. It was many months before he worked again. Despite further Trio work, with other members, Evans has described the original incarnation as the best. Evans tried working in other formats, including the use of recording techniques to allow him to play different parts of piece simultaneously, which can be heard on the acclaimed Conversations with Myself series, he also recorded with other artists such as saxophonist Stan Getz.\n\nEvans' health gave way in 1980, aggravated by a long term drug addiction. He left behind an extensive back catalogue of highly praised work, including The Bill Evans Album which won two Grammys. The Grammy committee honoured him again with a posthumously awarded Lifetime Achievement Award.\n\nPersonnel:\nBill Evans (Piano),\nMarc Johnson (Bass),\nJoe La Barber (Drums)\n\nBill Evans Trio - Live in Buenos Aires Vol 2 - The 1979 Concert Tracks:\n01  Stella By Starlight  \n02  Laurie (Gary's Theme)  \n03  Theme From M*A*S*H  \n04  Turn Out The Stars (We Will Meet Again)  \n05  I Do It For Your Love (Letter To Evan)  \n06  My Romance  \n07  Letter To Evan (Noelle's Theme)  \n08  I Loves You, Porgy (I Loves Your Porgy)  \n09  Up With The Lark  \n10  Minha  ","torrent":{"xt":"urn:btih:3f0c1774d699dcf8eb9027958601fb9be8e1e0a6","amp;dn":"Bill+Evans+Trio+-+Live+in+Buenos+Aires+Vol+2+%281979%29+%5BJazz%5D%5Bflac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0c1774d699dcf8eb9027958601fb9be8e1e0a6","infoHashBuffer":{"type":"Buffer","data":[63,12,23,116,214,153,220,248,235,144,39,149,134,1,251,155,232,225,224,166]},"announce":[],"urlList":[]}}