{"title":"Arsenal Season Review 2005/2006","uid":9344934,"size":1469014016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f327b232fb7434221c9025fc3fedb8dfda3f636&amp;dn=Arsenal+Season+Review+2005%2F2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"santicaz","files":1,"time":1387017628,"description":"On the 7th May 2006, Arsenal FC waved goodbye to their former stadium &quot;Highbury&quot; to move to their new 60,000 capacity &quot;Emirates&quot; stadium&quot;. This DVD takes a look at Arsenal's full 2005/06 season as they go through a roller-coaster of events, records and emotions, any fan would feel. A special brown shirt and white shorts were designed for their home kit which do look quite sharp I must say as they start to their season at home to Newcastle in a comfortable win. However disappointingly, their form is in inconsistent in the league as their performances against the big four were poor with one home win over Liverpool. The lowest point was December which they saw 3 defeats and no goals. Then in the new year, the Gunners truly start firing as inspirational captain Theirry Henry finds himself unstoppable in goal form, becoming a one man team desperate to take his team to victory. Highlights included the 7-0 hammering of Boro and 2-0 away win at Birmingham. The came February and they defied all odds and became the first English team to beat Real Madrid at the Bernabou, Eboue was a rock that night as was Toure as they fought to keep a clean sheet against the rampant Ronaldo and Beckham. \n\nThings only got better for the Quarter Finals as a young central midfielder named Cesc Fabregas marks his true quality and genius and they play Juventus off the park and rub former player Viera's face in the mud to take the club to their first ever European semi finals as they narrowly defeated surprise package Villareal to mark a European record of 10 consecutive clean sheets and the final in Paris awaited. As they managed to get their league form to put the pressure on Spurs challenging for 4th spot, a last ever controversial North London derby is played on April as Henry bags a crucial point to keep Arsenal in the hunt and the drama becomes all emotional as Dennis Bergkamp announces his retirement and comes of the bench for the final against Wigan. Theirry Henry finally gets the personal achievement to cement himself the King of Highbury as becomes Arsenal's leading goal scorer and FWA player of the year award.","torrent":{"xt":"urn:btih:3f327b232fb7434221c9025fc3fedb8dfda3f636","amp;dn":"Arsenal+Season+Review+2005%2F2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f327b232fb7434221c9025fc3fedb8dfda3f636","infoHashBuffer":{"type":"Buffer","data":[63,50,123,35,47,183,67,66,33,201,2,95,195,254,219,141,253,163,246,54]},"announce":[],"urlList":[]}}