{"title":"Three-dimensional modelling in KOMPAS-3D V8","uid":3406988,"size":646756352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3f5240cdcc789f50e8d7d4b424cc73ff2acfca59&amp;dn=Three-dimensional+modelling+in+KOMPAS-3D+V8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Vovik","files":1,"time":1131475577,"description":"KOMPAS-3D is designed for creating three-dimensional associative models for individual parts and assembly units containing both original and standardised structural elements. The parametric technology allows to quickly obtain models for typical products basing on a once designed prototype. Numerous service functions facilitate solving auxiliary designing and production maintenance problems.\n\nA key feature of KOMPAS-3D is the use of its own mathematical core and parametric technologies developed by ASCON specialists. \n\nThe basic problem being solved by the system is the modelling of products in order to considerably reduce the period of their designing and launch them into production as fast as possible. \n\nThe model export/import tools (KOMPAS-3D supports IGES, SAT, XT, STEP, VRML formats) provide functioning of complexes containing various CAD/CAM/CAE systems.\n\nThe product modelling in KOMPAS-3D can be carried out by various methods, namely: down-top modelling (using finished components), top-dawn modelling (designing components in the context of a specific design), modelling based on a layout outline drawing (for example, on a kinematic diagram) or a combination of modelling methods. Such ideology provides obtaining easily modifiable associative models.\n\nThe system has a powerful functional for the management of project including several thousand sub-assemblies, parts and standard products. It supports all the capabilities of three-dimensional solid-state modelling that have become a standard for medium-level CAD/CAM designs: \n\n- Boolean operations on typical shape-generating elements; \n- creation of surfaces; \n- associative setting of elements parameters; \n- construction of auxiliary straight lines and planes, outline drawings, spatial curves (broken lines, splines, various spirals); \n- creation of structural elements, i.e. bevels, fillets, holes, stiffness elements, thin-walled shells; \n- special possibilities facilitating the construction of foundry moulds, i.e. pattern draft, joint lines, cavities according to the part shape (including those with the setting of shrinkage); \n- creation of any shape-generating arrays and assembly components; \n- inserting standards products into the model from a library, generating user model libraries; \n- component modelling in the context of assembly, relative determination of parts comprising the assembly; \n- imposition of mating for assembly components (in doing so, a possibility of automatic imposition of mating considerably increases the rate of assembly creation); \n- detection of the interpenetration of parts; \n- a possibility of flexible editing of parts and assemblies, \n- re-determination of the parameters of any element on any designing stage causing a re-construction of the whole model. \n- Associative BOM-creation. \n\nA significant novelty of the KOMPAS-3D V7 version is a functional for the modelling of parts from a sheet material. This set of commands for creating a sheet body, bends, holes and cutouts in the sheet body, angle closure as well as the performance of a developed view for the sheet body obtained (including generating an associative developed view drawing).\n\nNew capabilities of KOMPAS-3D V7 are not limited by the bending functional only; they also include the following: document bookmarks, colour schemes, user profile saving, improvements in handling of parametric variables, element arrays, raster objects - these and dozens of other new elements make the designer's work to be much more convenient and effective that before. Releasing KOMPAS-3D V7, the developers have paid a considerable attention to the system performance improvement; as a result, a noticeable time reduction has been achieved for the processing of three-dimensional models and complicated associative drawings.","torrent":{"xt":"urn:btih:3f5240cdcc789f50e8d7d4b424cc73ff2acfca59","amp;dn":"Three-dimensional+modelling+in+KOMPAS-3D+V8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5240cdcc789f50e8d7d4b424cc73ff2acfca59","infoHashBuffer":{"type":"Buffer","data":[63,82,64,205,204,120,159,80,232,215,212,180,36,204,115,255,42,207,202,89]},"announce":[],"urlList":[]}}