{"title":"Cum Glazed 5 (NEW 2014 Vince Voyeur) [DVDRip]","uid":9857957,"size":1924665808,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3f76063a980cb23947081aed5b6808812407e113&amp;dn=Cum+Glazed+5+%28NEW+2014+Vince+Voyeur%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":1,"time":1396243751,"description":"Cum Glazed 5 (NEW 2014 Vince Voyeur) [DVDRip]\n\nAlina Li, Asia Zo, Austin Taylor, Casey Calvert, Raven Bay\n\nCum Glazed 5: The 2014 AVN Nominated Series is back!Alina Li the newest Asian Sensation stands at 5`8 and used to do fashion and runway modeling. This Chinese beauty is perfect from head to toe. Alina`s Pussy hole is so tiny but it still takes some big cock. Chris Strokes is the lucky porn stud that gets to pound on Alina until he blasts his load on her face.Casey Calvert meets Jovan Jordan for the 1st time; Casey says that she has done just about everything in porn. But she has not seen Jovan`s Girth and Casey was unable to keep Jovan`s Monster cock in her pussy for very long, But Casey had a plan B. Casey then tells Jovan to put his BBC up her ass for the rest of the scene and her anal cavity took the whole cock without hesitation.Well Known Blond MILF Austin Taylor just got back from an 8-month vacation from porn and wants to start up again going big. So Jovan Jordan steps up for the task of knocking the dust off of Austin`s well-rested MILF pussy. Austin just loves the BBC and rides Jovan like a bull until he blows his massive load on her face.Super Slut Raven Bay wants to bounce her tiny pussy on Chris Strokes Monster cock so she can show off her round booty in several positions before getting throat fucked by Chris and taking his load on her face.Asia Zo is no stranger to the Big Black Cock, Asia wants to meet the man the myth they call Jovan Jordan. Asia goes right to town sucking the monster cock trying her hardest to deep throat it. Jovan tries to get his cock in her tight Asian hole but it just will not fit, So Asia sucks the load right out of the BBC getting the load on her face.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=g8swdhjs1x4smvh6q2ve.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=g8swdhjs1x4smvh6q2ve.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=nivescvze1alhjn29s7i.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=nivescvze1alhjn29s7i.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:3f76063a980cb23947081aed5b6808812407e113","amp;dn":"Cum+Glazed+5+%28NEW+2014+Vince+Voyeur%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f76063a980cb23947081aed5b6808812407e113","infoHashBuffer":{"type":"Buffer","data":[63,118,6,58,152,12,178,57,71,8,26,237,91,104,8,129,36,7,225,19]},"announce":[],"urlList":[]}}