{"title":"S.T.A.L.K.E.R.: Shadow of Chernobyl (GOG)","uid":11988900,"size":4043281635,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3ffdce9a0b656edc0269c3fecc8f9c88d3babefd&amp;dn=S.T.A.L.K.E.R.%3A+Shadow+of+Chernobyl+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mercs215","files":10,"time":1433447018,"description":"Includes the full game along with all the GOG.com game goodies.\n\nInstall instructions:\n1. Run &quot;setup_stalker_shoc_2.1.0.7&quot;\n2. Play\nIf you like this game, support the developers and BUY IT!\n\nTitle: S.T.A.L.K.E.R.: Shadow of Chernobyl\nGenre: Action, RPG\nDeveloper: GSC Game World \nPublisher: GSC Game World\t\nRelease Date: Mar 20, 2007\nStore page: https://www.gog.com/game/stalker_shadow_of_chernobyl\n\nAbout\nIn 1986, the world's worst nuclear disaster occurred at the Chernobyl power station. Soviet authorities established a 30km 'Exclusion Zone' around this nuclear wasteland, but in 2006 a second explosion rocked the stricken reactor, obliterating all living things and causing the Zone's boundaries to ripple outwards. From this epicenter came waves of mutated creatures, deadly radiation, and a strange, anomalous energy. The Zone was cordoned off by the military, who would shoot on sight anyone foolish enough to brave the horrors within. \nIt is now 2012 - man has ventured further and further into the heart of the Zone driven by reports of strange 'artifacts' imbued with anomalous energy. Mercenaries and bounty hunters compete to recover these artifacts, which command extortionate prices on the black market. Others seek to find the truth behind the Zone, while some merely revel in the desolate lawlessness of the place. Whatever their motivation, over time these individuals - Scavengers, Trespassers, Adventurers, Loners, Killer, Explorers and Robbers - have become known as S.T.A.L.K.E.R.s. \nAwakening in the Zone, you are one such S.T.A.L.K.E.R., fighting for survival in this man-made Hell, while trying to discover the truth behind Chernobyl's sinister past and ominous future. \nAn immersive storyline seamlessly blended with a living, breathing, non-linear open-world environment governed by the revolutionary 'A-Life' system. \nAccurately modeled real-world buildings and locations from deep inside the Chernobyl Exclusion Zone. \nUnique 'Survival FPS' game play - combines action, stealth, survival and RPG elements to create an incomparable experience in the Zone. \nEnemy Threat Evaluation AI system - NPC characters react dynamically to environments and situations. \nBrutally realistic combat mechanics - weapons display accurate ballistic properties and can be modified with silencers and telescopic scopes. \nDynamic day/night and weather system directly impacts game play. \nAdvanced physics and dynamic lighting effects powered by the proprietary 'X-Ray Engine'. \nIntense multiplayer action, supporting up to 32 players.\n\nMinimum system requirements\nMicrosoftÂ® WindowsÂ® XP (Service Pack 2)/MicrosoftÂ® WindowsÂ® 2000 SP4\nIntel Pentium 4 2 Ghz/AMD XP 2200+\n512 MB RAM\n10 GB available hard drive space\n128 MB DirectXÂ® 9c compatible card/ nVIDIAÂ® GeForceâ„¢ 5700/ATI RadeonÂ® 9600\nDirectXÂ® 9 compatible sound card\nLAN/ Internet connection with Cable/DSL speeds for multiplayer\nKeyboard\nMouse","torrent":{"xt":"urn:btih:3ffdce9a0b656edc0269c3fecc8f9c88d3babefd","amp;dn":"S.T.A.L.K.E.R.%3A+Shadow+of+Chernobyl+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ffdce9a0b656edc0269c3fecc8f9c88d3babefd","infoHashBuffer":{"type":"Buffer","data":[63,253,206,154,11,101,110,220,2,105,195,254,204,143,156,136,211,186,190,253]},"announce":[],"urlList":[]}}