{"title":"Handbook of Infrared Spectroscopy of Ultrathin Films.pdf","uid":10760103,"size":37139631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:401cf0d8cb47c2bc74f084531b20b364abbe814e&amp;dn=Handbook+of+Infrared+Spectroscopy+of+Ultrathin+Films.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"interuniversal","files":-1,"time":1407968601,"description":"                Handbook of Infrared Spectroscopy of Ultrathin Films\n\n                                       by\n\n           Valeri P. Tolstoy, Irina V. Chernyshova, Valeri A. Skryshevsky\n\n                            Publisher:John Wiley &amp; Sons\n\nBecause of the rapid increase in commercially available Fourier transform infrared spectrometers and computers over the past ten years, it has now become feasible to use IR spectrometry to characterize very thin films at extended interfaces. At the same time, interest in thin films has grown tremendously because of applications in microelectronics, sensors, catalysis, and nanotechnology. The Handbook of Infrared Spectroscopy of Ultrathin Films provides a practical guide to experimental methods, up-to-date theory, and considerable reference data, critical for scientists who want to measure and interpret IR spectra of ultrathin films. This authoritative volume also: Offers information needed to effectively apply IR spectroscopy to the analysis and evaluation of thin and ultrathin films on flat and rough surfaces and on powders at solid-gaseous, solid-liquid, liquid-gaseous, liquid-liquid, and solid-solid interfaces.\n\n     *Provides full discussion of theory underlying techniques\n    \n     *Describes experimental methods in detail, including optimum conditions for recording spectra and the interpretation of spectra\n    \n     *Gives detailed information on equipment, accessories, and techniques\n    \n     *Provides IR spectroscopic data tables as appendixes, including the first compilation of published data on longitudinal frequencies of different substances\n    \n     *Covers new approaches, such as Surface Enhanced IR spectroscopy (SEIR), time-resolved FTIR spectroscopy, high-resolution microspectroscopy and using synchotron radiation\n ","torrent":{"xt":"urn:btih:401cf0d8cb47c2bc74f084531b20b364abbe814e","amp;dn":"Handbook+of+Infrared+Spectroscopy+of+Ultrathin+Films.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"401cf0d8cb47c2bc74f084531b20b364abbe814e","infoHashBuffer":{"type":"Buffer","data":[64,28,240,216,203,71,194,188,116,240,132,83,27,32,179,100,171,190,129,78]},"announce":[],"urlList":[]}}