{"title":"In.The.Name.Of.The.King.2007.iTALiAN.MD.DVDRip.XviD-SiLENT[volpe","uid":4748702,"size":1341181952,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:406b11e301563a7c8b1a27c8f195a187524443aa&amp;dn=In.The.Name.Of.The.King.2007.iTALiAN.MD.DVDRip.XviD-SiLENT%5Bvolpe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Volpebianca","files":2,"time":1236076074,"description":":::Scheda del film:::\nTitolo: In the Name of the King\nTitolo originale: In the Name of the King\nNazionalitÃƒÂ : U.S.A., Canada, Germania\nAnno: 2007\nGenere: Fantastico, Avventura, Azione\nRegia: Uwe Boll\nData di uscita: 27 Febbraio 2009 (cinema)\nCast: Jason Statham, Leelee Sobieski, John Rhys-Davies, Ron Perlman, Claire Forlani, Kristanna Loken, Matthew Lillard, Brian J. White, Mike Dopud, Will Sanderson\n\n:::Trama:::\n\nLa vita di un semplice contadino e gran lavoratore di nome Farmer sta per cambiare per sempre. Una banda di assassini, i Krug - brutali energumeni guidati da un demoniaco stregone - arriva a Stonebridge, dando inizio a un vortice di violenza: saccheggiano il villaggio, uccidono alcuni abitanti, tra cui anche il figlio di Farmer, e rapiscono sua moglie Solana. Farmer, pur essendo sempre stato pacifico e amorevole, spinto dal dolore, decide di vendicarsi e, assieme al suo mentore Norick e suo cognato Bastian, si muove all'inseguimento dell'esercito Krug per liberare Solana. Intanto Merick, il mago del Re Konrad, scopre la fonte della forze dell'esercito dei Krug: un vecchio rivale di nome Gallian, un formidabile, potente mago. Gallian vuole detronizzare Re Konrad e far insediare al suo posto una debole pedina nelle sue mani, il duca Fallow. Mentre l'esercito del re tiene occupata la banda dei Krug, assetata di sangue, Farmer e i suoi compagni riescono a passare attraverso il pericoloso passo montano di Ehb. L'incursione notturna nell'accampamento dei Krug si trasforma in tragedia quando Norick e Bastian vengono catturati e Farmer riesce a salvarsi per il rotto della cuffia. Farmer a questo punto, alla disperata ricerca della moglie e dei due amici, si unisce all'esercito reale in un'epica battaglia. Il suo straordinario eroismo cattura l'attenzione sia di Gallian che di Merick. Nello scontro finale sarÃƒÂ  compito di Farmer sconfiggere Gallian o permettere al terribile mago di prendere il controllo di quelle terre.\n\nQualitÃƒÂ  audio 6.5 video 9.","torrent":{"xt":"urn:btih:406b11e301563a7c8b1a27c8f195a187524443aa","amp;dn":"In.The.Name.Of.The.King.2007.iTALiAN.MD.DVDRip.XviD-SiLENT%5Bvolpe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"406b11e301563a7c8b1a27c8f195a187524443aa","infoHashBuffer":{"type":"Buffer","data":[64,107,17,227,1,86,58,124,139,26,39,200,241,149,161,135,82,68,67,170]},"announce":[],"urlList":[]}}