{"title":"IMDB Top 10 Action Movies","uid":4530082,"size":17869059683,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40a053618fa1da6c3a6173bc3965fa35fa808e0c&amp;dn=IMDB+Top+10+Action+Movies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"circlensess","files":72,"time":1227524681,"description":"The Dark Knight\nDirector: Christopher Nolan\nCast:\n\nChristian Bale ... Bruce Wayne / Batman\n\nHeath Ledger ... The Joker\n\nAaron Eckhart ... Harvey Dent / Two-Face\n\nMichael Caine ... Alfred Pennyworth\n\nMaggie Gyllenhaal ... Rachel Dawes\n\nGary Oldman ... James Gordon\n\nMorgan Freeman ... Lucius Fox\nGenre: Action | Adventure | Crime | Drama | Mystery\nYear of Production: 2008\nCountry: USA\n\nPlot: Batman raises the stakes in his war on crime. With the help of Lieutenant Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the city streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as The Joker.\n\n\n\n\n\n\n\n\n Buono, il brutto, il cattivo., Il\nThe Good, the Bad and the Ugly (UK) (USA)\nBo, el lleig i el dolent, El (Spain: Catalan title)\nBueno, el feo y el malo, El (Spain)\nDue magnifici straccioni, I (Italy) (working title)\nThe Good, the Ugly, the Bad (USA) (literal English title)\nThe Magnificent Rogues (UK)\nZwei glorreiche Halunken (West Germany) \nDirector: Sergio Leone\nCast:\n\nEli Wallach ... Tuco\n\nClint Eastwood ... Blondie\nLee Van Cleef ... Sentenza / Angel Eyes\nAldo Giuffre` ... Alcoholic Union Captain\nLuigi Pistilli ... Father Pablo Ramirez\nRada Rassimov ... Maria\nEnzo Petito ... Storekeeper\nClaudio Scarchilli ... Mexican peon\nJohn Bartha ... Sheriff (as John Bartho)\nLivio Lorenzon ... Baker\nGenre: Action | Adventure | Western\nYear of Production: 1966\nCountry: Italy  | Spain  | West Germany\n\nPlot: Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is payed to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco&amp;#039;s bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco comes across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie meet with Carson and knows they know the location of the gold. All he needs is for the two to lead him to it. Now The Good, The Bad and The Ugly must all battle it out to get their hands on $200,000 worth of gold.\n\n\n\n\n\n\n\n Star Wars: Episode V\nThe Empire Strikes Back\nDirector: Irvin Kershner\nCast:\n\n\nMark Hamill ... Luke Skywalker\n\nHarrison Ford ... Han Solo\n\nCarrie Fisher ... Princess Leia\n\nBilly Dee Williams ... Lando Calrissian\nAnthony Daniels ... C-3PO\nDavid Prowse ... Darth Vader\n\nPeter Mayhew ... Chewbacca\nKenny Baker ... R2-D2\nGenre: Action | Adventure | Fantasy | Sci-Fi | Thriller\nYear of Production: 1980\nCountry: USA\n\nPlot: After receiving a vision from Obi-Wan Kenobi and fleeing the ice world of Hoth with his friends after an Imperial attack, Luke Skywalker travels to the marsh planet of Dagobah, where he is instructed in the ways of the Force by the legendary Jedi master Yoda. Meanwhile, Han Solo and Princess Leia make their way to planet Bespin, where they are greeted by Han&amp;#039;s old friend, a shifty gambler named Lando Calrissian. Ambushed by the Empire shortly after their arrival, Han and his friends are imprisoned by Darth Vader. Luke leaves Dagobah to rescue his friends, and is met by Vader and a startling revelation.\n\n\n\n\n\n\n\n\n Shichinin no samurai\nSeven Samurai (UK)\nShichi-nin no samurai (Japan) (alternative transliteration)\nThe Seven Samurai (USA) \nDirector: Akira Kurosawa\nCast:\n\nTakashi Shimura ... Kambei Shimada\nToshiro^ Mifune ... Kikuchiyo\nYoshio Inaba ... Gorobei Katayama\nSeiji Miyaguchi ... Kyuzo\nMinoru Chiaki ... Heihachi Hayashida\nDaisuke Kato^ ... Shichiroji\nIsao Kimura ... Katsushiro Okamoto\nKeiko Tsushima ... Shino\nYukiko Shimazaki ... Rikichi&amp;#039;s Wife\nKamatari Fujiwara ... Manzo, father of Shino\nYoshio Kosugi ... Mosuke\nGenre: Action | Adventure | Drama\nYear of Production: 1954\nCountry: Japan\n\nPlot: A village is constantly attacked by well armed bandits. One day after an attack they seek the wisdom of an elder who tells them they cannot afford weapons, but they can find men with weapons, samurai, who will fight for them, if they find samurai who are in down on their luck and wondering where their next meal will come from. They find a very experienced samurai with a good heart who agrees to recruit their party for them. He selects five genuine samurai and one who is suspect but the seven return to the village to protect it from the forty plus bandits\n\n\n\n\n\n Star Wars\nDirector: George Lucas\nCast:\n\n\nMark Hamill ... Luke Skywalker\n\nHarrison Ford ... Han Solo\n\nCarrie Fisher ... Princess Leia Organa\n\nPeter Cushing ... Grand Moff Tarkin\n\nAlec Guinness ... Ben Obi-Wan Kenobi\nAnthony Daniels ... C-3PO\nKenny Baker ... R2-D2\nGenre: Action | Adventure | Family | Fantasy | Sci-Fi\nYear of Production: 1977\nCountry: USA\n\nPlot: In a galaxy far, far away, a psychopathic emperor and his most trusted servant - a former Jedi Knight known as Darth Vader - are ruling a universe with fear. They have built a horrifying weapon known as the Death Star, a giant battle station capable of annihilating a world in less than a second. When the Death Star&amp;#039;s master plans are captured by the fledgling Rebel Alliance, Vader starts a pursuit of the ship carrying them. A young dissident Senator, Leia Organa, is aboard the ship &amp; puts the plans into a maintenance robot named R2-D2. Although she is captured, the Death Star plans cannot be found, as R2 &amp; his companion, a tall robot named C-3PO, have escaped to the desert world of Tatooine below. Through a series of mishaps, the robots end up in the hands of a farm boy named Luke Skywalker, who lives with his Uncle Owen &amp; Aunt Beru. Owen &amp; Beru are viciously murdered by the Empire&amp;#039;s stormtroopers who are trying to recover the plans, and Luke &amp; the robots meet with former Jedi Knight Obi-Wan Kenobi to try to return the plans to Leia Organa&amp;#039;s home, Alderaan. After contracting a pilot named Han Solo &amp; his Wookiee companion Chewbacca, they escape an Imperial blockade. But when they reach Alderaan&amp;#039;s coordinates, they find it destroyed - by the Death Star. They soon find themselves caught in a tractor beam &amp; pulled into the Death Star. Although they rescue Leia Organa from the Death Star after a series of narrow escapes, Kenobi becomes one with the Force after being killed by his former pupil - Darth Vader. They reach the Alliance&amp;#039;s base on Yavin&amp;#039;s fourth moon, but the Imperials are in hot pursuit with the Death Star, and plan to annihilate the Rebel base. The Rebels must quickly find a way to eliminate the Death Star before it destroys them as it did Alderaan.\n\n\n\n\n\n\n\n The Lord of the Rings\nThe Return of the King\nDirector: Peter Jackson\nCast:\n\nNoel Appleby ... Everard Proudfoot\nAlexandra Astin ... Elanor Gamgee\n\nSean Astin ... Sam\nDavid Aston ... Gondorian Soldier 3\nJohn Bach ... Madril\n\nSean Bean ... Boromir\n\nCate Blanchett ... Galadriel\n\nOrlando Bloom ... Legolas\n\nBilly Boyd ... Pippin\nSadwyn Brophy ... Eldarion\nGenre: Action | Adventure | Fantasy\nYear of Production: 2003\nCountry: USA  | New Zealand  | Germany\n\nPlot: Gondor is overrun by the orcs of Mordor, and Gandalf rides to Minas Tirith to aid the humans in the war that is ahead. Aragorn must realize his true identity and purpose as the King of Men, and journey with Gimli and Legolas to summon the Army of the Dead so that the battle against evil can be won. Meanwhile, paranoia and suspicion rises between Frodo, Sam and Gollum as they continue their increasingly dark and dangerous travel to Mount Doom, the one place where The Ring can be destroyed once and for all\n\n\n\n\n\n\n\n\n C&amp;#039;era una volta il West \nOnce Upon a Time in the West (UK) (USA)\nThere Was Once the West (USA) (literal English title) \nDirector: Sergio Leone\nCast:\n\nHenry Fonda ... Frank\n\nClaudia Cardinale ... Jill McBain\n\nJason Robards ... Cheyenne\n\nCharles Bronson ... Harmonica\nGabriele Ferzetti ... Morton (railroad baron)\nPaolo Stoppa ... Sam\nWoody Strode ... Stony (member of Frank&amp;#039;s gang)\n\nJack Elam ... Snaky (member of Frank&amp;#039;s gang)\nKeenan Wynn ... Sheriff (auctioneer)\nFrank Wolff ... Brett McBain\nLionel Stander ... Barman\nGenre: Action | Drama | Western\nYear of Production: 1968\nCountry: Italy  | USA\n\nPlot: Story of a young woman, Mrs. McBain, who moves from New Orleans to frontier Utah, on the very edge of the American West. She arrives to find her new husband and family slaughtered, but by who? The prime suspect, coffee-lover Cheyenne, befriends her and offers to go after the real killer, assassin gang leader Frank, in her honor. He is accompanied by Harmonica on his quest to get even. Get-rich-quick subplots and intricate character histories intertwine with such artistic flair that this could in fact be the movie-to-end-all-movies.\n\n\n\n\n\n\n\n\n Raiders of the Lost Ark\nDirector: Steven Spielberg\nCast:\n\nHarrison Ford ... Indiana Jones\n\nKaren Allen ... Marion Ravenwood\nPaul Freeman ... Dr. Rene Belloq\nRonald Lacey ... Major Arnold Toht\n\nJohn Rhys-Davies ... Sallah\nDenholm Elliott ... Dr. Marcus Brody\n\nAlfred Molina ... Satipo\n\nWolf Kahler ... Colonel Dietrich\nGenre: Action | Adventure\nYear of Production: 1981\nCountry: USA\n\nPlot: The year is 1936. A professor who studies archeology named Inidana Jones is venturing in the jungles in South America searching for a golden statue. Unfortunately, he sets off a deadly trap doing so, miraculously, he escapes. Then, Jones hears from a museum curator named Marcus Brody about a biblical artifact called The Ark of the Covenant, which can hold the key to humanly existence. Jones has to venture to vast places such as Nepal and Egypt to find this artifact. However, he will have to fight his enemy Renee Belloq and a band of Nazis in order to reach it.  \n\n\n\n\n\n\n\n\n\n The Lord of the Rings\nThe Fellowship of the Ring\nDirector: Peter Jackson\nCast:\n\nAlan Howard ... The Ring (voice)\nNoel Appleby ... Everard Proudfoot\n\nSean Astin ... Sam Gamgee\n\nSala Baker ... Sauron\n\nSean Bean ... Boromir\n\nCate Blanchett ... Galadriel\n\nOrlando Bloom ... Legolas Greenleaf\n\nBilly Boyd ... Peregrin &amp;#039;Pippin&amp;#039; Took\n\nMarton Csokas ... Celeborn\nMegan Edwards ... Mrs. Proudfoot\nGenre: Action | Adventure | Fantasy\nYear of Production: 2001\nCountry: New Zealand  | USA\n\nPlot: An ancient Ring thought lost for centuries has been found, and through a strange twist in fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it! However he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir and his three Hobbit friends Merry, Pippin and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign!\n\n\n\n\n\n\n\n\n\n Fight Club\nDirector: David Fincher\nCast:\n\nEdward Norton ... The Narrator\n\nBrad Pitt ... Tyler Durden\n\nHelena Bonham Carter ... Marla Singer\n\nMeat Loaf ... Robert &amp;#039;Bob&amp;#039; Paulson (as Meat Loaf Aday)\n\nZach Grenier ... Richard Chesler\nRichmond Arquette ... Intern\n\nDavid Andrews ... Thomas\n\nGeorge Maguire ... Group Leader\n\nEugenie Bondurant ... Weeping Woman\nGenre: Action | Drama | Thriller\nYear of Production: 1999\nCountry: USA  | Germany\n\nPlot: The narrator suffers from a lack of sleep. He tries different ways to cure this, but he does not succeed. He does get some sleep, but his conditions rebounds back into it&amp;#039;s original state when he meets a lovely young woman, whose name is Marla. He finds out that she and he both have a lot in common and they spend a lot of time together. While touring, he meets an enigmatic young man named Tyler and after a short conversation both become fast friends. Both like to relieve their inner tensions by hitting each other. Soon word gets around about their fights, and lots of young people also get interested. Then a club is formed, which the narrator and Tyler call &amp;#039;Fight Club&amp;#039;. Both start spending a lot of time and both also make lots of money. Then one day the narrator finds out that Tyler has been using him.\n\n\n &lt;a href=&quot;\thttp://www.imdb.com/Sections/Genres/Action/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.imdb.com/Sections/Genres/Action/&lt;/a&gt;","torrent":{"xt":"urn:btih:40a053618fa1da6c3a6173bc3965fa35fa808e0c","amp;dn":"IMDB+Top+10+Action+Movies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40a053618fa1da6c3a6173bc3965fa35fa808e0c","infoHashBuffer":{"type":"Buffer","data":[64,160,83,97,143,161,218,108,58,97,115,188,57,101,250,53,250,128,142,12]},"announce":[],"urlList":[]}}