{"title":"Andrew's Brain: A Novel (2014) E L Doctorow (multi)","uid":9540509,"size":5395707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40ef4302715b7d23698250dd0cd4828e79c80c6e&amp;dn=Andrew%27s+Brain%3A+A+Novel+%282014%29+E+L+Doctorow+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1391033513,"description":"Andrew's Brain: A Novel by E. L. Doctorow\n\n\nFormat: mobi/epub/azw3\nLength: 208 pages\nGenre: Contemporary Fiction\nDate: 16 January 2014\n\nThis brilliant new novel by an American master takes us on a radical trip into the mind of a man who, more than once in his life, has been an inadvertent agent of disaster.\n\nSpeaking from an unknown place and to an unknown interlocutor, Andrew is thinking, Andrew is talking, Andrew is telling the story of his life, his loves, and the tragedies that have led him to this place and point in time. And as he confesses, peeling back the layers of his strange story, we are led to question what we know about truth and memory, brain and mind, personality and fate, about one another and ourselves.\n\nWritten with psychological depth and great lyrical precision, this suspenseful and groundbreaking novel delivers a voice for our times--funny, probing, skeptical, mischievous, profound. Andrew's Brain is a surprising turn and a singular achievement in the canon of a writer whose prose has the power to create its own landscape, and whose great topic, in the words of Don DeLillo, is &quot;the reach of American possibility, in which plain lives take on the cadences of history.&quot;\n\nAn Amazon Best Book of the Month, January 2014\n\nToo compelling to put down...fascinating, sometimes funny, often profound...Andrew is a provocatively interesting and even sympathetic character. The novel seamlessly combines Doctorow's remarkable prowess as a literary stylist with deep psychological storytelling pitting truth against delusion, memory and perception, consciousness and craziness. Doctorow takes huge creative risks--the best kind.--USA Today\n\nAuthor:\n\nE. L. Doctorow's novels include The March, City of God, The Waterworks, Welcome to Hard Times, The Book of Daniel, Ragtime, Loon Lake and Billy Bathgate. His work has been published in thirty-two languages. Among his honors are the National Book Award, three National Book Critics Circle awards, two PEN/Faulkner awards, the Edith Wharton Citation for Fiction, the William Dean Howells Medal of the American Academy of Arts and Letters, and the presidentially conferred National Humanities Medal. E. L. Doctorow lives in New York. ","torrent":{"xt":"urn:btih:40ef4302715b7d23698250dd0cd4828e79c80c6e","amp;dn":"Andrew%27s+Brain%3A+A+Novel+%282014%29+E+L+Doctorow+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40ef4302715b7d23698250dd0cd4828e79c80c6e","infoHashBuffer":{"type":"Buffer","data":[64,239,67,2,113,91,125,35,105,130,80,221,12,212,130,142,121,200,12,110]},"announce":[],"urlList":[]}}