{"title":"I Like It Like That","uid":7892394,"size":1109728890,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4157bdea3554d64111e626e788550ca12a2823b4&amp;dn=I+Like+It+Like+That&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ike74ph","files":1,"time":1354754993,"description":"I Like It Like That is a 1994 comedy-drama film about the trials and tribulations of a young Puerto Rican couple living in the poverty-stricken New York City neighborhood of the South Bronx. The film stars Lauren Velez, Jon Seda, Lisa Vidal, Griffin Dunne, Jesse Borrego and Rita Moreno, and was written and directed by Darnell Martin who, in her filmmaking debut, became the first African-American female filmmaker to take helm of a film produced by a major film studio.\n\nLisette Linares (Velez) is a young mother of three children, married to Chino (Seda), a bicycle messenger. Although he is always reliable as the breadwinner of the family, Chino is having an affair with the neighborhood tramp, Magdalena (Vidal). One summer evening, a blackout sweeps the neighborhood, and Chino finds himself in jail after being arrested for looting.\n\nFaced now with the reality of keeping her family together with the main breadwinner in jail, Lisette, with the encouragement of her transexual sister Alexis (Borrego), decides to give her dream of becoming a print model a chance. As she happens to be in the right place at the right time, Lisette lands a job as the personal assistant to a major record label producer (Dunne), who is trying to sign a major Latin music group (played by the real life group the Barrio Boyz).\n","torrent":{"xt":"urn:btih:4157bdea3554d64111e626e788550ca12a2823b4","amp;dn":"I+Like+It+Like+That","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4157bdea3554d64111e626e788550ca12a2823b4","infoHashBuffer":{"type":"Buffer","data":[65,87,189,234,53,84,214,65,17,230,38,231,136,85,12,161,42,40,35,180]},"announce":[],"urlList":[]}}