{"title":"Bad Students, Not Bad Schools (2010) by Robert Weissberg","uid":10397586,"size":1294631,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41c1320a2727f49785eca9f7d3cf23b78fdd1c23&amp;dn=Bad+Students%2C+Not+Bad+Schools+%282010%29+by+Robert+Weissberg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mystyc1","files":-1,"time":1403291449,"description":"Bad Students, Not Bad Schools (2010) by Robert Weissberg.pdf\n\nAmericans are increasingly alarmed over our nation's educational deficiencies. Though anxieties about schooling are unending, especially with public institutions, these problems are more complex than institutional failure. Expenditures for education have exploded, and far exceed inflation and the rising costs of health care, but academic achievement remains flat. Many students are unable to graduate from high school, let alone obtain a college degree. And if they do make it to college, they are often forced into remedial courses. Why, despite this fiscal extravagance, are educational disappointments so widespread?\n\nIn Bad Students, Not Bad Schools, Robert Weissberg argues that the answer is something everybody knows to be true but is afraid to say in public America's educational woes too often reflect the demographic mix of students. Schools today are filled with millions of youngsters, too many of whom struggle with the English language or simply have mediocre intellectual ability. Their lackluster performances are probably impervious to the current reform prescriptions regardless of the remedy's ideological derivation. Making matters worse, retention of students in school is embraced as a philosophy even if it impedes the learning of other students. Weissberg argues that most of America's educational woes would vanish if indifferent, troublesome students were permitted to leave when they had absorbed as much as they could learn; they would quickly be replaced by learning-hungry students, including many new immigrants from other countries.\n\nAmerican education survives since we import highly intelligent, technically skillful foreigners just as we import oil, but this may not last forever. When educational establishments get serious about world-class mathematics and science, and permit serious students to learn, problems will dissolve. Rewarding the smartest, not spending fortunes in a futile quest to uplift the bottom, should become official policy. This book is a bracing reminder of the risks of political manipulation of education and argues that the measure of policy should be academic achievement.\n\n315 pages\nPublisher: Transaction Publishers (April 1, 2010)\nLanguage: English\nISBN-10: 141281345X\nISBN-13: 978-1412813457","torrent":{"xt":"urn:btih:41c1320a2727f49785eca9f7d3cf23b78fdd1c23","amp;dn":"Bad+Students%2C+Not+Bad+Schools+%282010%29+by+Robert+Weissberg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41c1320a2727f49785eca9f7d3cf23b78fdd1c23","infoHashBuffer":{"type":"Buffer","data":[65,193,50,10,39,39,244,151,133,236,169,247,211,207,35,183,143,221,28,35]},"announce":[],"urlList":[]}}