{"title":"Andrzej Szczypiorski - The Beautiful Mrs. Seidenman (pdf)","uid":10280358,"size":1817225,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41e55e9bdee56e9b282b646b7ee57a038d9a227e&amp;dn=Andrzej+Szczypiorski+-+The+Beautiful+Mrs.+Seidenman+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401687730,"description":"Andrzej Szczypiorski - The Beautiful Mrs. Seidenman (Phoenix, 1990). 204 pp. First published in Poland in 1986.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nback cover:\n\nIn the Nazi-occupied Warsaw of 1943, Irma Seidenman, a beautilul young Jewish widow, possesses two attributes that may hold the difference between life and death - blue eyes and blonde hair. With these, and a set of false papers, she has passed as the wife of a Polish officer, until one day an informer denounces her to the Gestapo.\n\nThe Beautiful Mrs Seidenman is the story of the thirty-six hours that follow Irma's arrest as, only a stone's throw away, the last of Warsaw's Jews are about to meet their death in the burning ghetto.\n\nAt times as a dark lament, at times with a sly and sardonic wit, Szczypiorski tells of the timid and the brave, the doomed and the saved. His book is a magnificent, heart-wrenching requiem for the twentieth century, full of sadness, wisdom, irony, tenderness and, above all, deep compassion for victims and persecutors alike. It has deservedly been called a masterpiece.","torrent":{"xt":"urn:btih:41e55e9bdee56e9b282b646b7ee57a038d9a227e","amp;dn":"Andrzej+Szczypiorski+-+The+Beautiful+Mrs.+Seidenman+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41e55e9bdee56e9b282b646b7ee57a038d9a227e","infoHashBuffer":{"type":"Buffer","data":[65,229,94,155,222,229,110,155,40,43,100,107,126,229,122,3,141,154,34,126]},"announce":[],"urlList":[]}}