{"title":"0   0 (2012) Alcest - BBC Sessions Live @ 320kbps {100.XY}","uid":8709523,"size":49464180,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4205aaf4ae3105362dd1115a2747c91194978940&amp;dn=+0+++0+%282012%29+Alcest+-+BBC+Sessions+Live+%40+320kbps+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"100.XY","files":-1,"time":1374206617,"description":"\n0\n \n0\n(2012) Alcest - BBC Sessions Live @ 320kbps {100.XY}\nseeders: 1leechers: 4\nDOWNLOAD TORRENT\nAdded on Jul 17, 2013 by  DarkAngie10251 in Music &gt; Mp3\t\nTorrent verified.\tDownloaded once.\nMAIN\n \nTECHNICAL\n \nCOMMENTS\nadd torrent to bookmarks add torrent to your personal rss feed\n(2012) Alcest - BBC Sessions Live @ 320kbps {100.XY} (Size: 47.17 MB)\n \t\t02 - Ã‰cailles De Lune (Part I) (BBC Sessions 2012).mp3\t22.04 MB\n \t\t03 - Souvenirs D'un Autre Monde (BBC Sessions 2012).mp3\t14.4 MB\n \t\t01 - Autre Temps (BBC Sessions 2012).mp3\t10.45 MB\n \t\tCover.jpg\t286.51 KB\n \t\tIcon\t0 bytes\nDescription\nIf you have the time and patient to read long reviews well this is one, because after all is Alcest in BBC, and well, it is good to know what you are about to download.\n\nREVIEW:\nThis short album of three songs is a live recording of Alcest's BBC sessions that took place in late Februrary 2012, made by Miti Adhikari who has over 20 years' experience making live recordings of other well-known acts including Dead Can Dance and Nirvana at the BBC studios. For those people surprised that a black metal band actually made it to the BBC to perform live, recall that in the late 1980s, the BBC radio personality John Peel championed underground British bands Napalm Death and Carcass and Carcass themselves participate in the Peel sessions at the BBC in 1989.\n\n&quot;Souvenirs d'un Autre Monde&quot; has a very strong start of sparkling guitar melodies and lively drumming leading into Neige's soft, barely audible voice. The singing is the only aspect of the song that disappoints: the instruments and some of the back-up singing simply overpower Neige's thin vocals. Apart from this, the music is ever constant and flowing, and while the black metal element is toned down a great deal, it's always present in the music's general style: it supplies the sharp whirring noise edge and puts meat on the song's bones. I'd have liked the song to be different from its studio album version - more raw, more BM, less pretty - but not knowing whether the BBC had very much input into what Neige did, I'll take the song as is.\n\n&quot;Ecailles de Lune (Part 1)&quot; is a beautiful song here with a stronger lead vocal still filled with longing and wistfulness. Backing female vocals are very soulful and convey a lot of emotion. The tune is distinctive and very poppy. Although the song is better described as melodic post-rock with a siren-like lead guitar solo, there is a soft black metal edge to the rhythm guitars riffs and melodies. A guitar solo passage with only sparse drum accompaniment is a dreamy highlight, followed by a sudden cascade of black metal noise guitar shower and tremolo guitar chords.\n\nBringing up the rear, &quot;Autre Temps&quot; is a lovely melodic ballad-style indie-pop piece with a smooth if fairly unemotional vocal from Neige, and some black metal elements like tremolo guitar squiggles throughout. This version seems a little darker and a bit more lush in style than the version released as a single.\n\nAll songs on this mini-album end quite abruptly which interrupts the natural flow of the entire recording twice. Other than this observation which for some listeners might be a small problem - if you're listening to the mini-album late at night, the sudden finishes can disrupt your drift into the Land of Nod - the BBC sessions live album is a pleasant and pop-oriented experience with Neige choosing to perform three of his strongest and catchiest songs. Alcest completists will get this recording anyway but it's also a good introduction to Neige's project for first-timers, featuring as it does songs from all studio Alcest albums at the time of performance. Of course, the Alcest completist will notice straight away that the songs are not very different from one another and could probably swap spots on the studio albums with no-one noticing much difference between the swapped songs on the one hand, and the rest of the album for each full-length. This isn't going to matter much to new listeners.\n\n\n\nCountry: France\nGenre: Blackgaze\nQuality: 320 kbps\nTracklist:\n01 - Autre Temps (BBC Sessions 2012).mp3\n02 - Ã‰cailles De Lune (Part I) (BBC Sessions 2012).mp3\n03 - Souvenirs D'un Autre Monde (BBC Sessions 2012).mp3\n","torrent":{"xt":"urn:btih:4205aaf4ae3105362dd1115a2747c91194978940","amp;dn":"+0+++0+%282012%29+Alcest+-+BBC+Sessions+Live+%40+320kbps+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4205aaf4ae3105362dd1115a2747c91194978940","infoHashBuffer":{"type":"Buffer","data":[66,5,170,244,174,49,5,54,45,209,17,90,39,71,201,17,148,151,137,64]},"announce":[],"urlList":[]}}