{"title":"Dirt - The Erosion of Civilizations (gnv64)","uid":7088809,"size":14378143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4214631758ebc9196b9ec578351cee71fff243d4&amp;dn=Dirt+-+The+Erosion+of+Civilizations+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1331281822,"description":"Dirt - The Erosion of Civilizations\nby David R. Montgomery\nUniversity of California Press | 2008 | ISBN-10: 0520258061 | ePUB/PDF | 2.47/11.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Dirt-Civilizations-David-R-Montgomery/dp/0520258061&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Dirt-Civilizations-David-R-Montgomery/dp/0520258061&lt;/a&gt;\nPDF conversion is mine\n\nDirt, soil, call it what you want--it's everywhere we go. It is the root of our existence, supporting our feet, our farms, our cities. This fascinating yet disquieting book finds, however, that we are running out of dirt, and it's no laughing matter. An engaging natural and cultural history of soil that sweeps from ancient civilizations to modern times, Dirt: The Erosion of Civilizations explores the compelling idea that we are--and have long been--using up Earth's soil. Once bare of protective vegetation and exposed to wind and rain, cultivated soils erode bit by bit, slowly enough to be ignored in a single lifetime but fast enough over centuries to limit the lifespan of civilizations. A rich mix of history, archaeology and geology, Dirt traces the role of soil use and abuse in the history of Mesopotamia, Ancient Greece, the Roman Empire, China, European colonialism, Central America, and the American push westward. We see how soil has shaped us and we have shaped soil--as society after society has risen, prospered, and plowed through a natural endowment of fertile dirt. David R. Montgomery sees in the recent rise of organic and no-till farming the hope for a new agricultural revolution that might help us avoid the fate of previous civilizations.\n\nAbout the Author\nDavid R. Montgomery was born in 1961 Stanford, California, and studied geology at Stanford University before earning his Ph.D. in geomorphology at UC Berkeley. He teaches at the University of Washington where he studies the evolution of topography and how geological processes shape landscapes and influence ecological systems. He loved maps as a kid and now writes about the relationship of people to their environment and other things that interest him. In 2008 he was named a MacArthur Fellow. He lives with his wife Anne in Seattle, Washington.\n\nCONTENTS\nACKNOWLEDGMENTS\n1 / GOOD OLD DIRT\n2 / SKIN OF THE EARTH\n3 / RIVERS OF LIFE\n4 / GRAVEYARD OF EMPIRES\n5 / LET THEM EAT COLONIES\n6 / WESTWARD HOE\n7 / DUST BLOW\n8 / DIRTY BUSINESS\n9 / ISLANDS IN TIME\n10 / LIFE SPAN OF CIVILIZATIONS\nNOTES\nBIBLIOGRAPHY\nINDEX ","torrent":{"xt":"urn:btih:4214631758ebc9196b9ec578351cee71fff243d4","amp;dn":"Dirt+-+The+Erosion+of+Civilizations+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4214631758ebc9196b9ec578351cee71fff243d4","infoHashBuffer":{"type":"Buffer","data":[66,20,99,23,88,235,201,25,107,158,197,120,53,28,238,113,255,242,67,212]},"announce":[],"urlList":[]}}