{"title":"Water Markets - Terry L. Anderson","uid":11710097,"size":7725048,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:426ebdb827f38df87d17a871ed30abcfaae2d565&amp;dn=Water+Markets+-+Terry+L.+Anderson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1424299516,"description":"\nRain and snow may be falling today, but throughout the world people continually fear water shortages. Is there reason for such apprehension? In Water Markets: Priming the Invisible Pump, Terry L. Anderson and Pamela Snyder argue that the answer is no -- if we return control of water from government to markets.\n\nThe authors document that humans are using only between 38 and 64 percent of the earth's readily available water. Nevertheless, in several poor countries of Africa and the Middle East, available water is often contaminated, producing millions of deaths each year. Anderson and Snyder argue that government control of water supplies has led to mismanagement and misallocation of water and that markets are the solution.\n\nAnderson and Snyder provide a history of government water policy, including the development of laws that either prohibit the transfer of water or sharply regulate its use, such as &quot;beneficial use&quot; restrictions. To establish a water right in most states, an appropriator must apply the diverted water to a &quot;beneficial&quot; use. How &quot;beneficial&quot; is defined, however, is often a mystery. \n\n\nAbout the author:\n Terry L. Anderson is Executive Director of PERC, the Center for Free Market Environmentalism; Senior Fellow at the Hoover Institution, Stanford University; and Professor Emeritus at Montana State University. He has published 28 books. P. J. Hill is Professor of Economics at Wheaton College, Illinois, and a PERC Senior Associate. This is his eleventh book","torrent":{"xt":"urn:btih:426ebdb827f38df87d17a871ed30abcfaae2d565","amp;dn":"Water+Markets+-+Terry+L.+Anderson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"426ebdb827f38df87d17a871ed30abcfaae2d565","infoHashBuffer":{"type":"Buffer","data":[66,110,189,184,39,243,141,248,125,23,168,113,237,48,171,207,170,226,213,101]},"announce":[],"urlList":[]}}