{"title":"Fundamentals of Chemical Reaction Engineering","uid":12080533,"size":21969031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:436984b0679b2378b31afae667863db454d07d25&amp;dn=Fundamentals+of+Chemical+Reaction+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1435750170,"description":"Fundamentals of Chemical Reaction Engineering (McGraw-Hill Chemical Engineering Series) - Mark E. Davis, Robert J. Davis (2003).pdf\n\nISBN 0-07-245007-X\n\n&quot;Chemistry in the hands of Engineers!&quot; This mantra, initiated and developed largely in the research programs of academic chemical engineers over the last few decades, has now made its way into the core undergraduate curriculum in the form of a new Chemical Reaction Engineering textbook by Cal Tech's Mark E. Davis and U VA's Robert J. Davis...&quot; -Michael T. Klein, Rutgers University This book is an introduction to the quantitative treatment of chemical reaction engineering. It is appropriate for a one-semester undergraduate (or first-year graduate)course. The text provides a balanced approach: first, it covers both homogeneous and heterogeneous reacting systems; second, it covers both chemical reaction engineering and chemical reactor engineering.\n\nHere's what reviewers have to say:\n\n&quot;The Davis/Davis book really brings out the strong coupling between chemical reactions and reactor design concepts in a pedagogical fashion.&quot; -Michael S. Wong, Rice University\n\n&quot;Great use of chemical reactions as teaching examples&quot; -Michael S. Wong, Rice University\n\n&quot;The examples, illustrations, and vignettes given in the text are very well done, and are of either fundamental or practical interest.&quot; -David F. Cox, Virginia Tech\n\n&quot;A primary motivation to use this text is the arrangement of the introductory material on kinetics. The initial description of reactions and kinetics in Davis/Davis appears prior to the introduction of reactor material balances.&quot; -David F. Cox, Virginia Tech\n\n&quot;Concise development and discussion of material&quot; -Michael S. Wong, Rice University","torrent":{"xt":"urn:btih:436984b0679b2378b31afae667863db454d07d25","amp;dn":"Fundamentals+of+Chemical+Reaction+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"436984b0679b2378b31afae667863db454d07d25","infoHashBuffer":{"type":"Buffer","data":[67,105,132,176,103,155,35,120,179,26,250,230,103,134,61,180,84,208,125,37]},"announce":[],"urlList":[]}}