{"title":"Greg Iles - The Bone Tree (Penn Cage #5)","uid":13153194,"size":930733200,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4383d4a5c057bc5c7ca2a1459f3fd472f2a1bb7e&amp;dn=Greg+Iles+-+The+Bone+Tree+%28Penn+Cage+%235%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":30,"time":1452080768,"description":"\n\r\nGreg Iles continues the electrifying story begun in his smash New York Times bestseller Natchez Burning in this highly anticipated second installment of an epic trilogy of blood and race, family and justice, featuring Southern lawyer Penn Cage.\r\n\r\nFormer prosecutor Penn Cage and his fiancée, reporter and publisher Caitlin Masters, have barely escaped with their lives after being attacked by wealthy businessman Brody Royal and his Double Eagles, a KKK sect with ties to some of Mississippi's most powerful men. But the real danger has only begun as FBI Special Agent John Kaiser warns Penn that Brody wasn't the true leader of the Double Eagles. The puppeteer who actually controls the terrorist group is a man far more fearsome: the chief of the state police's Criminal Investigations Bureau, Forrest Knox.\r\n\r\nThe only way Penn can save his father, Dr. Tom Cage—who is fleeing a murder charge as well as corrupt cops bent on killing him—is either to make a devil's bargain with Knox or destroy him. While Penn desperately pursues both options, Caitlin uncovers the real story behind a series of unsolved civil rights murders that may hold the key to the Double Eagles' downfall. The trail leads her deep into the past, into the black backwaters of the Mississippi River, to a secret killing ground used by slave owners and the Klan for over two hundred years . . . a place of terrifying evil known only as &quot;the bone tree.&quot;","torrent":{"xt":"urn:btih:4383d4a5c057bc5c7ca2a1459f3fd472f2a1bb7e","amp;dn":"Greg+Iles+-+The+Bone+Tree+%28Penn+Cage+%235%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4383d4a5c057bc5c7ca2a1459f3fd472f2a1bb7e","infoHashBuffer":{"type":"Buffer","data":[67,131,212,165,192,87,188,92,124,162,161,69,159,63,212,114,242,161,187,126]},"announce":[],"urlList":[]}}