{"title":"The Pirates of The Caribbean Movie Collection","uid":6741927,"size":5894733053,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:43cfcbbeb43e33ffe62459ecdadfd1e029bbc212&amp;dn=The+Pirates+of+The+Caribbean+Movie+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"neil1966hardy","files":13,"time":1318539274,"description":"Hello here you have Pirates of The Caribbean MOVIE PACK\n\nPirates.Of.The.Caribbean.DVDRip.XViD-ViTE &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0325980/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0325980/&lt;/a&gt;\n\nStoryline\n\nThis swash-buckling tale follows the quest of Captain Jack Sparrow, a savvy pirate, and Will Turner, a resourceful blacksmith, as they search for Elizabeth Swann. Elizabeth, the daughter of the governor and the love of Will's life, has been kidnapped by the feared Captain Barbossa. Little do they know, but the fierce and clever Barbossa has been cursed. He, along with his large crew, are under an ancient curse, doomed for eternity to neither live, nor die. That is, unless a blood sacrifice is made. Written by the lexster\n\n\nPirates.of.the.Caribbean.Dead.Mans.Chest.REAL.PROPER.DVDRip.XviD-PiratesCaribbean &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0383574/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0383574/&lt;/a&gt;\n\nStoryline\n\nOnce again we're plunged into the world of sword fights and &quot;savvy&quot; pirates. Captain Jack Sparrow is reminded he owes a debt to Davy Jones, who captains the flying Dutchman, a ghostly ship, with a crew from hell. Facing the &quot;locker&quot; Jack must find the heart of Davy Jones but to save himself he must get the help of quick-witted Will Turner and Elizabeth Swan. If that's not complicated enough, Will and Elizabeth are sentenced to hang, unless will can get Lord Cutler Beckett Jack's compass, Will is forced to join another crazy adventure with Jack. Written by kate Archie\n\n\nPirates.Of.The.Caribbean.At.Worlds.End.PROPER.DVDRip.XviD-HooKah &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0449088/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0449088/&lt;/a&gt;\n\nStoryline\n\nAfter Elizabeth, Will, and Captain Barbossa rescue Captain Jack Sparrow from the the land of the dead, they must face their foes, Davy Jones and Lord Cutler Beckett. Beckett, now with control of Jones' heart, forms a dark alliance with him in order to rule the seas and wipe out the last of the Pirates. Now, Jack, Barbossa, Will, Elizabeth, Tia Dalma, and crew must call the Pirate Lords from the four corners of the globe, including the infamous Sao Feng, to gathering. The Pirate Lords want to release the goddess Calypso, Davy Jones's damned lover, from the trap they sent her to out of fear, in which the Pirate Lords must combine the 9 pieces that bound her by ritual to undo it and release her in hopes that she will help them fight. With this, all pirates will stand together and will make their final stand for freedom against Beckett, Jones, Norrington, the Flying Dutchman, and the entire East India Trading Company. Written by J. Curcio\n\n\nPirates.Of.The.Caribbean.On.Stranger.Tides.DVDRip.XviD-NeDiVx &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1298650/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1298650/&lt;/a&gt;\n\nStoryline\n\nCaptain Jack Sparrow (Depp) crosses paths with a woman from his past (Cruz), and he's not sure if it's love -- or if she's a ruthless con artist who's using him to find the fabled Fountain of Youth. When she forces him aboard the Queen Anne's Revenge, the ship of the formidable pirate Blackbeard (McShane), Jack finds himself on an unexpected adventure in which he doesn't know who to fear more: Blackbeard or the woman from his past. Written by Walt Disney Pictures \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:43cfcbbeb43e33ffe62459ecdadfd1e029bbc212","amp;dn":"The+Pirates+of+The+Caribbean+Movie+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43cfcbbeb43e33ffe62459ecdadfd1e029bbc212","infoHashBuffer":{"type":"Buffer","data":[67,207,203,190,180,62,51,255,230,36,89,236,218,223,209,224,41,187,194,18]},"announce":[],"urlList":[]}}