{"title":"The Rembrandts - L.P. 320cbr (Big Papi) 1995","uid":9433997,"size":150856497,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:447b1d983583b22a016f84ebef5cbafbc049feb8&amp;dn=The+Rembrandts+-+L.P.+320cbr+%28Big+Papi%29+1995&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Big-Papi","files":17,"time":1388861873,"description":"Source: 1995 CD\n\nThe Rembrandts - L.P. 320cbr (Big Papi) 1995 I'll Be There For You\n\nInstructions: delete the last song and enjoy the album - Big Papi\n\n\nBy A Customer\n'LP' is the third album from The Rembrandts' and is undoubtedly their best known work, thanks to it's release at the height of Friends Mania in 1995. The album seems unfairly shunned by the casual lister as a collection of lacklustre companions to the pop hit 'I'll Be There For You' (the theme song from Friends) or scorned by Rembrandts fans for its association with the television show. In reality, however, it's simply a well written and beautifully performed guitar album with the TV single tacked on the end. Make no mistake; the end of 'LP' is the gorgeous 'The Other Side of Night'. The addition of 'I'll Be There For You' is simply there to pull the Friends crowd.\nIf you're looking for something a little subdued and introspective that swings between 'rockin good' and 'melancholic' effortlessly, then LP might be for you. The slower songs are the highlights, particularly 'End of the Beginning', 'Don't Hide Your Love', 'Drowning In Your Tears' and 'The Other Side of Night' but there's something for everyone with the faster, sometimes grungier tracks like 'This House is Not a Home', 'Lovin Me Insane' and the fantastic 'Easy to Forget'.\n\nUltimately the strength of LP is The 'Brandts ability to craft magnificent lyrics and weave them with great guitar and smooth harmonies. Compared to their other albums, LP has its roots more in commercial rock than traditional acoustic which may explain why a lot of the band's fans disliked it. It's still my personal favourite from the boys, the flow of the tracks is brilliant and overall the album has aged very well. LP is definitely one of my favourite albums and very worthy of anyone's time.","torrent":{"xt":"urn:btih:447b1d983583b22a016f84ebef5cbafbc049feb8","amp;dn":"The+Rembrandts+-+L.P.+320cbr+%28Big+Papi%29+1995","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"447b1d983583b22a016f84ebef5cbafbc049feb8","infoHashBuffer":{"type":"Buffer","data":[68,123,29,152,53,131,178,42,1,111,132,235,239,92,186,251,192,73,254,184]},"announce":[],"urlList":[]}}