{"title":"Andrew Wyatt - Descender [2013] [FLAC]","uid":8395946,"size":176891596,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:44a4b8ee4a4ddc6ddffd77b10658fbe4c27d37ab&amp;dn=Andrew+Wyatt+-+Descender+%5B2013%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":10,"time":1366572189,"description":"1. Horse Latitudes (4:07)\n2. Harlem Boyzz (3:07)\n3. Cluster Subs (2:59)\n4. She's Changed (2:33)\n5. And Septimus... (3:31)\n6. It Won't Let You Go (3:56)\n7. Descender (Death of 1000 Cuts) (2:37)\n8. In Paris They Know How to Build a Monument (3:16)\n9. There Is a Spring (3:49)\n\n\nIt's difficult to paint a proper picture of the solo debut from Miike Snow frontman and co-writer of Bruno Mars' Grammy-nominated hit &quot;Grenade&quot; without launching forth a well-intentioned volley of hyperbole. Without a doubt the finest Odessey and Oracle-esque, Appalachian Spring-kissed, Lamb Lies Down on Broadway and back half of Yoshimi Battles the Pink Robots-inspired record of 2013, Descender is as bold, subversive, and unpredictable as it is familiar and oddly comforting. Andrew Wyatt may not have been on a Zombies, Aaron Copland, Peter Gabriel-era Genesis, and Flaming Lips bender during the nine-track, 30-odd-minute album's creation, but its evocative mix of classical, progressive rock, chamber pop, and indie folk certainly invokes the aforementioned artists' mastery of atmosphere. Recorded with the 75-piece Prague Philharmonic Orchestra and featuring guest appearances from Anthony Rossomando (the Libertines), Brad Traux (Interpol), and John Herndon (Tortoise), Descender feels cut from the same burgundy cloth as recent releases from Owen Pallet, Father John Misty, and Edward Sharpe, but there's a deeper, less-calculated retro vibe at work here that suggests a deep affinity for Van Dyke Parks, Scott Walker, David Ackles, and Harry Nilsson. Standout cuts like the funereal, alternate universe sock-hop jam &quot;And Septimus...,&quot; the propulsive doo-wop/Morrissey-imbued &quot;Harlem Boyzz,&quot; and the epic, Far East-tinged &quot;Cluster Subs&quot; all utilize traditional pop foundations, but are ultimately carried along by the same undercurrent of psychedelia that casts its shadow over more labyrinthine works like &quot;Horse Latitudes&quot; and the ornate, wonderfully enigmatic closer, &quot;There Is a Spring.&quot; It's a lot to take in, especially if you're only familiar with the more singles-oriented electro-pop of his day band, but Wyatt's engaging delivery, enigmatic lyricism, and willingness to allow each song to chart its own course make for compelling listening from start to finish.","torrent":{"xt":"urn:btih:44a4b8ee4a4ddc6ddffd77b10658fbe4c27d37ab","amp;dn":"Andrew+Wyatt+-+Descender+%5B2013%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44a4b8ee4a4ddc6ddffd77b10658fbe4c27d37ab","infoHashBuffer":{"type":"Buffer","data":[68,164,184,238,74,77,220,109,223,253,119,177,6,88,251,228,194,125,55,171]},"announce":[],"urlList":[]}}