{"title":"Around the World in Knitted Socks: 26 Inspired Designs","uid":11240364,"size":14065549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:452d1250eb0d8f4b7b9e17c5c26e8279d4755a67&amp;dn=Around+the+World+in+Knitted+Socks%3A+26+Inspired+Designs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1413661929,"description":"International sock knitting sensation Stephanie van der Linden shares an irresistible collection of 26 original designs inspired by global knitting traditions. In Around the World in Knitted Socks, youÂ’ll travel through world cultures by foot and try your hand at new patterns and techniques. Using stitch motifs and colors, knitting techniques and construction details, the socks blend regional knitting traditions with StephanieÂ’s unique design flair. Drawing inspiration from signature local textiles such as Turkish kilim carpets, Japanese sashiko embroidery, Belgian lace, American quilts, and Scottish argyle tartan, each pattern is distinctly tied to both country and culture. YouÂ’ll also learn traditional knitting techniques including Estonian and Latvian braids, Norwegian stranded knitting, and Austrian twisted-stitch designs. Though each pattern in Around the World in Knitted Socks draws on a different global inspiration, the thoughtful construction and attention to detail are signature elements of StephanieÂ’s work and are showcased in both detailed photography and an illustrated glossary","torrent":{"xt":"urn:btih:452d1250eb0d8f4b7b9e17c5c26e8279d4755a67","amp;dn":"Around+the+World+in+Knitted+Socks%3A+26+Inspired+Designs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"452d1250eb0d8f4b7b9e17c5c26e8279d4755a67","infoHashBuffer":{"type":"Buffer","data":[69,45,18,80,235,13,143,75,123,158,23,197,194,110,130,121,212,117,90,103]},"announce":[],"urlList":[]}}