{"title":"Stephen Fry - The Liar (1991) and The Hippopotamus (1994)","uid":4591767,"size":603983425,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4591fd5a051cafaed9638abeb6279b529f030823&amp;dn=Stephen+Fry+-+The+Liar+%281991%29+and+The+Hippopotamus+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"eddie1969","files":20,"time":1229820774,"description":"Audio Books : Humour : MP3/Variable : English\n\n\nStephen Fry (1957 - )\n\nAs well as being the bestselling author of three novels, Making History, The Hippopotamus and The Liar, and the first volume of his autobiography, Moab is My Washpot, Fry has played Peter in Peter's Friends, Oscar Wilde in the film Wilde, Jeeves in the television series Jeeves and Wooster and 'Fry' in the television series Fry and Laurie.\n\n\nThe Liar (1991)\nA novel by Stephen Fry\n\nThe spirits of Oscar Wilde and Evelyn Waugh glower benignly over this very funny first novel by Stephen Fry. The novel has an ingenious plot filled with surprises and glittering with hilarious, often indecent inventions: a pugnacious faculty meeting that collapses into an exchange of obscenities, the fabrication of a 'lost' pornographic novel by Charles Dickens, and an exercise in intellectual gamesmanship that engages some of the finest minds and blackest hearts in England. Stephen Fry's sympathetic portrayal of his defiantly unconventional hero makes for an outrageously entertaining debut. \n\n\nThe Hippopotamus (1994)\nA novel by Stephen Fry\n\nFired from his newspaper and disgusted with a world that undervalues him, Ted Wallace seeks a few months repose and free drink at the country mansion of his old friend, Lord Logan. But strange things have been going on at Swafford Hall, phenomena beyond the comprehension of a hippopotamus like Ted. \n\n\nRescuing the Spectacled Bear (2002)\nA diary by Stephen Fry\n\nOn New Years Day 2000 BBC 1 broadcast a programme about Stephen Fry going to Peru to track Paddington Bear's roots and more seriously to rescue a Spectacled bear, one of the world's most endangered species. \n\nAt Easter a follow up programme was shown on BBC 2 in which they went back and helped rescue a mate for the young bear they had found on their first trip.\n\nStephen is now gripped by drawing the world's attention to these bears and has written a diary of his time in Peru. It is packed with lovely colour pictures of Stephen, bears and Peru, and it is, of course, wildly funny. \n\nStephen Fry is set to become the Diane Fossey of the bear world.\n\n\nShare and Enjoy!\n","torrent":{"xt":"urn:btih:4591fd5a051cafaed9638abeb6279b529f030823","amp;dn":"Stephen+Fry+-+The+Liar+%281991%29+and+The+Hippopotamus+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4591fd5a051cafaed9638abeb6279b529f030823","infoHashBuffer":{"type":"Buffer","data":[69,145,253,90,5,28,175,174,217,99,138,190,182,39,155,82,159,3,8,35]},"announce":[],"urlList":[]}}