{"title":"AT LENINGRAD'S GATES: The Combat Memoirs of a Soldier (Reupload)","uid":8603284,"size":2207677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45ff55bb6c2cabd9f957cfc6e4f1532d8e0b3199&amp;dn=AT+LENINGRAD%27S+GATES%3A+The+Combat+Memoirs+of+a+Soldier+%28Reupload%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"candymancan","files":1,"time":1371941152,"description":"&quot;. . . a well-wrought ground level view of daily life in hell.&quot;-World War II MagazineThis is the remarkable story of a German soldier who fought throughout World War II, rising from conscript private to captain of a heavy weapons company on the Eastern Front.William Lubbeck, age 19, was drafted into the Wehrmacht in August 1939. As a member of the 58th Infantry Division, he received his baptism of fire during the 1940 invasion of France. The following spring his division served on the left flank of Army Group North in Operation Barbarossa. After grueling marches amidst countless Russian bodies, burnt-out vehicles, and a great number of cheering Baltic civilians, Lubbeck's unit entered the outskirts of Leningrad, making the deepest penetration of any German formation. The Germans suffered hardships the following winter as they fought both Russian counterattacks and the brutal cold. The 58th Division was thrown back and forth across the front of Army Group North, from Novgorod to Demyansk, at one point fighting back Russian attacks on the ice of Lake Ilmen. A soldier who preferred to be close to the action, Lubbeck served as forward observer for his company, dueling with Russian snipers, partisans and full-scale assaults alike. His worries were not confined to his own safety, however, as news arrived of disasters in Germany, including the destruction of Hamburg where his girlfriend served as an Army nurse. In September 1943, Lubbeck earned the Iron Cross and was assigned to officers' training school in Dresden. By the time he returned to Russia, Army Group North was in full-scale retreat. Now commanding his former heavy weapons company, Lubbeck alternated sharp counterattacks with inexorable withdrawal to Memel on the Baltic. In April 1945 his company was nearly obliterated, but in the last scramble from East Prussia, he was able to evacuate on a newly minted German destroyer. After his release from British captivity, Lubbeck immigrated to the United States where he raised a successful family. With the assistance of David B. Hurt, he has drawn on his wartime notes and letters, Soldatbuch, regimental history and personal memories to recount his frontline experience, including rare firsthand accounts of both triumph and disaster.returncharacterreturncharacter returncharacterreturncharacter REVIEWS returncharacterreturncharacter&quot;...a well-wrought ground level view of daily life in hell.&quot;WWII Magazine No 3, 06/2007&quot;... compiled with attention to details. The reader will feel as though he is alongside Lubbeck as he calls fire missions on the enemy during his three years of service.&quot;Military Trader 11/2007","torrent":{"xt":"urn:btih:45ff55bb6c2cabd9f957cfc6e4f1532d8e0b3199","amp;dn":"AT+LENINGRAD%27S+GATES%3A+The+Combat+Memoirs+of+a+Soldier+%28Reupload%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45ff55bb6c2cabd9f957cfc6e4f1532d8e0b3199","infoHashBuffer":{"type":"Buffer","data":[69,255,85,187,108,44,171,217,249,87,207,198,228,241,83,45,142,11,49,153]},"announce":[],"urlList":[]}}