{"title":"Battlestar Galactica fanedit Boomer and Chief v2 1080p 5.1","uid":10260634,"size":7647321559,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:46e1d3430fc38c2de1958d1805e51b7e11fd1b3a&amp;dn=Battlestar+Galactica+fanedit+Boomer+and+Chief+v2+1080p+5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bsg4you","files":9,"time":1401461149,"description":"Battlestar Galactic FANEDIT Boomer and Chief v2\n7 total episodes - 7.12GB - 3 Viewing Options\nChronological 4hours 16minutes 2seconds\nAlternative with Flash Forward 4hours 14minutes 4seconds\nAlternative without Flash Forward 3hours 44minutes 57seconds\n1080p 3000Mbps AVC - 5.1 384Kbps AAC\nBlu-Ray source\n\nBattlestar.Galactica.fanedit.Boomer.and.Chief.v2.part0alt.415to419.29m6s 740,306,648\nBattlestar.Galactica.fanedit.Boomer.and.Chief.v2.part1.100to102.54m25s 1,320,050,002\nBattlestar.Galactica.fanedit.Boomer.and.Chief.v2.part2.103to113.47m47s 1,311,155,574\nBattlestar.Galactica.fanedit.Boomer.and.Chief.v2.part3.201to220.58m23s 1,176,515,681\nBattlestar.Galactica.fanedit.Boomer.and.Chief.v2.part4.301to414.48m40s 1,205,721,173\nBattlestar.Galactica.fanedit.Boomer.and.Chief.v2.part5.415to419.46m45s 1,105,310,276\nBattlestar.Galactica.fanedit.Boomer.and.Chief.v2.part5alt.415to419.15m40s 777,855,560\n(note, episode 100 = the mini-series)\n\nTHIS IS THE SAME CONTENT AS VERSION1 JUST SMALLER WITH THE SAME QUALITY\nversion2 Handbrake0.9.9 7.12GB\nV: 2-Pass Encoding (Turbo first pass) Preset = 09 (very slow) 3000Kbps AVC\nA: 5.1 384Kbps AAC\n\nThis is a new encode of the final MPEG-2/AC3 7-part fanedit Boomer and Chief from the new Battlestar Galactica (2003-2009). The v1 fanedits were:\nversion1 Handbrake0.9.8 21.7GB\nV: CRF21.5 7477-13430Kbps AVC - A: 5.1 448Kbps AC3\n\nThis new version2 was 2-pass encoded instead of using constant quality and the results are much smaller files with no discernible visual or audible differences. Stills and video sections were carefully evaluated during the review but if *any* issue is detected please leave a comment with the filename and timecode describing the issue so it can be addressed as soon as possible.\n\nWhy download this FANEDIT? Because you like ...\n1. Grace Park or Aaron Douglas\n2. the characters Boomer or Chief\n3. Battlestar Galactica 2003-2009 and you want to watch a FANEDIT\n4. You already have Boomer.and.Chief.v1 and want to save over 14GB of space\n\nBoomer.and.Chief is a 1080p video, 5.1 surround sound audio TRUE FANEDIT of Battlestar Galactica 2003-2009 that includes all of Boomer's story and her relationship with Chief covered in 7 episodes with 3 different viewing options using 5-6 episodes each. Almost every scene where Boomer has a line and almost every frame of when Boomer was on screen are included. Additionally, Boomer.and.Chief includes all non-Boomer Eights that are on the Basestars with Boomer or around Chief, e.g. Athena meeting Chief on Kobol or the non-Boomer Eights involved in the Cylon Civil War. This began as an edit with every Battlestar Galactica scene Grace Park was in and developed into Athena.and.Helo and Boomer.and.Chief. There is a standalone release for The Face Of The Enemy webisodes. Note that Boomer.and.Chief has stretches of just Chief material or only snippets of Boomer, e.g. between 2.04 Resistance to 2.18 Downloaded and during Cavil and Ellen conversations from No Exit. Also, non-Boomer Eights are included even if it's for a small part of a scene.\n\nTHERE ARE 3 VIEWING OPTIONS FOR BOOMER.AND.CHIEF:\n\n1) CHRONOLOGICAL VIEWING ORDER: has all of Boomer's lines and almost all of her screen time plus all Boomer related stuff with Chief in mostly chronological order. The last episode ends with Boomer's death and Chief walking off alone on Earth followed by an upbeat montage of Boomer and Chief.\nWATCH:\nBoomer.and.Chief.v2.part1.100to102.54m25s\nBoomer.and.Chief.v2.part2.103to113.47m47s\nBoomer.and.Chief.v2.part3.201to220.58m23s\nBoomer.and.Chief.v2.part4.301to414.48m40s\nBoomer.and.Chief.v2.part5.415to419.46m45s\nSKIP:\nBoomer.and.Chief.v2.part0alt.415to419.29m6s\nBoomer.and.Chief.v2.part5alt.415to419.15m40s\n\n2) ALTERNATE VIEWING ORDER INCLUDING OPTIONAL VERY SAD FLASH FORWARD: this option starts with Chief pleading with President Roslin not to extradite Boomer through Chief walking away alone on Earth as a flash forward which has the following removed: SonjaSix requesting Boomer's extradition in front of Chief and Chief's arguing in Joe's Bar with Tory/Tigh/Ellen about saving Boomer. It ends with Boomer and Chief sharing dream house projections followed by an upbeat montage of Boomer and Chief.\nWATCH:\nBoomer.and.Chief.v2.part0alt.415to419.29m6s\nBoomer.and.Chief.v2.part1.100to102.54m25s\nBoomer.and.Chief.v2.part2.103to113.47m47s\nBoomer.and.Chief.v2.part3.201to220.58m23s\nBoomer.and.Chief.v2.part4.301to414.48m40s\nBoomer.and.Chief.v2.part5alt.415to419.15m40s\nSKIP:\nBoomer.and.Chief.v2.part5.415to419.46m45s\n\n3) ALTERNATE VIEWING ORDER WITHOUT THE VERY SAD FLASH FORWARD: this viewing is the most upbeat and ends with Boomer in the brig and Chief sharing her dream house projection followed by the upbeat montage. The montage includes an edited sequence of the dream house but it's set to &quot;Two Boomers&quot; from the soundtrack so its a little different then the dream house scenes just before it. Despite being the most upbeat viewing option, all of Boomer's tragedies are on display from the episodes, deleted scenes and The Plan. Only the extradition discussions, Boomer's escape, Boomer's death and Chief walking away on Earth alone are removed. This is a &quot;what if&quot; ending that was completely possible and not so incredibly tragic like the producers decided to show; what if extradition never came up or never happened, Chief never broke out Boomer from the brig, Boomer never kidnapped Hera and Earth was found anyway? What if Boomer could have found her love, family and humanity?\nWATCH:\nBoomer.and.Chief.v2.part1.100to102.54m25s\nBoomer.and.Chief.v2.part2.103to113.47m47s\nBoomer.and.Chief.v2.part3.201to220.58m23s\nBoomer.and.Chief.v2.part4.301to414.48m40s\nBoomer.and.Chief.v2.part5alt.415to419.15m40s\nSKIP:\nBoomer.and.Chief.v2.part0alt.415to419.29m6s\nBoomer.and.Chief.v2.part5.415to419.46m45s\n\nBoomer.and.Chief General Content Notes:\n* As many scenes in space were kept, especially space battles and Cylon Centurions\n* Some scenes just include Boomer parts without telling the story of the whole episode, e.g. The Hand of God, Guess What's Coming to Dinner?, No Exit, etc.\n* Scenes without Boomer or relevant Chief scenes but with important Boomer or relevant Boomer-related Chief discussions were included\n* Deleted scenes with Boomer were integrated, even scenes that are short or do not add much to the story\n* Opening credit graphics may appear throughout the Boomer.and.Chief episodes\n* Most material is chronological, e.g. flashbacks from 4.19 Daybreak are at the start of Boomer.and.Chief.v2.part1.100to102.54m25s\n* Material from The Plan was included.\n* When Boomer is under the influence of the elephant which reveals her base Cylon personality without the sleeper program overlay, a loop of &quot;By You Command&quot; from the soundtrack was added in the background to indicate she's in her non-sleeper agent state.\n\nPlease check out other Battlestar Galactica posts plus Rifftrax, Star Trek Enterprise, DC Comics, documentaries and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:46e1d3430fc38c2de1958d1805e51b7e11fd1b3a","amp;dn":"Battlestar+Galactica+fanedit+Boomer+and+Chief+v2+1080p+5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46e1d3430fc38c2de1958d1805e51b7e11fd1b3a","infoHashBuffer":{"type":"Buffer","data":[70,225,211,67,15,195,140,45,225,149,141,24,5,229,27,126,17,253,27,58]},"announce":[],"urlList":[]}}