{"title":"R&amp;I 10.LAST TO DIE.Tess Gerritsen.mb4","uid":8843916,"size":278174028,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4767528ec5d08e6ebfb7052aab22189e0b7cd226&amp;dn=R%26amp%3BI+10.LAST+TO+DIE.Tess+Gerritsen.mb4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1377323666,"description":"For the second time in his short life, Teddy Clock has survived a massacre. Two years ago, he barely escaped when his entire family was slaughtered. Now, at fourteen, in a hideous echo of the past, Teddy is the lone survivor of his foster family's mass murder. Orphaned once more, the traumatized teenager has nowhere to turn - until the Boston PD puts detective Jane Rizzoli on the case. But no sooner does her investigation begin than Teddy's life almost ends . . . again. Suddenly, what seemed like a grisly coincidence is unmasked as the mission of a relentless killer.\n\nJane spirits Teddy to the exclusive Evensong boarding school, a sanctuary where young victims of violent crime learn the secrets and skills of survival in a dangerous world. But even behind locked gates, and surrounded by acres of sheltering Maine wilderness, Jane fears that Evensong's mysterious benefactors aren't the only ones watching. When strange blood-splattered dolls are found dangling from a tree, Jane knows that her instincts are dead on. And when she meets Will Kennedy and Claire Ward, students whose tragic pasts bear a shocking resemblance to Teddy's, it becomes chillingly clear that a circling predator has more than one victim in mind.\n\nJoining forces with her trusted partner, medical examiner Maura Isles, Jane is determined to keep these orphans safe from harm. But an unspeakable secret dooms the children's fate - unless Jane and Maura can finally put an end to an obsessed killer's twisted quest.\n","torrent":{"xt":"urn:btih:4767528ec5d08e6ebfb7052aab22189e0b7cd226","amp;dn":"R%26amp%3BI+10.LAST+TO+DIE.Tess+Gerritsen.mb4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4767528ec5d08e6ebfb7052aab22189e0b7cd226","infoHashBuffer":{"type":"Buffer","data":[71,103,82,142,197,208,142,110,191,183,5,42,171,34,24,158,11,124,210,38]},"announce":[],"urlList":[]}}