{"title":"HISTORY OF POP AND ROCK MUSIC - part 535","uid":9243560,"size":451938050,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:47c8ef6f785224b03ee033557f18ed915e1bf2cc&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+535&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1385328557,"description":"\n\n                         PART  535\n\n\n        SIMON &amp; GARFUNKEL  -  A Poem On The Underground Wall (1966)\n        SIMON &amp; GARFUNKEL  -  Patterns  (1966)\n        SIMON &amp; GARFUNKEL and A. WILLIAMS  - Scarborough FairCanticle (1968)     \n        SIMON &amp; GARFUNKEL  - Scarborough FairCanticle (1975)   \n\n\n\n\n     &quot;Scarborough Fair&quot; is a traditional ballad of Great Britain and more precisely Yorkshire. Paul Simon learned the song in London in 1965 from Martin Carthy, who had picked up the tune from the songbook by Ewan MacColl and Peggy Seeger. Art Garfunkel then set it in counterpoint with &quot;Canticle&quot;, a reworking of Simon's 1963 song &quot;The Side of a Hill&quot; with new, anti-war lyrics. It was the lead track of the 1966 album Parsley, Sage, Rosemary and Thyme, and was released as a single after being featured on the soundtrack to The Graduate in 1968. The copyright credited only Simon and Garfunkel as the authors, causing ill-feeling on the part of Carthy, who felt the &quot;traditional&quot; source should have been credited. This rift remained until Simon invited Carthy to duet the song with him at a London concert in 2000. Simon performed this song with The Muppets when he guest starred on The Muppet Show.\n    &quot;Patterns&quot; is a song written by Paul Simon and included on his 1965 album The Paul Simon Songbook, and later recorded by Simon and Garfunkel on their third album, Parsley, Sage, Rosemary and Thyme. The lyrics are about how life is a labyrinthine maze, following patterns that are difficult to unravel or control although we are trapped in them.  Warrel Dane included a heavy metal cover of the song on his 2008 album Praises to the War Machine.\n","torrent":{"xt":"urn:btih:47c8ef6f785224b03ee033557f18ed915e1bf2cc","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+535","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47c8ef6f785224b03ee033557f18ed915e1bf2cc","infoHashBuffer":{"type":"Buffer","data":[71,200,239,111,120,82,36,176,62,224,51,85,127,24,237,145,94,27,242,204]},"announce":[],"urlList":[]}}