{"title":"Thrombolytic Therapy for Acute Stroke,2nd Edition {BBS}","uid":6811549,"size":7726934,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47ccdd44591ee6cbf8b378a55fd8b4d196966999&amp;dn=Thrombolytic+Therapy+for+Acute+Stroke%2C2nd+Edition+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321052794,"description":"Now extensively revised and significantly expanded, this second edition of the highly praised Thrombolytic Therapy for Stroke incorporates the knowledge gained from the widespread implementation of large rt-PA for acute stroke trials and demonstrates the power of the new technologies now available, specifically MRI scanning. The authors, all recognized experts internationally known for their contributions to developing thrombolytic therapy, have included much new material on stroke-MRI and computed tomography, and updated all chapters describing the background, use, and nuances of thrombolytic therapy. They present everything one needs to know for proper patient selection, the key to successful treatment. Practical how-to chapters guide the reader in treating acute stroke patients, both with and without thrombolytic therapy, according to the latest findings. As in the first edition, all the facts and data are presented for the reader to consider, with opinion clearly segregated and labeled. New detailed practice cases simulate making the rounds in a world-class stroke center to prepare practitioners to be as ready as possible for their first case.\nUp to date and highly practical, Thrombolytic Therapy for Acute Stroke, Second Editon offers the practicing physician everything necessary-background, protocols, new technologies, and case studies-for the safe and effective treatment of the emergency stroke patient today.\nProduct Details\n\n    * Paperback: 392 pages\n    * Publisher: Humana Press; Softcover reprint of hardcover 2nd ed. 2005 edition (December 16, 2010)\n    * Language: English\n    * ISBN-10: 1617375403\n    * ISBN-13: 978-1617375408","torrent":{"xt":"urn:btih:47ccdd44591ee6cbf8b378a55fd8b4d196966999","amp;dn":"Thrombolytic+Therapy+for+Acute+Stroke%2C2nd+Edition+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47ccdd44591ee6cbf8b378a55fd8b4d196966999","infoHashBuffer":{"type":"Buffer","data":[71,204,221,68,89,30,230,203,248,179,120,165,95,216,180,209,150,150,105,153]},"announce":[],"urlList":[]}}