{"title":"Devon Allman - Turquoise [2013] [FLAC]","uid":8421784,"size":428769712,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48b9f42c07c5f89756f5a455ea40d250c0b4ff36&amp;dn=Devon+Allman+-+Turquoise+%5B2013%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":18,"time":1367215892,"description":"01. When I Left Home \n02. Don't Set Me Free \n03. Time Machine \n04. Stop Draggin My Heart Around \n05. There's No Time \n06. Strategy\n07. Homesick \n08. Into the Darkness \n09. Key Lime Pie \n10. Yadira's Lullaby \n11. Turn Off the World\n\nAfter a couple of albums with his band Honeytribe, guitarist and songwriter Devon Allman scored with the Royal Southern Brotherhood. A blues-rock supergroup comprised of Allman and guitarist Mike Zito, drummer Yonrico Scott, and bassist Charlie Wooton from Zydefunk, the band's lone album hit the Top Ten on Billboard's blues chart. But Allman has proven himself restless from the start, and Turquoise is the latest chapter in his musical evolution. For those who've heard his past recordings as exercises in jam band expression, this set will come as a surprise. Produced by Jim Gaines (the Radiators, Huey Lewis, Santana, Ana Popovic, etc.), the album is a deeper, richer, collection of tunes that focuses on the Allman the singer and songwriter rather than the guitarist. Joined by Scott and bassist Myles Weeks, as well as some select guests, he displays a multi-dimensional persona here, rooted in blues, Southern soul, swampy rock, and sultry funk grooves. Opener &quot;When I Left Home&quot; is a straight-up rocker whose lyrics reveal his autobiography with some fine lead and slide work by Luther Dickinson. The lone cover on the set, Tom Petty's &quot;Strop Draggin' My Heart Around,&quot; is a gritty, emotionally taut duet reading that features blueswoman Samantha Fish in the Stevie Nicks role. &quot;My Strategy&quot; is a funky, nocturnal, midtempo ballad that revs it on the chorus. It's a love song with real power, and Bobby Schneck, Jr. provides some nice, economical guitar work. &quot;Into the Darkness&quot; showcases how soulful a vocalist Allman can be when he tries, employing a ragged falsetto inside his marbled, gritty baritone; he's backed by his trio, Rick Steff's B-3, and a saxophone solo by Ron Holloway. The misplaced -- and boring -- solo guitar instrumental, &quot;Yadira's Lullaby,&quot; unbalances the album a bit, but it's a small misstep. Allman's still searching for the right mix inside his meld of Southern music styles, but that's because he's multi-talented rather than unfocused; he feels at home with all of them. Turquoise is a fine next step for a singer and songwriter who has plenty to offer. ~ Thom Jurek, Allmusic","torrent":{"xt":"urn:btih:48b9f42c07c5f89756f5a455ea40d250c0b4ff36","amp;dn":"Devon+Allman+-+Turquoise+%5B2013%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b9f42c07c5f89756f5a455ea40d250c0b4ff36","infoHashBuffer":{"type":"Buffer","data":[72,185,244,44,7,197,248,151,86,245,164,85,234,64,210,80,192,180,255,54]},"announce":[],"urlList":[]}}