{"title":"Neil MacGregor - A History of the World in 100 Objects [96] Unab","uid":8102291,"size":1058331504,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:48d1ed43856c47d84498e7fbbabb82e2b7cb189d&amp;dn=Neil+MacGregor+-+A+History+of+the+World+in+100+Objects+%5B96%5D+Unab&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rambam1776","files":-1,"time":1360002845,"description":"NOTE - This torrent contains full liner note scans, as well as the pdf pictures of each object that came on each disk. The reviews below regard the companion book, which I have included as an epub.\n\nNeil MacGregor - A History of the World in 100 Objects\n\n96kbps, Unabridged, As broadcast on BBC4\n &lt;a href=&quot;\nhttp://www.bbc.co.uk/ahistoryoftheworld/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/ahistoryoftheworld/&lt;/a&gt;\n\nOverview\nFrom the renowned director of the British Museum, a kaleidoscopic history of humanity told through things we have made.\n\nWhen did people first start to wear jewelry or play music? When were cows domesticated and why do we feed their milk to our children? Where were the first cities and what made them succeed? Who invented math-or came up with money?\n\nThe history of humanity is a history of invention and innovation, as we have continually created new items to use, to admire, or to leave our mark on the world. In this original and thought-provoking book, Neil MacGregor, director of the British Museum, has selected one hundred man-made artifacts, each of which gives us an intimate glimpse of an unexpected turning point in human civilization. A History of the World in 100 Objects stretches back two million years and covers the globe. From the very first hand axe to the ubiquitous credit card, each item has a story to tell; together they relate the larger history of mankind-revealing who we are by looking at what we have made.\n\nHandsomely designed, with more than 150 color photographs throughout the text, A History of the World in 100 Objects is a gorgeous reading book and makes a great gift for anyone interested in history.\n\nLibrary Journal\nWe are what we make, and MacGregor proves it. Director of the British Museum, he uses 100 objects, ranging from a two million-year-old hand ax to a solar-powered lamp and charger, circa 2010, to survey human history. Sounds absolutely fascinating, and it comes highly recommended; the book was chosen by 11 publications as Book of the Year in the UK, and the joint BBC Radio program has been downloaded 12.5 million times. Get this one.\n\nKirkus Reviews\nAn arresting world history told through the stories of 100 objects that can be found in the British Museum.\n\nBased on a popular BBC Radio series broadcast last year, this beautifully illustrated book demonstrates how much we can learn about past societies from the things they have left behind. British Museum director MacGregor provides insightful commentaries on each of the objects, which range from the beginning of human history (about 2 million years ago) to the present, and represent most parts of the world. Selected by the museum's curators, the objects are not associated with important historical events; rather, they are artworks and everyday things that exemplify themes and establish connections across time and space. Each part consists of objects made in different parts of the world in the same time period. Thus a section on &quot;The First Global Economy, AD 1450-1650,&quot; when traders first brought different cultures into contact with each other, features a mechanical galleon from Germany, a brass plaque from Nigeria, a mosaic-decorated figurine from Mexico, porcelain elephants from Japan and pieces-of-eight coins minted in Bolivia. New scientific techniques help tease out stories from the objects: Researchers can now see inside the linen wrappings of Egyptian mummies and can test materials to reveal trading networks. The colors and patterns of broken pots and plates found on a beach in Tanzania around 900 show the extent of links with China and the Middle East. Many items, such as a bronze Chinese bell and silver Turkish coins, convey the power of owners and rulers. In an appealing, conversational style, MacGregor considers chess pieces, wine jugs, tablets and other objects to explain how people lived through the ages. The text also includes contributions from Seamus Heaney, David Attenborough, Martin Amis and others.","torrent":{"xt":"urn:btih:48d1ed43856c47d84498e7fbbabb82e2b7cb189d","amp;dn":"Neil+MacGregor+-+A+History+of+the+World+in+100+Objects+%5B96%5D+Unab","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d1ed43856c47d84498e7fbbabb82e2b7cb189d","infoHashBuffer":{"type":"Buffer","data":[72,209,237,67,133,108,71,216,68,152,231,251,186,187,130,226,183,203,24,157]},"announce":[],"urlList":[]}}