{"title":"George.Lopez.Why.You.Crying.2004.DVDRip.XviD","uid":3992228,"size":733065216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:48efa23fb44f8bdb1181e7bc7d8d290ab24a68a2&amp;dn=George.Lopez.Why.You.Crying.2004.DVDRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"werty11","files":1,"time":1201110664,"description":"In his bestselling autobiography WHY YOU CRYING?, standup comic and sitcom star George Lopez revealed the heartbreaking source of much of his zany, almost painfully honest brand of comedy. The son of a migrant-worker father and emotionally unstable mother--who abandoned him by the age of 10--Lopez was raised by his grandparents in Los Angeles&amp;#039; San Fernando Valley, where the specter of growing up poor and Mexican led him to seek catharsis in a style of observational humor that actually mined his tragic upbringing. Lopez adapts WHY YOU CRYING? for the stage in an hour-long standup performance recorded on February 21, 2004, at the Terrace Theater in Long Beach, California, and aired as a Showtime television special of the same name. Restoring 20 minutes of footage not included in the broadcast version, this presentation captures Lopez offering his trademark one-liners on universal topics such as family, relationships, and sex, while also examining the particular circumstance of being Latino in America, with a poignant hilarity that is candid, refreshing, and sidesplitting.","torrent":{"xt":"urn:btih:48efa23fb44f8bdb1181e7bc7d8d290ab24a68a2","amp;dn":"George.Lopez.Why.You.Crying.2004.DVDRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48efa23fb44f8bdb1181e7bc7d8d290ab24a68a2","infoHashBuffer":{"type":"Buffer","data":[72,239,162,63,180,79,139,219,17,129,231,188,125,141,41,10,178,74,104,162]},"announce":[],"urlList":[]}}