{"title":"T.G.Sport.Relief.Bake.Off-S03E03-w.subs-BBC-2016-720p","uid":13582239,"size":1051340406,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4970658e349120b8d7f3adc97d81abbe778f6378&amp;dn=T.G.Sport.Relief.Bake.Off-S03E03-w.subs-BBC-2016-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uggauga","files":2,"time":1455753772,"description":"The Great Sport Relief Bake Off, Series 3 Episode 3 of 4\r\n\r\nBBC (2016)\r\n \nhttp://www.bbc.co.uk/programmes/b03qgyqf\r\n_______________________________________\r\n\r\n1280x720 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n \nhttps://en.wikipedia.org/wiki/Sport_Relief\r\n\r\nSport Relief is a biennial charity event from Comic Relief, in association with BBC Sport, which brings together the worlds of sport and entertainment to raise money to help vulnerable people in both the UK and the world's poorest countries. At the heart of the campaign is the &quot;Sport Relief Mile&quot;, which involves members of the public doing their bit for charity.\r\nComic Relief teamed up with the newly established Sport Relief initiative in 2002 and alternates with Sport Relief,\r\nairing every second year in March.\r\n_______________________________________\r\n\r\nEpisode 3 of 4\r\nFour more celebrities head to the famous Bake Off tent in aid of UK fundraising event, Sport Relief. Judges Mary Berry and Paul Hollywood set three tasks to test each celebrity's baking prowess, while comedian Ed Byrne is on hand to guide them through.\r\nThe celebrities taking up the baking baton this time are ex-Spice Girl Geri Horner, BBC world affairs editor John Simpson, footballer and pundit Jermaine Jenas and 1990s pop sensation Louise Redknapp.\r\nThe first hurdle for the bakers is the signature challenge, where they take on savoury tarts. Up next it's the technical challenge, Mary's chocolate and beetroot tray bake. The bakers must follow a stripped-back recipe to produce this moist, malty sponge, covered with a cream-cheese icing and decorated with candied beetroot.\r\nOn day two, the bakers have one last chance to impress the judges in a bid to claim the Sport Relief Star Baker apron. For this final task, the showstopper bake, they attempt to make 3D models of their favourite sporting moments out of biscuits!\r\nWhen it comes to the crunch, who will crumble under the pressure and who will triumph to take home the title of Star Baker?\r\nWhile the celebrity bakers hope to inspire others to get involved in fundraising for Sport Relief, Clare Balding visits Kenya to learn about the work of Sport Relief there, and the difference the money raised is making in the fight against malaria. She visits children in hospital battling the disease and sees how donations can help prevent such suffering","torrent":{"xt":"urn:btih:4970658e349120b8d7f3adc97d81abbe778f6378","amp;dn":"T.G.Sport.Relief.Bake.Off-S03E03-w.subs-BBC-2016-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4970658e349120b8d7f3adc97d81abbe778f6378","infoHashBuffer":{"type":"Buffer","data":[73,112,101,142,52,145,32,184,215,243,173,201,125,129,171,190,119,143,99,120]},"announce":[],"urlList":[]}}