{"title":"Flavius Josephus - Complete Works","uid":4435868,"size":4048298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a152d034042aa791b690b458dd6d9d94c553913&amp;dn=Flavius+Josephus+-+Complete+Works&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CuriousGeorge","files":-1,"time":1223540290,"description":"&quot;The destruction of Jerusalem was more terrible than anything that the world has ever witnessed, either before or since. Even Titus seemed to see in his cruel work the hand of an avenging God.&quot; (C.H. Spurgeon)\n\nEusebius  (325)\n&quot;If any one compares the words of our Saviour with the other accounts of the historian (Josephus) concerning the whole war, how can one fail to wonder, and to admit that the foreknowledge and the prophecy of our Saviour were truly divine and marvelously strange.&quot; (Book III, Ch. VII)\n\nFlavius Josephus, a Jewish priest and Pharisee, was put in command of the national resistance in Galilee at the time of Israel's revolt against Rome.  When he was captured at Jotapata; his life was spared upon his prediction to rival Vespasian, that the Roman general would soon become emperor.  Upon the fulfillment of this prophecy shortly thereafter, he was commissioned to provide his captors with a history of the Jewish people, although he initially wrote a history of the Roman-Jewish war suited for both a Roman and a Jewish audience.   His works, disputed though they may be regard accuracy, are an indispensable source on the life and history in Roman Judea.\n\nAntiquities of the Jews\n\nPreface to the Antiquities of the Jews\nBook I -- From Creation to the Death of Isaac\nBook II -- From the Death of Isaac to the Exodus out of Egypt\nBook III -- From the Exodus out of Egypt to the Rejection of the Generation\nBook IV -- From the Rejection of that Generation to the Death of Moses\nBook V -- From the Death of Moses to the Death of Eli\nBook VI -- From the Death of Eli to the Death of Saul\nBook VII -- From the Death of Saul to the Death of David\nBook VIII -- From the Death of David to the Death of Ahab\nBook IX -- From the Death of Ahab to the Captivity of the Ten Tribes\nBook X -- From the Captivity of the Ten Tribes to the First Year of Cyrus\nBook XI -- From the First Year of Cyrus to the Death of Alexander the Great\nBook XII -- From the Death of Alexander the Great to the Death of Judas Maccabeus\nBook XIII -- From the Death of Judas Maccabeus to the Death of Queen Alexandra\nBook XIV -- From the Death of Queen Alexandra to the Death of Antigonus\nBook XV -- From the Death of Antigonus to the Finishing of the Temple by Herod\nBook XVI -- From the Finishing of the Temple by Herod to the Death of Alexander and Aristobulus\nBook XVII -- From the Death of Alexander and Aristobulus to the Banishment of Archelaus\nBook XVIII -- From the Banishment of Archelaus to the Departure of the Jews from Babylon\nBook XIX -- From the Departure of the Jews from Babylon to FAdus the Roman Procurator\nBook XX -- From Fadus the Procurator to Florus\nWar of the Jews\n\nPreface to the War of the Jews\nBook I -- From the Taking of Jerusalem by Antiochus Epiphanes to the Death of Herod the Great\nBook II -- From the Death of Herod till Vespasian was sent to subdue the Jews by Nero\nBook III -- From Vespasian's coming to Subdue the Jews to the Taking of Gamala\nBook IV -- From the Siege of Gamala to the Coming of Titus to besiege Jerusalem\nBook V -- From the Coming of Titus to besiege Jerusalem to the Great Extremity to which the Jews were reduced\nBook VI -- From the Great Extremity to which the Jews were reduced to the taking of Jerusalem by Titus\nBook VII -- From the Taking of Jerusalem by Titus to the Sedition of the Jews at Cyrene","torrent":{"xt":"urn:btih:4a152d034042aa791b690b458dd6d9d94c553913","amp;dn":"Flavius+Josephus+-+Complete+Works","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a152d034042aa791b690b458dd6d9d94c553913","infoHashBuffer":{"type":"Buffer","data":[74,21,45,3,64,66,170,121,27,105,11,69,141,214,217,217,76,85,57,19]},"announce":[],"urlList":[]}}