{"title":"DSB Flux - Old School Photoshop Plugin","uid":6814123,"size":277735,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4a1e898d884aea31df080c242c8a75dc773af1be&amp;dn=DSB+Flux+-+Old+School+Photoshop+Plugin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fuckingruff","files":1,"time":1321133273,"description":"Digital Showbiz - The Flux Collection\n\n20 plugins for Photoshop\n\nPlugin Descriptions:\n\n\nCassini generates looping patterns around center points you define. You specify the thickness of the rings, the number of centers and the general color balance.\n\nTo set center locations click &quot;Randomize Centers&quot; to set all centers or chose a center from the &quot;Center Selection&quot; drop down list, then click in the blank box left of the &quot;Cancel&quot; and &quot;OK&quot; buttons to set its position. To adjust the color balance use the red, green and blue sliders.\nsample output \t\nElectrosphere\n\nElectroSphere generates soft smooth background images intended for multimedia. Four sliders, Current, Voltage, Heat and Frequency, define the appearance of the image. Adjusting hue allows you to generate drastically different shapes or patterns.\n\nBecause of the large number of floating point calculations Electrosphere's interactive preview can be somewhat slow on older machines.\nsample output \t\nIsotope\n\nIsotope generates colorful and highly saturated background images for multimedia use. The colors created by Isotope are mostly outside the CMYK color gamut and are thus not suitable for printing. On computer or video monitors they look spectacular. Because of the smooth nature of these backgrounds they are well suited for web usage.\n\nYou set the Tension, Attraction, Radiation and Distance. When you're satisfied with the general appearance use the hue slider to alter not only the image hue but also its apparent three dimensional depth. Because of the large number of floating point calculations performed Isotope's interactive preview can be somewhat slow on older machines.\nsample output \t\nBlast\n\nThe Blast plugin &quot;blasts&quot; across an image mixing original color and blasted color along the way. You define the direction, left, right, up or down and overall amount of blast as a percentage or absolute in pixels.\n\nThe Blast plugin randomizes individual blasts within these limits, mixing colors as it proceeds.\nsample output \t\nBright Noise\n\nThis plugin sprinkles an image with noise depending on the brightness. You can darken or lighten the image or mix noise into the image. You specify the noise intensity and the direction.\nsample output \t\nBubbles\n\nThe bubbles plugin speckles your image with a grid of bubbles. You manipulate the number of bubbles, their density and frequency, using tune to make slight variations.\nsample output \t\nCenter Mirror\n\nPlaces a number of double sided mirrors in the center of an image and reflects. You set the number of mirrors - we used four - and the rotation.\nsample output \t\nGears\n\nShapes an image into gears from its center. You control the number of gears and the strength.\nsample output \t\nMirror\n\nMirrors an image along a horizontal or vertical axis. You specify the location of the mirror, its direction - horizontal or vertical - and the amount of blending between the original and the mirrored image. We placed the mirror in the center of the image and used a blend of 50%.\nsample output \t\nLinear Transmission\n\nCuts an image into horizontal or vertical strips, offsetting alternating strips and blending these with the original. You set direction, horizontal or vertical, the offset and blend factor.\n\nBlend factors from 0 to -100 increase contrast between the strips, peaking in a pattern of black and white lines. Blend factors from 0 to 100 blend the offset strips with the underlying image.\nsample output \t\nMosaic Ripple\n\nCuts an image into tiles and ripples each tile individually. You specify the number of mosaic tiles and the amount of ripple pull.\nsample output \t\nPsychedelic\n\nModifies colors in an image without geometric distortion. You control the amount of red, green and blue psychedelic generation, plus overall frequency and intensity.\nsample output \t\nRadial Mosaic\n\nArranges an images into a radial mosaic preserving some of the original texture. You define angle and mosaic size.\nsample output \t\nRadial Noise\n\nCreates a noisy version of your original image, which is scaled, rotated and blended with the original.\n\nYou vary the size, rotation, noise threshold and intensity.\nsample output \t\nRadial Smox\n\nDistorts an image using &quot;smox&quot; arranged in a radial fashion. You control scale, density and frequency of the &quot;smox.\nsample output \t\nRadial Transmission\n\nCuts an image into circular rings, rotates these into opposite directions and blends rings with the original image.\n\nYou specify ring size, rotation and blend factor. Blend factors from -100 to 0 increase contrast peaking at -100 in black and white circular rings. Blend factors above 0 blend the rotated rings with the underlying image.\nsample output \t\nRadial Warp\n\nWarps an image using radial motion. You use six sliders to control the distortion.\nsample output \t\nRadical Warp\n\nWarps an image using a more radical variation of the radial engines used in &quot;Radial Warp&quot;. You use the same six sliders to control the distortion.\nsample output \t\nSpider Web\n\nPuts an image behind a spider web. You control the number of rays [an absolute value] and rings [relative] plus how much spider web darkens the image.\nsample output \t\nTiler\n\nTakes part of an image and tiles it repeatedly. You specify the horizontal and vertical dimension of the tile [in percent of the image size] and its horizontal and vertical origin. ","torrent":{"xt":"urn:btih:4a1e898d884aea31df080c242c8a75dc773af1be","amp;dn":"DSB+Flux+-+Old+School+Photoshop+Plugin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a1e898d884aea31df080c242c8a75dc773af1be","infoHashBuffer":{"type":"Buffer","data":[74,30,137,141,136,74,234,49,223,8,12,36,44,138,117,220,119,58,241,190]},"announce":[],"urlList":[]}}