{"title":"Acres of Skin - Human Experiments at Holmesburg Prison (Malestro","uid":4712337,"size":1633698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a518e495d3c5f2cfcab061330e6bf26969106cc&amp;dn=Acres+of+Skin+-+Human+Experiments+at+Holmesburg+Prison+%28Malestro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1234088260,"description":" &lt;a href=&quot;http://www.image-upload.net/images/91oqbo9pn4soc7wsxw53.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/91oqbo9pn4soc7wsxw53.jpeg&lt;/a&gt;\n\nAcres of Skin: Human Experiments at Holmesburg Prison\nRoutledge | 1999 | ISBN: 0415923360 | Pages: 320 | PDF \n\nIn the first expose of unjust medical experimentation since David Rothman's Willowbrook's Wars, Allen M. Hornblum releases devastating stories from within the walls of Philadelphia's Holmesburg Prison. For more than two decades, from the mid-1950s through the mid-1970s, inmates were used, in exchange for a few dollars, as guinea pigs in a host of medical experiments.\n\nAn array of doctors, in conjunction with the University of Pennsylvania and prison officials, established Holmesburg as a laboratory testing ground. Hundreds of prisoners were used to test products from facial creams to far more hazardous, even potentially lethal, substances such chemical warfare agents.\n\nBased on in-depth interviews with dozens of prisoners as well as the doctors and prison officials who performed or enforced these experimental tests, Hornblum paints a disturbing portrait of abuse, moral indifference, and greed. Central to this account are the millions of dollars many of America's leading drug and consumer goods companies made available for the all too eager doctors seeking fame and fortune through their medical experiments.\n\nAcres of Skin is rigorously researched and shocking in its depiction of men treated as laboratory animals.","torrent":{"xt":"urn:btih:4a518e495d3c5f2cfcab061330e6bf26969106cc","amp;dn":"Acres+of+Skin+-+Human+Experiments+at+Holmesburg+Prison+%28Malestro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a518e495d3c5f2cfcab061330e6bf26969106cc","infoHashBuffer":{"type":"Buffer","data":[74,81,142,73,93,60,95,44,252,171,6,19,48,230,191,38,150,145,6,204]},"announce":[],"urlList":[]}}