{"title":"Harvey Danger - Where Have All the Merrymakers Gone? [1997]","uid":9570189,"size":314762674,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ae330e9d63889f78b36bb00971c9e34327a1b98&amp;dn=Harvey+Danger+-+Where+Have+All+the+Merrymakers+Gone%3F+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GenXRock","files":-1,"time":1391616755,"description":"Review by David Kent-Abbott\n&quot;I'm not sick, but I'm not well&quot; whines vocalist Sean Nelson in &quot;Flagpole Sitta,&quot; the first single released from Harvey Danger's 1998 debut album. Such studied bile and wry wordplay abound on this lyrically and musically very solid first effort. Rather than pigeonholing themselves into a sub-genre, Harvey Danger seem to have incorporated a variety of &quot;alternative&quot; influences -- notably the Pixies, the Wedding Present, and Joy Division -- plus bits of Gang of Four, Sonic Youth, the Smiths, Hole, Green Day, Buzzcocks, Ride, and Iggy Pop. The band's use of dynamics on this album is subtle and skillful, gliding within one song from a whisper to a Wall of Noise and back again seamlessly. With its melodic basslines and roomy, fuzz-box guitars chugging away at forceful riffs that straddle the line between '70s British punk and '80s indie, Where Have All the Merrymakers Gone? should be immediately accessible to fans of intelligent, sardonic, hard-edged rock. In &quot;Private Helicopter,&quot; Nelson sneers &quot;If you've got greatness in you, would you do us all a favor and keep it to yourself?&quot; Fortunately, Harvey Danger have chosen not to take their own advice. (3/5)","torrent":{"xt":"urn:btih:4ae330e9d63889f78b36bb00971c9e34327a1b98","amp;dn":"Harvey+Danger+-+Where+Have+All+the+Merrymakers+Gone%3F+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ae330e9d63889f78b36bb00971c9e34327a1b98","infoHashBuffer":{"type":"Buffer","data":[74,227,48,233,214,56,137,247,139,54,187,0,151,28,158,52,50,122,27,152]},"announce":[],"urlList":[]}}