{"title":"Chucho Valdes - Chucho's Steps [FLAC] TQMP","uid":5808789,"size":450273894,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4afd6bdf3587629cf21d891a9b63a7c11f88e915&amp;dn=Chucho+Valdes+-+Chucho%5C%27s+Steps+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pastafari","files":-1,"time":1283549375,"description":"Chucho Valdes &amp; The Afro-Cuban Messengers - Chucho's Steps\n2010\n\nWith Chucho's Steps, a reference to Coltrane's Giant Steps, Chucho Valdes raises the bar. And I mean he really raises the frikking bar!\n\nBrought to you by TQMP\nThe Quality Music Project\n\nReview\n\nChucho Valdes' newest release, Chucho's Steps, is as much of a discovery for the preeminent pianist as for his audience. In his first solo project since 2003's New Conceptions, Valdes speaks through his distinctive and extraordinary compositions and arrangements, reflecting upon his own evolution throughout the previous years.\n\nBorn in Quivican, Cuba, in 1941, Chucho Valdes is one of Cuba's most famous pianists, bandleaders, composers and arrangers. Having began his music training with his father, famed pianist Bebo Valdes, when he was 3 years old, Chucho's style melds his diverse experiences and skills: classical, jazz, bop, Cuban and swing, all combined by his virtuosic dexterity on the piano. Perhaps best known for founding the influential Latin jazz band IRAKERE in 1972, Valdes continues to develop unique works of art, generating ideas for a change of style, orchestral format and concept, that nonetheless end up characteristically reflecting pure Chucho.\n\nWhile exploring his own growth, Valdes, joined by the Afro-Cuban Messengers, pays tribute to those that have influenced him and aided his musical development. For example, the title track, a tribute to John Coltrane and his masterpiece Giant Steps, rounds off the harmonic structure in 50 bars without repetition. The improvisation and variations heard in this track create the illusion of a concert or suite, while exhibiting the virtuosity of Valdes and the Afro-Cuban Messengers. The upbeat and funky opening track, &quot;Zawinul's Mambo,&quot; pays homage to Austrian keyboardist and composer, Joe Zawinul, whom Valdes cites as an integral inspiration to the development of his composition and technique.\n\n&quot;New Orleans,&quot; a tribute to the musicians of New Orleans, specifically the Marsalis family, is a walk through the history of the &quot;birthplace of jazz&quot; beginning with Jelly Roll Morton's transformation of ragtime to jazz.\n\nIn the opening notes of &quot;Yansa,&quot; Valdes and the Afro-Cuban Messengers deftly evoke Yoruba mythology's &quot;Queen of the Wind and Storms.&quot; In conjuring this powerful Goddess, Valdes juxtaposes the powerful cacophony of violent storms with the melodic resolution found in the call and response of a chorus. His interpretation of this classic deity weaves the clave rhythm in and out of the composition in a very non-traditional manner, providing a fresh modern insight to an ancient religious belief.\n\n&quot;Julian,&quot; a bluesy lullaby dedicated to Chucho's youngest son, is a melodic tune ranging from the lyrical to the playful. The beautiful melody, along with the saxophone and trumpet solos, contribute to the wonder of simplicity inspired by father-son tenderness.\n\nValdes' new album Chucho's Steps with the Afro-Cuban Messengers, which will extensively tour the USA in October 2010, marks Chucho's return to the US for the first time in 7 years.\n\nChucho's illustrious career has garnered him 7 Grammy wins and 16 nominations over the past three decades. His most recent wins, a 2010 Grammy and a 2009 Latin Grammy for the record Juntos para Siempre, saw him collaborate with his father, Bebo Valdes, a major player on the Cuban jazz scene in his own right. Chucho Valdes has recorded over eighty CD's and performed with everybody who is somebody in the world of jazz, from Herbie Hancock and Dizzy Gillespie, to Wynton Marsalis and Chick Corea. His reputation as one of the greatest living Cuban jazz pianists has earned him appearances on the greatest stages in music, including Carnegie Hall, The Kennedy Center and The Hollywood Bowl.\n-- All About Jazz\n\nPersonnel --\nChucho Valdes, piano\nJuan Carlos Rojas Castro, drums\nLazaro Rivero Alarcon, bass\nYaroldy Abreu Robles, percussion\nCarlos Manuel Miyares Hernandez, tenor saxophone (except &quot;Begin To Be Good&quot;)\nReinaldo Melian Alvarez, trumpet (except &quot;Danzon&quot;)\nDreiser Durruthy Bambole, voice Leader &amp; drums bata (on &quot;Yansa&quot;)\nBaira Fermina Ramirez, Yemi Menocal, Lazaro Rivero Alarcon, Yaroldy Abreu Robles, chorus (on &quot;Yansa&quot;)\n\n\nTrack List\n01- Las dos caras (Both Sides)\n02- Danzon\n03- Zawinul's Mambo\n04- Begin To Be Good\n05- New Orleans\n06- Yansa\n07- Julian\n08- Chucho's steps\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4afd6bdf3587629cf21d891a9b63a7c11f88e915","amp;dn":"Chucho+Valdes+-+Chucho%5C%27s+Steps+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4afd6bdf3587629cf21d891a9b63a7c11f88e915","infoHashBuffer":{"type":"Buffer","data":[74,253,107,223,53,135,98,156,242,29,137,26,155,99,167,193,31,136,233,21]},"announce":[],"urlList":[]}}