{"title":"Cassie Alexander - Edie Spence (1,2&amp;3)","uid":8646057,"size":4678478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b33dae3c2379ea41587ff8facc3f55e044da75e&amp;dn=Cassie+Alexander+-+Edie+Spence+%281%2C2%26amp%3B3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBayUser255","files":10,"time":1372985938,"description":"From debut author Cassie Alexander comes a spectacular new urban fantasy series where working the nightshift can be a real nightmare.Nothing compares to being Nightshifted.\n\n01 - Nightshifted\n\nNursing school prepared Edie Spence for a lot of things. Burn victims? No problem. Severed limbs? Piece of cake. Vampires? No way in hell. But as the newest nurse on Y4, the secret ward hidden in the bowels of County Hospital, Edie has her hands full with every paranormal patient you can imagine - from vamps and were-things to zombies and beyond... \n\nEdie's just trying to learn the ropes so she can get through her latest shift unscathed. But when a vampire servant turns to dust under her watch, all hell breaks loose. Now she's haunted by the man's dying words - Save Anna - and before she knows it, she's on a mission to rescue some poor girl from the undead. Which involves crashing a vampire den, falling for a zombie, and fighting for her soul.\n\n02 - Moonshifted\n\nCheck in to County Hospital's secret ward - where paranormal activities lead to medical emergencies for one tireless nurse...\n\nAfter surviving a brutal vampire attack, Nurse Edie Spence is ready to get back to work - attending to supernatural creatuers in need of medical help. But her nursing skills are put to the test when she witnesses a hit-and-run on her lunch break. The injured pedestrian is not only a werewolf, he's the pack leader. And now Edie's stuck in the middle of an all-out were-war...\n\nWith two rival packs fighting tooth and nail, Edie has no intention of crossing enemy lines. But when she meets her patient's nephew - a tattooed werewolf named Lucas with a predatory gleam in his eye that's hard to resist - Edie can't help but choose sides. The question is: can she trust this dangerous new ally? And can she trust her own instincts when she's near him? Either way, Edie can't seem to pull away - even if getting involved makes her easy prey...\n\n03 - Shapeshifted\n\nEdie hopes to procure it at her new job at the clinic across town, where the forces of evil loom large. Vampire gang wars are rampant. Old underground enemies are rising to the surface. And Edie's zombie ex-boyfriend has arrived at the scene - but is he the same man he used to be? And what should she make of the enigmatic doctor with whom she shares an unexpected connection? She'll have to figure it out soon, because all hell is about to break loose - literally - and time is running out...","torrent":{"xt":"urn:btih:4b33dae3c2379ea41587ff8facc3f55e044da75e","amp;dn":"Cassie+Alexander+-+Edie+Spence+%281%2C2%26amp%3B3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b33dae3c2379ea41587ff8facc3f55e044da75e","infoHashBuffer":{"type":"Buffer","data":[75,51,218,227,194,55,158,164,21,135,255,143,172,195,245,94,4,77,167,94]},"announce":[],"urlList":[]}}