{"title":"The Anniversary {Hammer} {Bette Davis}  [1968]","uid":6932655,"size":762161585,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4ba5c99c213c2e1e97c793bc0cfe5ea9ff3ad645&amp;dn=The+Anniversary+%7BHammer%7D+%7BBette+Davis%7D++%5B1968%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alien99","files":-1,"time":1325709258,"description":"Storyline\n\nOn the celebration of the anniversary of Mrs. Taggart, her three dominated sons come to her house for the party. Terry, Henry and Tom Taggart work in construction, in a business that belonged to their father and is presently managed by their manipulative mother. Tom brings his pregnant fiancÃƒÂ©e Shirley Blair to tell his mother that they will marry each other; Terry brings his wife Karen Taggart and they secretly intend to emigrate to Canada; and Henry is gay and loves to wear women's underwear. During the night, the mean Mrs. Taggart uses the most despicable means and tricks to get rid off Shirley and Terry and keep her sons close to her.\n\nUser Review \n\nThe blackest of comedies, this really can't be classified under any specific category because of its stepping into every genre now and then. It's a drama one minute, a comedy the next, with some pieces of horror and mystery thrown in. Usually it's found in the classics section or the horror section, but it can't be put in any specific genre.\n\nBette Davis is Mrs. Taggart, a one-eyed society matron who keeps a firm grip on her three sons and their lives. Henry (James Cossins), the oldest, has a strong fixation with his mother and does whatever she asks him to do. Terry (Jack Hedley), the middle son, is the one who managed to marry Karen (Sheila Hancock) and have 5 children. Tom (Christian Roberts), the youngest, is secretly engaged to Shirley (Elaine Taylor), a blonde beauty. On each wedding anniversary of her and her late husband, Mrs. Taggart commands that her three sons and their families attend. On every wedding anniversary, it is an endurance test to see who can stand the wraith of the woman This anniversary, Shirley is subjected to what could be the oddest family in all of England.\n\nAll of the actors are amazing in their roles. Bette Davis gives what could be her best role after Margot Channing in ALL ABOUT EVE! Jack Hedley, familiar as the police inspector in Lucio Fulci's gory NEW YORK RIPPER, is younger and has his original British voice (dubbed in RIPPER). THE ANNIVERSARY is a wonder to watch. Intelligently written, with enough twists and turns in the plot to give one whiplash, Davis delivers so much venomous dialogue it's a wonder that her co-stars didn't die from poisoning! Every character has secrets that are used as blackmail by Mrs. Taggart, who wouldn't think much of putting her sons in jail.\n\nTHE ANNIVERSARY is too much fun to explain in a simple review, so find a copy of this gem and find out for yourself!\n","torrent":{"xt":"urn:btih:4ba5c99c213c2e1e97c793bc0cfe5ea9ff3ad645","amp;dn":"The+Anniversary+%7BHammer%7D+%7BBette+Davis%7D++%5B1968%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ba5c99c213c2e1e97c793bc0cfe5ea9ff3ad645","infoHashBuffer":{"type":"Buffer","data":[75,165,201,156,33,60,46,30,151,199,147,188,12,254,94,169,255,58,214,69]},"announce":[],"urlList":[]}}