{"title":"ESET NOD32 Antivirus 5.2.9.1 + Fix - psyko666","uid":7655050,"size":106766097,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c46efe343e0ea1cb6b942f7be5553ca85a83dd1&amp;dn=ESET+NOD32+Antivirus+5.2.9.1+%2B+Fix+-+psyko666&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MFATeam","files":1,"time":1348127627,"description":"[img]http://img823.imageshack.us/img823/3765/nod32s.png[/img]\n\nESET NOD32 Antivirus 5 offers advanced detection technologies and multi-layered security features. Designed for a low footprint, fast scanning, it packs security features and customization options for consistent and personalized security on- or offline. ESET NOD32 Antivirus 5 is built on ESET's unique heuristic technology that identifies viruses that have never been seen before. This enables them to protect your computer proactively, in real-time, against new viruses and cyber threats that conventional signature-based antivirus products don't catch. ESET NOD32 Antivirus 5 includes antivirus, antispyware, antirootkit and HIPS protection, removable media control, cloud-enhanced whitelisting and gamer mode.\n\n\nQuote:\nChangelog:\n\n   Added: The number of scanned objects is now displayed in the main program window\n   Added: support for SSL False Start in Google Chrome\n   Added: support for SSL scanning in recent versions of Mozilla Firefox and Thunderbird\n   Fix: Product activation now utilizes proxy server\n   Fix: GUI opened in a large window\n   Fix: Issues with misleading notification bubbles about the program requiring user's attention\n   Fix: Issues with detection of emails in Windows Live Mail 2011\n   Fix: improved compatibility with HP Protect Tools\n   Fix: Removable media blocking feature does not block devices for particular Windows accounts\n   Fix: Files scanned by real-time protection on execution with real-time protection disabled\n   Fix: minor GUI issues\n\n\n\nx86 and x64 included\n\nQuote:\nFix: box, mara-fix 1.6 (Trial reset patch)\n\n\n\n\nQuote:\nImportant: Disable ESET before trying to download this fix. Before installing, we recommend uninstalling your current protection (including older versions of ESET software), to ensure a smooth transition. You can export all your settings before you uninstall ESET.\n\n\n\n\nQuote:\nNotes:  box, mara-fix 1.6 is flagged as virus/potentially unwanted application by ESET, I assure you it's not harmful in any way.\n\n\n\n\n\nHow To Setup?\n\nQuote:\n\n 1. Install ESET EAV/ESS.\n 2. Follow the on-screen instructions and read the ReadMe First message.\n 3. If ESET is not installed, you can apply the fix during installation. Just run it before installation.\n 4. Enjoy..","torrent":{"xt":"urn:btih:4c46efe343e0ea1cb6b942f7be5553ca85a83dd1","amp;dn":"ESET+NOD32+Antivirus+5.2.9.1+%2B+Fix+-+psyko666","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c46efe343e0ea1cb6b942f7be5553ca85a83dd1","infoHashBuffer":{"type":"Buffer","data":[76,70,239,227,67,224,234,28,182,185,66,247,190,85,83,202,133,168,61,209]},"announce":[],"urlList":[]}}