{"title":"MIRC.v7.36-TE","uid":10801574,"size":3915641,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c501b12976fbf71aa6e69769d551fd6ff435926&amp;dn=MIRC.v7.36-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"TeX","files":-1,"time":1408354763,"description":"TE 2014 PRESENTS\n\nANOTHER FINE RELEASE\n\nRelease: mIRC v7.36 (c) 2014 mIRC Co. Ltd\nDate: 08/18/2014\n\nCracked By: Twisted EndZ\nRelease Type: Registration/Serial Crack, Activation Crack, Server Check Crack, Precracked\nRELEASE NOTES\n\nmIRC is a full featured Internet Relay Chat client for Windows\nthat can be used to communicate, share, play or work with others\non IRC networks around the world, either in multi-user group\nconferences or in one-to-one private discussions\n\nIt has a clean, practical interface that is highly configurable\nand supports features such as buddy lists, file transfers\nmulti-server connections, IPv6, SSL encryption, proxy support\nUTF-8 display, UPnP, customizable sounds, spoken messages, tray\nnotifications, message logging, and more\n\nmIRC also has a powerful scripting language that can be used both\nto automate mIRC and to create applications that perform a wide\nrange of functions from network communications to playing games\n\nmIRC has been in development for over a decade and is constantly\nbeing improved and updated with new technologies. The most recent\nchanges can be found on the latest news page\n\nWhats New?\n\nmIRC 7.36 has been released! (August 14th 2014)\n\nThis is a small update that addresses a number of issues reported\nby users since the last release. It includes improvements\nchanges and fixes to a number of features, including:\n\nFixed slow mark/copy text in windows that contain long lines\nFixed listbox lines in Options dialog and other windows being\nchopped when DPI settings are set to a high value\nReverted change to alias/identifiers that caused a script to be\nhalted with a recursion error warning\nFixed listbox with checkboxes bug that caused checkboxes to be\nchecked if you scrolled through them with the up/down keys\nChanged channel folder dialog so that it can now be resized\nChanged online timer dialog to display information more\nclearly\nFixed Shift+Tab beeping when switching to listbox in channel\nwindow\nFixed $fullscreen not working on a non-primary monitor\nUpdated the find/replace dialogs in the script editor to\nremember their positions for the current mIRC session\nUpdated mIRC to include OpenSSL support without needing\nexternal DLLS\nFixed lock dialog bug that caused mIRC to ask for a password if\nthe on startup option was enabled without setting a password\nFixed $input() 'b' switch so that the dialog window close\nbutton is also temporarily disabled\nFixed isignore only accepting types, now also accepts switches\nFixed CAP server-time time value not being used when\ntimestamping an event in the log file\nOther changes and bug fixes\n\nIn total there have been around 25 changes since the last release\nand although most of them are only small fixes and tweaks, we\nhope that they result in a more useful and stable mIRC for you\n\nIMPORTANT NOTICE:\n\nAs of 09/14/2013 ALL TE RAR archives will now be using the RAR5\nstandard. Please make sure to update to the latest version of\nWinrar (at least Winrar v5.0) so you can extract the contents of\nthe *.001, *.002 etc... archives within the zip files. The\nupdate is free, there is no reason not to update\n\nTE Release Filename: tmirc736.zip\n\nINSTALLATION NOTES\n\nInstall mirc736.exe. After installation copy precracked exe from\nthe Crack folder to the installed folder of mIRC. Launch mIRC\nand use ANY information for registration. You now have a fully\nactivated version of mIRC! This version is also compatible with\nthe fish_10, just make sure you install the latest version of\nfish_10\n\nIMPORTANT NOTE ABOUT PORTABLE INSTALL:\n\nIf you choose to make a portable install while doing the\ninstallation its important to note that the registration info is\nthen stored in mIRC.ini on your portable device. If you copy\nover your mIRC.ini from your Windows Program Files/User\ninstallation of mIRC, then when you launch mIRC it will ask for a\nkey again (if you have entered one before) because this time it\nstarted to look in your registry\n\nEither don't copy your old ini over, or make sure to find, then\ncopy and paste the [user] section from the portable version ini\ninto your old ini you plan on using\n\nThats it! Enjoy\n\nT E 2 0 1 4\n\nascii\nby mx\n\nDon't Hate The Hacker, Hate The Code","torrent":{"xt":"urn:btih:4c501b12976fbf71aa6e69769d551fd6ff435926","amp;dn":"MIRC.v7.36-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c501b12976fbf71aa6e69769d551fd6ff435926","infoHashBuffer":{"type":"Buffer","data":[76,80,27,18,151,111,191,113,170,110,105,118,157,85,31,214,255,67,89,38]},"announce":[],"urlList":[]}}