{"title":"settings     profile     bookmarks     upload     feedback","uid":8963987,"size":541714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c80c413898e7c192ec74647609ed43b20677c6f&amp;dn=++++++settings+++++profile+++++bookmarks+++++upload+++++feedback&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":3,"time":1380173054,"description":"Publication Date: June 23, 1994 | ISBN-10: 0195089618 | ISBN-13: 978-0195089615\n\nThe Celts were one of the great founding civilizations of Europe and the first North European people to emerge into recorded history, producing a vibrant labyrinth of mythological tales and sagas that have influenced the literary traditions of Europe and the world.\nThe first A-Z reference of its kind, Dictionary of Celtic Mythology is fascinating and accessible guide to the gods and goddesses, the heroes and heroines, the magical weapons, fabulous beasts, and otherworld entities that populate the myths of this rich European culture. Like A Dictionary of Irish Mythology before it, this is a who's who and what's what of the epic Celtic sagas and tales. Predated only by Greek and Latin by virtue of the fact that the Celtic languages were not written until the early Christian era, Celtic mythology is a development from a far earlier oral tradition containing voices from the dawn of European civilization. The peoples of these Celtic cultures survive today on the western seaboard of Europe--the Irish, Manx, and Scots, who make up the Goidelic- (or Gaelic) speaking branch of Celts, and the Welsh, Cornish, and Brentons, who represent the Brythonic-speaking branch. And it is in these languages that their vibrant and fascinating mythology has been recorded and appreciated throughout the world. In his introduction, Ellis discusses the roles of these six cultures, the evolution (or demise) of the languages, and the relationship between the legends, especially the Irish and Welsh, the two major Celtic cultures. From Celtic legends have come not only the stories of Cuchulainn and Fionn MacCumhail, of Deidre of the Sorrows and the capricious Grainne, but the stories of the now world-famous Arthur, and the romantic tragedy of Tristan and Iseult.\nAn easy-to-read handbook, The Dictionary of Celtic Mythology presents a fascinating window to centuries of rich oral and written tradtion from the mists of Europe's origins.","torrent":{"xt":"urn:btih:4c80c413898e7c192ec74647609ed43b20677c6f","amp;dn":"++++++settings+++++profile+++++bookmarks+++++upload+++++feedback","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c80c413898e7c192ec74647609ed43b20677c6f","infoHashBuffer":{"type":"Buffer","data":[76,128,196,19,137,142,124,25,46,199,70,71,96,158,212,59,32,103,124,111]},"announce":[],"urlList":[]}}