{"title":"Britains.Horror.Homes.Series.1.3of6.PDTV.x264.AAC.MVGroup.org","uid":11921068,"size":699893234,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4c8813795d921039169203f3d542b05eb20f3f24&amp;dn=Britains.Horror.Homes.Series.1.3of6.PDTV.x264.AAC.MVGroup.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"artistharry","files":1,"time":1431638822,"description":"Britains Horror Homes: Series 1\n\nNature, Technology Documentary hosted by Jill Halfpenny, published by Channel 5 in 2015 - English narration\n   &lt;a href=&quot;\nhttp://docuwiki.net/images/c/cc/Britains-Horror-Homes-Series-1-Cover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/images/c/cc/Britains-Horror-Homes-Series-1-Cover.jpg&lt;/a&gt;\n\nInformation\n------------------------------\n\nBritains Horror Homes\nA six-part series revealing the stories of people whose lives have been turned upside-down when their home became a living nightmare. From homes left swimming in raw sewage to houses about to fall into the sea, and houses destroyed by acts of God to new-build nightmares and holiday home hellholes, this series tells some shocking and emotional tales.\n\n\n1)  Part 1 \nThe first edition features Phil and Helen from Staffordshire, whose B&amp;B was already in danger due to subsidence before a huge sinkhole opened up just two metres from their front door, and Caroline reveals the damage done to her Somerset home by drivers trying to squeeze their large lorries down a single-track lane. In Bexhill-on-Sea in East Sussex, Tony recalls how a bolt of lightning struck his home, leaving a 4ft hole in his roof and setting fire to his loft.\n\n2)  Part 2 \nTed Grayson is used to road traffic accidents taking place near his house in South Yorkshire as it is situated at the bottom of a hill on a dangerous bend, but nothing could prepare him for the day a car crashed into his kitchen. David and Sylvia Mason had their hopes of a peaceful retirement shattered when a large sinkhole opened up dangerously close to their Northamptonshire bungalow, while Bryony Nierop-Reading from the Norfolk village of Happisburgh was devastated when her house had to be demolished after coastal erosion left it suspended in mid-air on the edge of a cliff.\n\n3)  Part 3 \nLytham St Annes resident Michael reveals how his newly renovated property was left in an unrecognisable state by tenants who left him with a repair bill of Ã‚Â£10,000. In Essex, Carol discovers that the water continually flooding the garden of her 17th-century timber cottage is in fact sewage, and a retirement villa in Spain is demolished after it was declared illegal by the authorities.\n\n4)  Part 4 \nThis edition includes the stories of two people who have taken extreme measures to protect their homes. Graham turned his West Yorkshire house into a fortress with a 7ft-high fence and CCTV after it was burgled 10 times, while engineer Yaron devised a plan to raise his Berkshire property by more than 4ft to reduce the risk of being flooded a second time.\n\n5)  Part 5 \nPaul and Joanne talk about their life on a street nicknamed Poo Mews, thanks to the tide of raw sewage that flows through it every time it rains. Retired couple Brian and Irene's Canvey Island home is being threatened by a series of devastating floods, while fellow Essex resident Owen has built a blockade consisting of steel and concrete bollards, a double gate and an eight-inch wall to protect his property from speeding motorists.\n\n6)  Part 6 \nBob and Val have lived in their West Sussex home in what they believed was the best spot on the beach. However, as the years have gone by, erosion has brought the sea closer to the couple's front door. Now, they are terrified that one day their dream beach-front home will be swept away. Cameras also focus on Carol and John, whose back garden in Surrey was flooded with sewage.\n\n\nTechnical Specs\n------------------------------\n\n\n * Video: Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;6c210d05022c205f425d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n * Video: Bitrate: 2153 Kbps\n * Video: Resolution: 1024 x 576\n * Video: Aspect Ratio: 1.778 (16:9)\n * Audio: Codec: AAC LC\n * Audio: Bitrate: 160 Kbps VBR 48KHz\n * Audio: Channels: stereo (2/0)\n * Audio: English\n * Run-Time: 46mins\n * Framerate: 25fps\n * Number of Parts: 6\n * Part Size: 698 MB average\n * Container: Mp4\n * Source: PDTV\n * Encoded by: Harry65","torrent":{"xt":"urn:btih:4c8813795d921039169203f3d542b05eb20f3f24","amp;dn":"Britains.Horror.Homes.Series.1.3of6.PDTV.x264.AAC.MVGroup.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c8813795d921039169203f3d542b05eb20f3f24","infoHashBuffer":{"type":"Buffer","data":[76,136,19,121,93,146,16,57,22,146,3,243,213,66,176,94,178,15,63,36]},"announce":[],"urlList":[]}}