{"title":"Earth Science Puzzles: Making Meaning From Data","uid":8352420,"size":7330893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cf19c32e24cb9d3d09d6449dfcac891e053d014&amp;dn=Earth+Science+Puzzles%3A+Making+Meaning+From+Data&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365381726,"description":"Kim Kastens, Margie Turrin, &quot;Earth Science Puzzles: Making Meaning From Data&quot;\nISBN: 1935155156 | 2010 | PDF | 190 pages | 7 MB\n\nTeachers of Earth and environmental sciences in grades 8 12 will welcome this activity book centered on six data puzzles that foster critical-thinking skills in students and support science and math standards. Earth Science Puzzles presents professionally gathered Earth science data including graphs, maps, tables, images, and narratives and asks students to step into scientists shoes to use temporal, spatial, quantitative, and concept-based reasoning to draw inferences from the data. For the teacher, each puzzle is supported by an extensive Pedagogical Content Knowledge Guide with background information, required skills, common student misconceptions, an answer key to the questions in the student section, and a bank of resources for further exploration of the topics. Paleoclimates, weather forecasting, earthquakes, estuaries, watersheds, and hydrothermal vents are all covered. The time-efficient puzzles taking approximately one period to complete can be the beginning of an exciting, data-rich classroom environment.\n","torrent":{"xt":"urn:btih:4cf19c32e24cb9d3d09d6449dfcac891e053d014","amp;dn":"Earth+Science+Puzzles%3A+Making+Meaning+From+Data","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cf19c32e24cb9d3d09d6449dfcac891e053d014","infoHashBuffer":{"type":"Buffer","data":[76,241,156,50,226,76,185,211,208,157,100,73,223,202,200,145,224,83,208,20]},"announce":[],"urlList":[]}}