{"title":"On Guard - Dr. William Lane Craig","uid":11735191,"size":4966426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d374286cd8f8606a3c39edadd61738ad13d7cea&amp;dn=On+Guard+-+Dr.+William+Lane+Craig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1425539990,"description":"This concise guide is filled with illustrations, sidebars, and memorizable steps to help Christians stand their ground and defend their faith with reason and precision. In his engaging style, Dr. Craig offers four arguments for God?s existence, defends the historicity of Jesus? personal claims and resurrection, addresses the problem of suffering, and shows why religious relativism doesn?t work. Along the way, he shares his story of following God?s call in his own life.\n\nThis one-stop, how-to-defend-your-faith manual will equip Christians to advance faith conversations deliberately, applying straightforward, cool-headed arguments. They will discover not just what they believe, but why they believe?and how being on guard with the truth has the power to change lives forever.\n\n\nAbout the author:\nWilliam Lane Craig is Research Professor of Philosophy at Talbot School of Theology in La Mirada, California. At the age of sixteen as a junior in high school, he first heard the message of the Christian gospel and yielded his life to Christ. Dr. Craig pursued his undergraduate studies at Wheaton College (B.A. 1971) and graduate studies at Trinity Evangelical Divinity School (M.A. 1974; M.A. 1975), the University of Birmingham (England) (Ph.D. 1977), and the University of Munich (Germany) (D.Theol. 1984). From 1980-86 he taught Philosophy of Religion at Trinity, during which time he and Jan started their family. In 1987 they moved to Brussels, Belgium, where Dr. Craig pursued research at the University of Louvain until 1994.\nHe has authored or edited over thirty books, including The Kalam Cosmological Argument; Assessing the New Testament Evidence for the Historicity of the Resurrection of Jesus; Divine Foreknowledge and Human Freedom; Theism, Atheism and Big Bang Cosmology; and God, Time and Eternity, as well as over a hundred articles in professional journals of philosophy and theology, including The Journal of Philosophy, New Testament Studies, Journal for the Study of the New Testament, American Philosophical Quarterly, Philosophical Studies, Philosophy, and British Journal for Philosophy of Science. He lives in Atlanta, Georgia, with his wife Jan and their two teenage children Charity and John","torrent":{"xt":"urn:btih:4d374286cd8f8606a3c39edadd61738ad13d7cea","amp;dn":"On+Guard+-+Dr.+William+Lane+Craig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d374286cd8f8606a3c39edadd61738ad13d7cea","infoHashBuffer":{"type":"Buffer","data":[77,55,66,134,205,143,134,6,163,195,158,218,221,97,115,138,209,61,124,234]},"announce":[],"urlList":[]}}