{"title":"Gaither Vocal Band - I Do Believe (NTSC-DVDR - Live From New O.)","uid":4658088,"size":4682219520,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4d590dafb479f9eec8c3384c6e1468946bf3f5ca&amp;dn=Gaither+Vocal+Band+-+I+Do+Believe+%28NTSC-DVDR+-+Live+From+New+O.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"verifire","files":-1,"time":1232238793,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm duplicating them all to another torrent-site, maybe two or three. I guess it'll be at least:\n &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for me, and all uploads will come up, just give me a day or two.. :-)\n \nOn every torrent I've uploaded that you've started to download from here, (including this one) just add the tracker: (copy and paste, don't click on the link underneath, it's just a tracker..:)\n  &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nLike I say; add it to the trackers already in the torrent file, and we'll all find each other again, and the icons turn blue and green on uTorrent instead of red.. :-)\n \nIT WILL TAKE A DAY OR TWO TO DUPLICATE them all, but just hang in there..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance:\n  &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent, and I'll upload them there as well, with my alias as tag and included in the comment..\n\nSee you later. I guess this is the last comment I'll make on TPB, at least until things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter..\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S BEEN AN HONOR...\n\nVerifire.\n\n___________________________________________________________________________________\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nThis is the NTSC-DVD version of a great concert by a great vocal group.\n\nThe upload is an ISO-file, which means it's an DVD-image, and as such automatically mounts in Nero or other similar DVD-burner you've got assigned for this task when you (double?) click on the finished, downloaded file, which you'll of course leave in the download folder so you'll help to seed further for a while..? :-)\n\nAfter that, press &quot;play&quot;, and feel the chills roll down your spine when hearing these talented singers do their stuff, and even maybe have a few laughs in between..\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;087e6d7a616e617a6d65696164486f65696164266b6765&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:4d590dafb479f9eec8c3384c6e1468946bf3f5ca","amp;dn":"Gaither+Vocal+Band+-+I+Do+Believe+%28NTSC-DVDR+-+Live+From+New+O.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d590dafb479f9eec8c3384c6e1468946bf3f5ca","infoHashBuffer":{"type":"Buffer","data":[77,89,13,175,180,121,249,238,200,195,56,76,110,20,104,148,107,243,245,202]},"announce":[],"urlList":[]}}