{"title":"HISTORY OF POP AND ROCK MUSIC - part 550","uid":9523375,"size":183502238,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4da4d7fa2317721d766f60c8c99dce7e03464fa7&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+550&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1390687801,"description":"                  \n\n\n                    PART  550\n\n\n\n         LEONARD COHEN  -  So long, Marianne  (1972)\n\n\n\n      &quot;So Long, Marianne&quot; is a song written by Leonard Cohen. It was featured on his debut album, &quot;Songs of Leonard Cohen&quot;.   Pitchfork Media placed it at number 190 on their list of &quot;The 200 Greatest Songs of the 1960s\nThe song was inspired by Marianne Jensen, whom Cohen met on the Greek island of Hydra in 1960. Cohen said she was the most beautiful woman he had ever met.  She had recently been left by her husband, the Norwegian writer Axel Jensen, leaving her and her six-month-old son alone on the island. The two hit it off, and Cohen ultimately took her from Hydra back to her home in Oslo, Norway. He later invited her and her son to live with him in Montreal, an offer which she accepted. The two lived together throughout the 1960s, commuting between New York, Montreal, and Hydra.\n      Cohen dedicated his third volume of poetry, &quot;Flowers for Hitler&quot;, to her, and she directly inspired many of his other songs and poems. A photo of her appears on the back cover of his second album, Songs From a Room.\n      The song has been covered by Beck, John Cale with Suzanne Vega, Brian Hyland, James, Bill Callahan, Russian Red and others, including Cohen's own son, Adam. It was also covered by the New Zealand band, Straitjacket Fits on their &quot;Hail&quot; LP.","torrent":{"xt":"urn:btih:4da4d7fa2317721d766f60c8c99dce7e03464fa7","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+550","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4da4d7fa2317721d766f60c8c99dce7e03464fa7","infoHashBuffer":{"type":"Buffer","data":[77,164,215,250,35,23,114,29,118,111,96,200,201,157,206,126,3,70,79,167]},"announce":[],"urlList":[]}}