{"title":"Tom Jones - Reload - (2000)[FLAC-EAC-CUE]","uid":4472208,"size":490785369,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e6502dc454276a5ba5488a71aa5d8f01b763758&amp;dn=Tom+Jones+-+Reload+-+%282000%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"seanprince","files":27,"time":1225179254,"description":"Tom Jones - Reload - (2000)[FLAC-EAC-CUE]\n\nTrack list\n\nTom Jones - Reload\n\n01. Burning Down The House + The Cardigans 03:39\n02. Mama Told Me Not To Come + Stereophonics 03:00\n03. Are You Gonna Go My Way 03:27\n04. All Mine + Divine Comedy 03:59\n05. Sunny Afternoon + Space 03:26\n06. I'm Left, You're Right, She's Gone + James Dean Bradfield 03:40\n07. Sexbomb + Mousse T 03:31\n08. You Need Love Like I Do + Heather Small 03:49\n09. Looking Out My Window + James Taylor Quartet 03:20\n10. Sometimes We Cry + Van Morrison 05:00\n11. Lust For Life + Pretenders 03:42\n12. Little Green Bag + Barenaked Ladies 03:49\n13. Ain't That A Lot Of Love + Simply Red 02:42\n14. She Drives Me Crazy + Zucchero 03:35\n15. Never Tear Us Apart + Natalie Imbruglia 03:08\n16. Baby, It's Cold Outside + Cerys of Catatonia 03:41\n17. Motherless Child + Portishead 05:09\n\nBiography by Stephen Thomas Erlewine\n\nTom Jones became one of the most popular vocalists to emerge from the British Invasion. Since the mid-'60s, Jones has sung nearly every form of popular music -- pop, rock, show tunes, country, dance, and techno, he's sung it all. His actual style -- a full-throated, robust baritone that had little regard for nuance and subtlety -- never changed, he just sang over different backing tracks. On stage, Jones played up his sexual appeal; it didn't matter whether he was in an unbuttoned shirt or a tuxedo, he always radiated a raw sexuality, which earned him a large following of devoted female fans who frequently threw underwear on stage. Jones' following never diminished over the decades; he was able to exploit trends, earning new fans while retaining his core following.\n\nBorn Thomas John Woodward, Tom Jones began singing professionally in 1963, performing as Tommy Scott with the Senators, a Welsh beat group. In 1964, he recorded a handful of solo tracks with record producer Joe Meek and shopped them to various record companies to little success. Later in the year, Decca producer Peter Sullivan discovered Tommy Scott performing in a club and directed him to manager Phil Solomon. It was a short-lived partnership and the singer soon moved back to Wales, where he continued to sing in local clubs. At one of the shows, he gained the attention of former Viscounts singer Gordon Mills, who had become an artist manager. Mills signed Scott, renamed him Tom Jones and helped him record his first single for Decca, &quot;Chills and Fever,&quot; which was released in late 1964. &quot;Chills and Fever&quot; didn't chart but &quot;It's Not Unusual,&quot; released in early 1965, became a number one hit in the U.K. and a Top Ten hit in the U.S. The heavily orchestrated, over-the-top pop arrangements perfectly meshed with Jones' swinging, sexy image, guaranteeing him press coverage, which translated into a series of hits, including &quot;Once Upon a Time,&quot; &quot;Little Lonely One,&quot; and &quot;With These Hands.&quot; During 1965, Mills also secured a number of film themes for Jones to record, including the Top Ten hit &quot;What's New Pussycat?&quot; (June 1965) and &quot;Thunderball&quot; (December 1965).\n\nJones' popularity began to slip somewhat by the middle of 1966, causing Mills to redesign the singer's image into a more respectable, mature tuxedoed crooner. Jones also began to sing material that appealed to a broad audience, like the country songs &quot;Green, Green Grass of Home&quot; and &quot;Detroit City.&quot; The strategy worked, as he returned to the top of the charts in the U.K. and began hitting the Top 40 again in the U.S. For the remainder of the '60s, he scored a consistent string of hits in both Britain and America. At the end of the decade, Jones relocated to America, where he hosted the television variety program, This Is Tom Jones. Running between 1969 and 1971, the show was a success and laid the groundwork for the singer's move to Las Vegas in the early '70s. Once he moved to Vegas, Jones began recording less, choosing to concentrate on his lucrative club performances. After Gordon Mills died in the late '70s, Jones' son, Mark Woodward, became the singer's manager. The change in management prompted Jones to begin recording again. This time, he concentrated on the country market, releasing a series of slick Nashville-styled country-pop albums in the early '80s that earned him a handful of hits.\n\nJones' next image makeover came in 1988, when he sang Prince's &quot;Kiss&quot; with the electronic dance outfit, the Art of Noise. The single became a Top Ten hit in the U.K. and reached the American Top 40, which led to a successful concert tour and a part in a recording of Dylan Thomas' voice play, Under Milk Wood. The singer then returned to the club circuit, where he stayed for several years. In 1993, Jones performed at the Glastonbury Festival in England, where he won an enthusiastic response from the young crowd. Soon, he was on the comeback trail again, releasing the alternative dance-pop album The Lead and How to Swing It in the fall of 1994; the record was a moderate hit, gaining some play in dance clubs.\n\nReview by Carlo Wolff\n\nIt had been six years since Tom Jones released his last stateside record, but this one scored big in England and on the Continent, for good reason. Ultra-modern and topical, Reload suggests you can easily ignore Jones' &quot;What's New Pussycat?&quot; past. Not only does Jones deliver one of the more invigorating workings of modern pop here, his selection of material and choice of mates prove that in addition to his routinely extraordinary performances, he's still recording quite potently, thank you. Like 1994's underrated &quot;The Lead and How To Swing It,&quot; a lesser seller from the Interscope label, &quot;Reload&quot; finds Tom in collaborative mode. But where The Lead stressed original tunes and producer chops (everyone from Teddy Riley to Flood to Trevor Horn weighed in), Reload focuses on contemporary artists and cover songs. The artists are a motley, and very talented, crew indeed. Jones more than holds his own, turning the tunes into unusually personal and expressive vehicles. Jones launches the disc with Talking Heads' &quot;Burning Down the House,&quot; working it brisk and funky with the Cardigans and lending David Byrne's opaque lyrics a fresh vigor. Then, with Stereophonics, he resurrects Randy Newman's &quot;Mama Told Me Not to Come,&quot; refreshing the Three Dog Night chestnut with unexpected lasciviousness. The selections are as peculiar as they are successful, spanning &quot;Sometimes We Cry&quot; (a sparsely arranged duet with Van Morrison), a sharp interpretation of Iggy Pop's &quot;Lust for Life&quot; with Chrissie Hynde's Pretenders, and a fruity, truly bizarre take on the George Baker Selection's &quot;Little Green Bag&quot; with Barenaked Ladies. Jones probably doesn't do knee drops anymore, but he sure as hell does vocal swoops; check out &quot;Ain't That a Lot of Love&quot; with Simply Red's Mick Hucknall or his resurrection of Fine Young Cannibals' &quot;She Drives Me Crazy&quot; with Zucchero for throat acrobatics. Jones is in the uncomfortable position of being a retro novelty, and although he may not ignite the U.S. charts anymore (his last notable effort here was his great collaboration with the Art of Noise on the Prince tune &quot;Kiss,&quot; in 1988), his music is as contemporary and driving as ever","torrent":{"xt":"urn:btih:4e6502dc454276a5ba5488a71aa5d8f01b763758","amp;dn":"Tom+Jones+-+Reload+-+%282000%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e6502dc454276a5ba5488a71aa5d8f01b763758","infoHashBuffer":{"type":"Buffer","data":[78,101,2,220,69,66,118,165,186,84,136,167,26,165,216,240,27,118,55,88]},"announce":[],"urlList":[]}}