{"title":"The Taking of Pelham One Two Three 1974 Walter Matthau, Robert S","uid":3679402,"size":732915712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4ea8cf6de6880be25ab9f38a87bd3fac371c348a&amp;dn=The+Taking+of+Pelham+One+Two+Three+1974+Walter+Matthau%2C+Robert+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"mike18xx","files":1,"time":1178181527,"description":"resolution: 640x272 (2.35:1) fps: 23.98\nvideo codec: XviD, bitrate: 882.48 kbit/s\naudio codec: mp3, 112 kbit/s, channels: 2, 48.000 kHz\n\nPlot Synopsis by Bruce Eder (allmovie.com):\n\nOn a quiet mid-day in New York, along the Lexington Avenue subway line, the train designated &quot;Pelham One Two Three&quot; -- so named for its station-of-origin and time of departure -- makes its way down the East Side of Manhattan. One by one, three men board the train and at 28th Street a fourth man approaches the motorman (James Broderick) and points a pistol at him, ordering him to unlock the door to his cab and admit the man waiting there; meanwhile, another man points a gun at the conductor and threatens to kill him unless he holds the doors open and then closes them when the man talking to the motorman is aboard.\n\nOnce on board, &quot;Mr. Blue&quot; (Robert Shaw) and &quot;Mr. Green&quot; (Martin Balsam) halt the train between stations, while &quot;Mr. Brown&quot; (Earl Hindeman) and &quot;Mr. Gray&quot; (Hector Elizondo) seal off the lead car. With Mr. Green at the controls, the front car is separated and isolated in the tunnel with 17 passengers aboard, and then Mr. Blue presents their demands over the radio -- one million dollars in cash, within one hour, or they will start shooting one passenger each minute.\n\nOn the other end, Transit Police Lieutenant Zachary Garber (Walter Matthau) must overcome his initial disbelief to deal with this threat, amid the confusion of a subway system that&amp;#039;s chaotic even when it&amp;#039;s running normally. With the mayor reluctantly aboard to pay the ransom, Garber must keep the hijackers from carrying out their threat while the money is transported, and keep the hotheads around him and on the police force under control -- and figure out how they intend to get away with a million dollars from inside a subway tunnel with police on all sides.\n\nThe action is fast and furious but never confusing, with director Joseph Sargent, photographer Owen Roizman, and editors Gerald Greenberg and Robert Q. Lovett all combining to create a closely interwoven, briskly-paced account of split-second interlocked and overlapping action, which locks together like the dialogue in a Howard Hawks movie and is every bit as intense and engrossing, leavened by carefully placed, totally naturalistic moments of gallows humor.","torrent":{"xt":"urn:btih:4ea8cf6de6880be25ab9f38a87bd3fac371c348a","amp;dn":"The+Taking+of+Pelham+One+Two+Three+1974+Walter+Matthau%2C+Robert+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ea8cf6de6880be25ab9f38a87bd3fac371c348a","infoHashBuffer":{"type":"Buffer","data":[78,168,207,109,230,136,11,226,90,185,243,138,135,189,63,172,55,28,52,138]},"announce":[],"urlList":[]}}