{"title":"Lyle Blackburn - The Beast of Boggy Creek- The True Story [Epub ","uid":10718866,"size":5442328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50984e562968ba9deaf285f7723336c6a0c93261&amp;dn=Lyle+Blackburn+-+The+Beast+of+Boggy+Creek-+The+True+Story+%5BEpub+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"krystine","files":-1,"time":1407448695,"description":"The Beast of Boggy Creek: The True Story of the Fouke Monster by Lyle Blackburn\n\n\n\nFor more than a century, reports of a strange beast known as the Fouke Monster have circulated among the locals in southern Arkansas. Described as a large, hairy man-like creature, it's said to haunt the vast Sulphur River Bottoms as it travels the secluded waterway known as Boggy Creek. Over the years, the creature has been seen by numerous witnesses including respected citizens, experienced hunters, famous musicians, and even a police officer. The encounters were often so shocking, they served as inspiration for the classic horror film, &quot;The Legend of Boggy Creek,&quot; by Charles B. Pierce. Tales of the creature have long existed in scattered pieces across news clippings, memoirs, police reports, and movies, but it is only now that the complete history of the Fouke Monster has been assembled in one place. This book collects all the facts, theories, and amazing sighting reports, and weaves them into a fascinating tale about this undeniable southern mystery, one that lives on, as frightening encounters with the Beast of Boggy Creek are still being reported today!\n\nGrowing up in Texas, Lyle Blackburn became fascinated with the legends, lore, and sighting reports of alleged real-life monsters. He is a frequent contributor and cryptozoology advisor to Rue Morgue magazine, one of the leading horror media publications in print today. He is also the founder and frontman for the rock band Ghoultown. Over the last decade, Ghoultown has released six albums, toured extensively in both the U.S. and Europe, and has appeared on several horror movie soundtracks. Lyle currently lives near Dallas, Texas, where he enjoys a day off now and then.\n\nGenre: Horror | Mystery","torrent":{"xt":"urn:btih:50984e562968ba9deaf285f7723336c6a0c93261","amp;dn":"Lyle+Blackburn+-+The+Beast+of+Boggy+Creek-+The+True+Story+%5BEpub+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50984e562968ba9deaf285f7723336c6a0c93261","infoHashBuffer":{"type":"Buffer","data":[80,152,78,86,41,104,186,157,234,242,133,247,114,51,54,198,160,201,50,97]},"announce":[],"urlList":[]}}