{"title":"Hidden Secrets - Part 41- The New Atlantis - 2 of 4","uid":12222865,"size":2585017284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50fa9f63239ac570eaff56e57bd70d451a5ca7ca&amp;dn=Hidden+Secrets+-+Part+41-+The+New+Atlantis+-+2+of+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"POtHS11","files":89,"time":1439393897,"description":"Secret Mysteries of America's Beginnings: The New Atlantis\n\n\n Throughout recorded history, mankind has dreamt of building the perfect society, an empire that might somehow satisfy the needs of every man. An ancient legend casts the shadows of one such society that is said to have existed long ago. Twenty-five hundred years ago, the Greek philosopher, Plato, set down a dialogue called the Critias. He recounted the story of an ancient Greek poet and statesman named Solon. Solon had journeyed to Egypt in search of wisdom to help the government of his beloved Greece.\n\nThe Greeks had been beset with factions and troubles, so Solon took counsel from the priests of the city of Sais. An old priest told him, &quot;Oh, Solon. Solon! You Greeks are never anything but children. There is no old opinion handed down among you nor any science that is white with age.&quot; The old priest then proceeded to tell him the story of the lost city of Atlantis. In the centuries that would follow, scholars and researchers have debated whether Plato's Atlantis was intended to be an account of real history or simply an allegorical myth. Some even suggest that Atlantis was really the Antediluvian World, the wicked society destroyed by the wrath of God in the great flood of Noah.\n\nIn the 20th century, Plato's account was further supported by a Masonic philosopher, Manly P. Hall. Hall claimed that Atlantis had once been a vast and mighty empire that extended to the whole world, a philosophic commonwealth of nations that one day was destined to be rebuilt, but who would rebuild it, and exactly who was Manly P. Hall? Hall authored over 200 books and is said to have given some 8000 lectures on ancient philosophy. He is perhaps most remembered for his contribution to the mysterious brotherhood of Masonry. Upon his death in 1990, the Scottish Rite Journal, a Masonic publication, noted that he was often called &quot;Masonry's greatest philosopher.&quot; Among his teachings was that contained in Masonry and all the secret orders was the ancient wisdom of lost Atlantis.\n\nHall wrote that for more than 3000 years, secret societies had been laboring to create a background of knowledge necessary to an establishment of an enlightened democracy among the nations of the world. According to Hall, these societies could be traced back to ancient Egypt and had, for centuries, known of a secret place hidden from the eyes of common men, a place that would one day be revealed.\n\nIn the 17th century, as settlers were colonizing the new world, Sir Francis Bacon, the leader of secret societies in England, set down his classic work, the &quot;New Atlantis&quot;, while archaeologists and treasure hunters had searched the globe, looking for the lost continent. Four hundred years ago, Bacon, like many of his contemporaries, believed that Atlantis was America itself","torrent":{"xt":"urn:btih:50fa9f63239ac570eaff56e57bd70d451a5ca7ca","amp;dn":"Hidden+Secrets+-+Part+41-+The+New+Atlantis+-+2+of+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50fa9f63239ac570eaff56e57bd70d451a5ca7ca","infoHashBuffer":{"type":"Buffer","data":[80,250,159,99,35,154,197,112,234,255,86,229,123,215,13,69,26,92,167,202]},"announce":[],"urlList":[]}}