{"title":"Busta Rhymes &amp; Mariah Carey - I Know What You Want","uid":4682157,"size":165036036,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5125052b10e0791ad6f6e8bff1a04cd53673226c&amp;dn=Busta+Rhymes+%26+Mariah+Carey+-+I+Know+What+You+Want&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1233109623,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nBusta Rhymes &amp; Mariah Carey feat. Flipmode Squad - I Know What You Want \n\nThis video has no logos.\n\n\n&quot;I Know What You Want&quot; is a song written by rapper Busta Rhymes, and produced by Rick Rock for Rhymes' eighth album It Ain't Safe No More (2002). It is a duet with American singer Mariah Carey, and was co-written by Rah Digga, R. McNaire, R. Thomas and Spliff Star. It also includes a rap from Rhymes' group, the Flipmode Squad: Spliff Star, Baby Sham, Rah Digga, and Rampage.\n\nIt was released as the second single from It Ain't Safe No More in 2003 and was a major hit across the world, peaking at number three in the United States, Australia, and the United Kingdom. It was a big hit for Rhymes, whose previous single, &quot;Make It Clap&quot;, had failed to reach the top forty on the U.S. Billboard Hot 100 chart. &quot;I Know What You Want&quot; stayed in the top forty for twenty-one weeks, and was ranked seventeenth on the Hot 100 2003 year-end chart. For Carey, it was a return to form after a string of unsuccessful singles, and it became one of her biggest hits in years. Columbia Records later included it on her thirteenth album The Remixes (2003).\n\nWhen the song was released, it was rumoured that Mariah Carey was set to tour the Philippines for the very first time, as part of her Charmbracelet World Tour. As radio airplay became excited, the probability of Carey's visit to the country lessened as it was believed that the idea of a Philippine leg of the tour was scrapped. This was said to be the reason why the song peaked only at the number three position, despite having an outstanding amount of radio airplay at that time. By October, news surfaced that Mariah Carey had set a date in her website stating her concert would push through on November 16. Since &quot;I Know What You Want&quot; had sudsided at this point, her single &quot;Bringin' On The Heartbreak&quot; skyrocketed towards the number one position by November, in lieu of Carey's arrival. The extreme reception of this single boosted Charmbracelet's album sales, which was sold in a repackaged format.\n\nThe single's video, directed by Chris Robinson, features Busta Rhymes, the Flipmode Squad, and Carey lounging around an expensive mansion as they debate whether they &quot;know what they want&quot;. Carey advertises her own brand of jewelry, Automatic Princess.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:5125052b10e0791ad6f6e8bff1a04cd53673226c","amp;dn":"Busta+Rhymes+%26+Mariah+Carey+-+I+Know+What+You+Want","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5125052b10e0791ad6f6e8bff1a04cd53673226c","infoHashBuffer":{"type":"Buffer","data":[81,37,5,43,16,224,121,26,214,246,232,191,241,160,76,213,54,115,34,108]},"announce":[],"urlList":[]}}