{"title":"Prophecy and the Muslim Anti Christ-Walid Shoebat mp4","uid":11008673,"size":46605535,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:512f4f6acce00d8074ac8608535e07cb3b9ca6ce&amp;dn=Prophecy+and+the+Muslim+Anti+Christ-Walid+Shoebat+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eboneezer","files":-1,"time":1410296554,"description":"Produced by: CleanTV Runtime:1:16 I reduced the Video Quality of this lecture, to a minimum so its a faster download. I felt the Mesg. of the video was much more important to Hear. The commentator\n\nWalid Shoebat is a Palestinian American Christian who converted from Islam. Shoebat claims to be a former &quot; Palestinian Liberation Organization terrorist&quot;\nMillions of American evangelicals believe that the Antichrist will rise from Europe from a 'born again' Roman Empire, as depicted in the immensely popular Left Behind book series. \n\nBut what most people don't know is that the Muslim Bible and Islamic Prophecy also predicts the coming of a person fitting nearly that identical description: The Madhi, the Muslim Messiah! How can this be? \n\nWalid Shoebat is a scholar of both Islamic and Christian religions and he does not believe the Antichrist will rise from Europe. Rather, he teaches in this video that the Antichrist will arise from Turkey in resurgence of the Ottoman Empire. \n\nView the documentary, &quot;Bible Prophecy and the Coming Muslim anti-Christ&quot; by Walid Shoebat and decide for yourself. Your life may never be the same again.","torrent":{"xt":"urn:btih:512f4f6acce00d8074ac8608535e07cb3b9ca6ce","amp;dn":"Prophecy+and+the+Muslim+Anti+Christ-Walid+Shoebat+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"512f4f6acce00d8074ac8608535e07cb3b9ca6ce","infoHashBuffer":{"type":"Buffer","data":[81,47,79,106,204,224,13,128,116,172,134,8,83,94,7,203,59,156,166,206]},"announce":[],"urlList":[]}}