{"title":"Wii 4 PC Ã‚Â» RESIDENT EVIL ZERO perfect emulator iso by globe@","uid":5623975,"size":3218894656,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5164fd0067d1cdd7c7e57b694ae862969d9bddd7&amp;dn=Wii+4+PC+%C3%82%C2%BB+RESIDENT+EVIL+ZERO+perfect+emulator+iso+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"globeplus","files":-1,"time":1276393691,"description":"* Hello Wii and PC great games fans ...\n\n\n* Play this great exclusive wii and gamecube resident evil game ...\n\n\n* FILE INFO :  videos worked a little bit with perfect gameplay in the emulator \n\n\n* watch the intro presentation of the game in the next link :\n\nhttp://\nwww.dailymotion\n.com/video/xdnl0j_\nresidentevilzero_videogames\n\n(copy in succession the link then paste to the address bar then click ok) \n\n\n* STORY : [text extracted from wikipedia] *\n\nOn July 23, 1998, STARS Bravo team is sent in to investigate a series of grisly murders in the Arklay Mountains region outside of Raccoon City. On the way to the scene, Bravo's helicopter malfunctions and is forced to crash land in the forest. The team soon discover an overturned military police transport truck, along with the mutilated corpses of two officers. The team split up and Bravo team's field medic, Rebecca Chambers, finds a train stopped in the middle of the forest; the Ecliptic Express.\n\nSoon after, she discovers that it is infested with zombies. After a little exploration, she teams up with the man the military police were escorting to his execution; former Marine Billy Coen and the two explore the remaining train compartments whilst combating the zombies, swarms of strange leeches, and a mutated scorpion.\n\nAs the train begins speeding out of control towards a cliff, the two manage to apply the brakes and divert its course towards an abandoned research and training center. They investigate the underground facility, being forced to defeat the Umbrella Corporation's experiments; mutated insects, spiders and primates. During their navigation, Coen reveals that his unit was forced to kill the innocent civilians of an African village in the midst of a civil war against his wishes, and he soon found that their actions were based on false information.\n\nThey discover that the former operator of the facility James Marcus, along with Ozwell E. Spencer and Edward Ashford, discovered the Progenitor virus which, when combined with the ebola virus, created a strain that, despite being photosensitive, caused rapid mutations. Ashford originally wanted to use the virus to help the handicapped through its regenerative effects, but after his death Spencer and Marcus began research on its applications for bio-weapons, combining it with leech DNA which eventually led to the formation of the t-virus. After a showdown with a gigantic bat inside a church, Coen is attacked by a t-virus infected primate and becomes lost inside an underground laboratory. While searching for him, Chambers meets Enrico Marini and fights a released Tyrant before finding Coen washed up on a walkway. After fighting the Tyrant together, the two eventually meet Marcus. It is revealed that both Wesker and William Birkin were oblivious to the cause of the outbreak in both the Ecliptic Express and the mansion, and that the real culprit was Marcus, an employee of Umbrella who operated the facility until his assassination by Wesker and Birkin, on the orders of Spencer. During his dying moments, his pet queen leech entered his body and reproduced exponentially over ten years to absorb his DNA and memories to bring him back to life. Marcus proceeds to split into a mass of leeches, before chasing Chambers and Coen through the facility.\n\nBirkin activates the self-destruct system as the Queen Leech, Chambers, and Coen continue to fight. After being injured due to a brief exposure to sunlight, the monster is paralysed when the overhead entrance to the laboratory is opened just as the sun rises. Chambers throws Coen a revolver and he delivers the final shot to the Queen Leech.\n\n\n\n\n\n\n\n\n                                  ***** enjoy ... *****\n","torrent":{"xt":"urn:btih:5164fd0067d1cdd7c7e57b694ae862969d9bddd7","amp;dn":"Wii+4+PC+%C3%82%C2%BB+RESIDENT+EVIL+ZERO+perfect+emulator+iso+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5164fd0067d1cdd7c7e57b694ae862969d9bddd7","infoHashBuffer":{"type":"Buffer","data":[81,100,253,0,103,209,205,215,199,229,123,105,74,232,98,150,157,155,221,215]},"announce":[],"urlList":[]}}