{"title":"Late Victorian Gothic Tales (Oxford World's Classics)","uid":8976288,"size":1547600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:518928cfd36029e37527a938a8a48c9282057462&amp;dn=Late+Victorian+Gothic+Tales+%28Oxford+World%27s+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1380450852,"description":"The Victorian fin de siecle has many associations: the era of Decadence, The Yellow Book, the New Woman, the scandalous Oscar Wilde, the Empire on which the sun never set. This heady brew was caught nowhere better than in the revival of the Gothic tale in the late Victorian age, where the undead walked and evil curses, foul murder, doomed inheritance and sexual menace played on the stretched nerves of the new mass readerships. This anthology collects together some of the most famous examples of the Gothic tale in the 1890s, with stories by Arthur Conan Doyle, Vernon Lee, Henry James and Arthur Machen, as well as some lesser known yet superbly chilling tales from the era. The introduction explores the many reasons for the Gothic revival, and how it spoke to the anxieties of the moment.\n\nAbout the Series: For over 100 years Oxford World's Classics has made available the broadest spectrum of literature from around the globe. Each affordable volume reflects Oxford's commitment to scholarship, providing the most accurate text plus a wealth of other valuable features, including expert introductions by leading authorities, voluminous notes to clarify the text, up-to-date bibliographies for further study, and much more.","torrent":{"xt":"urn:btih:518928cfd36029e37527a938a8a48c9282057462","amp;dn":"Late+Victorian+Gothic+Tales+%28Oxford+World%27s+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"518928cfd36029e37527a938a8a48c9282057462","infoHashBuffer":{"type":"Buffer","data":[81,137,40,207,211,96,41,227,117,39,169,56,168,164,140,146,130,5,116,98]},"announce":[],"urlList":[]}}