{"title":"Burden R. L. and Faires J. D. Numerical Analysis Ninth ( 9th ) E","uid":8587918,"size":15231115,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51b464a359c20609365f249b3127a5db52dbc1c1&amp;dn=Burden+R.+L.+and+Faires+J.+D.+Numerical+Analysis+Ninth+%28+9th+%29+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cancel-","files":-1,"time":1371573658,"description":"# Hardcover: 895 pages\n# Publisher: Richard Stratton; 9th Edition\n# Language: English\n# ISBN-10: 0-538-73351-9\n# ISBN-13: 978-0-538-73351-9\n\n\nProduct Description:\n\nThis well-respected text gives an introduction to the modern approximation techniques and explains how, why, and when the techniques can be expected to work. The authors focus on building students' intuition to help them understand why the techniques presented work in general, and why, in some situations, they fail. With a wealth of examples and exercises, the text demonstrates the relevance of numerical analysis to a variety of disciplines and provides ample practice for students. The applications chosen demonstrate concisely how numerical methods can be, and often must be, applied in real-life situations. In this edition, the presentation has been fine-tuned to make the book even more useful to the instructor and more interesting to the reader. Overall, students gain a theoretical understanding of, and a firm basis for future study of, numerical analysis and scientific computing. A more applied text with a different menu of topics is the authors' highly regarded NUMERICAL METHODS, Third Edition.\n\n\nAbout the Authors:\n\nRichard L. Burden is a Professor of Mathematics at Youngstown State University. His research interests include numerical linear algebra and numerical solution of partial differential equations.\n\nJ. Douglas Faires is a Professor of Mathematics at Youngstown State University. His research interests include analysis, numerical analysis, and mathematics history. Dr. Faires has won many awards, including Outstanding College-University Teacher of Mathematics, Ohio Section of MAA (1996) and Youngstown State University, Distinguished Professor for Teaching (1995-1996).\t\t","torrent":{"xt":"urn:btih:51b464a359c20609365f249b3127a5db52dbc1c1","amp;dn":"Burden+R.+L.+and+Faires+J.+D.+Numerical+Analysis+Ninth+%28+9th+%29+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51b464a359c20609365f249b3127a5db52dbc1c1","infoHashBuffer":{"type":"Buffer","data":[81,180,100,163,89,194,6,9,54,95,36,155,49,39,165,219,82,219,193,193]},"announce":[],"urlList":[]}}