{"title":"The Dangerous Passion (mobi, epub, pdf)","uid":6565274,"size":2147336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51e64502b787cc7fac388b6b24e68cef8e5e6979&amp;dn=The+Dangerous+Passion+%28mobi%2C+epub%2C+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Paul-ish","files":-1,"time":1311657925,"description":"Why do men and women cheat on each other? How do men really feel when their partners have sex with other men? What worries women more -- men who turn to other women for love or men who simply want sexual variety in their lives? Can the jealousy husbands and wives experience over real or imagined infidelities be cured? Should it be? In this surprising and engaging exploration of men's and women's darker passions, David Buss, acclaimed author of The Evolution of Desire, reveals that both men and women are actually designed for jealousy. Drawing on experiments, surveys, and interviews conducted in thirty-seven countries on six continents, as well as insights from recent discoveries in biology, anthropology, and psychology, Buss discovers that the evolutionary origins of our sexual desires still shape our passions today.\n\nAccording to Buss, more men than women want to have sex with multiple partners. Furthermore, women who cheat on their husbands do so when they are most likely to conceive, but have sex with their spouses when they are least likely to conceive. These findings show that evolutionary tendencies to acquire better genes through different partners still lurk beneath modern sexual behavior. To counteract these desires to stray -- and to strengthen the bonds between partners -- jealousy evolved as an early detection system of infidelity in the ancient and mysterious ritual of mating.\n\nBuss takes us on a fascinating journey through many cultures, from pre-historic to the present, to show the profound evolutionary effect jealousy has had on all of us. Only with a healthy balance of jealousy and trust can we be certain of a mate's commitment, devotion, and true love.\n &lt;a href=&quot;\nhttp://www.amazon.com/The-Dangerous-Passion-ebook/dp/B000FBJHOE/ref=sr_1_2?ie=UTF8&amp;qid=1311649981&amp;sr=8-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Dangerous-Passion-ebook/dp/B000FBJHOE/ref=sr_1_2?ie=UTF8&amp;qid=1311649981&amp;sr=8-2&lt;/a&gt;","torrent":{"xt":"urn:btih:51e64502b787cc7fac388b6b24e68cef8e5e6979","amp;dn":"The+Dangerous+Passion+%28mobi%2C+epub%2C+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51e64502b787cc7fac388b6b24e68cef8e5e6979","infoHashBuffer":{"type":"Buffer","data":[81,230,69,2,183,135,204,127,172,56,139,107,36,230,140,239,142,94,105,121]},"announce":[],"urlList":[]}}