{"title":"Dick: A Guide to the Penis for Men and Women{BBS}","uid":6661279,"size":749394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52368b987754ad69b92368b10ec1b020fd0ee357&amp;dn=Dick%3A+A+Guide+to+the+Penis+for+Men+and+Women%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315516454,"description":"Everything you could possibly want to know about the &quot;crown jewels&quot;, but were afraid to ask, including why men so fond of their most prized possession, how it works and what to do when it doesn't. Although they might be quick with jokes, men are often reluctant to discuss their penis and might not have accurate information about it. This is an accurate but accessible and entertaining manual written for both men and women. The authors explain everything from what it's called, to the anatomy and physiology of the penis: size, shape, function, circumcision, hygiene, hormones and contraception. They explain what can go wrong - sexually transmitted diseases, infertility, premature ejaculation, impotence and cancer - and provide useful information on how to avoid and deal with these nasties. They uncover the myths of male sexuality, and poke fun at the names we call it and the things it does. The book presents the facts in a manner easily accessible and relevant to all ages, and answers questions men and women are often too embarrassed to ask.\n","torrent":{"xt":"urn:btih:52368b987754ad69b92368b10ec1b020fd0ee357","amp;dn":"Dick%3A+A+Guide+to+the+Penis+for+Men+and+Women%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52368b987754ad69b92368b10ec1b020fd0ee357","infoHashBuffer":{"type":"Buffer","data":[82,54,139,152,119,84,173,105,185,35,104,177,14,193,176,32,253,14,227,87]},"announce":[],"urlList":[]}}