{"title":"MAXOPHONE - 1975 - Maxophone (Rock Progressivo Italiano)","uid":5633966,"size":326787000,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5256f8ea7bf5a464057bd19dc4cb7a6705fa4cd6&amp;dn=MAXOPHONE+-+1975+-+Maxophone+%28Rock+Progressivo+Italiano%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lonesomecowboy","files":-1,"time":1276806035,"description":"M A X O P H O N E\n - 1975 - Maxophone -\n\nAlthough less popular than other mainstream Italian prog rock groups, MAXOPHONE achieved a late cult status among prog rock fans because of their well crafted music, solid musical expertise and precisely cut arrangements. As a well coordinated six piece ensemble, MAXOPHONE sits in the prog rock arena covering the gap between the clattering edge of groups like KING CRIMSON, the folky roots of JETHRO TULL and the more elaborated Canterbury sound. MAXOPHONE had a twin-fold soul: half of the members had classic music background while the other half had a solid rock background. This weird combination appears clearly in some songs, where very non-rock instruments, such as horn, clarinet, trumpet and vibraphone are used in a very balanced way together with Fripp-esque guitars and electrical piano. After one year rehearsal work, in 1975, MAXOPHONE issued their only LP record, the homonymous MAXOPHONE, which aged pretty well, sounding fresh today as 30 year ago.\n\nAlthough MAXOPHONE may sometime blink an eye to melodic rock, they never forget to surprise the listener, nicely standing repeated listening. Their music shows surfacing influences from Greg LAKE, Robert FRIPP, ELP, KING CRIMSON, GENTLE GIANT, NATIONAL HEALTH, PFM, BANCO and Yes among the others. Their most renown feature is to change the music mood from pastoral to rock to classical within the same song without losing listening momentum. After the publication of the homonymous LP, they recorded a pop pier single, whose side A and B songs are both included as bonus tracks in the CD version of MAXOPHONE.  \n\nA clear must for all Italian prog rock lovers.\n\n: : : Ludovico Vecchione, ITALY : : :\n(from http://www.progarchives.com/artist.asp?id=239)","torrent":{"xt":"urn:btih:5256f8ea7bf5a464057bd19dc4cb7a6705fa4cd6","amp;dn":"MAXOPHONE+-+1975+-+Maxophone+%28Rock+Progressivo+Italiano%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5256f8ea7bf5a464057bd19dc4cb7a6705fa4cd6","infoHashBuffer":{"type":"Buffer","data":[82,86,248,234,123,245,164,100,5,123,209,157,196,203,122,103,5,250,76,214]},"announce":[],"urlList":[]}}