{"title":"The Way of Trust and Love: A Retreat Guided by St. Therese","uid":15687573,"size":952512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52630911e91b4a256f7863697227d62964859e75&amp;dn=The+Way+of+Trust+and+Love%3A+A+Retreat+Guided+by+St.+Therese&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"catholicstuff","files":3,"time":1472359616,"description":"Fr. Jacques Philippe - The Way of Trust and Love: a Retreat Guided by St. Thérèse of Lisieux (EPUB, MOBI, PDF)\r\n\r\nSt. Thérèse of Lisieux sought a new way to Heaven: &quot;a little way that is quite straight, quite short: a completely new little way.&quot; Blessed with personal limitations that might have discouraged another, Thérèse believed God would not have given her a desire for holiness if He did not intend for her to achieve it. She learned to humbly accept herself as she was and trust completely in God's love. First given as a retreat by renowned author Father Jacques Philippe, The Way of Trust and Love navigates excerpts of St. Thérèse's writings phrase by phrase, extracting powerful, resonating insights. To Thérèse, the journey seemed &quot;little&quot; as she traveled it. A hundred and fifteen years after her death, the message of the young saint and Doctor of the Church has traveled around the world inspiring millions. With this newly translated study of her spirituality, many today will rediscover-or find for the first time-the relevance of &quot;the little way,&quot; in all seasons of life. Fr. Jacques Philippe is well-known for his books on prayer and spirituality. A member of the Community of the Beatitudes, he regularly preaches retreats in France and abroad. He also spends much of his time giving spiritual direction and working for the development of the Community in Asia and Oceania where he travels frequently.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:52630911e91b4a256f7863697227d62964859e75","amp;dn":"The+Way+of+Trust+and+Love%3A+A+Retreat+Guided+by+St.+Therese","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52630911e91b4a256f7863697227d62964859e75","infoHashBuffer":{"type":"Buffer","data":[82,99,9,17,233,27,74,37,111,120,99,105,114,39,214,41,100,133,158,117]},"announce":[],"urlList":[]}}