{"title":"DEATH - A PHILOSOPHY COURSE (audiobook from Yale University)","uid":5970602,"size":438277531,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5298520f066c38eb8885a13364ecf4d91f1c85d3&amp;dn=DEATH+-+A+PHILOSOPHY+COURSE+%28audiobook+from+Yale+University%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skeptoidfan","files":-1,"time":1290266795,"description":"Death - Philosophy 176\n\nA philosophy course from Yale University, by professor Shelly Kagan.\n\nAudiobook lectures / MP3 VBR / proper ID3\n\n19 hours total playing time.\n\n------------------------------------------------------------------------------\n\n&quot;I believe this course is one of the most mind-opening experiences of my life.&quot;\n&quot;Great course. Wonderful professor. Fascinating subjects.&quot;\n&quot;The deepest thinking I've done in my life.&quot;\n\n------------------------------------------------------------------------------\n\nAbout the Course\n\nThere is one thing I can be sure of: I am going to die. But what am I to make of that fact? This course will examine a number of issues that arise once we begin to reflect on our mortality. The possibility that death may not actually be the end is considered. Are we, in some sense, immortal? Would immortality be desirable? Also a clearer notion of what it is to die is examined. What does it mean to say that a person has died? What kind of fact is that? And, finally, different attitudes to death are evaluated. Is death an evil? How? Why? Is suicide morally permissible? Is it rational? How should the knowledge that I am going to die affect the way I live my life?\n\n------------------------------------------------------------------------------\n\nSessions\n\n01. Course introduction\n02. The nature of persons: dualism vs. physicalism\n03. Arguments for the existence of the soul, Part I\n04. Introduction to Plato's Phaedo; Arguments for the existence of the soul, Part II\n05. Arguments for the existence of the soul, Part III: Free will and near-death experiences\n06. Arguments for the existence of the soul, Part IV; Plato, Part I\n07. Plato, Part II: Arguments for the immortality of the soul\n08. Plato, Part III: Arguments for the immortality of the soul (cont.)\n09. Plato, Part IV: Arguments for the immortality of the soul (cont.)\n10. Personal identity, Part I: Identity across space and time and the soul theory\n11. Personal identity, Part II: The body theory and the personality theory\n12. Personal identity, Part III: Objections to the personality theory\n13. Personal identity, Part IV; What matters?\n14. What matters (cont.); The nature of death, Part I\n15. The nature of death (cont.); Believing you will die\n16. Dying alone; The badness of death, Part I\n17. The badness of death, Part II: The deprivation account\n18. The badness of death, Part III; Immortality, Part I\n19. Immortality, Part II; The value of life, Part I\n20. The value of life, Part II; Other bad aspects of death, Part I\n21. Other bad aspects of death, Part II\n22. Fear of death\n23. How to live given the certainty of death\n24. Suicide, Part I: The rationality of suicide\n25. Suicide, Part II: Deciding under uncertainty\n26. Suicide, Part III: The morality of suicide and course conclusion\n\n-----------------------------------------------------------------------------\n\nThis version has been edited to give you the best quality and listening experience.\n\n-----------------------------------------------------------------------------\n\n\n\nQ U E S T I O N :\n\nBefore I download this I would like to know if it is pro/anti religion, or unbiased. Thanks.\n\n\nA N S W E R :\n\nThank you for a very good question!\n\nThe lecturer in this course acknowledges that people may have various religious beliefs about the nature of death, morality, afterlife and immortality, based upon what they read from scripture or learn from their family traditions. THAT IS NOT A SUBJECT OF THIS COURSE.\n\nThe subject of the course is to examine what we can say about the topic of death, souls, immortality, morality, personal identity and so on WITHOUT resorting to arguments based solely upon traditional beliefs or sources of &quot;divine revealed authority&quot;. Religion is in other words NOT a subject of this course AT ALL.\n\nThis is a philosophy course in the true sense of the word - based on unbiased thinking and reasoning and looking at difficult problems from multiple perspectives.\n\nWhat I really appreciate about this course is the way the lecturer works through the issues from both sides of the argument. And sometimes there are problems where we end up with arguments with more than two &quot;sides&quot; such as a body-view, a personality-view and a soul-view - all of which are examined in great detail. And we do not always end up with one side as the sole victor.\n\nBe prepared for some serious and mind opening thinking.\n\nBy the way, the professor lecturing is one of the most enthusiastic and clear spoken teachers I've ever heard, and luckily he also does have a good sense of humor.","torrent":{"xt":"urn:btih:5298520f066c38eb8885a13364ecf4d91f1c85d3","amp;dn":"DEATH+-+A+PHILOSOPHY+COURSE+%28audiobook+from+Yale+University%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5298520f066c38eb8885a13364ecf4d91f1c85d3","infoHashBuffer":{"type":"Buffer","data":[82,152,82,15,6,108,56,235,136,133,161,51,100,236,244,217,31,28,133,211]},"announce":[],"urlList":[]}}