{"title":"NubileFilms Sydney Cole Kamasutra 1080p","uid":13579677,"size":1028889735,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:535be19eb495c77e6bd1484c475b760fb0590d9f&amp;dn=NubileFilms+Sydney+Cole+Kamasutra+1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1455738286,"description":"NubileFilms Sydney Cole Kamasutra 1080p\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/kiP\r\n \nhttp://imgsnaps.com/image/kiR\r\n\r\nDescription:\r\n\r\nSydney Cole is lounging on the couch exploring the Kamasutra and warming herself up with lusty touches to her tits beneath her bra as she waits for Damon Dice. When he finally arrives, Sydney wastes no time in climbing onto his lap in full-on seduction mode as she aims to put to use all of her new sexual knowledge.\r\n\r\nHappy to be Sydney's test subject, Damon buries his face between Sydney's boobs to motorboat her tits before relieving her of her bra. From there, he is happy to lavish attention on each tender nipple with his hands and mouth to increase Sydney's pleasure and anticipation.\r\n\r\nSydney is eager to bring Damon to the same razor's edge that she's on, so she drops to her knees and pulls out his cock for a lusty blowjob. She isn't shy about taking Damon's whole dick in her mouth as far as she can go for an utterly enthusiastic cock sucking that only stops when Damon demands a turn at delivering some oral sex.\r\n\r\nAfter wetting down Sydney's snatch beneath her thong, Damon takes the time to find her clit and work it with a single finger. Holding Sydney's thong so that it is pressed to her most tender bits, Damon puts his mouth to work wetting her down. He only pulls the thong aside when it's time for him to indulge fully in the pussy feast that he craves.\r\n\r\nPeeling Sydney's thong off of her legs, Damon makes sure to stretch her opening by sliding two fingers deep into her tight twat in preparation for his dick. Finding her nice and ready, he stands up to replace his fingers with the cock that Sydney craves much to the blonde's pleasure.\r\n\r\nAfter a few minutes of enjoying Damon's long deep strokes on her back, Sydney switches things up and climbs onto her lover's lap. Sliding down on his cock with her back to Damon's chest, Sydney takes a moment to enjoy the fullness and then puts her hips to work bouncing and thrusting while Damon does the same beneath her. The result is a wild and crazy fuck fest that leaves Sydney screaming her sheer joy.\r\n\r\nOnce she has taken a moment to come down from her climax, Sydney goes back to work. With Damon's hand anchored at her lower back and his thumb stimulating her anus, Sydney bounces her booty in a rhythm that is utterly pleasing to them both. She only stops when Damon urges her to spoon with him so that he can take her in a position that lets them enjoy passionate kisses as they continue to fuck.\r\n\r\nWhen Damon flips Sydney onto her back once again, she knows that he's nearly ready to explode. Leaning forward with a smile, Sydney takes a blast of cum all over her cheeks in a facial that leaves her covered in her lover's jizz and knowing that they are both fully satisfied","torrent":{"xt":"urn:btih:535be19eb495c77e6bd1484c475b760fb0590d9f","amp;dn":"NubileFilms+Sydney+Cole+Kamasutra+1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"535be19eb495c77e6bd1484c475b760fb0590d9f","infoHashBuffer":{"type":"Buffer","data":[83,91,225,158,180,149,199,126,107,209,72,76,71,91,118,15,176,89,13,159]},"announce":[],"urlList":[]}}