{"title":"HISTORY OF POP AND ROCK MUSIC - part 540","uid":9378478,"size":590612875,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:536fb2d7a5c351e89814595fc34f4ff132689788&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+540&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1387666810,"description":"\n\n\n                  PART  540\n\n\n\n      FOUR SEASONS &amp; FRANKIE VALLI - December, 1963 (Oh, What A Night)(1975)\n      ROD STEWART - Tonight's The Night (1976) \n      PLAYER  -  Baby Come Back (1977)  \n \n\n\n                 &quot;December, 1963 (Oh, What a Night)&quot; is a hit single by The Four Seasons, written by original Four Seasons keyboard player Bob Gaudio and his future wife Judy Parker, produced by Gaudio, and included on the group's 1975 album, &quot;Who Loves You&quot;.The song features drummer Gerry Polci on lead vocals, with usual lead Frankie Valli singing the bridge sections and backing vocals.The single was released in December of 1975 and hit number one on the UK Singles Chart on February 21, 1976. It repeated the feat on the U.S. Billboard Hot 100 on March 13, 1976, remaining in the top spot for three weeks and one week on Cash Box. On April 10th of the same year, it topped the RPM National Top Singles Chart in Canada. New drummer Gerry Polci and bassist Don Ciccone shared lead vocals with long-time frontman Frankie Valli.\n\n                &quot;Tonight's the Night (Gonna Be Alright)&quot; is a song by Rod Stewart, recorded at Muscle Shoals Sound Studio in Muscle Shoals, Alabama for his 1976 album &quot;A Night on the Town&quot;. The song became his second US chart topper, peaked at #5 in UK, #3 in Australia and charted well in other parts of the world as well. The song features whispers from Britt Ekland who was Stewart's girlfriend at the time. The song has been remade by such artists as Linda Clifford, Nicky Moore, and sung by Anthony Kavanagh, Terry Steele, who reached number forty-four on the R&amp;B singles chart and Alison Crawford on Grease is the Word.The song was often included in Tina Turner's 1980s live set and features with another Rod Stewart song on her 'Nice n Rough' video.\n\n             &quot;Baby Come Back&quot; is a song by American rock group Player. It was released in October 1977 as the lead single from their self-titled second album of the same name. It was written by lead singer Peter Beckett and J.C. Crowley. The song was their biggest single, hitting number one on the Billboard Hot 100 and number 10 on the soul charts, in 1978. It was the breakthrough single for the band, gaining them mainstream success, and the only number-one hit of their career.","torrent":{"xt":"urn:btih:536fb2d7a5c351e89814595fc34f4ff132689788","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+540","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"536fb2d7a5c351e89814595fc34f4ff132689788","infoHashBuffer":{"type":"Buffer","data":[83,111,178,215,165,195,81,232,152,20,89,95,195,79,79,241,50,104,151,136]},"announce":[],"urlList":[]}}