{"title":"Sexually Broken--Fresh 18yr old southrn girl Mattie Borders  Mat","uid":8844460,"size":938700166,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:539466f6d301546aaebced234e13c87038f29cb6&amp;dn=Sexually+Broken--Fresh+18yr+old+southrn+girl+Mattie+Borders++Mat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1377339997,"description":"Fresh faced 18yr old southern girl Mattie Borders drilled deep by 10 inch BBC, helplessly squirts! | Mattie Borders | Matt Williams\n\nAugust 23, 2013 \n \n\nMP4 only. \n  \n \nJack Hammer has worked over our precocious little starlet Mattie Borders before, but this is the first time he gets a solo shot at her. Let's see what he does now that he has her all to himself, shall we? Jack has the best toy you could ask for: A fresh out of the box 18 year old slut that has been fantasizing for years about all of the cock she was going to get stuffed full of the second she became legal. Who is Jack to deny Mattie her dreams?\n\nThe barn is dark &amp; foreboding, packed with instruments of perversion and restraint. It does't exactly qualify as romantic. Which is fine by Jack, he isn't feeling very romantic. He strides in with his toy slung over his shoulder and quickly installs her into an antique milking frame. Today she is going to be throughly milked out for all the squirt and cum she has in her little holes. Mattie is bent over and helpless, both ends completely exposed to the massive dicking down she is about to endure.\n\nIt is one thing to fantasize about 10 inch dick, it is an entirely different thing to be face to face with a massive black fuckstick with no hope of escape. Jack trains the back of her tender throat until Mattie's eyes bulge. She chokes and gasps, eyes watering with the strain. We are showing her exactly what it mean to be a fuckpuppet for our pleasure. We can't ignore the pert little bottom on the other end of this little slut, and after his dick has been properly worshipped Jack slams his monster cock home up to the base, as Mattie moans and whimpers. She takes her training well, let's see what else this eager pussy can handle.\n\nA vibrator is added to the mix, and the combination has Mattie squirting almost instantly. She is helpless to stop the cum being ripped from her well-used hole. Bound and breathless, while standing in a puddle of her own cum is a good look on Mattie. This might be a toy Jack will keep for a while. Back and forth, he uses both her ends as he sees fit. When he has had his fill, he binds this filthy whore up to take her downstairs to the showers. After all, clean toys are the funnest to play with! \n\nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_23mborders3/SexuallyBroken-Mattie-Borders-Matt-Williams-Fresh-faced-18yr-old-southern-girl-Mattie-Borders-drilled-deep-by-10-inch-BBC-helplessly-squirts.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_23mborders3/SexuallyBroken-Mattie-Borders-Matt-Williams-Fresh-faced-18yr-old-southern-girl-Mattie-Borders-drilled-deep-by-10-inch-BBC-helplessly-squirts.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:539466f6d301546aaebced234e13c87038f29cb6","amp;dn":"Sexually+Broken--Fresh+18yr+old+southrn+girl+Mattie+Borders++Mat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"539466f6d301546aaebced234e13c87038f29cb6","infoHashBuffer":{"type":"Buffer","data":[83,148,102,246,211,1,84,106,174,188,237,35,78,19,200,112,56,242,156,182]},"announce":[],"urlList":[]}}