{"title":"Taking Liberties The War on Terror and the Erosion of American D","uid":9401251,"size":2925464,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5395cbd8adb64d545676f0a00b0970ae57198bc5&amp;dn=Taking+Liberties+The+War+on+Terror+and+the+Erosion+of+American+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":-1,"time":1388077115,"description":"In this eye-opening work, the president of the ACLU takes a hard look at the human and social costs of the War on Terror. Over a decade after 9/11, it is far from clear that the government's hastily adopted antiterrorist tactics--such as the Patriot Act--are keeping us safe, but it is increasingly clear that these emergency measures in fact have the potential to ravage our lives--and have already done just that to countless Americans. \nFrom the Oregon lawyer falsely suspected of involvement with terrorism in Spain to the former University of Idaho football player arrested on the pretext that he was needed as a &quot;material witness&quot; (though he was never called to testify), this book is filled with unsettling stories of ordinary people caught in the government's dragnet. These are not just isolated mistakes in an otherwise sound program, but demonstrations of what can happen when our constitutional protections against government abuse are abandoned. Whether it's running a chat room, contributing to a charity, or even urging a terrorist group to forego its violent tactics, activities that should be protected by the First Amendment can now lead to prosecution. Blacklists and watchlists keep people grounded at airports and strand American citizens abroad, although these lists are rife with errors--errors that cannot be challenged. National Security Letters allow the FBI to demand records about innocent people from libraries, financial institutions, and internet service providers without ever going to court. Government databanks now brim with information about every aspect of our private lives, while efforts to mount legal challenges to these measures have been stymied.","torrent":{"xt":"urn:btih:5395cbd8adb64d545676f0a00b0970ae57198bc5","amp;dn":"Taking+Liberties+The+War+on+Terror+and+the+Erosion+of+American+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5395cbd8adb64d545676f0a00b0970ae57198bc5","infoHashBuffer":{"type":"Buffer","data":[83,149,203,216,173,182,77,84,86,118,240,160,11,9,112,174,87,25,139,197]},"announce":[],"urlList":[]}}