{"title":"Fairground Attraction - Kawasaki Live in Japan [2003]  [FLAC]","uid":10548897,"size":571411855,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53b7418e7960bf08e739aee977fe32957a6d218a&amp;dn=Fairground+Attraction+-+Kawasaki+Live+in+Japan+%5B2003%5D++%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":-1,"time":1405317693,"description":"FLAC / Lossless / Log(100&amp;) /cue\nLabel/Cat#: BMG Japan / BVCM-31105 / Japanese 2 CD Edition\nCountry:japan\nYear: 2003\nGenre: pop,folk rock\nFormat: CD, Album,\n\n\n01. Winter Rose / Allelujah 4:30\n02. The Waltz Continues 3:37\n03. The Moon is Mine / Get Happy 6:02\n04. Don't Be a Stranger 3:28\n05. Dangerous 4:01\n06. I Know Why the Willow Weeps 6:14\n07. Home to Heartache 4:46\n08. Fear is the Enemy of Love 4:31\n09. Find My Love 6:15\n10. Broken by a Breeze 5:06\n11. Whispers 4:32\n12. Goodbye to Songtown 4:46\n13. Fairground Attraction 4:07\n14. Clare 6:05\n15. Perfect 6:13\n16. Moon on the Rain 4:02\n\nDisc 2\n01. Watching the Party 9:24\n\n\n\n\nJapanese double-disc edition of the live performance recording of Fairground Attraction in Kawasaki, Japan on the 2nd July 1989.\n\nThe performance contains 8 new songs meant to have appeared on the band's second album (which never got recorded) as well as 8 songs from The First of a Million Kisses, re-issued to coincide with the release of Kawasaki Live in Japan\n\nThe second bonus disc contains an over-9-minutes-long rendition of the band's original Watching the Party.\n\nAnyone who has ever had any question, let alone doubt, about the unique, soul-stirring qualities ofEddi Reader's wondrous singing has only to listen to this live album to be floored, and then converted. Recorded on Fairground Attraction's only tour of Japan while supporting their unexpected hit album,The First of a Million Kisses. Fairground Attraction were a pop group to be reckoned with in the live arena as well. Featuring all the hits from the first album, such as &quot;Winter Rose/Allelujah,&quot; &quot;Perfect,&quot; &quot;Find My Love,&quot; and &quot;Whispers,&quot; among others; all were performed in grand style, and recorded stunningly well. But more importantly, featured here are live renditions of eight songs never released by the band; they were being tried out in front of audiences before Fairground got into a studio to record their follow-up. The band imploded three days into it. While it's true that the songs on First of a Million Kissesbelied the band's relative inexperience as a touring unit, cuts like &quot;The Waltz Continues,&quot; &quot;Don't Be a Stranger,&quot; &quot;Home to Heartache,&quot; &quot;Broken by a Breeze,&quot; and &quot;Goodbye Songtown&quot; offer a view of the band in full possession of their strengths as instrumentalists and singers. Mark Nevin's later songs are even more adventurous, much more tight, and searingly heartfelt, than their predecessors, andReader's live singing is nothing short of inspirational. This is a must-have, not only for Fairground fans, but for those who live and breathe for flawless Celtic pop.","torrent":{"xt":"urn:btih:53b7418e7960bf08e739aee977fe32957a6d218a","amp;dn":"Fairground+Attraction+-+Kawasaki+Live+in+Japan+%5B2003%5D++%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b7418e7960bf08e739aee977fe32957a6d218a","infoHashBuffer":{"type":"Buffer","data":[83,183,65,142,121,96,191,8,231,57,174,233,119,254,50,149,122,109,33,138]},"announce":[],"urlList":[]}}