{"title":"Soulstorm MEGATRAINER by Cheathappens","uid":4628120,"size":991075,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:53f795147d6fd935f1701544fe1a930a4b4abf14&amp;dn=Soulstorm+MEGATRAINER+by+Cheathappens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Idelpenquin","files":1,"time":1231283175,"description":"Dawn of War: SoulStorm Trainer\n==============================\n\nPUBLIC RELEASE DATE: APRIL 15, 2008\n\n\nThis is for the original retail version!\n\nGET UPDATES FOR THIS TRAINER AT WWW.CHEATHAPPENS.COM\n\n\n\nUsing this Trainer\n------------------\nLaunch Trainer.  Launch Game.  Press F1 at main menu-\nListen for &quot;Trainer Activated.&quot;\n\n\n\nOptions\n-=-=-=-=\n\nNumpad 1 : Allow FOW\nNumpad 2 : Unlimited Requisition\nNumpad 3 : Unlimited Power\nNumpad 4 : No Population Cap\nNumpad 5 : Special Unit Powers\nNumpad 6 : Instant Units/Upgrades\nNumpad 7 : Unit Refills\nNumpad 8 : Instant Buildings\nF1 : Invincible Unit On\nF2 : Invincible Unit Off\nF3 : Soul Replenish\nF4 : Soul Drain\nNumpad 9 : Planetary Requisition\nNumpad .  : Complete WarGear\nNumpad + : Steal Technology \nNumpad 0 : Enemy Mind Control\nNumpad /  : Morale Manipulation\nNumpad * : Rapid Special Abilities\n\n\n\nNotes-\n-=-=-=-\n\nNumpad 1- Activate Menu for Fog Of War option. You can then Press the FOW button and then\n\tit's best to deactivate this for the remainder of the match.\n\nNumpad 2- Make Requisition Unlimited\n\nNumpad 3- Make Power Unlimited\n\nNumpad 4- Remove Unit Cap\n\nNumpad 5 : Special Unit Powers - Gives unlimited Soul Essence, Orc Waaaghh, and Sister's Faith.\n\nNumpad 6- Activate Instant Creation of Troops\n\nNumpad 7- Activate Instant Refill of Squad Spaces for Troops that have fallen.\n\nNumpad 8- Activate Instant Build of Buildings.  VERY IMPORTANT:  It is necessary to click twice on the space where the building is being built to make it build instantly, however you must wait until the builder has already begun building the structure.  If the unit is far away from the build site, you must wait until the unit is at the site and building before the second click.  This is the only way I could make it where the enemy doesn't get the same benefits.  Also, if you double click before the builder is at the building site, the building may not complete and you will have to destroy it.\n\nNumpad 9 : Planetary Requisition - Gives you unlimited Planetary Requisition for the Campaign mode.\n\nNumpad . : Complete WarGear - you must have at least 1 WarGear Point.  Access the WarGear screen and then press this option and you will be able to select all WarGear options.\n\nNumpad + : Steal Technology - Press this button to cycle through all the known Dawn of War factions technologies when you are building.  Create an army that is a mixture of many races and technologies!\n\nNumpad 0 : Enemy Mind Control - Selected Unit will be under your control when you have this option activated.\n\nNumpad /  : Morale Manipulation - Press once and you will increase the moral of the unit selected.  Press again and you will degrade the morale of the unit selected. Press again to turn it off.\n\nNumpad * : Rapid Special Abilities - While this option is activated you will notice that the unit special abilities recharge more quickly for many of the units and many of their special abilities.  May not work instantly or for all units.\n\nOptions F1-F4- These work on buildings and troops, both friendly and enemy!  Select the troop or units (you must select by clicking on the structure on unit with the mouse) and then press the associated key.  You cannot select units by dragging a box around them for this to work, you must select each unit/squad/building to apply these options to.  F1 and F2 toggle the invincibility of the unit.  F3 will instantly heal the unit and F4 will instantly drain the unit of life.\n\n\nThis trainer will allow you to customize the keys if you desire!  Use our\nTrainer Customizer to accomplish this! Download it from our trainer \ntroubleshooting page (link below).\n\n\nHaving trouble getting the trainer to work? Visit our forums at www.cheathappens.com\nand check out our TRAINER TROUBLESHOOTING GUIDE for helpful tips:\n &lt;a href=&quot;\nhttp://www.cheathappens.com/trainer_troubleshooting.asp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cheathappens.com/trainer_troubleshooting.asp&lt;/a&gt;\n\n==============================\n\nIf you want more trainers or mega trainer versions, when available, with more\noptions then visit us at WWW.CHEATHAPPENS.COM\n","torrent":{"xt":"urn:btih:53f795147d6fd935f1701544fe1a930a4b4abf14","amp;dn":"Soulstorm+MEGATRAINER+by+Cheathappens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f795147d6fd935f1701544fe1a930a4b4abf14","infoHashBuffer":{"type":"Buffer","data":[83,247,149,20,125,111,217,53,241,112,21,68,254,26,147,10,75,74,191,20]},"announce":[],"urlList":[]}}