{"title":"Black Sabbath/13 [2CD][2013][320KBPS][Japan SHM-CD][DE]","uid":11739287,"size":223618139,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5509fb9dfa6d67befb9da531c0994a53203429e3&amp;dn=Black+Sabbath%2F13+%5B2CD%5D%5B2013%5D%5B320KBPS%5D%5BJapan+SHM-CD%5D%5BDE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"LameDuck69","files":28,"time":1425703828,"description":"Black Sabbath - 13 [2 CD's][2013][Japan SHM-CD][DE]\n\n\n\nDisc 1:\n\n01. End of the Beginning\n02. God Is Dead?\n03. Loner \n04. Zeitgeist    \n05. Age of Reason \n06. Live Forever \n07. Damaged Soul\n08. Dear Father \n\nDisc 2:\n\n01. Methademic\n02. Peace of Mind \n03. Pariah\n--------------------------\n**320 KBPS CBR\n**Cover Art\n----------------------------------\nBlack Sabbath are an English rock band, formed in Birmingham in 1968, by guitarist and main songwriter Tony Iommi, bassist and main lyricist Geezer Butler, singer Ozzy Osbourne, and drummer Bill Ward. The band have since experienced multiple line-up changes, with guitarist Iommi being the only constant presence in the band through the years. Originally formed in 1968 as a blues rock band, the group soon adopted the Black Sabbath moniker and began incorporating occult themes with horror-inspired lyrics and tuned-down guitars. Despite an association with these two themes, Black Sabbath also composed songs dealing with social instability, political corruption, the dangers of drug abuse and apocalyptic prophecies of the horrors of war.\n\nOsbourne's regular abuse of drugs and alcohol led to his dismissal from the band in 1979. He was replaced by former Rainbow vocalist Ronnie James Dio. Following two albums with Dio, Black Sabbath endured countless personnel changes in the 1980s and 1990s that included vocalists Ian Gillan, Glenn Hughes, Ray Gillen and Tony Martin, as well as several drummers and bassists. In 1992, Iommi and Butler rejoined Dio and drummer Vinny Appice to record Dehumanizer. The original line-up reunited with Osbourne in 1997 and released a live album Reunion. Black Sabbath's 19th studio album, 13, which features all of the original members but Ward, was released in June 2013.\n\nBlack Sabbath are often cited as pioneers of heavy metal music. The band helped define the genre with releases such as Black Sabbath (1970), Paranoid (1970) and Master of Reality (1971). They were ranked by MTV as the &quot;Greatest Metal Band&quot; of all time, and placed second in VH1's &quot;100 Greatest Artists of Hard Rock&quot; list. Rolling Stone magazine ranked them number 85 in their &quot;100 Greatest Artists of All Time&quot;. They have sold over 70 million records worldwide. Black Sabbath were inducted into the UK Music Hall of Fame in 2005 and the Rock and Roll Hall of Fame in 2006. They have also won two Grammy Awards for Best Metal Performance.\n--------------------------------------------------------------------------------\n 13 is the nineteenth studio album by British rock band Black Sabbath. The album was released on 10 June 2013 in Europe[6] and 11 June 2013 in North America, via Vertigo Records and Republic Records in the US, and via Vertigo Records worldwide. It is the first studio album released by Black Sabbath since Forbidden (1995), and their first studio recording with original singer Ozzy Osbourne and bassist Geezer Butler since the live album Reunion (1998), which contained two new studio tracks. It is also the first studio album with Osbourne since Never Say Die! (1978), and with Butler since Cross Purposes (1994). This is also the first Black Sabbath studio album since Never Say Die! not to feature longtime keyboardist Geoff Nicholls, and the first since The Eternal Idol (1987) on Vertigo (outside the US and Canada).\n\nBlack Sabbath's original line-up first began work on a new studio album in 2001 with producer Rick Rubin. The album's development was delayed because Osbourne was in the middle of finishing his eighth solo album Down to Earth, and the rest of the band members eventually went on to pursue other projects, including GZR and Heaven &amp; Hell. When Black Sabbath announced the end of their hiatus on 11 November 2011, the band announced that they would restart work on a new album with Rubin. In addition to original members Osbourne, Butler and guitarist Tony Iommi, they were joined at the recording sessions by drummer Brad Wilk, of Rage Against the Machine and Audioslave, following original drummer Bill Ward's decision to not participate in the reunion, due to a &quot;contractual dispute&quot;. The album became available for streaming on iTunes on 3 June 2013.\n--------------------------------------------------------------------------------\n\nBlack Sabbath:\n\nOzzy Osbourne: vocals, harmonica\nTony Iommi: guitars\nGeezer Butler: bass guitar\n\n\nSession Member:\n\nBrad Wilk: drums, percussion","torrent":{"xt":"urn:btih:5509fb9dfa6d67befb9da531c0994a53203429e3","amp;dn":"Black+Sabbath%2F13+%5B2CD%5D%5B2013%5D%5B320KBPS%5D%5BJapan+SHM-CD%5D%5BDE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5509fb9dfa6d67befb9da531c0994a53203429e3","infoHashBuffer":{"type":"Buffer","data":[85,9,251,157,250,109,103,190,251,157,165,49,192,153,74,83,32,52,41,227]},"announce":[],"urlList":[]}}