{"title":"Bird Sense: What It`s Like to Be a Bird (Audiobook Audio Book) B","uid":8581291,"size":315896296,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:553fb7e2d5f1cc33097c79e881e4502948667755&amp;dn=Bird+Sense%3A+What+It%60s+Like+to+Be+a+Bird+%28Audiobook+Audio+Book%29+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bobpocket","files":10,"time":1371419472,"description":"Bird Sense: What It's Like to Be a Bird (Audiobook) By Tim Birkhead, read by Robin Sachs\nUnabridged edition 2013 | 14 hours and 2 mins | ISBN: n/a , ASIN: B00BNH5NRY | MP3 96 kbps | 316 MB\n\nWhat is it like to be a swift, flying at over one hundred kilometres an hour? Or a kiwi, plodding flightlessly among the humid undergrowth in the pitch dark of a New Zealand night? And what is going on inside the head of a nightingale as it sings, and how does its brain improvise?\n\nBird Sense addresses questions like these and many more, by describing the senses of birds that enable them to interpret their environment and to interact with each other. Our affinity for birds is often said to be the result of shared senses - vision and hearing - but how exactly do their senses compare with our own? And what about a bird's sense of taste, or smell, or touch, or the ability to detect the earth's magnetic field? Or the extraordinary ability of desert birds to detect rain hundreds of kilometres away - how do they do it?\n\nBird Sense is based on a conviction that we have consistently underestimated what goes on in a bird's head. Our understanding of bird behaviour is simultaneously informed and constrained by the way we watch and study them. By drawing attention to the way these frameworks both facilitate and inhibit discovery, Birkhead identifies ways we can escape from them to explore new horizons in bird behaviour.\n\nThere has never been a popular book about the senses of birds. No one has previously looked at how birds interpret the world or the way the behaviour of birds is shaped by all their senses. A lifetime spent studying birds has provided Tim Birkhead with a wealth of observation and a unique understanding of birds and their behaviour that is firmly grounded in science. ","torrent":{"xt":"urn:btih:553fb7e2d5f1cc33097c79e881e4502948667755","amp;dn":"Bird+Sense%3A+What+It%60s+Like+to+Be+a+Bird+%28Audiobook+Audio+Book%29+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"553fb7e2d5f1cc33097c79e881e4502948667755","infoHashBuffer":{"type":"Buffer","data":[85,63,183,226,213,241,204,51,9,124,121,232,129,228,80,41,72,102,119,85]},"announce":[],"urlList":[]}}