{"title":"Glacial Geology: Ice Sheets and Landforms{BBS}","uid":6717842,"size":16170041,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5541b84c60d78b3f4b0a3c58091ca9b46b26daa1&amp;dn=Glacial+Geology%3A+Ice+Sheets+and+Landforms%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317651117,"description":"The new Second Edition of Glacial Geology provides a modern, comprehensive summary of glacial geology and geomorphology. It is has been thoroughly revised and updated from the original First Edition. This book will appeal to all students interested in the landforms and sediments that make up glacial landscapes.\n\nThe aim of the book is to outline glacial landforms and sediments and to provide the reader with the tools required to interpret glacial landscapes. It describes how glaciers work and how the processes of glacial erosion and deposition which operate within them are recorded in the glacial landscape.\n\nThe Second Edition is presented in the same clear and concise format as the First Edition, providing detailed explanations that are not cluttered with unnecessary detail. Additions include a new chapter on Glaciations around the Globe, demonstrating the range of glacial environments present on Earth today and a new chapter on Palaeoglaciology, explaining how glacial landforms and sediments are used in ice-sheet reconstructions.  Like the original book, text boxes are used throughout to explain key concepts and to introduce students to case study material from the glacial literature. Newly updated sections on Further Reading are also included at the end of each chapter to point the reader towards key references.  The book is illustrated throughout with colour photographs and illustrations.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 400 pages\n    * Publisher: Wiley; 2 edition (September 23, 2009)\n    * Language: English\n    * ISBN-10: 0470516917\n    * ISBN-13: 978-0470516911","torrent":{"xt":"urn:btih:5541b84c60d78b3f4b0a3c58091ca9b46b26daa1","amp;dn":"Glacial+Geology%3A+Ice+Sheets+and+Landforms%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5541b84c60d78b3f4b0a3c58091ca9b46b26daa1","infoHashBuffer":{"type":"Buffer","data":[85,65,184,76,96,215,139,63,75,10,60,88,9,28,169,180,107,38,218,161]},"announce":[],"urlList":[]}}