{"title":"Sleep No More By Greg Iles","uid":8644242,"size":1647066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55e9bc95efcf347f12ce3fe1c85d12cc49009b4d&amp;dn=Sleep+No+More+By+Greg+Iles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"maxdesolate","files":5,"time":1372949954,"description":"John Waters is a successful petroleum geologist with the perfect family. Then one day his world is turned inside out by a single word spoken from the lips of the stunning Eve Sumner. One solitary word that takes him back a decade to another woman and the most passionate of affairs. Mallory Candler was the quintessential Southern Belle. But her captivating beauty and intelligence hid a dark side that John Waters couldn't handle. Mallory loved John with a deep seething passion that threatened to destroy them both, and despite his infatuation he ended their affair. Sometime later her body was found raped and murdered on a New Orleans pier. When John and Eve meet two days later at a cocktail party her parting gesture is a slight squeeze of his hand and the words &quot;You weren't wrong about what I said; it's me John.&quot; His blood runs cold. How does Eve Sumner know so many secrets about his past with Mallory Candler? Was their first meeting cleverly orchestrated or simply fate?\n\nepub,mobi and txt.\n\none of the creepiest stories you will ever read. enjoy and seed! ","torrent":{"xt":"urn:btih:55e9bc95efcf347f12ce3fe1c85d12cc49009b4d","amp;dn":"Sleep+No+More+By+Greg+Iles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e9bc95efcf347f12ce3fe1c85d12cc49009b4d","infoHashBuffer":{"type":"Buffer","data":[85,233,188,149,239,207,52,127,18,206,63,225,200,93,18,204,73,0,155,77]},"announce":[],"urlList":[]}}