{"title":"Policenauts eboot (English translation) for PSP [nuneral]","uid":7358603,"size":1719161365,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:5656f8e86d263abb1b355e5c17f290331adf69ec&amp;dn=Policenauts+eboot+%28English+translation%29+for+PSP+%5Bnuneral%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nuneral","files":3,"time":1339865951,"description":"Great game that is perfectly suited for mobile play. If you've played Snatcher, then you get the jist of the game but it's without all the frustration, a better story, characters, voice acting, much improved flow and just about everything else. It exceeds Snatcher by leaps and bounds and that's something because Snatcher was also a fantastic game.\n~11.5 hour playtime\nran on a psp-3001 with 660 PRO-B\n\n\n\nContents:\nSLPS00215 is Disc 1 of Policenauts\n\nThe Policenauts folder is both disk 1 and 2 of policenauts made into one eboot so you can switch discs when it prompts you to do so. However the first disc does not load so it is only useful for the switch and playthrough of disc 2.\n\nIn both cases drop the folder into your game folder not just their contents in order for the psp to read them correctly. You only need to add SLPS00215 to run the first disc if your short on space.\n\nHow to switch discs:\nAfter the save your file and prompted to switch to disc 2 quit the game and switch to the dual eboot which is about 1.2gb. Load disc 1 and it will go to a black screen and flash the Konami logo every minute or so at this point press the PS button and you'll see the option to switch to disc 2. Do that and start with your latest save and you should be ready to roll after that and you won't have to go through that process again when you reload the eboot as it remembers your decision. \n\n\n\nDon't ask me how to hack your psp, ask google.\n\nHave fun and please seed as I imagine the audience for this eboot is quite limited to say the least.","torrent":{"xt":"urn:btih:5656f8e86d263abb1b355e5c17f290331adf69ec","amp;dn":"Policenauts+eboot+%28English+translation%29+for+PSP+%5Bnuneral%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5656f8e86d263abb1b355e5c17f290331adf69ec","infoHashBuffer":{"type":"Buffer","data":[86,86,248,232,109,38,58,187,27,53,94,92,23,242,144,51,26,223,105,236]},"announce":[],"urlList":[]}}