{"title":"FastPictureViewer Professional v1.9 Build 325.0 (x86) Incl Crack","uid":9080212,"size":38731861,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:56bba4227a6fbdfd83b9b536eca8a3837e13657c&amp;dn=FastPictureViewer+Professional+v1.9+Build+325.0+%28x86%29+Incl+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":12,"time":1382374470,"description":"FastPictureViewer Professional\n\nFastPictureViewer Pro - easy-to-use program for viewing image files. The main advantage of the program is very fast to work with large files, which is not being used classical methods of rendering images, and read them using the graphics chip graphics card. You can view individual files or entire folders, there is a set of very simple for any user options.\n\nKey features:\n\n- Support for Vista, Windows 7, and 8 (normal user account with enabled UAC).\n- Support for Unicode file names and folders.\n- Color Management, which allows accurately display images with Adobe RGB color space or ProPhoto RGB.\n- Support for custom color profiles to match the calibrated monitor.\n- Precision linear histogram R, G, B with the possibility of compression by channel and normalization.\n- Show EXIF-data capture (shutter speed, aperture, sensitivity, exposure compensation, etc.).\n- Instant transition to the next image by using the keyboard or press / roller mouse.\n- Ease review tens of thousands (!) Images in a single operation, even with deep nesting tree.\n- Instant switching between the modes of one key and fill 100-display with the ability of high-quality scaling.\n- Record the accompanying files Adobe XMP (save data on rating labels, the importance of the metadata is compatible with Adobe XMP format).\n- Write embedded metadata for files JPEG / TIFF / HD Photo / JPEG-XR (rating / tag Adobe XMP rating, and Windows Vista).\n- Movable lens when holding the right mouse button with adjustable magnification from 50 to 6400protsentov.\n- Review the contents of multiple sub-folders without pauses, as a single sequence (for example, a review of the entire hard disk or CD / DVD at a time).\n- Support drag and drop, drag and drop a folder or set of files in FastPictureViewer for quick viewing.\n- Background copy the selected folder to a preset by clicking the mouse or pressing a key without disturbing the flow view.\n- Plug'n'play-integration with the ability to automatically review the contents of inserted media or directly from a digital camera.\n- Integration into the local context menus of folders and drives the team opening with FastPictureViewer.\n- Support for file associations to run from Windows Explorer Windows (&quot;Open With ...&quot;).\n- Instant auto-added from the outside image of a folder tree in the review (the concept of update folders in real time).\n- Working with multiple monitors and support for large monitors with full-screen mode (by pressing F11).\n\nSupported OS: \n\nWindows 8, Windows 7, Windows Vista and Windows XP\nLanguage: MULTi\n\nHomepage: http://www.fastpictureviewer.com\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Run &quot;Regme&quot; and merge it to system registry.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:56bba4227a6fbdfd83b9b536eca8a3837e13657c","amp;dn":"FastPictureViewer+Professional+v1.9+Build+325.0+%28x86%29+Incl+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56bba4227a6fbdfd83b9b536eca8a3837e13657c","infoHashBuffer":{"type":"Buffer","data":[86,187,164,34,122,111,189,253,131,185,181,54,236,168,163,131,126,19,101,124]},"announce":[],"urlList":[]}}