{"title":"Batman 542-549 (1997-05) (digital) (OkC.O.M.P.U.T.O.-Novus-HD) [","uid":10380955,"size":248468269,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:56c1c511041b0626b675fb2b8960578d2a58b493&amp;dn=Batman+542-549+%281997-05%29+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dadrkhomr","files":-1,"time":1403074252,"description":"\nA Novus Release\n\n\n\nThis torrent includes the HD version.  \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n#542  The serial killer known as Faceless begins murdering Gotham's citizens, apparently at random, and then removing their faces. Batman must stop this crime spree before more innocents die. \n\n#543  Batman uses all his formidable detective skills to discover the identity of the serial killer Faceless and the identity of the fiend's next victim. But is he too late? \n\n#544  The Joker decides to summon Satan, but gets the demon Etrigan instead. Together, they set their sights on taking over Gotham City! \n\n#545  The Joker and the Demon decide to forget about Gotham City and concentrate instead on their common enemy: Batman. \n\n#546  The Joker and the Demon Etrigan have almost succeeded in their plan to bring Hell to Gotham City, and the Dark Knight has just one slim chance to stop them. \n\n#547  Like everyone else in the world, Batman feels the despair caused by the events of GENESIS. But that doesn't stop him from saving a woman from committing suicide and enlisting Oracle in an attempt to save others who may be about to commit some final, terrible act. \n\n#548  The Penguin, bored with his life as a casino owner, returns to his old role as a master criminal and starts by declaring war on both a rival gang and the Batman. \n\n#549  The Penguin has returned to a life of crime, using an Egyptian falcon as a reason to renew his battle of wits with Batman and lure the Dark Knight into a deadly trap. \n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O. for this release.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:56c1c511041b0626b675fb2b8960578d2a58b493","amp;dn":"Batman+542-549+%281997-05%29+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-HD%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56c1c511041b0626b675fb2b8960578d2a58b493","infoHashBuffer":{"type":"Buffer","data":[86,193,197,17,4,27,6,38,182,117,251,43,137,96,87,141,42,88,180,147]},"announce":[],"urlList":[]}}