{"title":"Hank Ballard  And The Midnighters 1958 **RARE **  vtwin88cube","uid":6137774,"size":78983784,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:575939fbfaa809d9773d658697305202fa07fb47&amp;dn=Hank+Ballard++And+The+Midnighters+1958+%2A%2ARARE+%2A%2A++vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1296379626,"description":"Hank Ballard \nAnd The Midnighters\nTheir Greatest Hits (1958)\nFederal 541 Reissue\n\n***This is a vinyl rip from a 53 year old record, so it has a few imperfections.***\n\nThe King label was founded in 1943 by Syd Nathan in Cincinnati, Ohio. The company was an early pioneer in the cultural and racial integration of American music, from blues and R&amp;B to rockabilly, bluegrass, western swing, and country, creating a unique discography spanning up to 1968 on Nathan's death.\n\n(Following contact info now obsolete)\nStarday-King Records, Inc.\nBox 8188\nNashville Tennessee\n37207 USA\n\nIn the world of early rhythm &amp; blues and doo wop, Hank Ballard was the very definition of earthiness. Though influenced by high-energy gospel vocal groups, Ballard's music with the Midnighters couldn't have been more diametrically opposed in terms of subject matter: his lyrics were filled with raunchy double-entendres that left little to the imagination, pushing the envelope of what was considered acceptable in the '50s. His songs were sometimes banned on the radio, but that only made him an even bigger jukebox favorite among black audiences. Ballard's hard-driving, rhythmic style was also an underappreciated influence on the rawer side of R&amp;B, particularly on a young James Brown; plus, his composition The Twist -- recorded for a hit by Chubby Checker -- became one of the biggest hits in rock &amp; roll history. \n\nHank Ballard was born November 18, 1927 (according to his birth records) in Detroit, but moved to Bessemer, AL, as a young child following his father's death. There he began singing in church and when he returned to Detroit at age 15, he set about forming a doo wop group while working on the Ford assembly line. Around the same time, singers Henry Booth and Charles Sutton were organizing a doo wop outfit called the Royals, which reputedly at one time also featured Jackie Wilson and future Four Top Levi Stubbs; it eventually grew to include vocalists Lawson Smith and Sonny Woods, plus gritty guitarist Alonzo Tucker. Initially copying the smooth style of Sonny Til &amp; the Orioles, the Royals were discovered by Johnny Otis in 1952 and signed with Federal Records. However, when Hank Ballard replaced Smith in 1953, they adopted a rougher, more hepped-up sound in keeping with Ballard's numerous original compositions and Clyde McPhatter influence. Ballard's first recording with the group was 1953's Get It, which hit the Top Ten on the R&amp;B charts, but it was the following year's ribald Work With Me Annie that really broke the group (they changed their name to the Midnighters around this time, to avoid confusion with the Five Royales). Work With Me Annie topped the R&amp;B charts and nearly reached the pop Top 20, despite a number of radio stations refusing to air the song. It inspired a number of answer records and the Midnighters themselves entered the fray with the sequels Annie Had a Baby (another R&amp;B chart-topper) and Annie's Aunt Fannie. They also scored another major smash with the Ballard-penned Sexy Ways, which solidified their reputation as R&amp;B's most risquÃƒÂ© act.\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tR&amp;B\t\t\nM3U Playlist:\t\tYes\n\nA1. Work With Me Annie\nA2.Moonrise\nA3.Sexy Ways\nA4.Get It\nA5.Switchie Witchie Titchie\nA6.It's Love Baby (24 Hours A Day)\n\nB1.Annie Had A Baby\nB2.She's The One\nB3.Annie's Aunt Fannie\nB4.Crazy Loving (Stay With Me)\nB5.Henry's Got Flat Feet\nB6.Tore Up Over You\n\n\nCheers!","torrent":{"xt":"urn:btih:575939fbfaa809d9773d658697305202fa07fb47","amp;dn":"Hank+Ballard++And+The+Midnighters+1958+%2A%2ARARE+%2A%2A++vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"575939fbfaa809d9773d658697305202fa07fb47","infoHashBuffer":{"type":"Buffer","data":[87,89,57,251,250,168,9,217,119,61,101,134,151,48,82,2,250,7,251,71]},"announce":[],"urlList":[]}}