{"title":"TMS - Classical Mythology - The Romans","uid":6587534,"size":114994950,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:58945313797b8697e25a7ff72a0a4768329baa4a&amp;dn=TMS+-+Classical+Mythology+-+The+Romans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"programa","files":15,"time":1312672053,"description":"\nTMS - Classical Mythology: The Romans\nBy Peter Meineck\n\nFormat: MP3\nBitrate: 32 Kbps\n\nRome grew from a tiny community of small hill villages near the River Tiber in central Italy to one of the most powerful empires the world has seen. The Romans themselves believed that their great city was founded in the middle of the eighth century BCE. By the middle of the second century CE, Rome had a population of 1.5 million; Alexandria, in Egypt, 500,000; and Londinium, in Briton, 30,000. Not counting locally recruited forces, this vast empire was subjugated and policed with only around twenty-five legions, or the equivalent of only three and a half times the entire police force of New York City.\n\nHow was this possible? Military power, colonial organization, superior technology, a well-organized infrastructure, and a cohesive economic system. These elements of Roman genius are well known, but it was the very idea of Rome that proved so persuasive and this Roman ideal was born from mythology.\n\n is a clinical assistant professor of classics and artist in residence at the New York University Center for Ancient Studies and the producing artistic director and founder of the Aquila Theatre Company. Peter currently teaches in the Classics Department at New York University in ancient drama, Greek literature, and Classical mythology. He has held teaching appointments at Princeton University, the University of South Carolina, and the Tisch School of the Arts. Fellowships include the Harvard Center for Hellenic Studies, Princeton, the University of California San Diego, and the University of Texas at Austin. He has lectured and held workshops on ancient drama and Shakespeare at conferences, academic institutions, museums, festivals, and schools throughout the world. \n\n14 Lectures\n30 minutes/lecture\n\n1  Mythological Rome\n2  The Making of Myth: How the Romans Recorded Their Mythology\n3  Greek Myths and the Romans: Cacus, Hercules, and the Greeks in Italy\n4  Arcadian Fantasies: The Fathers of the Founders\n5  Trojan Ancestors: The Myth of Aeneas\n6  Romulus and Remus\n7  The Seven Kings of Rome\n8  Etruscan Kings in Rome: Myth or History?\n9  Myths of the Republic\n10 Myths of Roman Expansion\n11 Virgil and The Aeneid (Part One)\n12 The Aeneid (Part Two)\n13 Ovid\n14 The Survival of Classical Myth","torrent":{"xt":"urn:btih:58945313797b8697e25a7ff72a0a4768329baa4a","amp;dn":"TMS+-+Classical+Mythology+-+The+Romans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58945313797b8697e25a7ff72a0a4768329baa4a","infoHashBuffer":{"type":"Buffer","data":[88,148,83,19,121,123,134,151,226,90,127,247,42,10,71,104,50,155,170,74]},"announce":[],"urlList":[]}}