{"title":"Summer of Love (TV) [2007] PBS","uid":6954899,"size":628628366,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:595b14b0b25ae926ec0a59d73d8a6ba3c7faa885&amp;dn=Summer+of+Love+%28TV%29+%5B2007%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1326502583,"description":" &lt;a href=&quot;http://bayimg.com/AaLBfaAdN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/AaLBfaAdN&lt;/a&gt;\n\nThe American Experience \n \nSummer of Love\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1000786/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1000786/&lt;/a&gt;\n\nOriginal Air Date:23 April 2007 \n\nWe hold these experiences to be self-evident, that all is equal, that the creation endows us with certain inalienable rights, that among these are: the freedom of body, the pursuit of joy, and the expansion of consciousness and that to secure these rights, we the citizens of the earth declare our love and compassion for all conflicting hate-carrying men and women of the world.\n\n- A Prophecy of a Declaration of Independence, published anonymously, 1967\n \nAmerican Experience presents Summer of Love, a striking picture of San Francisco's Haight Ashbury district during the summer of 1967 -- from the utopian beginnings, when peace and love prevailed, to the chaos, unsanitary conditions, and widespread drug use that ultimately signaled the end. Academy Award-nominated filmmakers Gail Dolgin and Vicente Franco (Daughter from Danang) examine the social and cultural forces that sparked the largest migration of young people in America's history.\n\n&quot;Many of these idealistic youth were products of the 1950s with its confusing mix of post-war affluence and the threat of nuclear annihilation,&quot; says Dolgin. &quot;San Francisco, in 1967, seemed like mecca, the center of a visionary new society, one that rejected war, hatred, conformity and money. The Haight Ashbury, for a brief period, was the playing field for a new way of life.&quot;\n\n&quot;Everybody had a different entrance point,&quot; explains San Francisco music critic Joel Selvin. &quot;Some people came in because of the sexual liberation prospect. Some people came in because of the appeal of the music. Some people came in because they were angry and scared about the draft and the war. But once you were in that vortex, once you were in that swirling miasma of social and personal change, all the doors were open.&quot;\n\n&quot;Thousands of kids were ready to go through those doors and find out what was on the other side,&quot; says Franco. &quot;The clichÃƒÂ© of &quot;Sex, Drugs and Rock &amp; Roll,&quot; often used to describe the Summer of Love, misses some of the more profound new horizons being explored. Love, personal growth, mysticism, community, and authenticity were at the core of the experimental society.&quot;\n\nIn January 1967, the thousands of youth already in San Francisco descended on Golden Gate Park for a Human Be-In. The media flocked to the event, putting hippies in the national spotlight for the first time. And once the press offered a window into the world of Haight Ashbury, even more young people flooded in. &quot;The city of San Francisco has been warned of a hippie invasion come summer in numbers almost too staggering to comprehend,&quot; declared one TV news reporter.\n\nThe new arrivals were looking to &quot;turn on, tune in, and drop out,&quot; the popular refrain that invited people to an existential experience courtesy of LSD. &quot;We really thought that drugs were going to change the world,&quot; recalls Mary Kasper, who was in the Haight from the start of the movement. &quot;We thought if you turned on, if you took acid, you would really change, because we had changed from those experiences of cosmic oneness.&quot;\n\nSan Francisco was fast becoming an outdoor society where free music was as readily available as free love. The Grateful Dead became the poster children for a generation, offering free concerts to anyone who wanted to listen. The music coming out of Haight Ashbury only served to draw more young people to the movement. One hit song beckoned the young and the curious and became an anthem for the time -- &quot;If You're Going to San Francisco (Be Sure to Wear Flowers in Your Hair).&quot;\n\nBut along with free music, free love, and &quot;cosmic oneness,&quot; the onslaught of people also brought a lack of housing, shortage of food, rampant drug problems, and sexually transmitted diseases. Free clinics and soup kitchens served the massive population, estimated to be from fifty thousand to one hundred thousand at its peak. The Haight soon became a caricature of its idealistic beginnings, as shops catered to souvenir-hungry tourists and weekend hippies. College students with no intention of &quot;dropping out&quot; took on hippie personas for the summer. Hundreds of young runaways wandered the streets aimlessly. For many, the center of the counterculture no longer seemed a shimmering wonderland. By fall, the numbers began to drop as precipitously as they had grown.\n\nThe Summer of Love was a fleeting moment in the turbulent history of the 1960s. But its underlying message left an indelible impression on those who witnessed it. &quot;So many of those things from that time have stayed with me, certainly the importance of community,&quot; says Kasper. &quot;I thought we could change the world, and I thought we could make it a better place. And I think in some ways we succeeded.&quot;\n\n&quot;1967 represents a touchstone and a turning point for so many people,&quot; says American Experience executive producer Mark Samels. &quot;The Summer of Love was the moment when hippies and all the beliefs they represented took center stage and became a cultural phenomenon.&quot;\n\n","torrent":{"xt":"urn:btih:595b14b0b25ae926ec0a59d73d8a6ba3c7faa885","amp;dn":"Summer+of+Love+%28TV%29+%5B2007%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"595b14b0b25ae926ec0a59d73d8a6ba3c7faa885","infoHashBuffer":{"type":"Buffer","data":[89,91,20,176,178,90,233,38,236,10,89,215,61,138,107,163,199,250,168,133]},"announce":[],"urlList":[]}}