{"title":"Charles Darwin - Janet Browne.epub","uid":9042855,"size":4240499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5996d3555aa23d7c5573a0cef5e273710e824205&amp;dn=Charles+Darwin+-+Janet+Browne.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381678057,"description":"In 1858, Charles Darwin was forty-nine years old, a gentleman scientist living quietly at Down House in the Kent countryside. He was not yet a focus of debate; his &quot;big book on species&quot; still lay on his desk as a manuscript. For more than twenty years he had been accumulating material for it, puzzling over the questions that it raised, trying to bring it to a satisfactory conclusion, and wanting to be certain that his startling theory of evolution was correct.\n\nIt is at this point that the concluding volume of Janet Browne's magisterial biography opens. Beginning with the extraordinary events that finally forced the &quot;Origin of Species&quot; into print, we come to the years of fame and controversy. Here, Browne does dramatic justice to all aspects of the Darwinian revolution, from a fascinating examination of the Victorian publishing scene to a survey of the debates between scientists and churchmen over evolutionary theory. At the same time, she presents a wonderfully sympathetic and authoritative picture of Darwin himself.","torrent":{"xt":"urn:btih:5996d3555aa23d7c5573a0cef5e273710e824205","amp;dn":"Charles+Darwin+-+Janet+Browne.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5996d3555aa23d7c5573a0cef5e273710e824205","infoHashBuffer":{"type":"Buffer","data":[89,150,211,85,90,162,61,124,85,115,160,206,245,226,115,113,14,130,66,5]},"announce":[],"urlList":[]}}