{"title":"Frodus Discography","uid":4802723,"size":554797674,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:59ee3a2f944e4929498d6dd6ce2c3a3dfc25825e&amp;dn=Frodus+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"frampy","files":124,"time":1238094363,"description":"Frodus (a.k.a. Frodus Conglomerate International, Frodus Sound Laboratories, FCI, Frodus Escape Plan, Frodus Deposit Insurance Corporation) was a 1990s Washington, D.C.-based post-hardcore band, described by critics as a mixture of math rock, hardcore punk, and indie rock. Their songs were frequently dark and dissonant.\nFrodus' first releases were self-distributed cassettes and 7 inches, such as &quot;Babe&quot;, &quot;Tzo-Boy&quot;, and &quot;Molotov Cocktail Party&quot;. Two other releases (&quot;Fireflies&quot; and &quot;F-Letter&quot;), on now defunct indies, followed. Frodus later signed with Tooth and Nail Records, an independent label out of Seattle, with which they released Conglomerate International in 1998. \n\nMost of Frodus' recognition was due to their epic swan song, the 1999 recorded and 2001 released LP on Fueled by Ramen entitled And We Washed Our Weapons In The Sea, considered by band members their best recorded work.\n\nFrodus is known for touring 5 weeks with Refused in Sweden in 1998 and in the United States in 1999 in which Refused broke up whilst on tour.\n\nAfter Frodus broke up December of 1999 it took two years to find a label to release their final album. The first label, MIA Records, shut down due to the owner (also a Texas oil-tycoon) having to settle a long-standing lawsuit. Afterwards, long-time Frodus friend, Tony Weinbender, then of Fueled by Ramen Records offered to release Frodus' final opus thus saving the album from obscurity.\n\nThe members of Frodus went separate ways and partially converged again for a short time. In 2000 Nathan went on to form The Out Circuit and Night Is Invisible (both of which released records on Lujo Records) and Jason went on to drum for Combat Wounded Veteran. In 2003 the founding members Shelby Cinca and Jason Hamacher along with bassist Joe Lally of Fugazi joined to form The Black Sea. They later changed their name to Decahedron. Lally left shortly after the completion of their debut album and was replaced by Jonathan Ford (Unwed Sailor, Roadside Monument). Continually plagued by bassist fluctuation anomalies Jonathan quit in 2004 and was later replaced by Jake Brown (Moments In Grace). In 2005 they suspended operations after the release of their EP entitled &quot;2005.&quot; Shelby Cinca then focused on his Swedish project Frantic Mantis with HÃƒÂ¥kan Johansson and Per StÃƒÂ¥lberg of Division Of Laura Lee and completed the 3rd album by The Cassettes (Buddyhead Records 2006). In 2006, Jason Hamacher started a project with Mike Schliebaum of Darkest Hour called Zealot and Shelby began releasing IDM Music made on a Game Boy (Game Boy music) with the Nanoloop software under his own name.\n\n2006 also saw the relaunch of the Frodus web-presence and consolidation of its MySpace entities with the help of two Canadian fans/supporters, Stu Hood of SHZINE and Jason Nicholas, who both wear the mark of the Frodus &quot;head&quot; tattooed on their upper arms. The new focus being an organized ongoing project of archiving all known interviews, previous website designs, press clippings, and digital transfers for new media content. Founder Shelby Cinca also began remastering out-of-print releases and adding them into the iTunes library and other digital music services through his partnership with Carcrash Records.\n\nIn 2008 experimental rock group Thrice released a Frodus cover track on their new album The Alchemy Index IV: Earth. The track &quot;The Earth Isn't Humming&quot; was originally released on And We Washed Our Weapons in the Sea.\n\n2009 saw Frodus resurface as the Frodus Escape Plan/Frodus Conglomerate International with Liam Wilson from Dillinger Escape Plan on bass in commemoration of the re-release of the Conglomerate International double-vinyl LP on Gilead Media and as a statement in response to the bank-bailouts and the uncovering of corporate corruption in the financial sector.","torrent":{"xt":"urn:btih:59ee3a2f944e4929498d6dd6ce2c3a3dfc25825e","amp;dn":"Frodus+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59ee3a2f944e4929498d6dd6ce2c3a3dfc25825e","infoHashBuffer":{"type":"Buffer","data":[89,238,58,47,148,78,73,41,73,141,109,214,206,44,58,61,252,37,130,94]},"announce":[],"urlList":[]}}