{"title":"The Best of Everything _KImberla Lawson Roby","uid":10382733,"size":487271,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a763fd7f6ddbda45d73bf3e4bb18a5830c942dd&amp;dn=The+Best+of+Everything+_KImberla+Lawson+Roby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"taylorman","files":1,"time":1403098992,"description":"The world-renowned Reverend Curtis Black's daughter, Alicia, is all grown up and even more trouble than her father. The apple certainly doesn't fall far from the tree in this new novel from the New York Times bestselling author of Sin No More and Love and Lies.\n\nAlicia Black Sullivan swore to never repeat her father's mistakes: she would never break any promises, she would never be unfaithful. And most important of all, when she got married, it would be for good.\n\nAnd she really does love Phillip, the assistant pastor of her father's church. She just happens to love money--and the things it can buy--as well. Alicia was born to the good life, she's entitled to the best, and she'll do anything to get it. Even if it means piling up thousands of dollars in debt. Even if it means denying to everyone--even herself--that her love of shopping has gotten way out of control.\n\nBefore long, Phillip begins to wonder if marrying the woman of his dreams was a huge mistake. Alicia has similar thoughts. Deep down, though, she knows a whopper of an emotional bill is coming due. And all the regrets in the world won't change the fact that she may be more like her infamous father than she could have imagined--or feared","torrent":{"xt":"urn:btih:5a763fd7f6ddbda45d73bf3e4bb18a5830c942dd","amp;dn":"The+Best+of+Everything+_KImberla+Lawson+Roby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a763fd7f6ddbda45d73bf3e4bb18a5830c942dd","infoHashBuffer":{"type":"Buffer","data":[90,118,63,215,246,221,189,164,93,115,191,62,75,177,138,88,48,201,66,221]},"announce":[],"urlList":[]}}