{"title":"Essays on Marx's Theory of Value","uid":8192918,"size":1884496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ae46ed05a0052d527dc447568b483ed85e79688&amp;dn=Essays+on+Marx%27s+Theory+of+Value&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ledpup","files":-1,"time":1361868201,"description":"Formats: MOBI and EPUB\n\nOriginally published in the former Soviet Union, it was suppressed and after 1928 it was never re-issued. This is the first English-language edition. The most fascinating aspect of this books is Rubin's thesis that Marx's theory of the commodity fetish underlies his entire economic analysis, and the nodal point at which all subsequent theories of capitalism emerge from.\n\nRubin examines the dynamic, causal relationship between labour time and monetized market exchanges. This is a very different point of view compared to most post-war interpretations of Marx's economic theory. Rubin's book is required reading for anyone who seriously wants to understand Marx's theory of value, and is an undisputed classic of Marxist political economy.\n\nAs a book of his essays it can mostly be read in scattered order, but a chronological reading is helpful for ascertaining Rubin's thesis. Since each essay wrestles with various aspects of Marx's theories (often with far more detail than Marx ever provided), it serves as a great reference book too, when you're puzzling over issues like abstract labor, or value-price relations.","torrent":{"xt":"urn:btih:5ae46ed05a0052d527dc447568b483ed85e79688","amp;dn":"Essays+on+Marx%27s+Theory+of+Value","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ae46ed05a0052d527dc447568b483ed85e79688","infoHashBuffer":{"type":"Buffer","data":[90,228,110,208,90,0,82,213,39,220,68,117,104,180,131,237,133,231,150,136]},"announce":[],"urlList":[]}}