{"title":"Sony Vegas Pro 11 Beginner's Guide {BBS}","uid":7558287,"size":13550792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b32cdb53753d0010f6241a65fab118e47203bde&amp;dn=Sony+Vegas+Pro+11+Beginner%27s+Guide+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1345676943,"description":"Edit videos with style and ease using Vegas Pro\n\nOverview\n\n    * Edit slick, professional videos of all kinds with Sony Vegas Pro\n    * Learn audio and video editing from scratch\n    * Speed up your editing workflow\n    * A practical beginner's guide with a fast-paced but friendly and engaging approach towards video editing\n\nIn Detail\n\nSony Vegas Pro is a widely used video editing tool that provides an efficient and intuitive environment for creating professional quality videos. Whether you're a beginner or an experienced video editor, Vegas Pro meets all your needs\n\nSony Vegas Pro 11 Beginner's Guide is packed with tips and advice on how to go about creating professional quality videos from scratch. With this book in hand, even a novice can start making a video or a short film quickly and easily.\n\nSony Vegas Pro 11 Beginner's Guide takes you through the process of creating a video project from scratch. The book is packed with many screenshots to help illustrate time-saving editing techniques and how to spice up your video with beautiful effects and titles. You will also dive into audio editing, color correction, event panning and cropping along with various other techniques which will enable you to develop a solid foundation in video editing.\n\nBy the end of this book you will be able to create and edit videos with ease.\n\nWhat will you learn from this book\n\n    * Easy and quick steps to make a video\n    * Import media from different sources\n    * Learn about the various editing tools available in Vegas Pro to save you time during the editing process\n    * Add professional, animated titles and transitions to enhance your videos' look\n    * Fix the colors in your footage with advanced color correction tools\n    * Export your projects to DVD, Blu-Ray, YouTube, and more\n\n\n\n\n# Paperback: 264 pages\n# Publisher: Packt Publishing (July 26, 2012)\n# Language: English\n# ISBN-10: 1849691703\n# ISBN-13: 978-1849691703","torrent":{"xt":"urn:btih:5b32cdb53753d0010f6241a65fab118e47203bde","amp;dn":"Sony+Vegas+Pro+11+Beginner%27s+Guide+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b32cdb53753d0010f6241a65fab118e47203bde","infoHashBuffer":{"type":"Buffer","data":[91,50,205,181,55,83,208,1,15,98,65,166,95,171,17,142,71,32,59,222]},"announce":[],"urlList":[]}}