{"title":"AKI KAURISMAKI - TOTAL BALALAIKA SHOW[TNTVILLAGE]","uid":5104030,"size":770693120,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5bdf84d9f0a5b0369d9e7807a3feb14e00f57f48&amp;dn=AKI+KAURISMAKI+-+TOTAL+BALALAIKA+SHOW%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1254230698,"description":"[b][color=blue] AKI KAURISMAKI[/color]\n\n[color=RED] TOTAL BALALAIKA SHOW[/color][/b]\n\n[b][color=RED]:::-&gt;LOCANDINA&lt;-:::[/color][/b]\n\n[IMG]http://img21.imageshack.us/img21/801/leningradcowboysshoptot.jpg[/IMG]\n\n\n[b][color=red]:::-&gt;SCREENSHOT&lt;-:::[/color][/b]\n\n[IMG]http://img84.imageshack.us/img84/2117/totalscreen.jpg[/IMG]\n\n[b][color=red]:::-&gt;TRAMA&lt;-:::[/color][/b]\n\n[color=teal]All'inizio sembrava solo un'idea pazzesca: far suonare insieme un branco di bifolchi di uno staterello periferico, un gruppo rock'n roll finlandese (&quot;il peggiore del mondo&quot; secondo l'orgogliosa definizione data da Aki Kaurismaki in &quot;Leningrad Cowboys Go America&quot;, la presentazione della loro opera) con uno dei piÃƒÂ¹ famosi e splendidi cori del mondo, il Coro dell'Armata Rossa con i suoi 150 elementi. Un incontro che coinvolgeva due nazioni che mezzo secolo prima erano state in guerra e che in seguito avevano tollerato un'amicizia un pÃƒÂ² irrequieta. Nel 1993 lo scherzo diventÃƒÂ² realtÃƒÂ  tangibile: una folla di piÃƒÂ¹ di 70.000 persone si accalcÃƒÂ² nel luogo dell'evento, la magnifica piazza stile vecchio Impero di Helsinki, riunite da qualcosa di autentico e palpitante sull'amicizia fra le nazioni, sulla coesistenza pacifica. Probabilmente l'alchimia di quello strano e scatenato incontro tra Est e Ovest rimarrÃƒÂ  un segreto per sempre, anche se questo film documentario di Aki Kaurisamaki ÃƒÂ¨ capace di regalarci qualche rivelazione. Ma l'esperienza dei Leningrad Cowboys non si ÃƒÂ¨ esaurita con questo straordinario evento, articolandosi anche in un gran numero di video girati, secondo i comandamenti del loro autore Aki Kaurismaki, con impeccabile tecnica vecchio stile su pellicola da 35mm..[/color]\n\n[b][color=red]:::-&gt;AKI KAURISMAKI&lt;-:::[/color][/b]\n[color=teal]\nA.K. &quot;Avevo in mente la prima sequenza e l'ultima, tutto il resto l'ho improvvisato. Ci mettevamo in viaggio e se vedevo qualcosa di interessante ci fermavamo. Io entravo in un bara mentre la troupe aspettava fuori all'angolo. Mi prendevo un birra e col barista parlavo del tempo. Poi dicevo: le dispiace se giriamo una scena qui nel bar? Quello rispondeva: Yeah. Io andavo alla porta, facevo un fischio e arrivavano trenta persone...&quot;un film incentrato sulla pazzia del mondo contemporaneo, sulle alienazioni che ci siamo abituati a subire, ma che giorno dopo giorno ci annientano, ci distruggono. E' il pi drammatico e tragico dei miei film, rappresenta in un certo senso la conclusione della mia trilogia, la completa perdita di speranza. E' la conclusione tragica a ribaltare le regole del film che testimonia le fine dei sogni, la morte, la rovina, la distruzione, la disperazione degli uomini che vivono alle soglie del terzo millennio&quot;\n\nBiografia\n\nAki KaurismÃƒÂ¤ki (Orimattila, 4 aprile 1957) ÃƒÂ¨ un regista, sceneggiatore, produttore cinematografico e attore finlandese.\nÃƒË† noto per i suoi film ambientati negli strati sociali meno fortunati, soprattutto del nord Europa, spesso con situazioni e personaggi stravaganti.\n\nCon il fratello Mika KaurismÃƒÂ¤ki ha fondato il Midnight Sun Film Festival di SodankylÃƒÂ¤ e la societÃƒÂ  di distribuzione Ville Alpha (chiamata cosÃƒÂ¬ dal film Alphaville di Jean-Luc Godard).\nNel 1981, i due fratelli dirigono il film-documentario La sindrome del lago Saimaa, girato in riva al piÃƒÂ¹ grande lago della Finlandia.\nNel 1987, Aki dÃƒÂ  una interpretazione 'anticapitalistica' di Shakespeare con la pellicola Amleto nel mondo degli affari.\nLa fiammiferaia, del 1989, racconta le vicende sentimentali all'interno di una fabbrica. Nello stesso anno dirige il paradossale Leningrad Cowboys Go America, road movie musicale.\nNel 1990 KaurismÃƒÂ¤ki gira Ho affittato un killer, con Jean-Pierre LÃƒÂ©aud, presentato con successo alla mostra del cinema di Venezia. Segue Vita da BohÃƒÂ¨me, in cui sembra ispirarsi piÃƒÂ¹ all'omonimo romanzo di Henri Murger che all'opera di Puccini, utilizzando composizioni di Wolfgang Amadeus Mozart e valzer francesi.\nIl 1992 ÃƒÂ¨, anche per KaurismÃƒÂ¤ki, un anno molto importante. In quell'anno dirigerÃƒÂ  il mega-concerto dei Leningrad Cowboys ad Helsinki (Total Balalaika Show), concerto che darÃƒÂ  fama internazionale al gruppo russo/finlandese. Sul palco, insieme a loro, inoltre, l'Orchestra ed il coro dell'Armata Rossa. L'intero concerto ÃƒÂ¨ stato registrato ed il DVD ÃƒÂ¨ stato uno dei piÃƒÂ¹ venduti in assoluto (soprattutto nel nord Europa, Francia, Inghilterra, Germania e Russia) in quegli anni, difficile, perÃƒÂ², da trovare in Italia.\nNel 1994 dirige Leningrad Cowboys Meet Moses, sequel meno fortunato ma piÃƒÂ¹ ironico del precedente Leningrad Cowboys Go America, dove si racconta il ritorno del loro dispotico manager Vladimir (Matti PellonpÃƒÂ¤ÃƒÂ¤, 1951-1995). Il manager, &quot;scomparso&quot; alla fine del primo film (Ã‚Â«E nessuno ne seppe piÃƒÂ¹ nulla... succede!Ã‚Â»), convertito al cristianesimo dopo un lungo studio della Bibbia, ritorna come &quot;Moses&quot; e li convince a ritornare in patria. Lungo la strada le difficoltÃƒÂ  non saranno poche; nuovamente inseguiti dalle autoritÃƒÂ  americane in seguito al &quot;furto&quot; del naso della Statua della LibertÃƒÂ , lungo il tragitto, dopo esser approdati con una improvvisata imbarcazione sulle coste francesi (nelle zone di Amiens), incontrano la nuova formazione dei Leningrad Cowboys (che, tra l'altro, ÃƒÂ¨ l'effettiva e tutt'ora esistenze formazione, coloro che, ancora, solcano i palchi di mezzo mondo). La vecchia formazione del gruppo finlandese, in seguito, a quanto si dice nel prologo del film, ÃƒÂ¨ stata uccisa dalla &quot;tremenda bevanda&quot;, la Tequila, dopo un anno di enorme successo commerciale in Messico. Leningrad Cowboys Meet Moses ÃƒÂ¨ costellato da una serie di esilaranti battute e soluzioni sceniche, e, dopo mille peripezie, riusciranno a ritornare in patria.\nTatjana (1994), quasi una pellicola muta, definisce meglio il carattere surrealista del lavoro di KaurismÃƒÂ¤ki.\nNel 1996 Nuvole in viaggio riscuote un discreto successo: la commedia, dai toni leggeri, parla anche di crisi economica e disoccupazione.\nNel 1999 realizza Juha, adattando un classico della letteratura finlandese di Juhani Aho. Questo film, corredato da titoli esplicativi, non ha dialoghi e si presenta come un vecchio film muto.\nNel 2002 ÃƒÂ¨ premiato al festival del cinema di Cannes con il Grand Prix Speciale della Giuria per L'uomo senza passato (Mies vailla menneisyyttÃƒÂ¤).\nNel 2006 riceve il Premio Fiesole &quot;Maestri del Cinema&quot;. Lo stesso anno esce nelle sale Le luci della sera, uno tra i suoi film piÃƒÂ¹ pessimisti e malinconici.. [/color]\n\n\n[b][color=red]:::-&gt;RAPPORTO AVINAPTIC&lt;-:::[/color][/b]\n[b][color=teal]\n\n\n[ Info sul file ]\n\nNome: Aki Kaurismaki - Total Balalaika Show.avi\nData: 20/09/2009 13:23:40\nDimensione: 770,693,120 bytes (734.99 MB)\n\n[ Info generiche ]\n\nDurata: 00:54:30 (3270.04 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nJUNK: VirtualDubMod build 2540/release\n\n[ Dati rilevanti ]\n\nRisoluzione: ALTA (656 x 384)\nLarghezza: multipla di 16 (BENE)\nAltezza: multipla di 32 (BENE)\nQualitÃƒÂ  DRF medio: MEDIA (3.487938)\nQualitÃƒÂ  deviazione standard: ALTA (0.651900)\nMedia pesata dev. std.: ALTA (0.380257)\n\n[ Traccia video ]\n\nFourCC: xvid/XVID\nRisoluzione: 656 x 384\nFrame aspect ratio: 41:24 = 1.708333\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 41:24 = 1.708333\nFramerate: 25 fps\nFrames totali: 81751\nStream size: 675,156,718 bytes\nBitrate: 1651.739349 kbps\nQf: 0.262280\nKey frames: 528 (0; 300; 528; 611; 911; ... 81639)\nNull frames: 0\nMin key int: 3\nMax key int: 300\nKey int medio: 154.831439\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x2000 (AC3)\nBitrate (contenitore): 224 kbps CBR\nCanali (contenitore): 2\nFrequenza (contenitore): 48000 Hz\nChunks: 81739\nStream size: 91,560,448 bytes\nPreload: 480 ms\nMax A/V diff: 496 ms\nAC-3 frames: 102188\nDurata: 00:54:30 (3270.016 s)\nChunk-aligned: No\nMode: stereo\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: XviD0050\nPacked bitstream: No\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 81751\nDrop/delay frames: 0\nFrames corrotti: 0\n\n[ Analisi DRF ]\n\nDRF medio: 3.487938\nDeviazione standard: 0.651900\nDRF max: 6\n\nRapporto generato da AVInaptic (18-11-2007) in data 20 set 2009, h 16:15:00\n\n\n\n\n[/color][/b]\n[b][color=red]:::-&gt;NOTE FINALI&lt;-:::[/color][/b][color=TEAL]\n[b]Durata: 55'[/b]\n[b]Lingue: AUDIO AC3 [/b]\n[b]Sottotitoli: NON PRESENTI[/b]\n[/color]\n\n[b][color=red]TNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:5bdf84d9f0a5b0369d9e7807a3feb14e00f57f48","amp;dn":"AKI+KAURISMAKI+-+TOTAL+BALALAIKA+SHOW%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bdf84d9f0a5b0369d9e7807a3feb14e00f57f48","infoHashBuffer":{"type":"Buffer","data":[91,223,132,217,240,165,176,54,157,158,120,7,163,254,177,78,0,245,127,72]},"announce":[],"urlList":[]}}