{"title":"The Universal History of Numbers (gnv64)","uid":7773103,"size":87060431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c1f8ee788007f5ca64c6a2dba4e5723f01e26d1&amp;dn=The+Universal+History+of+Numbers+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1351586011,"description":"The Universal History of Numbers: From Prehistory to the Invention of the Computer\nby Georges Ifrah and David Bello\nWiley | 2000 | 656 Pages | ISBN: 0471393401 | DJVU/PDF | 19.5/63.5 mb &lt;a href=&quot;\nhttp://www.amazon.com/The-Universal-History-Numbers-Prehistory/dp/0471375683&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Universal-History-Numbers-Prehistory/dp/0471375683&lt;/a&gt;\nPDF conversion is mine.\n\nA riveting history of counting and calculating from the time of the cave dwellers to the late twentieth century, The Universal History of Numbers is the first complete account of the invention and evolution of numbers the world over. As different cultures around the globe struggled with problems of harvests, constructing buildings, educating their citizens, and exploring the wonders of science, each civilization created its own unique and wonderful mathematical system.\nDubbed the &quot;Indiana Jones of numbers,&quot; Georges Ifrah traveled all over the world for ten years to uncover the little-known details of this amazing story. From India to China, and from Egypt to Chile, Ifrah talked to mathematicians, historians, archaeologists, and philosophers. He deciphered ancient writing on crumbling walls; scrutinized stones, tools, cylinders, and cones; and examined carved bones, elaborately knotted counting strings, and X-rays of the contents of never-opened ancient clay accounting balls. Conveying all the excitement and joy of the process of discovery, Ifrah writes in a delightful storytelling style, recounting a plethora of intriguing and amusing anecdotes along the way.\nFrom the stories of the various ingenious ways in which different early cultures used their bodies to count and perfected the use of the first calculating machine-the hand-to the invention of different styles of tally sticks, up through the creation of alphabetic numbers, the Greek and Roman numeric systems, and the birth of modern numerals in ancient India, we are taken on a marvelous journey through humankind's grand intellectual epic.\nWe meet those who only count to four-anything more is &quot;a lot&quot;; discover the first uses of counting fingers and toes; learn of the amazing ability of abacus users to calculate with brilliant efficiency; and ponder the intriguing question: How did many cultures manage to calculate for all those centuries without a zero? Exploring the many ways civilizations developed and changed their mathematical systems, Ifrah imparts a unique insight into the nature of human thought-and into the ways our understanding of numbers and how they shape our lives has slowly changed and grown over thousands of years.\n\nIn this illuminating and entertaining work, you'll learn about:\n- The earliest calculating machine--the hand\n- Tally sticks--accounting for beginners\n- How the Sumerians did their sums\n- Greek and Roman numerals\n- The invention of alphabetic numerals\n- The achievements of the Mayan civilization\n- India and the birth of modern numbers\n- Indo-Arabic numerals and how they reached the West\n- The final stage of numerical notation","torrent":{"xt":"urn:btih:5c1f8ee788007f5ca64c6a2dba4e5723f01e26d1","amp;dn":"The+Universal+History+of+Numbers+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c1f8ee788007f5ca64c6a2dba4e5723f01e26d1","infoHashBuffer":{"type":"Buffer","data":[92,31,142,231,136,0,127,92,166,76,106,45,186,78,87,35,240,30,38,209]},"announce":[],"urlList":[]}}