{"title":"White Awareness: Handbook For Anti-Racism Training [blackatk]","uid":8792979,"size":359617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c303f90660b29efadf94ec2aa22346bf6d546bb&amp;dn=White+Awareness%3A+Handbook+For+Anti-Racism+Training+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"blackatk","files":-1,"time":1375999550,"description":"[img]http://image.bayimg.com/4be35c65dfbf69229b458c86cbcf8c69b2c5b3ee.jpg[/img]\n\n\n\nIn White Awareness, &quot;a group training program is presented in which white people work together in a nonthreatening environment to alter deeply ingrained, often unconscious racist attitudes and then embark on a program of behavioral change. The program has been used with measurable success in many settings. It can be adapted to the specific setting and needs of the participants. After an introduction explaining the principles on which the program is based, a detailed step-by-step training format is presented. The six group experiences, called stages, center on the following themes: racism, definitions and inconsistencies; confronting the reality of racism; dealing with feelings; cultural differences; exploring cultural racism, the meaning of whiteness; individual racism; and developing action strategies. Instructions and suggestions for conducting each session are provided, along with recommended readings, lists of materials required, and sources of materials.&quot; Social Work Research and Abstracts.\n\n\n\n\n\n[b]About the Author[/b]\n\nJudith H. Katz is coauthor of The Inclusion Breakthrough: Unleashing the Real Power of Diversity. She is Executive Vice President of The Kaleel Jamison Consulting Group, Inc., a Troy, New York firm that assists private and public sector organizations in promoting diversity and inclusion in the workplace.\n\n\n\nPaperback: 221 pages\nPublisher: University of Oklahoma Press (December 15, 1978)\nLanguage: English\nISBN-10: 0806114665\nISBN-13: 978-0806114668\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/White-Awareness-Handbook-Anti-Racism-Training/dp/0806114665/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/White-Awareness-Handbook-Anti-Racism-Training/dp/0806114665/&lt;/a&gt;\n\n\n\nTags: race, racism, oppression, anti-racism, tim, wise, usa, america, europe, minority, oppression, discrimination, white privilege, white narrative, psychology, sociology, narrative, judaism, anti, semitism, israel, palestine, jew, jewish, jewish studies, minority, black, african, african american, african american, studies, history, oppression, discrimination, arguement, rhetoric, retort, education, reference, foreign, language, study, words, language, grammar, linguistics, humanities, social sciences, sociology, psychology, political science, politics, government, international, world, politics, minority, race, relations, discrimination, racism,nazi, ss, himmler, nsdp, germany, wwII, world, war, 2, ww2, media, pr, communication, linguistics, frame, public, relations,\t","torrent":{"xt":"urn:btih:5c303f90660b29efadf94ec2aa22346bf6d546bb","amp;dn":"White+Awareness%3A+Handbook+For+Anti-Racism+Training+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c303f90660b29efadf94ec2aa22346bf6d546bb","infoHashBuffer":{"type":"Buffer","data":[92,48,63,144,102,11,41,239,173,249,78,194,170,34,52,107,246,213,70,187]},"announce":[],"urlList":[]}}