{"title":"Storage Wars - Season 02 (Episodes 22-33) 720p HDTV","uid":9667239,"size":8288650184,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5c806bf1d1fd345cbecd401ad36de4ac411b8e4b&amp;dn=Storage+Wars+-+Season+02+%28Episodes+22-33%29+720p+HDTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Albe_Sure","files":-1,"time":1393396320,"description":"Storage Wars - Season 02 (Episodes 22-33) 720p HDTV\n\nThis is an INCOMPLETE collection which includes only the final 12 episodes of Storage Wars - Season 2, EACH of the following are presented in 720p High-Definition...\n\nIncluded Episodes\n(NOTE: A&amp;E updated their Season 2 Episode list to include two special episodes, &quot;Unlocked: Buy Low&quot; and &quot;Unlocked: Sell High&quot;, so the now current &quot;official&quot; episode numbers for each of the following are TWO lower than they appear on the A&amp;E website.)\n\n22. Make It Rain, Girl&quot; (Originally aired December 6, 2011)\nThe buyers invade the quiet town of Simi Valley, CA. Darrell and Brandon smoke the competition. Jarrod and Brandi find some safes, &quot;release the Kraken,&quot; and walk away with literally a pirate's booty. Dave Hester again breaks down the competition but in the end it's his heart that is left broken.\n\n23. &quot;Smoke 'Em If You Find 'Em&quot; (Originally aired December 13, 2011)\nThe buyers are back in Dave Hester's backyard of Newport Beach, CA and they have a visitor. A heavy hitter is on the scene with a story of buying one of the most famous units in storage buying history, and she has a long history with Dave to boot. Jarrod and Brandi find some &quot;very interesting&quot; antiques. And Barry pays a visit to the doctor, but will the visit pay off for Barry?\n\n24. &quot;The Drone Wars&quot; (Originally aired December 20, 2011)\nThe buyers are back in Gardena, CA and Dave Hester's rival Nabila Hannis is back as well. Jarrod and Brandi get in the game by grabbing a sportsman's locker. Darrell drops seven grand on a unit full of construction equipment, hoping to build a nice nest egg. And Barry Weiss brings a secret weapon, but will it help him? Or break the rules?\n\n25. &quot;Brandi's First Time&quot; (Originally aired January 3, 2012)\nThe buyers are back in Santa Ana, CA with one notable exception, Jarrod Schulz. Construction on Now and Then is finally taking place, and it's forced Brandi to go to the auction by her lonesome. Dave Hester finds some vintage gaming machines. Darrell Sheets proves he's &quot;the real thing&quot;, scoring some vintage bottles. And Brandi buys a locker, but will she make Jarrod proud?\n\n26. &quot;Hooray for Holly-Weird&quot; (Originally aired January 3, 2012)\nThe buyers are in &quot;Tinseltown Adjacent&quot;, otherwise known as North Hollywood, CA. But first it's the grand re-opening of Jarrod and Brandi's store. Jarrod feels stressed to fill the new shelves, but will Brandi give him the license to bid? Dave Hester re-writes the auction record books. Darrell Sheets caves under the Hollywood pressure.\n\n27. &quot;Not Your Average Bear&quot; (Originally aired January 10, 2012)\nThe buyers make a pilgrimage to the desert of Lancaster, CA. West side heavy hitter Nabila Haniss makes the trek and is richly rewarded. Dave Hester brings the fifth wheel and ends up feeling like one. Darrell Sheets &quot;bears down&quot; and wins a unit that makes him feel all warm and cuddly inside. And Barry Weiss proves that you really can catch more flies with sugar.\n\n28. &quot;Don't Bid So Close to Me&quot; (Originally aired January 10, 2012)\nThe buyers do battle in Rancho Cucamonga, CA. Dave Hester arrives in a truck big enough to fit his ego AND a massive house hold unit. Darrell and Brandon try to get back on track. Jarrod and Brandi find a vintage mask, hoping to smoke out the competition. And Barry Weiss continues to march to the beat of his own drum, scoring big with a Rock and Roll' legend.\n\n29. &quot;Hook, Line, and Sucker&quot; (Originally aired January 17, 2012)\nThe buyers head west, to Inglewood, CA. It's Nabila Haniss's neck of the woods, but what she finds could end up shooting blanks. Darrell Sheets's bravado is on display, and not much else. Dave Hester proves once again that auction buying doesn't have to be pretty to be successful. Barry Weiss gambles on unit with a gnarly mattress, but will he stink up the joint, or come out smelling like roses?\n\n30. &quot;Operation Hobo&quot; (Originally aired January 17, 2012)\nThe buyers head to Harbor City, CA. Jarrod and Brandi get back to the business of buying. Dave Hester &quot;Yups&quot; his game as Nabila Haniss tries to bid the circus out of town. Barry Weiss looks like a hobo, and acts like a hobo, but buys like a pro. And Darrell Sheets goes big on the manliest of lockers, but will his unit hit the bullseye..or did Darrell totally blow it?\n\n31. &quot;Blame it on the Rain&quot; (Originally aired January 24, 2012)\nThe Dotson's follow the money to Santa Cruz, CA and the buyers follow the Dotsons...right into a torrential rainstorm. Dave Hester finds some quilts to help keep dry and patch together a profit. Jarrod and Brandi leave just plain soaked. Darrell and Brandon find something that requires getting wet. And Barry unpacks a locker, un-corks a find, but will it get him out of the red?\n\n32. &quot;San Francisco Here We Come&quot; AKA &quot;Viva La San Francsico&quot; (Originally aired January 24, 2012)\nThe buyers stay up north and invade &quot;the city by the bay&quot;... San Francisco, CA. Barry finds an apprentice and an old pair of boxers. Jarrod and Brandi uncover something top secret. Dave Hester's &quot;Yupp Armada&quot; shows up as a show of force. And Darrell &quot;The Gambler&quot; Sheets goes all in, but will he take the pot...or bust?\n\n33. &quot;Highland Anxiety&quot; (Originally aired March 4, 2012)\nThe buyers head for the high desert in Highland, CA. Darrell buys on a hunch, and finds something that gets him out of the danger zone. Dave Hester never gets his money out of his man bag. Jarrod and Brandi experience royal pains. And Barry Weiss follows the signs, but will they point to profit?\n\n\nMy genuine thanks and appreciation go to the original poster(s) of the above individual episodes.  I will only be able seed this collection myself for as much as a week or two...so, if you want to see it survive beyond that, then PLEASE SEED!!!\n\nThank you so much! ;)\n\n\n-A.S.","torrent":{"xt":"urn:btih:5c806bf1d1fd345cbecd401ad36de4ac411b8e4b","amp;dn":"Storage+Wars+-+Season+02+%28Episodes+22-33%29+720p+HDTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c806bf1d1fd345cbecd401ad36de4ac411b8e4b","infoHashBuffer":{"type":"Buffer","data":[92,128,107,241,209,253,52,92,190,205,64,26,211,109,228,172,65,27,142,75]},"announce":[],"urlList":[]}}