{"title":"RiffTrax - Fangs of the Living Dead (mp4)","uid":8620699,"size":885845170,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ce4100f1f386ff916bb87cf4ea4cccedc979fa4&amp;dn=RiffTrax+-+Fangs+of+the+Living+Dead+%28mp4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"saybis","files":1,"time":1372361835,"description":"Even before Prime Minister Berlusconi brought fame to Italy with his countless deviant and reprehensible acts, it was a sexy, saucy nation. And, according to its old horror movies, it's also full of sexy, saucy, abandoned castles, owned by sexy, saucy, possibly dead but still wealthy men. And of course, most important of all, lots of sexy, saucy, scantily clad women to explore these castles and gasp at basically everything they see. As you might have guessed, our new feature Fangs of the Living Dead is loaded with your daily recommended intake of exactly this kind of Sexy Sauce (now available at Arby's).\n\nLeading the way is Anita Ekberg, known for being Miss Sweden, her role in Fellini's La Dolce Vita, and most of all for going out of her way to keep people from finding out she played &quot;the most beautiful model in Italy&quot; in Fangs of the Living Dead about 10 years after all that.\n\nAnita is summoned by her &quot;uncle,&quot; aka the Italian Vincent Price, to a remote castle he claims is her inheritance. What she discovers leads to a shocking twist ending, one SO shocking that not even the filmmakers knew it was coming - seriously, they made the movie one way and at the last minute the producers made them tack on a twist ending that makes no sense. See if you notice! (you will absolutely notice)\n\nEase into your most practical dungeon-exploring negligee and join Mike, Kevin, and Bill for Fangs of the Living Dead!","torrent":{"xt":"urn:btih:5ce4100f1f386ff916bb87cf4ea4cccedc979fa4","amp;dn":"RiffTrax+-+Fangs+of+the+Living+Dead+%28mp4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce4100f1f386ff916bb87cf4ea4cccedc979fa4","infoHashBuffer":{"type":"Buffer","data":[92,228,16,15,31,56,111,249,22,187,135,207,78,164,204,206,220,151,159,164]},"announce":[],"urlList":[]}}