{"title":"Joomla- Community builder 3","uid":4425868,"size":5520809,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5d6d9065f8b2c708f404ef668afddb30ec4040ca&amp;dn=Joomla-+Community+builder+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aisuru","files":7,"time":1223024660,"description":"    * Native compatibility with Joomla 1.5.X (tested up to Joomla 1.5.3), Joomla 1.0.X (tested up to Joomla 1.0.15) and Mambo 4.5.0 - 4.6.4. This means that the single CB 1.2 package will be able to install and work on all three CMS code bases without the need for additional plugins (e.g., Joomla 1.5.X legacy plugin) or modifications. This is the reason the CB Team has given CB 1.2 the code name [ELEFTHERIA], which in Greek means freedom.\n    * Core fields (i.e., first name, middle name, last name, full name, username, avatar-thumbnail, password, parms) are now handled as CB managed fields. This has many nice implication like: allowing email address field to appear on profiles, username to appear on profile, avatar field to appear during registration process, etc.)\n    * All CB fields can now have default values.\n    * CB date field has now been enhanced to operate in date - age mode\n    * New CB password field type\n    * CB fields can now be marked as searchable (for user list searching)\n    * User lists can now be searchable by individual CB (searchable) fields (even core fields) - multi criteria searches permitted. Separate user lists URLs for searchable lists or non searchable lists (for future integration with CB subscription plugin system)\n    * Ajax based DNS and SMTP email address verification at registration and user editing of email address field (primary or extra).\n    * New lost password and lost username recovery functionality.\n    * Replacement tags now work everywhere, even in CB user list filtering. This has many cool implications like dynamic user lists. E.g., A user list that automatically adjusts its filter based on the value of CB fields completed by the viewer. One such example could be a user list of all members that live in the same country as I do.\n    * Field types can be extended or new field types can be created by CB plugin API. E.g., decimal field type can be easily created as a plugin.\n    * New but compatible profile HTML generator with full CSS styling markup.\n    * Optimized SQL and PHP (amount of SQL queries has been reduced by 30-60%).\n    * Core plugins have been updated to support fireboard (1.0.4 and 1.1), uddeIM (1.1) and Yanc (1.5 b3) integrations.\n\nAlso, the CB Team has been preparing its CB Team released plugins to be CB 1.2 compatible. This means that along with CB 1.2 (or shortly after), new CB 1.2 compatible releases of the following plugins will be published\n\n    *\n      CB ProfileBook\n    *\n      CB ProfileGallery\n    *\n      CB Captcha for doc subscribers\n    *\n      CB LastVisitors (Trails plugin)\n    *\n      CB AutoWelcome\n    *\n      CB Authorbot\n    *\n      CB subscriptions plugin [commercial]","torrent":{"xt":"urn:btih:5d6d9065f8b2c708f404ef668afddb30ec4040ca","amp;dn":"Joomla-+Community+builder+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d6d9065f8b2c708f404ef668afddb30ec4040ca","infoHashBuffer":{"type":"Buffer","data":[93,109,144,101,248,178,199,8,244,4,239,102,138,253,219,48,236,64,64,202]},"announce":[],"urlList":[]}}