{"title":"Steam Achievement Manager 6.3","uid":8192938,"size":121344,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5db4e84159b14d9ef9a2d481398fe2be743124c6&amp;dn=Steam+Achievement+Manager+6.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SSJASON","files":-1,"time":1361868878,"description":"Supported Games\n\nThis tool can support any game that has achievements on Steam, even if it is not listed directly in the dropdown box. Simply type its ID into the editable dropdown box text and refresh.\n\nInstructions\n\nInstall Microsoft .NET Framework 3.5 if you do not already have it installed.\nDownload Steam Achievement Manager 6.3.\nExtract it to a directory that is convenient to you, but not your Steam directory. It's a ZIP file, if you don't know how to extract a ZIP file then you probably shouldn't be trying to use this tool.\nRun Steam if it is not already running.\nExit any active VAC protected games if any are running. While this tool does not directly interact with any game itself, it is better safe than sorry.\nRun SAM.Picker.exe and do whatever you want in it.\n\nFrequently Asked Questions\n\nSERVERSIDE ACHIEVEMENTS? WUT?\n\nThat's right. Steam now has the capability to secure achievements from being managed. Naturally this means you can't unlock them. Good for them. :)\nWill I get banned for using this?\n\nImprobable.\nMy achievements were reset!\n\nUse the tool again? (Valve hasn't reset achievements since the original medic pack release)\nThe Announcer (hurr) took away my unlocked weapons!\n\nOH NOES (I don't care).\nSpacewar?\n\nIt's a sample game to demonstrate SteamWorks API to developers.\nCHEATING! HACKING! EARN IT OMG! PLAY ON ACHIEVEMENT MAPS! YOU SUCK! ARRRRRRGGGGGHHH!\n\nThat wasn't a question.\nTroubleshooting\n\nSome games show IDs instead of names for achievements such as TF_KILL_NEMESIS\n\nYou're probably talking about Portal, Half-Life 2: Episode Two, and Team Fortress 2. These games had achievements before the system for achievements was really nailed down in a standard way, so some achievements do not get translated text from Steam, they get the IDs instead. This is a bug in Steam that simply hasn't been fixed because it's such a low issue that doesn't occur normally.\n'generic error' (error #2)\n\nYou don't own the game or the game does not have achievements. If you or it really does, restart Steam and see if the issue clears up.\nAccess Violation! BUH?!\n\nContact me through either SA or FP so I can work the issue out with you.\n\nI WAS VAC BANNED\n\nDumbass.","torrent":{"xt":"urn:btih:5db4e84159b14d9ef9a2d481398fe2be743124c6","amp;dn":"Steam+Achievement+Manager+6.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db4e84159b14d9ef9a2d481398fe2be743124c6","infoHashBuffer":{"type":"Buffer","data":[93,180,232,65,89,177,77,158,249,162,212,129,57,143,226,190,116,49,36,198]},"announce":[],"urlList":[]}}