{"title":"Sonny Clark - 1961 - Leapin' And Lopin' (2014 24 96) FLAC","uid":11549356,"size":1017274390,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5dcd4450ef984f705e5b7457266debeaabd8b025&amp;dn=Sonny+Clark+-+1961+-+Leapin%27+And+Lopin%27+%282014+24+96%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eika256","files":-1,"time":1416764088,"description":"Sonny Clark - 1961 - Leapin' And Lopin' (2014)\nHDTracks, 24 bits, 96 KHz\n\nSonny Clark's fifth Blue Note recording as a leader is generally regarded as his best, especially considering he composed four of the seven tracks, and they all bear his stamp of originality. What is also evident is that he is shaping the sounds of his quintet rather than dominating the proceedings as he did on other previous dates. Tenor saxophonist Charlie Rouse and trumpeter Tommy Turrentine play very little harmony on the date, but their in-tune unison lines are singularly distinctive, while bassist Butch Warren and a young drummer Billy Higgins keep the rhythmic coals burning with a steady glowing red heat. Among the classic tunes is the definitive hard bop opener &quot;Somethin' Special&quot; which lives up to its title in a most bright and happy manner, with Clark merrily comping chords. &quot;Melody for C&quot; is similarly cheerful, measured, and vivid in melodic coloration, the CD containing a slightly longer alternate take. &quot;Zellmar's Delight,&quot; not included on the original LP, finally has the tenor and trumpet playing harmony during a tricky, progressive melody, not at all conventional, which is perhaps why it was initially omitted. The showstopper is &quot;Voodoo,&quot; the ultimate yin/yang, dark, late night, sly and slinky jazz tune contrasted by Clark's tinkling piano riffs. Warren wrote the exciting hard bopper &quot;Eric Walks&quot; reminiscent of a Dizzy Gillespie tune, while Turrentine's &quot;Midnight Mambo&quot; mixes metaphors of Afro-Cuban music with unusual off-minor phrases and the stoic playing of Rouse. Tenor saxophonist Ike Quebec plays a cameo sans the other horns on the soulful ballad &quot;Deep in a Dream,&quot; exhibiting a vocal quality on his instrument, making one wonder if any other sessions with this group were done on the side. Top to bottom Leapin' and Lopin' is a definitive recording for Clark, and really for all time in the mainstream jazz idiom. (AllMusic)\n\nTrack list:\n01 - Somethin' Special\n02 - Deep In A Dream\n03 - Melody For C\n04 - Eric Walks\n05 - Voodoo\n06 - Midnight Mambo\n\nPersonnel:\nSonny Clark - piano\nTommy Turrentine - trumpet\nCharlie Rouse, Ike Quebec (#2 only) - tenor saxophone\nButch Warren - bass\nBilly Higgins - drums\n\nConverted with Adobe Audition from 192 KHz to 96 KHz.\nEnjoy and share!","torrent":{"xt":"urn:btih:5dcd4450ef984f705e5b7457266debeaabd8b025","amp;dn":"Sonny+Clark+-+1961+-+Leapin%27+And+Lopin%27+%282014+24+96%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dcd4450ef984f705e5b7457266debeaabd8b025","infoHashBuffer":{"type":"Buffer","data":[93,205,68,80,239,152,79,112,94,91,116,87,38,109,235,234,171,216,176,37]},"announce":[],"urlList":[]}}