{"title":"International Steam Tables (2008) - (Malestrom)","uid":4839060,"size":7914886,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e0f9c374d69dee9a1bdf3c4c6c4acfbba7e2cb2&amp;dn=International+Steam+Tables+%282008%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1239434764,"description":" &lt;a href=&quot;http://www.image-upload.net/images/cmc6jx4n3h23vndyq2fu.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/cmc6jx4n3h23vndyq2fu.jpeg&lt;/a&gt;\n\nInternational Steam Tables - Properties of Water and Steam based on the Industrial Formulation IAPWS-IF97: Tables, Algorithms, Diagrams\nPublisher: Springer | Pages: 392 | 2008-02-06 | ISBN 3540214194 | PDF \n\nSteam tables for practical industrial use are presented which have been calculated using the international standard for the thermodynamic properties of water and steam, the IAPWS-IF97 formulation, and the international standards for transport and other properties. In addition, the complete set of equations of IAPWS-IF97 is presented including all supplementary backward equations adopted by IAPWS between 2001 and 2005 for fast calculations of heat cycles, boilers, and steam turbines. For the first time these steam tables contain the following features: A compact disc (CD) providing an interactive electronic steam table for the calculation of all properties used in the book dependent on pressure and temperature. Formulas to calculate from IAPWS-IF97 arbitrary partial derivatives of the eight most important properties; this is very helpful in non-stationary process modelling. Inclusion of the specific enthalpy and enthalpy differences into the uncertainty values of IPWS-IF97 regarding the most important properties. Pressure-temperature diagrams with isolines of all properties contained in the steam tables and further properties. Moreover, a Mollier h-s diagram and a T-s diagram are enclosed as full-colour wall charts in A1-format.","torrent":{"xt":"urn:btih:5e0f9c374d69dee9a1bdf3c4c6c4acfbba7e2cb2","amp;dn":"International+Steam+Tables+%282008%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e0f9c374d69dee9a1bdf3c4c6c4acfbba7e2cb2","infoHashBuffer":{"type":"Buffer","data":[94,15,156,55,77,105,222,233,161,189,243,196,198,196,172,251,186,126,44,178]},"announce":[],"urlList":[]}}