{"title":"Transformers: Generation 2 1-12 (1993) + More (Requested)","uid":8022426,"size":205751767,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5e16277d4d43b7479519687654310a2827041740&amp;dn=Transformers%3A+Generation+2+1-12+%281993%29+%2B+More+%28Requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackcanary","files":-1,"time":1358235091,"description":"English | CBR | 18 Issues\n\nTransformers: Generation 2 #1-12\nPublisher:  Marvel\nPublication Date:  November 1993 - October 1994\n\nThe story begins several months after the conclusion of the previous comic, with the Decepticons in exile, and the Autobots freed of their merciless hounding. Optimus Prime however, is far from jubilant, as he and the Autobots are still locked in combat long after the great wars have ended, as if looking for a reason to continue serving as soldiers, Prime is also haunted by mysterious visions generated by the Matrix, in which he is consumed by an unidentified plague.\n\nThe Autobots are soon overrun by a mysterious new breed of Transformer, or so it would appear, but upon capture, Prime and the Autobots learn that these Transformers are descendants of the Decepticons. Their leader, Jhiaxus, claims that both factions have long ended their war and have become one race of Cybertronians, cooperating in the goal of expanding the Transformer dynasty, Prime is disgusted to find Jhiaxus's troops have been launching attacks on defenseless planets, and escapes with his troops to oppose the new breed.\n\nMeanwhile, on Earth, Megatron, reborn and rebuilt by Cobra, infiltrates the salvaged Ark and begins to take over it, hoping to launch it and use it as a means of attacking Earth, drawing out Optimus Prime so he can seize the Matrix, but his schemes are hampered by a combined attack by both G.I. Joe and Fortress Maximus, and the latter sacrifices himself to destroy the Ark. Delayed, but not defeated, Megatron next turns his attention to destroying Bludgeon, the present day commander of the G1 Decepticons, and to reclaim leadership.\n\nAfter several encounters with Jhiaxus, and still haunted by his visions, Prime enlists the aid of Cybertronian elders to uncover the origins of the new Cybertronians, he learns that all Transformers once had a reproductive capability that enabled them to create life on their own, but once Cybertron had a sizable population, the capability became dormant. Prime discovers that the Elders reactivated it during the Autobots' absence on Earth, and that since the progress was never intended to be restarted, the Cybertronians were flawed immeasurably. Prime tries to convince Megatron of the threat.\n\nMegatron chooses instead to ambush and defeat Prime than ally with him, he also takes the matrix but he also trusts Prime's warnings and faces Jhiaxus himself, only to be defeated and left for dead, the matrix taken from him, to further complicate things, his treacherous lieutenant Starscream allies himself with Jhiaxus to get closer to the Matrix.\n\nAnother shocking development begins to occur across several solar systems, The Swarm, a mass of black energy, a by-product of Cybertronian reproduction, is wandering the stars, attracted to any being made of metal, and consuming them entirely, the swarm makes its way to Earth's sector, where a final battle has begun between the allied Transformers against the Cybertronians. During the conflict, Starscream briefly gains control of the Matrix, but eventually returns it to Prime when its inherent goodness corrupts his program, Jhiaxus succumbs to an insanity long repressed that reflected his barbaric side and he nearly destroys Optimus before being consumed by the invading Swarm.\n\nPrime finally grasps the truths behind his visions and realizes the Matrix is the one device that can reach out to the Swarm, so he allows them to kill him, hoping they will soon penetrate the Matrix. They do so, and the resulting energy barrage of knowledge and power transforms The Swarm, giving them a conscience. The Swarm resurrect Prime and give him a new body, before vanishing into the stars. The hostilities between the Autobots and the Decepticons come to a temporary halt, although how long it lasts depends on the outcome of a mysterious conversation taking place within a large complex in the depths of space between a G2 drone and a mysterious omnipotent being known only as the Liege Maximo.\n\nTransformers: Generation 2 Halloween Special Edition\nPublisher:  Marvel\nPublication Date:  October 1993\n\nTransformers (UK): Generation 2 #1-5\nPublisher:  Fleetway\nPublication Date:  October 1994 - February 1995\n\nG2's US run also inspired a brief UK version that, for the first two issues, introduced the storyline differently to reel in new readers, and then reprinted several G2 comics afterwards, the series was not a success and folded after several issues.","torrent":{"xt":"urn:btih:5e16277d4d43b7479519687654310a2827041740","amp;dn":"Transformers%3A+Generation+2+1-12+%281993%29+%2B+More+%28Requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e16277d4d43b7479519687654310a2827041740","infoHashBuffer":{"type":"Buffer","data":[94,22,39,125,77,67,183,71,149,25,104,118,84,49,10,40,39,4,23,64]},"announce":[],"urlList":[]}}