{"title":"Keiko Matsui - Deep Blue (2001) [CD Rip] 320 vtwin88cube","uid":6242969,"size":106886559,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e413464446de3265e139306f843d9c079932f06&amp;dn=Keiko+Matsui+-+Deep+Blue+%282001%29+%5BCD+Rip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1300134106,"description":"Keiko Matsui\nDeep Blue (2001)\n\n\nFusion/new age keyboard player Keiko Matsui grew up in Tokyo and took her first piano lesson at the age of five. Influenced by Stevie Wonder and Rachmaninov as well as early fusion masters Maurice Jarre and Chick Corea, Matsui began composing while in junior high but studied children's culture at the Japan Women's University (Nihon Joshidaigaku). She moved to the Yamaha Music Foundation in Tokyo after graduation and formed Cosmos, recording four albums with the new age group. Her first album as a leader, 1987's A Drop of Water, was released in the U.S. two years after the fact on Passport. The LP also featured her touring partner and husband, shakuhachi player Kazu Matsui, and was financed with their honeymoon money. A contract with MCA that year resulted in two albums, No Borders and Under Northern Lights. Matsui moved to the White Cat label in 1992 and began charting in the contemporary jazz charts. Her 1995 album Sapphire hit number one on the charts, and its follow-up also reached the Top Ten the following year. Whisper from the Mirror followed in 2000; Deep Blue appeared the next year. The Ring from 2002 recalled the composer's classical background, while 2004's Wildflower flirted with world music. Walls of Akendora appeared in 2005 with a smooth jazz flavor and updated version of Matsui's early hit, &quot;Mountain Shakedown.&quot; Moyo, an album that placed Matsui's piano in an orchestral setting, followed in 2007 on the Shout! Factory imprint. After a world tour and numerous festival appearances, Matsui took some time off, eventually returning with The Road... in 2011 on Shanachie. She produced most of the disc herself -- and received help on some cuts from Richard Bona, Craig Burbridge, and Joe Chicarelli. The nine-tune set showcases Matsui's playing in a variety of settings from trio to octet. Some of her musical guests include Bona, Kirk Whalum, Vinnie Colaiuta, and Jackiem Joyner. \n\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nGrabber:\t\tdBpoweramp Release 14\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tJazz/New age\nSource:\t\t\tRetail CD\nLabel:\t\t\tNarada\n\nTrack List:\n\n01.Deep Blue\n02.Water For The Tribe\n03.Across The Sun\n04.Trees\n05.Mediterranean Eyes\n06.Rose In Morocco\n07.Moonflower\n08.Crescent Night Dreams\n09.To The Indian Sea\n10.Mystic Dance\n\n","torrent":{"xt":"urn:btih:5e413464446de3265e139306f843d9c079932f06","amp;dn":"Keiko+Matsui+-+Deep+Blue+%282001%29+%5BCD+Rip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e413464446de3265e139306f843d9c079932f06","infoHashBuffer":{"type":"Buffer","data":[94,65,52,100,68,109,227,38,94,19,147,6,248,67,217,192,121,147,47,6]},"announce":[],"urlList":[]}}