{"title":"The Posies - Frosting on the Beater (Flac) [FrankFoo]","uid":10914460,"size":353559978,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ee37b25d0f4da6fcd70aad026291858caa89b31&amp;dn=The+Posies+-+Frosting+on+the+Beater+%28Flac%29+%5BFrankFoo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1409294515,"description":"\nThe Posies - Frosting on the Beater (flac)\n\n\nAll Music Guide Review\n\nFrosting on the Beater opens with a thick wall of distorted guitars and booming drums kicking up a very melodic fuss behind Ken Stringfellow and Jonathan Auer's creamy-smooth harmonies on the psych-tinged &quot;Dream All Day,&quot; and the track's sweet-and-sour blend immediately announces this is going to be a very different affair than the Posies' major label debut, Dear 23. \n\nWith noisy rock dude Don Fleming in the producer's chair, it came as no great surprise that Frosting on the Beater was a much harder sounding album than the introspective Dear 23, but surprisingly enough, Fleming also knew how to make the most of the band's expert pop songwriting; with the tempos and guitars turned, the tunes gained a needed physical impact that brought the melodies and hooks into the forefront, where they belonged. \n\nJust as importantly, the spot-on harmonies that were the highlight of Dear 23 were still very much in evidence, resting atop the piles of fuzzy guitar chords like a dollop of hot fudge poured over a big scoop of ice cream. \n\nAnd prior to this, who knew that Ken Stringfellow and Jonathan Auer could rock out so hard (and so well) on guitars? \n\nOne could argue that the big guitar attack of Frosting on the Beater was simply the Posies' way of trying to cash in on the grunge sweepstakes that briefly turned their hometown of Seattle into the center of the rock universe. \n\nBut one listen also reveals that it transformed a smart but overly precious pop outfit into a hard-charging power pop band that gained a wealth of strength without giving up any of their smarts in the process -- not a bad bargain.\n\nMark Deming, All Music Guide\n\nLinage: CD &gt; EAC &gt; flac\n\nIncluded: NFO, PLS, M3U, LOG, CUE\nCovers: Front \nTags: VorbisComment\n\n\nTrack Listing\n\n01. Dream All Day\n02. Solar Sister\n03. Flavor of the Month\n04. Love Letter Boxes\n05. Definite Door\n06. Burn &amp; Shine\n07. Earlier Than Expected\n08. 20 Questions\n09. When Mute Tongues Can Speak\n10. Lights Out\n11. How She Lied by Living\n12. Coming Right Along\n\nPlaying Time.........: 46:32\n\nA FrankFoo Original Rip\n\n\nMultiTracker @ FrankFoo\n","torrent":{"xt":"urn:btih:5ee37b25d0f4da6fcd70aad026291858caa89b31","amp;dn":"The+Posies+-+Frosting+on+the+Beater+%28Flac%29+%5BFrankFoo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ee37b25d0f4da6fcd70aad026291858caa89b31","infoHashBuffer":{"type":"Buffer","data":[94,227,123,37,208,244,218,111,205,112,170,208,38,41,24,88,202,168,155,49]},"announce":[],"urlList":[]}}