{"title":"Anne Frank - The Diary of a Young Girl","uid":5199272,"size":511508296,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5f61747406c55c39c5c7837de184b46c1ff4abff&amp;dn=Anne+Frank+-+The+Diary+of+a+Young+Girl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"g-roid","files":-1,"time":1260076629,"description":"ANNE FRANK: \nThe Diary of a Young Girl\n\nRead by: Susan Adams\n\nAnne Frank, it has been said, gave a face and a name to the horror of the Holocaust. This is her story. It relates how Anne, her family, and friends hid in secret rooms--&quot;the Annex&quot;--in an Amsterdam warehouse for 25 months. Anne, just 13 when the family moved in, and only 15 when the Gestapo at last broke down the doors of her secret world, found hope where there was only fear and the first blush of love when outside and all around there washed a sea of hate.\n\nWrote Ernst Schnable, a German writer who has researched Frank's life: &quot;Out of the millions that were silenced, this voice no louder than a child's whisper has outlasted the shouts of the murderers and has soared above the voices of time.&quot; \n\n&quot;An incredible reading of Anne Frank's diary. Optimistic, enthusiastic, and a vibrant tribute to an intelligent young woman whose life was cut short so tragically in the Nazi concentration camp at Belsen. Anne speaks to all ages and all people.&quot; --&quot;Lawrence Eagle Tribune&quot;\n \n&quot;The young voice of Susan Adams paces and inflects this diary with utmost skill. Also commendable is the fine afterword in which the historical context and the remaining details of Ann Frank's lift are explained.&quot; --&quot;Booklist&quot; \n\n9 hours from 8 compact discs at 128 kbps in MP3 format.","torrent":{"xt":"urn:btih:5f61747406c55c39c5c7837de184b46c1ff4abff","amp;dn":"Anne+Frank+-+The+Diary+of+a+Young+Girl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f61747406c55c39c5c7837de184b46c1ff4abff","infoHashBuffer":{"type":"Buffer","data":[95,97,116,116,6,197,92,57,197,199,131,125,225,132,180,108,31,244,171,255]},"announce":[],"urlList":[]}}