{"title":"The Joy of Yoga: Fifty Sequences for Your Home and Studio Practi","uid":11092892,"size":10714435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fa2f5285059a05f2921f49684a92b8fa98c5612&amp;dn=The+Joy+of+Yoga%3A+Fifty+Sequences+for+Your+Home+and+Studio+Practi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SectorVector","files":-1,"time":1411551391,"description":"The Joy of Yoga: Fifty Sequences for Your Home and Studio Practice\n\nBy Emma Silverman and Kerri Frail (Illustrator)\n\n# Pages     : 208.\n# Publisher : Skyhorse Publishing, 2014.\n# ISBN-13   : 978-1628737769\n# Format    : EPUB (Illustrated).\n\n\nMillions of people take time out  of their busy schedules every day to\nattend yoga classes where they learn postures and breathing techniques\nthat make  them feel more  energized and balanced. Thousands  of other\npeople, however, have yet to find the time in their day to do anything\nbut work,  study, or chase after  their children. In The  Joy of Yoga,\nauthor and expert Emma Silverman teaches readers how to take advantage\nof the  health benefits yoga  offers even when  they can't make  it to\nregularly scheduled classes.\n\n\nThe Joy of Yoga offers short  sequences that readers can perform while\nseated on  airplanes, standing at  the bus  stop, or even  waiting for\nwater to  boil. In addition, it  also includes sequences to  help with\ndaily  aches, pains,  and annoyances,  such as  tired feet,  sensitive\nwrists, neck and shoulder tension,  lower back pain, anxiety, and even\nheartbreak. Gardeners, cyclists, and  runners will also find exercises\nthat will help  ease the tension in their muscles  after long hours of\nwork or play.\n\n\nThe Joy of Yoga will also:\n\n* Provide step-by-step  instructions on asana (postures)  and pranayama\n  (breathing techniques) for fifty sequences\n\n* Includes the benefits of each  sequence and helpful information about\n  modifications for poses\n\n* Encourage  readers  to  create  sequences on  their  own,  using  the\n  sequences in the book as starting points\n\n\nAuthor\n======\nEmma Silverman is the author and founder  of the blog The Joy of Yoga.\n\nHer yoga  journey began with  dedicated Iyengar study and,  after more\nthan fifteen years of practice, she has also studied Bikram, Ashtanga,\nKundalini, and  Vinyasa Flow. After  working at the  Kripalu Institute\nfor Yoga and Health (North America's largest yoga retreat center), she\nis currently a  yoga instructor at Cornell  University, with thousands\nof  students worldwide. \n\nShe resides in Ithaca, New York.\n\n-_-","torrent":{"xt":"urn:btih:5fa2f5285059a05f2921f49684a92b8fa98c5612","amp;dn":"The+Joy+of+Yoga%3A+Fifty+Sequences+for+Your+Home+and+Studio+Practi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa2f5285059a05f2921f49684a92b8fa98c5612","infoHashBuffer":{"type":"Buffer","data":[95,162,245,40,80,89,160,95,41,33,244,150,132,169,43,143,169,140,86,18]},"announce":[],"urlList":[]}}