{"title":"Margaret Peterson Haddix - Shadow Children Series Complete - 7 B","uid":7017898,"size":16516853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:609510ee1e5fc07c6e5964375e83e1a7c8369507&amp;dn=Margaret+Peterson+Haddix+-+Shadow+Children+Series+Complete+-+7+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1328726795,"description":"Shadow Children series by Margaret Peterson Haddix\nRequirements: epub, mobi, pdf reader | 634 KB | 648 KB | 738 KB | 1.0 MB | 1.37 MB | 932 KB\nOverview: In a future where the Population Police enforce the law limiting a family to only two children, Luke has lived all his twelve years in isolation and fear on his family\\'s farm, until another \\&quot;third\\&quot; convinces him that the government is wrong...\n\nBook 1: Among the Hidden\nIn a future where the Population Police enforce the law limiting a family to only two children, Luke has lived all his twelve years in isolation and fear on his family\\'s farm, until another \\&quot;third\\&quot; convinces him that the government is wrong.\n\nBook 3: Among the Betrayed\n\\&quot;Everything that had happened to Nina was real. She had real handcuffs on her wrists, real scars on her back, real fear flooding her mind.\n\n\\&quot;\\'They\\'re going to kill me,\\' Nina whispered, and it was almost a relief to finally, finally give up hope.\\&quot;\n\nIn a society that allows no more than two children per family under penalty of death, third children are forced into hiding, or to live with false identity papers. In Among the Impostors, Nina Idi was arrested for treason for supposedly trying to trick the Population Police into arresting other students she said were illegal third children. Now she faces torture or death -- unless she agrees to betray three other imprisoned third children. Her dilemma intensifies when she meets the prisoners -- who are only ten, nine, and six.\n\nAs she did so brilliantly in the Publishers Weekly best-selling Among the Hidden and in Among the Impostors, Margaret Peterson Haddix once again brings readers to a world in which nothing is as it seems -- a world in which an imprisonment leads to an adventure of mind, body, and spirit.\n\nBook 4: Among the Barons\nMargaret Peterson Haddix continues her Shadow Children series with this harrowing tale about a boy in hiding, and his sudden catapult into upper-crust Baron life. In absorbing scenes that change direction with each page turn, Haddix tells the story of Luke Garner, a \\&quot;third child\\&quot; at the Hendricks School for Boys who is told that his identity has suddenly become \\&quot;Lee Grant.\\&quot; Now the son of a wealthy Baron family, Luke (\\&quot;Lee\\&quot;) is confused until his brother comes to Hendricks, after which the two get taken back to the Grant mansion, and he learns that the real Lee (who is dead) was killed in \\&quot;illegal\\&quot; activity meant to undermine his own parents. Sure to keep Shadow Children fans salivating for more, Among the Barons is an eerily riveting read you won\\'t want to put down.\n\nBook 5: Among the Brave\nIn a society that allows families to have only two children, a group of third-borns tries to save themselves and others like them.\n\nBook 6: Among the Enemy \nAn ache grew in his throat and he wanted to sob, but he set his jaw and held it in. He\\'d been wrong to send Nina away, wrong to refuse to help her, wrong to let the commander treat him like a pet. He\\'d been wrong to think that everything ended when he lost Percy and Alia....I can stop this evil, he thought.\n\nThe Population Police are gaining more and more power, and illegal third-borns are in increasing danger. Young Matthias finds himself caught in the cross fire between the Population Police and the rebels -- and unwittingly ends up saving the life of a Population Police officer. By way of reward, the officer takes Matthias to the luxury of Population Police headquarters to train him to become one of their own. There, among his most feared enemies, Matthias encounters Nina, another illegal third-born, who enlists his help in a plot to undermine the Population Police. But Matthias is under constant scrutiny, he has no idea whom he can trust, and he\\'s mourning the loss of his friends Percy and Alia. What can one boy do against a wicked bureaucracy?\n\nIn the most exciting Shadow Children book yet, Margaret Peterson Haddix examines how the courage of individuals can make an impact on growing evil.\n\nBook 7: Among the Free\n\\&quot;Enough games,\\&quot; the man said, raising the gun yet again. \\&quot;And enough of the Population Police, I say.\\&quot;\n\nThis time he cocked the gun and aimed carefully.\n\nThis is real, Luke thought. This is really going to happen.\n\n\\&quot;No, don\\'t!\\&quot; he screamed.\n\nLuke Garner is a third-born in a restrictive society that allows only two children per family. Risking his life, he came out of hiding to fight against the Population Police laws. Now, in the final volume of Margaret Peterson Haddix\\'s suspenseful Shadow Children series, Luke inadvertently sets off a rebellion that results in the overthrow of the government. The people are finally free. But who is in charge now? And will this new freedom be everything they had hoped?\n\nWith all of the plot twists and excitement Haddix\\'s fans have come to expect, Among the Free brings the Shadow Children sequence to a chilling conclusion.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:609510ee1e5fc07c6e5964375e83e1a7c8369507","amp;dn":"Margaret+Peterson+Haddix+-+Shadow+Children+Series+Complete+-+7+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"609510ee1e5fc07c6e5964375e83e1a7c8369507","infoHashBuffer":{"type":"Buffer","data":[96,149,16,238,30,95,192,124,110,89,100,55,94,131,225,167,200,54,149,7]},"announce":[],"urlList":[]}}