{"title":"Langmuir Blodgett Films - An Introduction - Michael C. Petty","uid":12128395,"size":3390858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61b132d0985b31820a7d74f089e0052f38847030&amp;dn=Langmuir+Blodgett+Films+-+An+Introduction+-+Michael+C.+Petty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1436981821,"description":"Langmuir Blodgett Films - An Introduction - Michael C. Petty (Cambridge).djvu\n\nLangmuir-Blodgett films are the focus of intense current worldwide interest, as the ability to deposit organic films of nanometer thicknesses has many implications in materials science and in the development of new electronic and opto-electronic devices. This book provides a multidisciplinary introduction to the subject of Langmuir-Blodgett films. Beginning with the application of simple thermodynamics to the common bulk phases of matter, the book outlines the nature of the phases associated with floating monolayer films. The Langmuir-Blodgett deposition process itself is described in some detail and contrasted with other thin film techniques. The author separately discusses monolayer-forming materials and the structural, electrical and optical properties of Langmuir-Blodgett films. Each chapter is comprehensive, easy to understand and generously illustrated. Petty provides appendices for the reader wishing to delve deeper into the physics and chemistry background. Graduates and postgraduates in materials science will find this text of great interest","torrent":{"xt":"urn:btih:61b132d0985b31820a7d74f089e0052f38847030","amp;dn":"Langmuir+Blodgett+Films+-+An+Introduction+-+Michael+C.+Petty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61b132d0985b31820a7d74f089e0052f38847030","infoHashBuffer":{"type":"Buffer","data":[97,177,50,208,152,91,49,130,10,125,116,240,137,224,5,47,56,132,112,48]},"announce":[],"urlList":[]}}