{"title":"Sexually Broken--Mia Li bound and face fucked by BBC, brutal dee","uid":10286225,"size":752733655,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:61f64352fea577b3e4aacd54888abe02c829935c&amp;dn=Sexually+Broken--Mia+Li+bound+and+face+fucked+by+BBC%2C+brutal+dee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1401782031,"description":"Mia Li gets bound and face fucked by BBC, brutal deep throat on 2 dicks, epic throat training! | Mia Li | Matt Williams\n\nJune 2, 2014\n\n\nHD MP4 only.\n\n\nEverybody loves Mia Li. She is bubbly, eager and loves to fuck. Too bad for this hot Asian piece of ass we are not fucking her today. Today is not about her pleasure, it is going to be about binding her down and turning her face hole into a pussy for our use. Wd are going to completely deconstruct this starlet with dick. This will be throat training at its finest.\n\nBound down on her knees and shacked into a custom made bondage device with her arms cranked behind her and her vision cut off by a leather blindfold, Mia can not see or anticipate what is going to happen. All she can do is take what we wish to dish out. And what we are going to dish out is an unrelenting serving of dick. We step up and make ourselves at home. Mia's warm open mouth is right where we belong.\n\nOne after the other the rock hard cocks run a train on that open mouth hole. The training begins. Locked in total darkness, Mia gasps and moans as the dicks own the back of her throat meat. The drool flows out and down onto her breasts, coating and discoloring her dress. We rip off the blindfold so that we can see those big eyes as 10 inches of cock disappear down those lips. The BBC owns her tender throat and her eyes glaze. We throw in the vibrator because we are nothing if not generous. Mia cums hard, over and over, straining in her bondage.\n\nThe bondage, orgasms and relentless dick all have served their purpose. Mia is a wrecked shell of starlet. Her hair is destroyed, her makeup is destroyed, her face a drool covered mess. Her ruined drool covered dress strains across her large breasts. She sags limply in her bondage, the true definition of sexually broken. This one was fun. \n \n\nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_02mli/SexuallyBroken-Mia-Li-Matt-Williams-Mia-Li-gets-bound-and-face-fucked-by-BBC-brutal-deep-throat-on-2-dicks-epic-throat-training.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/06_02mli/SexuallyBroken-Mia-Li-Matt-Williams-Mia-Li-gets-bound-and-face-fucked-by-BBC-brutal-deep-throat-on-2-dicks-epic-throat-training.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:61f64352fea577b3e4aacd54888abe02c829935c","amp;dn":"Sexually+Broken--Mia+Li+bound+and+face+fucked+by+BBC%2C+brutal+dee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61f64352fea577b3e4aacd54888abe02c829935c","infoHashBuffer":{"type":"Buffer","data":[97,246,67,82,254,165,119,179,228,170,205,84,136,138,190,2,200,41,147,92]},"announce":[],"urlList":[]}}