{"title":"Darwin, His Daughter, and Human Evolution - Randal Keynes (PDF)","uid":14264979,"size":7038237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62002977d57b3e9283508ee341f765d1102fee6c&amp;dn=Darwin%2C+His+Daughter%2C+and+Human+Evolution+-+Randal+Keynes+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pahly","files":1,"time":1460253658,"description":"In this intimate portrait of the great naturalist as devoted family man, Keynes describes how Charles Darwin's &quot;life and his science were all of a piece.&quot; The great-great-grandson of the scientist, Keynes uses published documents as well as family papers and artifacts to show how Darwin's thinking on evolution was influenced by his deep attachment to his wife and children. In particular, his anguish over his 10-year-old daughter Annie's death sharpened his conviction that the operation of natural laws had nothing to do with divine intervention or morality. Keynes, also a descendant of economist John Maynard Keynes, shows that much of Darwin's intellectual struggle in writing On the Origin of Species and The Descent of Man arose from his efforts to understand the role of suffering and death in the natural order of the world. Early in his career, Darwin saw the indifference of natural law as an answer to the era's religious doubts about how a benevolent god could permit human misery; cruelty and pain, he argued, should not be seen as moral issues, but as inevitable outcomes of nature. After Annie's death, however, Darwin's views darkened, and in a private letter he railed against the &quot;clumsy, wasteful, blundering low and horridly cruel works of nature!&quot; Though Keynes doesn't break new ground about Darwin's life and work, he produces a moving tribute to a thinker who, despite intimate acquaintance with the pain inflicted by the &quot;war of nature,&quot; could still marvel that, from this ruthless struggle, &quot;endless forms most beautiful and most wonderful have been, and are being, evolved.&quot; Publishers Weekly","torrent":{"xt":"urn:btih:62002977d57b3e9283508ee341f765d1102fee6c","amp;dn":"Darwin%2C+His+Daughter%2C+and+Human+Evolution+-+Randal+Keynes+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62002977d57b3e9283508ee341f765d1102fee6c","infoHashBuffer":{"type":"Buffer","data":[98,0,41,119,213,123,62,146,131,80,142,227,65,247,101,209,16,47,238,108]},"announce":[],"urlList":[]}}