{"title":"Heartland.S03E08.The.Fix.WS.XviD-err0001.avi","uid":5177516,"size":367032320,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:624c0f3f4d2b25ce477c7023f9627e58438323e9&amp;dn=Heartland.S03E08.The.Fix.WS.XviD-err0001.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"err0001","files":-1,"time":1259056359,"description":"Heartland S03E08: The Fix\n\nTy's abusive stepfather Wade, played with a real edge by Ian Tracey, has shown up unannounced and uninvited to try to win Ty's mom, Lily, over. Lily, played by Megan Follows, still has feelings for Wade, but she knows in her heart that he has been a destructive force in both her life and in Ty's. Wade won't give up in his pursuit of Lily however, and to fix things Lily must choose between her husband and the son she has not seen in years. Something's got to give...\n\nAnother thing that needs fixing - or so we're led to believe - is a rodeo cowboy's roping horse that is brought to Heartland for Amy to work her magic on. Caleb even gets involved trying to help out. But sometimes the problem - and the solution - lies elsewhere. This week we welcome appearances by Jonathan Keltz as the cowboy and Michael Rhoades as his father.\n\nAnd there's even more to be fixed! Over the years Jack has accumulated a lot of... stuff. When Lou wants to make room in the quonset hut to store her jam, Jack finds it hard to part with his lifetime of belongings. Something has to be worked out here, and it kind of results in an unrelated problem getting fixed.\n\nAnd of course a &quot;fix&quot; refers to something being rigged... something like a horse race. This week's episode features a horse race, involving Tim's racehorse going head to head with Lisa's... and what happens.\n\nThe resolution is 608x352 and the quality is quite watchable in my opinion. This episode aired on CBC on Nov 22, 2009.","torrent":{"xt":"urn:btih:624c0f3f4d2b25ce477c7023f9627e58438323e9","amp;dn":"Heartland.S03E08.The.Fix.WS.XviD-err0001.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"624c0f3f4d2b25ce477c7023f9627e58438323e9","infoHashBuffer":{"type":"Buffer","data":[98,76,15,63,77,43,37,206,71,124,112,35,249,98,126,88,67,131,35,233]},"announce":[],"urlList":[]}}