{"title":"Emma Healey - Elizabeth Is Missing","uid":12731036,"size":321838248,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:63013df1eb0da0ed614046bd24a8158643f4db96&amp;dn=Emma+Healey+-+Elizabeth+Is+Missing&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Cybotage","files":12,"time":1447114620,"description":"In this darkly riveting debut novel—a sophisticated psychological mystery that is also a heartbreakingly honest meditation on memory, identity, and aging—an elderly woman descending into dementia embarks on a desperate quest to find the best friend she believes has disappeared, and her search for the truth will go back decades and have shattering consequences.\r\n\r\nMaud, an aging grandmother, is slowly losing her memory—and her grip on everyday life. Yet she refuses to forget her best friend Elizabeth, whom she is convinced is missing and in terrible danger.\r\n\r\nBut no one will listen to Maud—not her frustrated daughter, Helen, not her caretakers, not the police, and especially not Elizabeth's mercurial son, Peter. Armed with handwritten notes she leaves for herself and an overwhelming feeling that Elizabeth needs her help, Maud resolves to discover the truth and save her beloved friend.\r\n\r\nThis singular obsession forms a cornerstone of Maud's rapidly dissolving present. But the clues she discovers seem only to lead her deeper into her past, to another unsolved disappearance: her sister, Sukey, who vanished shortly after World War II.\r\n\r\nAs vivid memories of a tragedy that occurred more fifty years ago come flooding back, Maud discovers new momentum in her search for her friend. Could the mystery of Sukey's disappearance hold the key to finding Elizabeth?","torrent":{"xt":"urn:btih:63013df1eb0da0ed614046bd24a8158643f4db96","amp;dn":"Emma+Healey+-+Elizabeth+Is+Missing","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63013df1eb0da0ed614046bd24a8158643f4db96","infoHashBuffer":{"type":"Buffer","data":[99,1,61,241,235,13,160,237,97,64,70,189,36,168,21,134,67,244,219,150]},"announce":[],"urlList":[]}}