{"title":"Maarten van Rossem - Typisch Nederland, Typi... (FLAC, 2010)","uid":10495660,"size":1043641194,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:632d0193141b598b690ae10b3d090d44a967ca06&amp;dn=Maarten+van+Rossem+-+Typisch+Nederland%2C+Typi...+%28FLAC%2C+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":23,"time":1404616309,"description":"Nederland is een typisch calvinistisch land waar het voortdurend regent, ons land puilt bovendien uit van de uitkeringstrekkers, heeft een beroerde keuken en een bijzonder ongunstig belastingklimaat. Het zijn maar enkele van de vooroordelen die historicus Maarten van Rossem tijdens dit luistercollege op zijn bekende wijze doorprikt.\n\nVan een diep gewortelde Nederlandse identiteit is, aldus Van Rossem, geen sprake: 'Culturele eigenaardigheden kunnen in enkele decennia aanzienlijk veranderen. Een halve eeuw geleden had bijvoorbeeld meer dan de helft van de Nederlanders volkomen andere opvattingen over huwelijk, gezin en procreatie dan nu.' Eigenlijk is Nederland bovenal een land waar het goed toeven is. 'Emigratie heb ik nooit ook maar een seconde overwogen.'\n\nTypisch Nederland is een heerlijk college, rijk aan persoonlijk getinte anekdotes, verrassende historische dwarsverbanden en uitgesproken meningen.\n\nDe dvd bij het college bevat de meest spraakmakende delen uit het college aangevuld met reacties uit de zaal en een interview met Maarten van Rossem over zijn idee hoe de toekomst van Nederland en de Nederlander eruit zal zien.\n","torrent":{"xt":"urn:btih:632d0193141b598b690ae10b3d090d44a967ca06","amp;dn":"Maarten+van+Rossem+-+Typisch+Nederland%2C+Typi...+%28FLAC%2C+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"632d0193141b598b690ae10b3d090d44a967ca06","infoHashBuffer":{"type":"Buffer","data":[99,45,1,147,20,27,89,139,105,10,225,11,61,9,13,68,169,103,202,6]},"announce":[],"urlList":[]}}