{"title":"Batman: Arkham City + DLC Pack + Harley Quinn's Revenge Repack b","uid":7937957,"size":13307785534,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:63304f7316a81a3fea77b99c91a60a1f62ac914d&amp;dn=Batman%3A+Arkham+City+%2B+DLC+Pack+%2B+Harley+Quinn%27s+Revenge+Repack+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Taker009","files":40,"time":1355912352,"description":"Batman: Arkham City + DLC Pack + Harley Quinn's Revenge Repack by RG Catalyst\n\n\nINFORMATION: \n\nReleased: 2011 \nGenre: Action / 3D / 3rd Person / Stealth \nDeveloper: Rocksteady Studios \nPublisher: Warner Bros. Interactive Entertainment / 1C-SoftKlab \nGame Version: 1.03 \nPublication Type: Repak \nLanguage: English, Russian \nSound language: English \n\nOperating System: Microsoft Â® Windows Vista / Windows 7 \nProcessor: Intel core 2 Duo processor with a clock speed of 2.4 GHz or AMD Athlon X2 4800 + \nRAM: 2 GB \nVideo: ATI 385OHD / NVIDIA 8800 GT with 512 MB \nSound Card: DirectX 9.0c compatible \nFree hard drive space: 19 GB \n\nStudio Rocksteady - creators of the project Batman: Arkham Asylum - new players are invited to plunge into a dark and mysterious atmosphere of Gotham City in the game \n\nÂ«Batman: Arkham City.&quot; \nArkhem - an area where rampant released from a psychiatric clinic and to their own mad, inveterate criminals and maniacs. This is a black spot in the heart of Gotham \n\nCity, separated from the surrounding city impregnable wall. And as you know, where the evil - and there Batman! In Arkham legendary man-bat to meet many famous heroes \n\nand villains, and players will be felt, what it is - to be the Dark Knight. \n\n\nGame Features: \n\n&quot;In the spectacular fights Batman is already used as otochennye to perfection, as well as new techniques and skills. Life in Arkhem City - is a fierce battle in the \n\nstreets, intense espionage mission, exciting investigation, epic battles with supervillains in which the identity of Batman can be revealed from an unexpected quarter. \n&quot;This time, Batman will perform well against the organized and skilled opponents, who are trained to use heavy weapons, assault teams and attack from all sides. \n\nHowever, man-bat is not easy: he now has twice as many combat moves - attacks, counterattacks and crushing blows. \n&quot;For the storyÂ« Batman: Arkham City &quot;meets the five-time winner of the&quot; Emmy &quot;writer Paul Dini (Paul Dini). From his pen came a fascinating story, unfolding in a \n\nterrible and beautiful place. After the closure of hospitals and prisons Arkhem Blekgeyt new mayor of Gotham ordered to allocate part of the city to create a private \n\narea, which included both industrial and historic neighborhoods. It is named Arkhem City. \n&quot;Players will meet many heroes and villains of the universe, man-bat. Among them are two-faced, Harley Quinn, Penguin, Hugo Strange, Victor Zsaszom, Kalendarnik, \n\nJoker, Zagadochnik and many others. \n&quot;Another game characterÂ« Batman: Arkham City &quot;will be a charming cat. In a beautiful superheroine is its own history is closely intertwined with the adventures of \n\nBatman, and its ability, fighting techniques and equipment will give everyone a completely new feel of the game. \n&quot;Along with the familiar wonders of technology at the disposal of Batman will be a completely new device, such as decoder (Cryptographic Sequencer) and smoke grenades \n\n(Smoke Pellets), significantly extending the range of his superpowers. \n&quot;The main heroes of the game, Batman and the Joker, gave their votes to the Hollywood stars Mark Hamill, who played the famous Jedi Luke Skywalker, and Kevin Conroy, \n\nBatman of the many permanent cartoons. \n\nRepack Features: \n\nBased on Steam-Rip license \nNothing is converted / not cut \nIntegrated Update 01.03, DLC Pack , and Harley Quinn's Revenge \nInstallation time ~ 35 minutes \nRePacked by [RG Catalyst] \n\n","torrent":{"xt":"urn:btih:63304f7316a81a3fea77b99c91a60a1f62ac914d","amp;dn":"Batman%3A+Arkham+City+%2B+DLC+Pack+%2B+Harley+Quinn%27s+Revenge+Repack+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63304f7316a81a3fea77b99c91a60a1f62ac914d","infoHashBuffer":{"type":"Buffer","data":[99,48,79,115,22,168,26,63,234,119,185,156,145,166,10,31,98,172,145,77]},"announce":[],"urlList":[]}}