{"title":"Electrocorrosion and Protection of Metals{BBS}","uid":6734757,"size":2599371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:636aa554cadf26e3b7556e80717c9be954d35f82&amp;dn=Electrocorrosion+and+Protection+of+Metals%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1318287813,"description":"Electrocorrosion, the corrosion of metallic constructions by external currents, is the most significant factor in conductive aggressive environments. Corrosion of underground and underwater metal constructions by stray currents has been comprehensively studied in the past decades and is considered here only in the form of a review. The primary attention is on corrosion, by external anodic (mainly) and cathodic currents, of metal constructions in the highly aggressive environments typical for electrochemical plants, where penetration of the external currents (leakage currents) from the electrolytic baths into metal constructions is unavoidable.   A new approach to the problem of electrocorrosion protection of passive structural metals is considered in this book,  keeping the metals attacked by external currents in the boundaries of their passive field. The systems, developed in accordance with this approach, are based on the modification of existing and elaboration of new methods of electrocorrosion protection. These systems take into account corrosion and electrochemical characteristics of the aggressive media (redox potential, conductivity etc.) and of the passive metal (corrosion and activation potentials, current density in a passive state, etc) as well as the sizes and distribution character of the external currents.\n\nThe book covers analysis of leakage current distributions in electrochemical plants, their influence, methods to estimate corrosion stability of metallic structures subject to external currents and presents many concrete examples of the successful introduction of corrosion protection systems in operating plants.\n\n\n    * A new approach to protection from electrocorrosion, taking into account the passive state of the metal in aggressive media\n\n    * Newly developed and modifications of well known methods of electrocorrosion protection are presented.\n\n    * Systematized data on electrocorrosion and protection of metals, especially in electrochemical plants, allow corrosion engineers, researchers and personnel maintaining the equipment of electrochemical plants to analyze the corrosion state of  metallic equipment and prevent electrocorrosion.\n\nProduct Details\n\n    * Hardcover: 264 pages\n    * Publisher: Elsevier Science; 1 edition (January 14, 2009)\n    * Language: English\n    * ISBN-10: 0444532951\n    * ISBN-13: 978-0444532954","torrent":{"xt":"urn:btih:636aa554cadf26e3b7556e80717c9be954d35f82","amp;dn":"Electrocorrosion+and+Protection+of+Metals%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"636aa554cadf26e3b7556e80717c9be954d35f82","infoHashBuffer":{"type":"Buffer","data":[99,106,165,84,202,223,38,227,183,85,110,128,113,124,155,233,84,211,95,130]},"announce":[],"urlList":[]}}