{"title":"The Holocaust Dogma of Judaism - Keystone of the New World Order","uid":4279962,"size":1584985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63db83e246250720864c8d423be4de1d6193e2cf&amp;dn=The+Holocaust+Dogma+of+Judaism+-+Keystone+of+the+New+World+Order&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CuriousGeorge","files":-1,"time":1215370376,"description":"This is Ben Weintraub's shocking book The Holocaust Dogma of Judaism - Keystone of the New World Order (1995) which proves through rabbinical books that what the Jewish people refer to as the Holocaust of 6 Millions Jews in World War II has become the primary dogma of their religion - the holocaust dogma of Judaism. It poses an interesting hypothesis: that the holocaust has no historical foundation but rather is established as religious dogma with its origins in the ancient documents of Judaism. It is this &quot;holocaust religion&quot; which is replacing the tenets of Christianity as a sort of new age religion. Wientraub argues that the holocaust religion is the an anti-Christian religion of the New World Order propped up and supported by the United Nations and others. He further states that the &quot;Six Million&quot; figure (generally acknowledged by &quot;official&quot; researchers worldwide as the number of Jews murdered in the Holocaust) is a rabbinical concoction derived from occult readings of Hebrew letters in the text of the Torah. Holocaust Dogma discusses Biblical numerology and some occult practices known as gematria. The letter VAV represents &quot;six&quot; in Hebrew numerals: &quot;the secret of the VAV, which is the first letter of the sixth word of the Torah, is that of a single line of light whose function is to illuminate the darkness and thus Time itself-present and future. Basically what the author says the six million figure was made up by rabbis to further the agenda of Jewish world domination as outlined in the Protocols of the Leaned Elders of Zion, to destroy the morale of the white race, especially the Germans, and to eradicate Christianity. It is true today that one that questions the Holocaust figures is surely going to ruin his reputation and be branded as something hideous, hateful and even evil. The Holocaust elevates the misfortunes and sufferings of Jews above those of all other peoples who have suffered more and in greater numbers, like Christians in Soviet Russia and the Chinese under Mao's communist regime, and justifies atrocities committed against the Holy Land's true ancestral inhabitants, the native Palestinians. It brings up the issue of the occult nature of the Holocaust dogma of six million Jews murdered by &quot;racist, anti-Semitic&quot; white German Christians. The Holocaust Dogma of Judaism does conclusively establish - through impeccable, rabbinical primary sources - the evidence that The Holocaust story is a documented part of Judaic doctrine and not history itself as it actually happened. But it is exactly through such manipulation that a very important keystone has been built - a Keystone going all the way to the New World Order. 225 pages, some pictures. A must read for everyone.\n\n\nCover: http://ecx.images-amazon.com/images/I/51CGWYATRSL._SL500_AA240_.jpg","torrent":{"xt":"urn:btih:63db83e246250720864c8d423be4de1d6193e2cf","amp;dn":"The+Holocaust+Dogma+of+Judaism+-+Keystone+of+the+New+World+Order","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63db83e246250720864c8d423be4de1d6193e2cf","infoHashBuffer":{"type":"Buffer","data":[99,219,131,226,70,37,7,32,134,76,141,66,59,228,222,29,97,147,226,207]},"announce":[],"urlList":[]}}