{"title":"Akvis Magnifier 2.0 (App + PS Plugin) [K]rack'd","uid":5000878,"size":31453856,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:64abf3c5ade2c2da1fce9bfc45547d21792b0051&amp;dn=Akvis+Magnifier+2.0+%28App+%2B+PS+Plugin%29+%5BK%5Drack%5C%27d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"polisdavid","files":-1,"time":1247509607,"description":"Last, but not least is Akvis Magnifier, which IMO gives a great increase in magnification (eventhough it doesn't have all the algorithms of Photozoom).  It gives great results, Try it and see!\n\nOffiicial Web Site: &lt;a href=&quot; http://akvis.com/en/magnifier/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://akvis.com/en/magnifier/index.php&lt;/a&gt;\n\nKVIS Magnifier is an efficient tool for increasing image resolution.\n\nAKVIS Magnifier allows resizing images without noticeable loss in quality. If you attempt to blow up a picture (increase its resolution) using the standard Resize command of a photo editor, you will notice that the resulting photo is blurred and pixelated. The reason is that the input photo didn't contain enough information for the new size. AKVIS Magnifier will cope with this problem and deliver good results.\n\nFeaturing advanced enlargement algorithms, Magnifier enlarges digital pictures to super-high resolution for producing stunning poster-size prints. The algorithm keeps edges smooth, sharp and clearly defined, while improving image appearance by removing unwanted noise and compression artifacts.\n\nResizing pictures with AKVIS Magnifier yields a much higher quality than simple bicubic interpolation. Depending on particular needs, AKVIS Magnifier can be fine-tuned to produce images that look exactly as required for a given purpose. The software allows enlarging an image to a super-high resolution of up to 30000x30000 pixels, making a 100x100 inch (2.5x2.5 meter) poster easily printable at typographic quality of 300dpi.\n\nAKVIS Magnifier makes it easy for anyone to produce professional-looking photos. It is easily configurable and allows fine-tuning the resulting photo by allowing complete control over the image sharpness and edges. Home users can apply the program to enlarge photos taken from Internet or images taken with a low-resolution camera.\n\nWhether creating poster-size images or adding resolution for a better printing quality, AKVIS Magnifier will make your enlarged image look crisp and clear.\n\nAKVIS Magnifier is available in two editions: a plugin and a standalone program. \nThe standalone program works with JPEG, PNG, BMP, TIFF formats, supports color modes RGB, Grayscale, CMYK, Lab 8/16/32 bits per channel. The program allows printing large images at a high resolution. \nThe plug-in version of Magnifier is compatible with Adobe Photoshop and Photoshop Elements. In Photoshop the Magnifier plugin supports Batch Processing that allows you to automatically convert a series of images. Just create an Action in Photoshop and apply the plug-in with the same settings to a folder full of images. The plugin works with any (one-layered) images which can be opened by Photoshop (in supported color modes: RGB, Grayscale 8/16 bits.\n\n--&gt;&gt; PLEASE SEED &lt;&lt;--","torrent":{"xt":"urn:btih:64abf3c5ade2c2da1fce9bfc45547d21792b0051","amp;dn":"Akvis+Magnifier+2.0+%28App+%2B+PS+Plugin%29+%5BK%5Drack%5C%27d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64abf3c5ade2c2da1fce9bfc45547d21792b0051","infoHashBuffer":{"type":"Buffer","data":[100,171,243,197,173,226,194,218,31,206,155,252,69,84,125,33,121,43,0,81]},"announce":[],"urlList":[]}}