{"title":"Enrico Rava Quintet - The Words And The Days (2007)","uid":5807766,"size":377632783,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:661c431de879d8b335b1bef6ea531a4b527fa54e&amp;dn=Enrico+Rava+Quintet+-+The+Words+And+The+Days+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mariorg","files":-1,"time":1283513244,"description":"ECM 1982 &lt;a href=&quot;\nhttp://www.ecmrecords.com/Catalogue/ECM/1900/1982.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ecmrecords.com/Catalogue/ECM/1900/1982.php&lt;/a&gt;\n\n* Enrico Rava: trumpet\n* Gianluca Petrella: trombone\n* Andrea Pozza: piano\n* Rosario Bonaccorso: double-bass\n* Roberto Gatto: drums\n\n\nReview\n~~~~~~\nby Thom Jurek &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:axftxqurldae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:axftxqurldae&lt;/a&gt;\n\nEnrico Rava\\'s 2004 outing, Easy Living, marked not only his return to the ECM\nlabel after a 17-year absence, but the complete maturation of his quintet, which\nat that time had been gigging together for four years. The Words and the Days\nsees most of the same band return with one major chair: Rava\\'s great foil,\npianist Stefano Bollani who released his acclaimed solo piano album on the\nlabel, has been replaced by the fluid, more percussive Andrea Pozza. The program\nconsists of seven Rava originals, a cover of Don Cherry\\'s \\&quot;Art Deco\\&quot; performed\nas a wonderfully warm and spirited duet with trombonist Gianluca Petrella, one\neach by drummer Roberto Gatto (\\&quot;Traps\\&quot;), and bassist Rosario Bonaccorso (\\&quot;Sogni\nProibiti\\&quot; [\\&quot;Forbidden Dreams\\&quot;]), and a version of Russ Freeman\\'s \\&quot;The Wind,\\&quot;\nwritten as a vehicle for the late Chet Baker. Typical of this quintet recording,\nRava digs into the jazz tradition and brings to it his lyrical gift as a\ncomposer, an improvising soloist and an arranger. His reading of \\&quot;The Wind\\&quot; is a\nfine example. Keeping Baker\\'s sparseness in phrase, he infuses it with the\nechoing presence of Petrella, playing just a shade behind the melody, and then\nplaying only parts of it and adding a bit of humor and drama to the work to make\nit a bit noir-ish rather than a straight nostalgia piece. Gatto\\'s dancing brush\nwork adds to the present tense understanding of the tune and is underscored by\nPozza\\'s painterly piano lines. Only the bassline by Bonaccorso keeps the tune\nrooted in history.\n\nConversely, \\&quot;Echoes of Duke,\\&quot; which immediately proceeds from it, is a firm case\nin point of Rava\\'s view of jazz tradition as living in the present and pointing\nto the future. Using the scuttlebutt rhythmic impulses of the Jimmy Blanton-Ben\nWebster band and the lyric improvisation of Ellington\\'s great brass frontliners,\nRava nonetheless moves the tune just outside enough to be a new and sprightly\nread on the blues. \\&quot;Serpent\\&quot; is an abstract piece that roots itself in the\nskeletal remnants of Miles Davis\\' modal period in the mid- to late \\'60s. The\nblues are everywhere present, but they are stretched almost to the breaking\npoint, and Pozza\\'s commanding, empathic solo here is nearly breathtaking. The\nfinal piece, the nine-minute \\&quot;Dr. Ra and Mr. Va,\\&quot; is the best example of the\nensemble\\'s inner dialogue, wrapping a minimal chart in grand poetic\ndesigns. Rava\\'s solo offers hints as to where he wants the band to go, and they\ndon\\'t just follow, they end up on the frontline with him. It begins so warm and\nleisurely it\\'s deceptive. There is a lot of spatial organizing going on\nhere. Despite the chart, there are moments of improvisation happening in the\nlyric, and in its harmonic interpolation by Pozza and then Petrella. The tune is\nlike a MÃƒÂ¶bius strip, changing places with itself throughout its length. Once\nmore, Rava dazzles with his grasp of the languages of jazz: its textures, its\nrhythms, its dynamics and above all, of course, its secretive and inventive\nmelodic improvisation. There is no let down here from Easy Living; The Words and\nthe Days is a worthy companion that confidently stands not in the previous\nrecording\\'s shadow, but on a ledge of its own.\n\nEn castellano: &lt;a href=&quot;\nhttp://www.tomajazz.com/imaxinasons/bollani/discos_bollani.htm#rava_words&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tomajazz.com/imaxinasons/bollani/discos_bollani.htm#rava_words&lt;/a&gt;","torrent":{"xt":"urn:btih:661c431de879d8b335b1bef6ea531a4b527fa54e","amp;dn":"Enrico+Rava+Quintet+-+The+Words+And+The+Days+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661c431de879d8b335b1bef6ea531a4b527fa54e","infoHashBuffer":{"type":"Buffer","data":[102,28,67,29,232,121,216,179,53,177,190,246,234,83,26,75,82,127,165,78]},"announce":[],"urlList":[]}}