{"title":"THE SIMPSONS SEASON 17 by deathmule","uid":3852206,"size":4680841216,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:66590bbd761f825d8695e47a4635d81c2333a9ff&amp;dn=THE+SIMPSONS+SEASON+17+by+deathmule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deathmule","files":11,"time":1192992356,"description":"THE SIMPSONS SEASON 17 by deathmule\n\nTHE SIMPSONS SEASON 18 by deathmule         &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3700537/THE_SIMPSONS_SEASON_18_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3700537/THE_SIMPSONS_SEASON_18_by_deathmule&lt;/a&gt;\n\nTHE SIMPSONS SEASON 9 by deathmule        &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3765820/THE_SIMPSONS_SEASON_9_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3765820/THE_SIMPSONS_SEASON_9_by_deathmule&lt;/a&gt;\n\n   \n\nBonfire of the Manatees (#GABF18 / SI-1618) 11 Sep 2005 \n When Homer falls for a football betting scam and owes money to Fat Tony, Fat Tony decides to let Homer pay off the debt by letting him shoot a porno film in the house. When Marge finds out, she drives off, and while she is calling Homer, the phone booth she is in is attacked by a manatee, which is driven off by a marine biologist specializing in them (right down to his &quot;I Love Manateess&quot; tattoo). Marge becomes fascinated by the manatees, which doesn&amp;#039;t escape Homer&amp;#039;s notice, so when a pack of them are attacked by jet-skiiers, it&amp;#039;s up to Homer to save the day, the manatees, and then himself.  \n\n   \nThe Girl Who Slept Too Little (#GABF16 / SI-1616) (18 Sep 05) \n When a new stamp museum is going to be opened behind the Simpson house, the Simpsons protest its construction to the point where it is moved to the site of the Springfield Cemetary, and the cemetary is moved to behind the Simpson house. Lisa is afraid of the things she sees, and Homer and Marge are afraid that if Lisa keeps sleeping with them, they&amp;#039;ll go crazy, but while Homer and Marge ask a psychologist for help, Lisa has her own solution: if she can make it until midnight without calling the Corey hotline - wait, wrong episode - if she can spend the night in the cemetary, she can overcome her fear.  \n Note: Fox originally announced that this episode would air as the season finale on 15 May 2005; however, when The Father, the Son, and the Holy Guest Star was pulled from its original 10 April 2005 air date, it replaced this episode in the schedule.  \n\n   \nMilhouse of Sand and Fog (#GABF19 / SI-1619) 25 Sep 05 \n When Maggie comes down with the chicken pox, Homer actually takes some advice from Flanders and holds a &quot;pox party&quot; so his friends could have their kids infected. After one too many Marge-aritas, Kirk and Luanne van Houten decide to get back together. However, Milhouse realizes they&amp;#039;re too interested in each other and not interested in him, so he tries to breaks them up by planting a bra in his parents&amp;#039; bedroom. One problem: Luanne discovers it&amp;#039;s Marge&amp;#039;s bra, which leads to Homer and Marge breaking up yet again...  \n\n   \nTreehouse of Horror XVI (#GABF17 / SI-1617)  6 Nov 2005 \n &quot;B.I. Bartificial Intelligence&quot; - when Bart lapses into a coma, Homer and Marge replace him with a robot boy \n&quot;Survival of the Fattest&quot; - Homer competes in &quot;The World Series of Manhunter&quot; with Mr. Burns hunting him, and Terry Bradshaw as the host \n&quot;I&amp;#039;ve Grown a Costume on Your Face&quot; - a witch casts a spell at a Halloween costume party, turning everyone into what their costume is and on the advice of our lawyers, we have never heard of the Halloween episode of The Fairly Oddparents, which has an almost identical plot \n\n \n\n   \nMarge&amp;#039;s Son Poisoning (#GABF20 / SI-1620) 13 Nov 2005 \n Marge buys a tandem bicycle because she thinks Homer will ride with her, but when she ends up trying to ride it on her own (and failing miserably), Bart decides to ride with her. When the teahouse they go to (Marge for the tea, Bart for the cakes) closes, Bart turns his treehouse into a teahouse, but when others call him a mama&amp;#039;s boy, he suddenly turns on Marge. Meanwhile, Homer buys a dumbbell from a strongman and, after lifting a pinball machine with one arm, Moe gets Homer involved in competitive arm wrestling.  \n\n   \nSee Homer Run (#GABF21 / SI-1621) 20 Nov 2005 \n Bart steals a &quot;Bart Boulevard&quot; traffic sign, which leads to a major traffic accident, but the new Safety Salamander (Homer&amp;#039;s attempt to earn Lisa&amp;#039;s love back after he ruins her Father&amp;#039;s Day present) saves everybody. When everybody blames Mayor Quimby, the town calls for a recall election, and Homer decides to run for mayor, along with pretty much everybody else in town (just like the time 135 people ran for Governor of California when Gray Davis was being recalled in 2003).  \n\n   \nThe Last of the Red Hat Mamas (#GABF22 / SI-1622) 27 Nov 2005 \n Homer gets into a fight with an Easter bunny (after stealing other kids&amp;#039; Easter eggs when they grab them right in front of Maggie). resulting in Marge being shunned by her friends, so she ends up joining the Cheery Red Tomatoes, an organization of older women whose interests include talking about their husbands, skydiving...and stealing Faberge eggs from Mr. Burns (who decided to renege on a million-dollar charitable donation); Lisa needs to be able to speak Italian in order to qualify for a summer program in Rome, so she hires one from a telpehone poll flyer - Milhouse, who spends two weeks in Tuscany every summer.  \n\n   \nThe Italian Bob (#HABF02 / SI-1702) 11 Dec 2005 \n Mr. Burns&amp;#039;s Stutz Bearcat finally breaks down, so he decides to buy a new Italian sports car, and have somebody pick it up for him - all together now: &quot;The Simpsons are going to Italy!&quot;, only to end up in a small town where the residents aren&amp;#039;t aware of the criminal past of their new mayor - Sideshow Bob, who is married and has a son, and gives the Simpsons the run of the town, and asks only that they keep his past from the townspeople...but when he forgets that wine and Simpsons (especially an eight-year-old one) don&amp;#039;t mix very well, Marge quickly finds out what &quot;vendetta&quot; means in English.  \n\n   \nSimpsons Christmas Stories (#HABF01 / SI-1701) 18 Dec 2005 \n It&amp;#039;s D&amp;#039;oh-Ho-Homer with these three Christmas stories: \n\n&quot;The First D&amp;#039;oh-El&quot; (no, I&amp;#039;m not going to call it &quot;The First (ANNOYED GRUNT)-El&quot;) - when Reverend Lovejoy can&amp;#039;t make it to church to deliver the Christmas sermon because of a train wreck (a model train wreck, that is), he asks Ned to deliver it, but when Ned gets a paper cut, it becomes The Gospel According to Homer, with Marge as Mary and Bart as Jebus Jesus \n&quot;I Saw Grampa Cussing Santa Claus&quot; - in a World War II flashback, Grampa and Mr. Burns end up stuck on a deserted island where Burns shoots down Santa Claus \n&quot;The Nutcracker...Sweet&quot; - to the music of Tchaikovsky&amp;#039;s ballet, everyone prepares for Christmas in their usual way, including Moe trying to kill himself and Homer forgetting to buy Marge a present \n\n \n\n   \nHomer&amp;#039;s Paternity Coot (#HABF03 / SI-1703) 8 Jan 2006 \n Marge refuses to drive through a new toll booth, so she backs up and causes a chain reaction accident where a number of cars back up over tire spikes; the resulting addition of flat tires to the Springfield Tire Fire causes a nearby glacier to melt, revealing a 40-year-old frozen mailman with 40-year-old frozen mail, including a letter to Homer&amp;#039;s mother from someone who believed he is Homer&amp;#039;s real father...and a paternity test says that he&amp;#039;s right  \n\n   \nWe&amp;#039;re on the Road to D&amp;#039;ohwhere (#HABF04 / SI-1704) 29 Jan 2006 \n When Bart finds the key to the school&amp;#039;s steam tunnels and ruins the school with steam, Principal Skinner sends him to a camp in Oregon, but when Homer discovers Bart is on the no-fly list, he has to drive him there; while they are gone, Marge and Lisa have a yard sale, only to discover that the big seller is Homer&amp;#039;s expired pain pills  \n\n   \nMy Fair Laddy (#HABF05 / SI-1705) 26 Feb 2006 \n On the advice of our lawyer&amp;#039;s, we have never heard of an episode that has both a plot and songs like My Fair Lady, where Lisa tries to turn Groundskeeper Willie into a refined gentleman after Bart accidentally destroys his shack with an ice-filled ball; Homer discovers that the company that makes his favorite blue pants has stopped making them  \n\n   \nThe Seemingly Never-Ending Story (#HABF06 / SI-1706) 12 Mar 2006 \n On a family outing inside a cave, Homer causes a stalactite to crash into the ground, and he ends up stuck in the hole; while Marge, Bart, and Maggie look for a way out, Lisa stays behind and tells Homer a story about how she was chased by a ram and ended up in Mr. Burns&amp;#039;s attic...where he tells the story of how he loses everything to the rich Texan and has to work his way back up from the bottom, starting at Moe&amp;#039;s...where he discovers Moe&amp;#039;s story of how he met the perfect woman - Mrs. Krabappel - but the only way he could afford to start a new life with her is to steal a bag of gold coins discovered by the archeologist who would be Snake.  \n\n   \nBart Has Two Mommies (#HABF07 / SI-1707) 19 Mar 2006 \n ...Marge, and a female monkey who kidnaps him and won&amp;#039;t let him go. Oh, you want more? Well, when Ned wins a computer in a rubber duck race at a church bazaar, he decides he doesn&amp;#039;t want it, so he gives it to the Simpsons, and in exchange Marge agrees to watch Rod and Todd while Ned attends a left-handers&amp;#039; expo. With Marge in charge, the boys have the time of their lives, and want to see more of Marge, so Homer is left to watch Bart, Lisa, and Maggie, which leads to a trip to a museum for old show business animals, including one who misses her children, who are still in show business.  \n\n   \nHomer Simpson, This is Your Wife (#HABF08 / SI-1708) 26 Mar 2006 \n Homer sees Lenny&amp;#039;s new plasma TV and wants one of his own, so he enters a contest in an attempt to win one, but instead wins a trip to Fox Studios, where he gets involved in a show similar to Trading Spouses: Meet Your New Mommy and ends up trading Marge for the no-nonsense wife of another man (voiced by Ricky Gervais of the BBC version of The Office, who also wrote this episode); while Homer&amp;#039;s &quot;wife&quot; runs the house with an iron fist, Marge&amp;#039;s new &quot;husband&quot;, unaccustomed to a woman who is nice to him, falls in love with Marge.  \n\n   \nMillion Dollar Abie (#HABF09 / SI-1709) 2 Apr 2006 \n The commissioner of football is in town to finalize the awarding of a new professional football team to Springfield, but when he gets lost and asks for directions at the Simpson house, Grampa ties him up, leading the commissioner to cancel the team. This results in everybody in town hating Grampa to the point where he tries assisted suicide, but when that doesn&amp;#039;t happen, he decides to live life to the fullest, starting with being the toreador at the new football-stadium-turned-bullring.  \n\n   \nKiss Kiss Bang Bangalore (#HABF10 / SI-1710) 9 Apr 2006 \n Mr. Burns outsources the power plant to India, and, thanks to a lucky bouquet catch, Homer is sent there to train the new employees, but when Burns puts him in charge of the plant, the employees treat him as a god; when Richard Dean Anderson mistakes Patty and Selma&amp;#039;s &quot;MacGyver&quot; convention for the (much larger) &quot;Stargate SG-1&quot; convention next door, he badmouths MacGyver, leading Patty and Selma to kidnap him, but when he performs an escape worthy of MacGyver himself, he realizes it&amp;#039;s the most exciting thing he has done, and insists that Patty and Selma keep him trapped so he can keep escaping.  \n\n   \nThe Wettest Stories Ever Told (#HABF11 / SI-1711) 23 Apr 2006 \n When dinner at the Frying Dutchman takes a little longer than expected to cook, thanks to an uncooperative octopus armed with knives, and the Sea Captain doesn&amp;#039;t know any sea tales, the Simpsons take up the slack by telling stories of three famous ships; Lisa with the Mayflower, Bart with the Bounty, and Homer with a ship that sounds an awful lot like the Posiedon (and is even named for a god of the sea, albeit the Roman one)  \n\n   \nGirls Just Want to Have Sums (#HABF12 / SI-1712)  30 Apr 2006 \n When Principal Skinner makes a comment at &quot;Stab-A-Lot&quot; (the Itchy &amp; Scratchy musical) that girls aren&amp;#039;t as good as math as boys, he is replaced by a new principal who separates the school into boys&amp;#039; and girls&amp;#039; schools. When Lisa discovers that the girls aren&amp;#039;t being taught anything about math, she tries disguising herself as a boy so she can learn &quot;real&quot; math, but when she ends up on the receiving end of a Nelson beating, she gets Bart to teach her how to act like a boy.  \n\n   \nRegarding Margie (#HABF13 / SI-1713)  7 May 2006 \n When Marge bumps her head on a stool by her maximum-strength cleaning solution she uses to clear the house before her free housecleaning (which &quot;she&quot; won thanks to Homer painting the address number on the curb in front of the house), she gets amnesia, but quickly remembers everything except for two things - one, that she&amp;#039;s married to Homer, and two, who Homer is.  \n\n   \nThe Monkey Suit (#HABF14 / SI-1714)  14 May 2006 \n After Ned Flanders sees an exhibit on evolution at a museum, he and Reverend Lovejoy talk Principal Skinner into allowing the teaching of creationism in schools. When Lisa complains at a town meeting that there should only be one theory taught in schools, Mayor Quimby agrees - and teaching evolution is banned in schools, so Lisa decides to teach a secret evolution class which gets her arrested. Does Marge have something up where her sleeves would be if she didn&amp;#039;t always wear a sleeveless dress to help Lisa?  \n\n   \nMarge and Homer Turn a Couple Play (#HABF16 / SI-1716) 21 May 2006 \n The Springfield Isotopes&amp;#039;s star first baseman is having marital problems, so when he sees Homer and Marge kissing on the Jumbotron, he asks them for advice, but when Homer is later caught giving a neck massage to the player&amp;#039;s wife, they break up again - and it&amp;#039;s hard for them to give advice when they&amp;#039;re not talking to each other themselves  \n\n\nmy other TV show DVDs\n======================\n\n\nHEROES SEASON 2 Episode 4 by deathmule\n\n\nHEROES SEASON 2 Episode 3 by deathmule    &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3836068/HEROES_SEASON_2_Episode_3_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3836068/HEROES_SEASON_2_Episode_3_by_deathmule&lt;/a&gt;\n\nHEROES SEASON 2 Episode 2 by deathmule     &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3827928/HEROES_SEASON_2_Episode_2_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3827928/HEROES_SEASON_2_Episode_2_by_deathmule&lt;/a&gt;\n\nHEROES SEASON 2 Episode 1 by deathmule      &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3819545/HEROES_SEASON_2_Episode_1_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3819545/HEROES_SEASON_2_Episode_1_by_deathmule&lt;/a&gt;\n\n\n\nHALO TRILOGY by deathmule  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3846132/HALO_TRILOGY_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3846132/HALO_TRILOGY_by_deathmule&lt;/a&gt;\n\n\n\nseason 1\n========\n\nHEROES SEASON 1 Episode 21 by deathmule             &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3684028/HEROES_SEASON_1_Episode_21_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3684028/HEROES_SEASON_1_Episode_21_by_deathmule&lt;/a&gt;\n\nHEROES SEASON 1 Episode 20 by deathmule              &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3684026/HEROES_SEASON_1_Episode_20_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3684026/HEROES_SEASON_1_Episode_20_by_deathmule&lt;/a&gt;\n\nHEROES SEASON 1 Episode 19 by deathmule              &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3672615/HEROES_SEASON_1_Episode_19_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3672615/HEROES_SEASON_1_Episode_19_by_deathmule&lt;/a&gt;\n\nHEROES SEASON 1 Episode 18 by deathmule                         &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3633117/HEROES_SEASON_1_Episode_18_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3633117/HEROES_SEASON_1_Episode_18_by_deathmule&lt;/a&gt;\n\nHEROES SEASON 1 Episodes 1 to 17 by deathmule                            &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3629603/HEROES_SEASON_1_Episodes_1_to_17_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3629603/HEROES_SEASON_1_Episodes_1_to_17_by_deathmule&lt;/a&gt;\n\n\nseason 3\n========\n\nPRISON BREAK SEASON 3 Episode 4 by deathmule    &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3836067/PRISON_BREAK_SEASON_3_Episode_4_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3836067/PRISON_BREAK_SEASON_3_Episode_4_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 3 Episode 3 by deathmule     &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3827932/PRISON_BREAK_SEASON_3_Episode_3_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3827932/PRISON_BREAK_SEASON_3_Episode_3_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 3 Episode 2 by deathmule      &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3819547/PRISON_BREAK_SEASON_3_Episode_2_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3819547/PRISON_BREAK_SEASON_3_Episode_2_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 3 Episode 1 by deathmule       &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3813726/PRISON_BREAK_SEASON_3_Episode_1_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3813726/PRISON_BREAK_SEASON_3_Episode_1_by_deathmule&lt;/a&gt;\n\n\n\n\nseason 2\n========\n\nPRISON BREAK SEASON 2 Episode 22 by deathmule                 &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3664095/PRISON_BREAK_SEASON_2_Episode_22_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3664095/PRISON_BREAK_SEASON_2_Episode_22_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 21 by deathmule                  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3654804/PRISON_BREAK_SEASON_2_Episode_21_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3654804/PRISON_BREAK_SEASON_2_Episode_21_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 20 by deathmule                     &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3644778/PRISON_BREAK_SEASON_2_Episode_20_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3644778/PRISON_BREAK_SEASON_2_Episode_20_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 19 by deathmule                        &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3639326/PRISON_BREAK_SEASON_2_Episode_19_by_deathmule_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3639326/PRISON_BREAK_SEASON_2_Episode_19_by_deathmule_&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 18 by deathmule                           &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3630763/PRISON_BREAK_SEASON_2_Episode_18_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3630763/PRISON_BREAK_SEASON_2_Episode_18_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 17 by deathmule                             &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3623553/PRISON_BREAK_SEASON_2_Episode_17_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3623553/PRISON_BREAK_SEASON_2_Episode_17_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 16 by deathmule                              &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3612902/PRISON_BREAK_SEASON_2_Episode_16_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3612902/PRISON_BREAK_SEASON_2_Episode_16_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 15 by deathmule                               &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3611351/PRISON_BREAK_SEASON_2_Episode_15_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3611351/PRISON_BREAK_SEASON_2_Episode_15_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 14 by deathmule                               &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3606403/PRISON_BREAK_SEASON_2_Episode_14_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3606403/PRISON_BREAK_SEASON_2_Episode_14_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episode 13 by deathmule                               &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3576472/PRISON_BREAK_SEASON_2_Episode_13_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3576472/PRISON_BREAK_SEASON_2_Episode_13_by_deathmule&lt;/a&gt;\n\nPRISON BREAK SEASON 2 Episodes 1 to 12 by deathmule                               &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3567696/PRISON_BREAK_SEASON_2_Episodes_1_to_12_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3567696/PRISON_BREAK_SEASON_2_Episodes_1_to_12_by_deathmule&lt;/a&gt;\n\n\nSEASON 3\n========\n\nLOST SEASON 3 Episodes 22 to 23 season finale by deathmule          &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3696422/LOST_SEASON_3_Episodes_22_to_23_season_finale_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3696422/LOST_SEASON_3_Episodes_22_to_23_season_finale_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 21 by deathmule           &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3690387/LOST_SEASON_3_Episode_21_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3690387/LOST_SEASON_3_Episode_21_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 20 by deathmule            &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3685720/LOST_SEASON_3_Episode_20_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3685720/LOST_SEASON_3_Episode_20_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 19 by deathmule              &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3680588/LOST_SEASON_3_Episode_19_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3680588/LOST_SEASON_3_Episode_19_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 18 by deathmule               &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3674987/LOST_SEASON_3_Episode_18_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3674987/LOST_SEASON_3_Episode_18_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 17 by deathmule                 &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3668158/LOST_SEASON_3_Episode_17_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3668158/LOST_SEASON_3_Episode_17_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 16 by deathmule                  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3663159/LOST_SEASON_3_Episode_16_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3663159/LOST_SEASON_3_Episode_16_by_deathmule&lt;/a&gt; \n\nLOST SEASON 3 Episode 15 by deathmule                  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3658003/LOST_SEASON_3_Episode_15_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3658003/LOST_SEASON_3_Episode_15_by_deathmule&lt;/a&gt; \n\nLOST SEASON 3 Episode 14 by deathmule                    &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3652408/LOST_SEASON_3_Episode_14_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3652408/LOST_SEASON_3_Episode_14_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 13 by deathmule                     &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3644779/LOST_SEASON_3_Episode_13_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3644779/LOST_SEASON_3_Episode_13_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 12 by deathmule                       &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3640096/LOST_SEASON_3_Episode_12_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3640096/LOST_SEASON_3_Episode_12_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 11 by deathmule                         &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3635160/LOST_SEASON_3_Episode_11_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3635160/LOST_SEASON_3_Episode_11_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 10 by deathmule                              &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3629580/LOST_SEASON_3_Episode_10_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3629580/LOST_SEASON_3_Episode_10_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 9 by deathmule                              &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3625204/LOST_SEASON_3_Episode_9_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3625204/LOST_SEASON_3_Episode_9_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 8 by deathmule                               &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3620032/LOST_SEASON_3_Episode_8_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3620032/LOST_SEASON_3_Episode_8_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 7 by deathmule                                &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3613759/LOST_SEASON_3_Episode_7_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3613759/LOST_SEASON_3_Episode_7_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 6 by deathmule                                 &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3554135/LOST_SEASON_3_Episode_6_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3554135/LOST_SEASON_3_Episode_6_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 5 by deathmule                                  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3550391/LOST_SEASON_3_Episode_5_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3550391/LOST_SEASON_3_Episode_5_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode 4 by deathmule                                   &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3546466/LOST_SEASON_3_Episode_4_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3546466/LOST_SEASON_3_Episode_4_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode_3 by_deathmule                                    &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3542674/LOST_SEASON_3_Episode_3_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3542674/LOST_SEASON_3_Episode_3_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode_2 by_deathmule                                     &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3538555/LOST_SEASON_3_Episode_2_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3538555/LOST_SEASON_3_Episode_2_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 Episode_0-1 by_deathmule                                      &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3534168/LOST_SEASON_3_Episode_0-1_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3534168/LOST_SEASON_3_Episode_0-1_by_deathmule&lt;/a&gt;\n\n\nLOST SEASON 3 DISC3 Episodes 10 to 15 by deathmule                &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3670968/LOST_SEASON_3_DISC3_Episodes_10_to_15_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3670968/LOST_SEASON_3_DISC3_Episodes_10_to_15_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 DISC2 Episodes 5 to 9 by deathmule                            &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3630342/LOST_SEASON_3_DISC2_Episodes_5_to_9_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3630342/LOST_SEASON_3_DISC2_Episodes_5_to_9_by_deathmule&lt;/a&gt;\n\nLOST SEASON 3 DISC1 Episode 0 to 4 by deathmule                                   &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3548413/LOST_SEASON_3_DISC1_Episodes_0_to_4_by_deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3548413/LOST_SEASON_3_DISC1_Episodes_0_to_4_by_deathmule&lt;/a&gt;\n\n\n\n\n\n\n(how to burn VIDEO_TS files) (this goes for all my releases)\n\nfirst download nero (you can get nero from any torrent site) install and open nero. pick \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;DVD-video\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; then press \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;NEW\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; \n            &lt;a href=&quot;\nhttp://img.photobucket.com/albums/v147/deathmule/17vb-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.photobucket.com/albums/v147/deathmule/17vb-1.jpg&lt;/a&gt; \n\n\nfind the \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;VIDEO_TS\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; files and move them over to the left hand side \n            &lt;a href=&quot;\nhttp://img.photobucket.com/albums/v147/deathmule/19vb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.photobucket.com/albums/v147/deathmule/19vb.jpg&lt;/a&gt; \n\n\nnow just press burn and your done. now you can watch this on your stand-alone DVD player \n            &lt;a href=&quot;\nhttp://img.photobucket.com/albums/v147/deathmule/20vb-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.photobucket.com/albums/v147/deathmule/20vb-1.jpg&lt;/a&gt; \n\n==========================\n\nhow to burn with imgburn\n\nYes! You can use ImgBurn to burn this too!\nPut in a empty DVD and open Imgburn, when it\nhas found the DVD go to MODE and click at BUILD!\nThen browse at the folder where the files are, that\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s all to it! I use it for all VIDEO_TS and Image files!\n\n\n==========================\n\nif you dont want to burn these files to a DVD, these programs will play the \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;VIDEO_TS\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; files on your PC \n\n\nall these players will work \n\n\nInterActual Player \n\n\nInterVideo.WinDVD.Platinum \n\n\nCyberlink.PowerDVD.Ultra.Deluxe.v7.2.Multilingual-CORE \n\n\nmy other torrents                                       &lt;a href=&quot;\nhttp://thepiratebay.se/user/deathmule&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/deathmule&lt;/a&gt;\n\nenjoy :) please seed when done\t\t\t\t \n     \n\n\t","torrent":{"xt":"urn:btih:66590bbd761f825d8695e47a4635d81c2333a9ff","amp;dn":"THE+SIMPSONS+SEASON+17+by+deathmule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66590bbd761f825d8695e47a4635d81c2333a9ff","infoHashBuffer":{"type":"Buffer","data":[102,89,11,189,118,31,130,93,134,149,228,122,70,53,216,28,35,51,169,255]},"announce":[],"urlList":[]}}