{"title":"Letters Home From My Journey Through the Middle East - Benjamin","uid":11602091,"size":2748126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66b067d355b9f947f3a4b8a4dee3d137be39920c&amp;dn=Letters+Home+From+My+Journey+Through+the+Middle+East+-+Benjamin+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1417366000,"description":"Title: Live From Jordan: Letters Home From My Journey Through the Middle East \nAuthor: Benjamin Orbach \nHardcover: 320 pages\nPublisher: AMACOM; 1ST edition (April 30, 2007)\nLanguage: English\nISBN-10: 0814474276\nISBN-13: 978-0814474273\n\nOn the eve of the U.S. invasion of Iraq, Pittsburgh native and graduate student Ben Orbach traveled to the Middle East to experience the region first-hand. Despite having a degree in Middle Eastern studies, he was completely unprepared for what he discovered. Beyond the anti-American sentiment he expected, he found a complex, curious people whose lives were made even more difficult by an overwhelming feeling of powerlessness. &quot;Live from Jordan&quot; is the story, told via his letters home, of Orbach's one year trip through Egypt, Jordan, Syria, Palestine, and Turkey. As he begins his unforgettable journey which takes him from bustling bazaars to underground brothels, he meets all kinds of characters: a falafel cook who hates Americans because they 'have no mercy', a kindly baker who wishes him 'peace and blessings' every time he buys pita bread, and the curious, impassioned 21-year-old medical student with a penchant for debating U.S. foreign policy. From the angry streets of Cairo to the living rooms of ordinary people in Jordan and Palestine, Orbach offers an honest, balanced portrait of a region in turmoil and the vivid, misunderstood, and often welcoming people who inhabit it. With humour and wit, he sheds new light on a culture that few Americans understand. Engaging and evocative, &quot;Live from Jordan&quot; is a myth-breaking book that combines the lyricism of a travelogue with the insight of reportage","torrent":{"xt":"urn:btih:66b067d355b9f947f3a4b8a4dee3d137be39920c","amp;dn":"Letters+Home+From+My+Journey+Through+the+Middle+East+-+Benjamin+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b067d355b9f947f3a4b8a4dee3d137be39920c","infoHashBuffer":{"type":"Buffer","data":[102,176,103,211,85,185,249,71,243,164,184,164,222,227,209,55,190,57,146,12]},"announce":[],"urlList":[]}}