{"title":"Bill Bryson- In a Sunburned Country","uid":3797919,"size":633949729,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6757c90d5da20d63b4f2130e1e24a38203559b94&amp;dn=Bill+Bryson-+In+a+Sunburned+Country&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"microwavspam","files":1,"time":1189125207,"description":"Read by the Author.\n128kbps\n44 kHz\nMP3 Format\n10cd in total\n\nTo the best of my knowledge this book is unabridged.\n\nENJOY!\n\n\nSynopsis\nPublisher Comments:\nEvery time Bill Bryson walks out the door memorable travel literature threatens to break out. His previous excursion up, down, and over the Appalachian Trail (well, most of it) resulted in the sublime national bestseller A Walk in the Woods. Now he has traveled across the world and all the way Down Under to Australia, a shockingly under-discovered country with the friendliest inhabitants, the hottest, driest weather, and the most peculiar and lethal wildlife to be found on the planet.\n\nIn a Sunburned Country is his report on what he found there ? a deliciously funny, fact-filled, and adventurous performance by a writer who combines humor, wonder, and unflagging curiosity.\n\nAustralia is a country that exists on a vast scale. It is the only island that is also a continent and the only continent that is also a country. Despite being the most desiccated, infertile, and climatically aggressive of all inhabited continents, it teems with life. In fact, Australia has more things that can kill you in extremely nasty ways than anywhere else: sharks, crocodiles, the ten most deadly poisonous snakes on the planet, fluffy yet toxic caterpillars, seashells that actually attack you, and the unbelievable box jellyfish (don\\&amp;#039;t ask). The dangerous riptides of the sea and the sun-baked wastes of the outback both lie in wait for the unwary. It\\&amp;#039;s one tough country.\n\nBill Bryson adores it, of course, and he takes his readers on a rollicking ride far beyond the beaten tourist path. Here is a place where interesting things happen all the time, from a Prime Minister lost ? yes, lost ? while swimming at sea to Japanese cult members who may have set off an atomic bomb (sic) entirely unnoticed on their 500,000-acre property in the great western desert.\n\nWherever he goes (and Bryson goes just about everywhere) he finds Australians who are cheerful, extroverted, and unfailingly obliging ? the beaming products of a land with clean, safe cities, cold beer, and constant sunshine. On occasion the Aborigines, a remote and mysterious race with a tragic history, make a haunting appearance in this book. But by and large Australia is an immense and fortunate land, and it has found in Bill Bryson its perfect guide. ","torrent":{"xt":"urn:btih:6757c90d5da20d63b4f2130e1e24a38203559b94","amp;dn":"Bill+Bryson-+In+a+Sunburned+Country","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6757c90d5da20d63b4f2130e1e24a38203559b94","infoHashBuffer":{"type":"Buffer","data":[103,87,201,13,93,162,13,99,180,242,19,14,30,36,163,130,3,85,155,148]},"announce":[],"urlList":[]}}