{"title":"Thomas Hardy - Tess of the D'Urbervilles (Unabridged)","uid":4493997,"size":835068746,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:67e542b78130b50c378d0369cc66bdd39bdadee4&amp;dn=Thomas+Hardy+-+Tess+of+the+D%5C%27Urbervilles+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dougietrotter","files":187,"time":1226098954,"description":"When Tess of the D'Urbervilles appeared in 1891, Thomas Hardy was one of England's leading men of letters. He had already authored several well-known novels, including The Return of the Native, and numerous short stories. Tess brought him notoriety and fortune. Despite this success, the novel was one of Hardy's last. He was deeply wounded by some of the particularly personal attacks he received from reviewers of the book. In 1892, he wrote in one of his notebooks, quoted in The Later Years of Thomas Hardy, 1892 - 1928, compiled by Florence Emily Hardy, &quot;Well, if this sort of thing continues no more novel writing for me. A man must be a fool to deliberately stand up to be shot at.&quot;\n\nIn spite of his reputation, Hardy had difficulty finding a periodical willing to publish the book when he offered it for serialization to London's leading reviews. The subject matter - a milkmaid who is seduced by one man, married and rejected by another, and who eventually murders the first one - was considered unfit for publications which young people might read. To appease potential publishers, Hardy took the novel apart, rewrote some scenes and added others. In due course, a publisher was secured. However, when it came time to publish the novel in book form, Hardy reassembled it as it was originally conceived.\n\nEarly critics attacked Hardy for the novel's subtitle, &quot;A Pure Woman,&quot; arguing that Tess could not possibly be considered pure. They also denounced his frank - for the time - depiction of sex, criticism of organized religion (he was in many ways the 19th century Richard Dawkins!), and dark pessimism. Today, the novel is praised as a courageous call for righting many of the ills Hardy found in Victorian society and as a link between the Victorian literature of such notables as Charles Dickens and that of the modern era giants such as D H Lawrence. \n\n\n","torrent":{"xt":"urn:btih:67e542b78130b50c378d0369cc66bdd39bdadee4","amp;dn":"Thomas+Hardy+-+Tess+of+the+D%5C%27Urbervilles+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e542b78130b50c378d0369cc66bdd39bdadee4","infoHashBuffer":{"type":"Buffer","data":[103,229,66,183,129,48,181,12,55,141,3,105,204,102,189,211,155,218,222,228]},"announce":[],"urlList":[]}}