{"title":"Eric Dolphy 24 Bit Vinyl Pack","uid":8830606,"size":4479758730,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:68ab646eabc51796f39d18af453bfaf1e3752547&amp;dn=Eric+Dolphy+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1376965714,"description":"\n  Eric Dolphy 24 Bit Vinyl Pack\n  \n  Genre: Jazz\n  Styles: Free Jazz, Post-Bop, Avant-Garde Jazz, Jazz Instrument\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~  3,000 kbps\n  Bit Depth: 24 \n  Sampling Rate: 96,000 Hz\n\n  Out to Lunch (two versions)\n  Fire Waltz\n  Out There\n  Outward Bound\n\n  Eric Dolphy was a true original with his own distinctive styles on alto, flute, and bass clarinet. His music fell into the &quot;avant-garde&quot; category yet he did not discard chordal improvisation altogether (although the relationship of his notes to the chords was often pretty abstract). While most of the other &quot;free jazz&quot; players sounded very serious in their playing, Dolphy's solos often came across as ecstatic and exuberant. His improvisations utilized very wide intervals, a variety of nonmusical speechlike sounds, and its own logic. Although the alto was his main axe, Dolphy was the first flutist to move beyond bop (influencing James Newton) and he largely introduced the bass clarinet to jazz as a solo instrument. He was also one of the first (after Coleman Hawkins) to record unaccompanied horn solos, preceding Anthony Braxton by five years.\n\n  Eric Dolphy first recorded while with Roy Porter &amp; His Orchestra (1948-1950) in Los Angeles, he was in the Army for two years, and he then played in obscurity in L.A. until he joined the Chico Hamilton Quintet in 1958. In 1959 he settled in New York and was soon a member of the Charles Mingus Quartet. By 1960 Dolphy was recording regularly as a leader for Prestige and gaining attention for his work with Mingus, but throughout his short career he had difficulty gaining steady work due to his very advanced style. Dolphy recorded quite a bit during 1960-1961, including three albums cut at the Five Spot while with trumpeter Booker Little, Free Jazz with Ornette Coleman, sessions with Max Roach, and some European dates.\n\n  Late in 1961 Dolphy was part of the John Coltrane Quintet; their engagement at the Village Vanguard caused conservative critics to try to smear them as playing &quot;anti-jazz&quot; due to the lengthy and very free solos. During 1962-1963 Dolphy played third stream music with Gunther Schuller and Orchestra U.S.A., and gigged all too rarely with his own group. In 1964 he recorded his classic Out to Lunch for Blue Note and traveled to Europe with the Charles Mingus Sextet (which was arguably the bassist's most exciting band, as shown on The Great Concert of Charles Mingus). After he chose to stay in Europe, Dolphy had a few gigs but then died suddenly from a diabetic coma at the age of 36, a major loss.\n\n  Virtually all of Eric Dolphy's recordings are in print, including a nine-CD box set of all of his Prestige sessions. In addition, Dolphy can be seen on film with John Coltrane (included on The Coltrane Legacy) and with Mingus from 1964 on a video released by Shanachie.","torrent":{"xt":"urn:btih:68ab646eabc51796f39d18af453bfaf1e3752547","amp;dn":"Eric+Dolphy+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68ab646eabc51796f39d18af453bfaf1e3752547","infoHashBuffer":{"type":"Buffer","data":[104,171,100,110,171,197,23,150,243,157,24,175,69,59,250,241,227,117,37,71]},"announce":[],"urlList":[]}}