{"title":"Beverley Knight - Voice - The Best of Beverley Knight - (2006)[E","uid":4312472,"size":150868983,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69073ef06329c78938385ef837954d3dd781a6cc&amp;dn=Beverley+Knight+-+Voice+-+The+Best+of+Beverley+Knight+-+%282006%29%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"seanprince","files":25,"time":1216886148,"description":"Beverley Knight - Voice - The Best of Beverley Knight - (2006)[EAC-MP3@320KBPS]\n\nTrack list\n\nBeverley Knight - Voice - The Best of Beverley Knight\n\n01.\tShoulda Woulda Coulda\t\t\t\t03:32\n02.\tKeep This Fire Burning\t\t\t\t03:53\n03.\tCome As You Are\t\t\t\t\t03:45\n04.\tPiece Of My Heart\t\t\t\t04:09\n05.\tGold (Album Version)\t\t\t\t04:49\n06.\tMade It Back (Good Times 7&quot; Mix)\t\t03:20\n07.\tGet Up!\t\t\t\t\t\t03:47\n08.\tFlavour Of The Old School\t\t\t04:46\n09.\tSista Sista\t\t\t\t\t04:43\n10.\tNot Too Late For Love\t\t\t\t03:54\n11.\tGreatest Day (Classic Mix)\t\t\t04:42\n12.\tMade It Back (Original Version feat. Redman)\t04:09\n13.\tSweet Thing (Live)\t\t\t\t03:53\n14.\tAngels (Live)\t\t\t\t\t04:41\n15.\tWho&amp;#039;s Gonna Save Your Soul\t\t\t03:26\n\nBiography\t\n\nNeo-soul diva Beverley Knight channeled the sound and spirit of classic R&amp;B to emerge as one of Britain&amp;#039;s biggest new pop stars of the &amp;#039;90s. Born Beverley Anne Smith to Jamaican parents in Wolverhampton, England, on March 22, 1973, she grew up in a strict Pentecostal environment and sang in her church choir throughout adolescence. Raised on a steady diet of gospel music and forbidden to listen to its secular counterpart, she nevertheless discovered crossover legends Sam Cooke and Aretha Franklin and began writing her own original songs at age 13. By 17, Knight was headlining local nightclubs and singing advertising jingles for a local radio station; the exposure earned her a recording contract offer, but she declined, instead studying religious theory and philosophy at the University of Wolverhampton.\nIn late 1994, Knight signed to the independent label Dome, teaming with London production trio 2BE3 to cut her debut LP, The B-Funk. A critical smash that earned plaudits for its adherence to old-school soul production and sensibilities, the album won a number of media and industry awards but failed to translate its acclaim into commercial success. The single &quot;Flavour of the Old School&quot; nevertheless cracked the U.K. Top 40 following a 1996 re-release, but soon after, Knight split with Dome in the wake of creative tensions and signed with EMI&amp;#039;s Parlophone subsidiary to release Prodigal Sista in the summer of 1998. The album generated five Top 40 smashes, chief among them &quot;Greatest Day&quot; and &quot;Make It Back &amp;#039;99,&quot; a collaboration with U.S. rapper Redman, and was well on its way to winning Best Album honors at the annual MOBO (Music of Black Origin) Awards.\nThe chart smashes &quot;Get Up!&quot; and &quot;Shoulda Woulda Coulda&quot; anticipated the spring 2002 release of Knight&amp;#039;s third LP, Who I Am, a Top Ten hit and Mercury Music Prize nominee celebrated as the singer&amp;#039;s most deeply personal effort up to that point. She next teamed with pop producers Guy Chambers and Peter-John Vettese for 2004&amp;#039;s Affirmation, which boasted a polished, mainstream sound that alienated a significant segment of her urban audience. The record still became Knight&amp;#039;s biggest-selling release yet, buoyed by the hits &quot;Not Too Late for Love&quot; and &quot;Keep This Fire Burning.&quot; Affirmation was profoundly inspired by her relationship with platonic soulmate Tyrone Jamison, host of the BBC program The Gay Show, who lost his battle with HIV in 2003. Knight would become an ambassador for charities including the Stop AIDS Campaign, Christian Aid, and the Terrence Higgins Trust, and in 2006 was created a Member of the Order of the British Empire (MBE) by Queen Elizabeth II for her creative and charitable contributions.\nThat same year, Knight co-starred in the BBC1 music showcase Just the Two of Us and issued the retrospective Voice: The Best of Beverley Knight, enjoying a Top 20 hit with her cover of Erma Franklin&amp;#039;s soul classic &quot;Piece of My Heart.&quot;\n\nReview\t\n\nBeverley Knight was responsible for some classy soulful singles throughout the late &amp;#039;90s and into the new century but she had never managed however to attain much in the way of album sales, her best effort to date being the number seven Who I Am from 2002. So the climate was ripe for a greatest-hits collection which EMI hoped would place her in a more adult-oriented market. Voice was very representative of her body of work, containing 15 tracks in total and three bonus tracks, including a version of Chaka Khan&amp;#039;s &quot;Sweet Thing,&quot; and a live cover of Robbie Williams&amp;#039; career-defining hit &quot;Angels,&quot; recorded for Radio 2 with a simple piano background and a gospel-style vocal. Of the 12 remaining tracks, every one had been a hit single from her debut back in 1995: &quot;Flavour of the Old School,&quot; complete with its formulaic rap break, through to her then-most recent hits &quot;Keep This Fire Burning,&quot; and a brave attempt at an R&amp;B version of Janis Joplin&amp;#039;s &quot;Piece of My Heart.&quot; Her music ranged from the ultra smooth ballads &quot;Gold&quot; and &quot;Who&amp;#039;s Gonna Save Your Soul&quot; to the Chic-&quot;Good Times&quot; sampled &quot;Made It Back,&quot; and the &amp;#039;70s disco influenced &quot;Greatest Day.&quot; Although she had been hitting the charts quite regularly since 1995, albeit not that close to the top, it was with the dance track &quot;Shoulda Woulda Coulda&quot; in 2002 that she finally broke through to the Top Ten and the album opens with this hit. In fact, the first four tracks were her two biggest singles, including 2004&amp;#039;s &quot;Come as You Are,&quot; and the two most recent hits: the Joplin track and &quot;Keep This Fire Burning.&quot; \n\nEnjoy","torrent":{"xt":"urn:btih:69073ef06329c78938385ef837954d3dd781a6cc","amp;dn":"Beverley+Knight+-+Voice+-+The+Best+of+Beverley+Knight+-+%282006%29%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69073ef06329c78938385ef837954d3dd781a6cc","infoHashBuffer":{"type":"Buffer","data":[105,7,62,240,99,41,199,137,56,56,94,248,55,149,77,61,215,129,166,204]},"announce":[],"urlList":[]}}