{"title":"Luxure, Epouses A Partager 2015 WEBRip","uid":12956810,"size":1497381767,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:69b22e3c7f10e7a3a19d24afc48dc48decc2c6e2&amp;dn=Luxure%2C+Epouses+A+Partager+2015+WEBRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"EndYou","files":1,"time":1449790012,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/uP\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 2015\r\nStudio: Marc Dorcel\r\nGenre: Porno francais, Ana, Group, Orgy\r\nDuration: 1:34:35\r\n\r\nYanick Shaft, Rico Simmons, Josh, Anna Polina, Ricky Mancini, Jessie Volt, Max Casanova, Amarna Miller, Alix Feeling, Cara Saint-Germain, Alexandra Stein.\r\n\r\nDans un univers fait de luxe et de charmes, ces six magnifiques femmes mariees sont pretes a tout pour satisfaire les fantasmes voyeuristes et libertins de leur epoux. En s'offrant a des inconnus sous le regard pervers de leur mari, elles sont sur le point de decouvrir de nouvelles facons d'atteindre la jouissance. Aucun doute, le fruit defendu est vraiment meilleur lorsqu'on y goute a deux? Plus tot dans la journee, cette superbe rousse a suce un inconnu jusqu'a ce qu'il jouisse dans sa bouche et son mari n'a rien rate de cet allechant spectacle. De retour a la maison, elle decouvre avec plaisir qu'il n'a jamais ete aussi excite: il compte bien la faire jouir comme jamais encore elle n'a joui! Ce soir, l'objectif de la belle Cara est tres simple: etancher le desir des trois inconnus que son homme a invites dans leur luxueuse demeure. La gourmandise avec laquelle la docile jeune femme menera sa mission a bien comblera tous ces males de bonheur, et surtout son pervers de mari. Assise nue au beau milieu du salon, Alix n'a pas d'autre choix que de regarder en silence son vigoureux mari sodomiser Jessie. Alors que cette escorte trouvee sur internet est en train d'atteindre un intense orgasme anal grace a la queue de son homme, Alix reve de pouvoir les rejoindre. Mais son mari ne lui en a pas donne l'autorisation: elle va devoir regarder la scene jusqu'au bout!\r\n\r\nVideo quality: WEBRip\r\nVideo Format: mp4\r\nVideo: MPEG4 Video (H264) 854x480 25fps 1979kbps\r\nAudio: AAC 48000Hz stereo 126kbps","torrent":{"xt":"urn:btih:69b22e3c7f10e7a3a19d24afc48dc48decc2c6e2","amp;dn":"Luxure%2C+Epouses+A+Partager+2015+WEBRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69b22e3c7f10e7a3a19d24afc48dc48decc2c6e2","infoHashBuffer":{"type":"Buffer","data":[105,178,46,60,127,16,231,163,161,157,36,175,196,141,196,141,236,194,198,226]},"announce":[],"urlList":[]}}