{"title":"Dark Fantasy (OTRR Certified V2) otr old time radio","uid":8231333,"size":306565444,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6a7d22fa35987f53f5ec54cf49c814765d69351a&amp;dn=Dark+Fantasy+%28OTRR+Certified+V2%29+otr+old+time+radio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"OldTimeRadio","files":-1,"time":1362739783,"description":"\n\nDARK FANTASY\n\n\nDark Fantasy was a short series with tales of the weird, adventures of the supernatural, created for you by Scott Bishop. The series aired as a horror drama on NBC between 1941 and 1942.\n\nDark Fantasy was a series dedicated to dealings with the unknown. Originating from radio station WKY, Oklahoma City, it was written by Scott Bishop (of Mysterious Traveler and The Sealed Book fame) and was heard Fridays over stations. Tom Paxton served as announcer. The shows covered horror, science fiction and murder mysteries. Although a short series, the shows are excellent with some stories way ahead of their time. The following is a news promo promoting the show:\n\n Every since Lights Out went out several years ago, fans of the fiendish have been clamoring for more good old goose-pimple horror drama on the air. Now they have it. One of the programs that currently freezes the airwaves with its chilling stories is Dark Fantasy comparatively new to the networks. In the late hours of Friday nights these shivery, shocking stories go out over NBC - right straight from Oklahoma City, which you might not have thought of as headquarters for haunts. Station WKY is the home of the Dark Fantasy plays, and the writer is Scott Bishop, who lives in the midst of mystery and the supernatural, represented by the innurnerable volumes of thriller fiction, fantasy lore and all kinds of horror literature that fill his home andhis office. Bishop has long contributed to network broadcasting and to magazines. He says, &quot;Give the listener enough material to let his imagination go to work, and he'll supply his own goose-pimples.&quot; Dark Fantasy has been furnishing plenty of such material since last November. And judging from enthusiastic comment, the horror fans are responding with goose-pimples galore! Tune in every Friday on Station WKY Oklahoma City. \n\n\nNOTE: Updated Release! Title corrections and other miscellaneous changes (13-Mar-2011).\n\n\n\n--------------------------------------------------------------------------------\nOTRR Certification Information:\n\nSeries Name: Dark Fantasy\nCertification Status: OTRR Certified Accurate\nCertification Date: January 3, 2011\nCertification Version: Version 2\nNumber of CDs: 1\n\n\n--------------------------------------------------------------------------------\nOLD TIME RADIO RESEARCHERS GROUP\n\n\n This is a production of the Old Time Radio Researchers Group located at Old Time Radio Researchers Website and the Old Time Radio Researchers Group.\n\n It contains the most complete and accurate version of this series in the best sound possible at the time of creation. An updated version will be issued if more episodes or better sounding ones become available.\n\n If you are interested in preserving old time radio, you may wish to join the Old Time Radio Researchers Group at Yahoo.\n\n\n Relax, listen, and enjoy!\n\n--------------------------------------------------------------------------------\n\nWhole Item Format Size \nOTRR_Certified_Dark_Fantasy_Ver2_CD_1of1.zip  ZIP  292.4 MB \n","torrent":{"xt":"urn:btih:6a7d22fa35987f53f5ec54cf49c814765d69351a","amp;dn":"Dark+Fantasy+%28OTRR+Certified+V2%29+otr+old+time+radio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a7d22fa35987f53f5ec54cf49c814765d69351a","infoHashBuffer":{"type":"Buffer","data":[106,125,34,250,53,152,127,83,245,236,84,207,73,200,20,118,93,105,53,26]},"announce":[],"urlList":[]}}