{"title":"The Tubes - White Punks and Others  2016 320ak","uid":14331046,"size":104075715,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6bcc902cb57d628b5c6e9d85fa95aa1c8bf923c8&amp;dn=The+Tubes+-+White+Punks+and+Others++2016+320ak&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"analogkid6103","files":9,"time":1460683285,"description":"The Tubes - White Punks and Others  2016 320ak\r\n\r\nThe Tubes are a San Francisco-based rock band whose 1975 debut album included the hit single &quot;White Punks on Dope&quot;. During its first fifteen years or so, the band's live performances combined quasi-pornography with wild satires of media, consumerism, and politics. They are also remembered for their 1983 single &quot;She's a Beauty&quot;, a top 10 U.S. hit with a frequently-played music video in the early days of MTV; and in the 1980 film Xanadu singing the rock portion of the cross-genre song &quot;Dancin'&quot; opposite a big band.\r\nOne of the first &quot;Tubes&quot; shows was at the Art Institute cafeteria as part of an art show for classmate and future Hollywood director Katherine Bigelow. While experimenting with their stage show and art, Prairie and Michael met a model named Re Styles.  Re has appeared in both Alejandro Jodorowsky's The Holy Mountain (1973 film)  and posed for Playboy and Penthouse. Prairie and Re began dating and she started performing with the band playing Patty Hearst and dressing in wild leather outfits during the &quot;Mondo Bondage&quot; dance with Fee Waybill. \r\nPrairie Prince had been hired by Journey to record demos and approached their manager Herbie Herbert, a former Santana roadie and Bill Graham employee. Herbie made a deal with Bill Graham that if the Tubes could sell out three local shows, Bill would give him an opening slot on the show of his choice.\r\n \r\nMuch to Bill Graham's dismay Herbie Herbert chose an opening slot for the upcoming Led Zeppelin show at Kezar Stadium. The band pulled out the stops including Fee dressed as an early version of &quot;Quay Lewd&quot; throwing &quot;Cocaine&quot; (flour) and &quot;Pills&quot; (candy) at the crowd who threw it back. Bill Graham threatened Herbie that the band would never play in San Francisco again but calmed down and eventually fell in love with the band, booking them at Winterland and other California venues for New Year's shows and Halloween.\r\n\r\nTracklist\r\n\r\n01 Piece By Piece.mp3\r\n02 She's A Beauty.mp3\r\n03 Talk To Ya Later.mp3\r\n04 White Punks On Dope(Studio version) ).mp3\r\n05 What Do You Want From Life_.mp3\r\n06 Cathy's Clone.MP3\r\n07 Only The Strong Survive.mp3\r\n08 Power Tools.mp3\r\n09 White Punks On Dope (Live version).mp3\r\n\r\n\r\nPlayers\r\n\r\nRoger Steen\r\nPrairie Prince\r\nRick Anderson\r\nFee Waybill\r\nDavid Medd","torrent":{"xt":"urn:btih:6bcc902cb57d628b5c6e9d85fa95aa1c8bf923c8","amp;dn":"The+Tubes+-+White+Punks+and+Others++2016+320ak","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bcc902cb57d628b5c6e9d85fa95aa1c8bf923c8","infoHashBuffer":{"type":"Buffer","data":[107,204,144,44,181,125,98,139,92,110,157,133,250,149,170,28,139,249,35,200]},"announce":[],"urlList":[]}}