{"title":"The Fishing Fleet- Husband-Hunting in the Raj by Anne de Courcy ","uid":10923410,"size":27784569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c05c7a4a8c28242e4ed03de1e8858b07d48495f&amp;dn=The+Fishing+Fleet-+Husband-Hunting+in+the+Raj+by+Anne+de+Courcy+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1409350244,"description":"From the late 19th century, when the Raj was at its height, many of Britain's best and brightest young men went out to India to work as administrators, soldiers and businessmen. With the advent of steam travel and the opening of the Suez Canal, countless young women, suffering at the lack of eligible men in Britain, followed in their wake. They were known as the Fishing Fleet, and this book is their story. \n\nFor these young women, often away from home for the first time, one thing they could be sure of was a rollicking good time. By the early twentieth century, a hectic social scene was in place, with dance parties, picnics, tennis tournaments and perhaps a tiger shoot and glittering dinner at a raja's palace thrown in. And, with men outnumbering women by roughly four to one, romances were conducted at alarming speed and marriages were frequent. But after the honeymoon life often changed dramatically: whisked off to remote outposts, they found it a far cry from the social whirlwind of their first arrival. \n\nAnne de Courcy's sparkling narrative is enriched by a wealth of first-hand sources which bring this forgotten era vividly to life.","torrent":{"xt":"urn:btih:6c05c7a4a8c28242e4ed03de1e8858b07d48495f","amp;dn":"The+Fishing+Fleet-+Husband-Hunting+in+the+Raj+by+Anne+de+Courcy+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c05c7a4a8c28242e4ed03de1e8858b07d48495f","infoHashBuffer":{"type":"Buffer","data":[108,5,199,164,168,194,130,66,228,237,3,222,30,136,88,176,125,72,73,95]},"announce":[],"urlList":[]}}