{"title":"Christina Aguilera - Hurt","uid":4255146,"size":151465988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6c9b76b50c77339accd0cc5d3dbd39c057906fdf&amp;dn=Christina+Aguilera+-+Hurt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2nafish","files":1,"time":1214203229,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 kbps\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\nDuring MTV&amp;#039;s red-carpet pre-show, Aguilera revealed that she would co-direct the music video alongside Floria Sigismondi, who worked on &quot;Fighter&quot; (2003). The circus-themed video for &quot;Hurt&quot; was shot over five days in September and the video premiered on October 17 on TRL. It is the first video Aguilera has directed. The video reached number one on TRL fourteen times and retired at number 1 on January 11, 2007. It&amp;#039;s her eighth video to retire on that show. Furthermore, the video swept the 2007 MVPA awards winning Best Video and Best Direction of a Female Artist.\n\nThe video begins with the ending instrumental to &quot;Enter the circus&quot;/&quot;Welcome&quot;, over which a carnival barker (voiced by Linda Perry) introduces a spectacular circus, and begins in black and white. The transition to colour begins when Aguilera appears in an old fashioned dressing room, receiving flowers and then an important telegram. A flashback then shows young Aguilera, played by Laci Kay, with her father, played by Timothy V. Murphy, raptured by the sight of the tightrope walker, played by Elizabeth Glassco. With her father&amp;#039;s encouragement, Aguilera begins to train herself to do the same. When the video switches to older Aguilera, we see her descending from the top of a circus tent on a rope, onto the back of an elephant, with her father watching adoringly in the audience. She later attempts to greet him but is pulled away by fans and photographers keen to meet the star. The content of the telegram is then revealed to be a message of her father&amp;#039;s death, and as Aguilera realises that she was too wrapped up in her stardom to deal with what matters, she races through the circus in a belated attempt to find her father. The video ends with a shot of Aguilera sitting on a circus box, singing and crying, before fading out to Aguilera&amp;#039;s grief-stricken form on the ground outside the circus tent.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6c9b76b50c77339accd0cc5d3dbd39c057906fdf","amp;dn":"Christina+Aguilera+-+Hurt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c9b76b50c77339accd0cc5d3dbd39c057906fdf","infoHashBuffer":{"type":"Buffer","data":[108,155,118,181,12,119,51,154,204,208,204,93,61,189,57,192,87,144,111,223]},"announce":[],"urlList":[]}}