{"title":"Grem - Liberty Amendment Money Trap (analysis of central banking","uid":7046556,"size":302233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6cef299e0e9f51fee601583987a722e9a42271cf&amp;dn=Grem+-+Liberty+Amendment+Money+Trap+%28analysis+of+central+banking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1329774886,"description":"This is June Grem's explosive book The Liberty Amendment Money Trap (1979) which reveals a sinister, well-organized and almost unknown plot to gain control of the entire world through the issuance and control of money. It was through author's knowledge of how the stock market operated that she became aware of the central bank's role in economy. It is through their manipulations of interest and discount rates, as well as stock margin requirements, that the market is moved up or down, thus ultimately affecting the financial and economic fortunes of entire nations. These operations have been shrouded in such secrecy that very few people either know or suspect that the same forces which control money, stock market and economy also control the world-wide revolutionary movement. It is hoped that when people gain an understanding of this vitally important subject of money issuance and control, an informed citizenry will take the necessary steps to reconstruct society on the basis of reason, constitutional law and peace and prosperity for all of citizens. The Liberty Amendment Money Trap is a penetrating analysis of the forces which control the market and today's money system. 75 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:6cef299e0e9f51fee601583987a722e9a42271cf","amp;dn":"Grem+-+Liberty+Amendment+Money+Trap+%28analysis+of+central+banking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cef299e0e9f51fee601583987a722e9a42271cf","infoHashBuffer":{"type":"Buffer","data":[108,239,41,158,14,159,81,254,230,1,88,57,135,167,34,233,164,34,113,207]},"announce":[],"urlList":[]}}