{"title":"Don't Starve Together [Repack]","uid":11616141,"size":530267047,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6e4ae344ef444e3484b53f8b7bc67dbd3323251e&amp;dn=Don%27t+Starve+Together+%5BRepack%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Whobuysgames","files":1,"time":1417498984,"description":"what this torrent will allow you to do differently from other independent torrents is:\n1. Change your name\n2. save items independently\n \nTo install this game run the &quot;DST Beta Setup.exe&quot; this will install the game into the registry allowing you to change the name from the default of &quot;Player 1&quot;.\n\nthis part of the torrent was originally uploaded from user &quot;FunnyHD&quot; from Kickasstorrents, so thanks to him.\n\n\n\nHOW TO CHANGE YOUR NAME! :\n\n1.After running &quot;&quot;DST Beta Setup.exe&quot; Open regedit (windowskey+r) and go to HKEY_CURRENT_USERSoftwareFLTSteam220660\n\n2. Click on PersonaName\n\n3.Change the value from &quot;Player 1&quot; to desired username\n\n4. Click OK\n\n\n\nHOW TO RUN THE GAME!:\n\nOnce the game has been installed and your name has been changed you need to use the game exe inside the &quot;Dont Starve Together&quot; folder inside the rar &quot;Dont Starve Togetherbindontstarve_steam.exe&quot;, if you do not your items will not save when leaving and joining servers.\n\nthe &quot;Dont Starve Together&quot; folder originated from the DST torrent by Viper_666 also from KickAssTorrents, so cheers to that user also.\n\n\n\nHOW TO JOIN ANOTHER PLAYER'S SERVER:\n\nI suggest using a VPN such as tunngle(personal preference) you can create a private network with your friends and then they can join your connection.\n\nYOU WILL NOT BE ABLE TO JOIN YOUR FRIENDS HOSTED SERVER UNLESS YOU TURN LAN ON:\n\nto turn lan on after stating the game click &quot;play online&quot; you will see a server list on the left side and a &quot;filters , server details&quot; on the right side, under the filters tab there is an option &quot;show LAN&quot; on the second page of the filters tab (click the arrow to the right) this is default to &quot;NO&quot; (i have no idea why this is like this) change this setting to &quot;YES&quot; and you should be able to see your friends server, if you cannot see your friends server check your firewall settings and make sure the VPN has been configured correctly.\n\n\nNotes:\n\nDST VERSION: 115992\n\nI am not sure if the game requires the files which were installed with the &quot;DST Beta Setup.exe&quot; i only used this to create the registry files to allow a unique name and combined with the other torrent it allows items to be saved.\n\nI DID THIS BY ACCIDENT AND WAS A COMPLETE FLUKE\n\nthis is my first torrent, if there is any questions pls ask","torrent":{"xt":"urn:btih:6e4ae344ef444e3484b53f8b7bc67dbd3323251e","amp;dn":"Don%27t+Starve+Together+%5BRepack%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4ae344ef444e3484b53f8b7bc67dbd3323251e","infoHashBuffer":{"type":"Buffer","data":[110,74,227,68,239,68,78,52,132,181,63,139,123,198,125,189,51,35,37,30]},"announce":[],"urlList":[]}}