{"title":"The Straight Story 1999 DVDRip Sonata Premiere","uid":9169042,"size":734320841,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6ea95b5e2940b4d6c2d6a06c499bb7917a56cde2&amp;dn=The+Straight+Story+1999+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"klinho","files":2,"time":1384037998,"description":"David Lynch offers an uncharacteristically straightforward and warmly sentimental approach to his material in this film, based on a true story, about an elderly man's journey to reconcile with his brother. Alvin Straight (Richard Farnsworth) is an ailing widower in his early 70's who lives in Laurens, Iowa with his daughter, Rose (Sissy Spacek), who is mildly retarded and has a speech defect. Alvin doesn't trust doctors, despite suffering from emphysema and a bad hip. Alvin learns that his brother Lyle (Harry Dean Stanton) has suffered a stroke and may not have long to live. Alvin and Lyle haven't spoken in 10 years, which Alvin says is mainly a matter of pride and alcohol; Alvin wants to clear his slate with his brother before it's too late. However, Lyle lives in Wisconsin, and Alvin has little money, no car, and no driver's license. He does, however, have a riding lawn mower, and so Alvin hops on board and heads northeast to Wisconsin, hoping to make it while there's still time. Along the way, Alvin makes new friends and refuses to give up on his journey, despite frequent mechanical breakdowns. Richard Farnsworth's performance as Alvin earned him an Academy Award nomination as Best Actor; it would prove to be his final screen appearance, as he died a year after the film's release.","torrent":{"xt":"urn:btih:6ea95b5e2940b4d6c2d6a06c499bb7917a56cde2","amp;dn":"The+Straight+Story+1999+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ea95b5e2940b4d6c2d6a06c499bb7917a56cde2","infoHashBuffer":{"type":"Buffer","data":[110,169,91,94,41,64,180,214,194,214,160,108,73,155,183,145,122,86,205,226]},"announce":[],"urlList":[]}}