{"title":"[John_Holmes]_Porn_King_The_Autobiography_of_John(Bookos.org).ep","uid":9180046,"size":5670125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f3df29cf736271aefd9b23ae5d7df7a78aa1076&amp;dn=%5BJohn_Holmes%5D_Porn_King_The_Autobiography_of_John%28Bookos.org%29.ep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1384218466,"description":" In the world of Adult Cinema, one name stands out above all others: John Holmes. For nearly 20 years, from 1967 to 1987, Holmes reigned as the undisputed King of X-rated films, having appeared in a record 2,200-plus productions, from the landmark Johnny Wadd movies to the legendary Insatiable with Marilyn Chambers. To a legion of fans throughout America, Europe and Asia, he was known as &quot;Mr. Big.&quot; To industry insiders, he was &quot;Mr. Nice Guy.&quot; Yet for all of his fame and notoriety, Holmes remained an intensely private person and a mystery man. That is until now.\nIn this startingly frank autobiography, PORN KING was written in large part prior to his death (with new material added by his widow, Laurie) Holmes talkes about his incredible life.This is not a typical celebrity story filled with bright lights and movie moguls. It is, instead, a rare portrait of a young man drawn into an unknown Hollywood, a secret, forbidden Hollywood, and the parallels between his astounding career and the sexual revolution in American Films. Holmes knew his subject better then anyone.\n\nHolmes candidly tells of a lucrative but often harrowing &quot;other&quot; life as a male prostitute to the rich and famous, international society matrons, politicians' wives, debutantes and actresses; a shattering fall into drugs and his involvements with dealers, organized crime, rock and screen stars; and a desperate cross-country flight following his implication in the grisly &quot;Laurel Canyon - Four on the Floor&quot; Murders.\n\nFrom start to finish, &quot;PORN KING&quot; is a sizzling, sensuous, fast-paced story laced with controversy. It is at times raw, violent, even filled with pain. During his lifetime, John Holmes wentthrough hell and back, and he had the emotional scars to prove it.\n\nJohn C. Holmes will without a doubt go down in our History Books. This is a definate must read book that any reader will have a hard time putting down. Many rare never seen before photographs of The man, The Legend, The real person.\nGenre: Non Fiction ; Memoir","torrent":{"xt":"urn:btih:6f3df29cf736271aefd9b23ae5d7df7a78aa1076","amp;dn":"%5BJohn_Holmes%5D_Porn_King_The_Autobiography_of_John%28Bookos.org%29.ep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3df29cf736271aefd9b23ae5d7df7a78aa1076","infoHashBuffer":{"type":"Buffer","data":[111,61,242,156,247,54,39,26,239,217,178,58,229,215,223,122,120,170,16,118]},"announce":[],"urlList":[]}}