{"title":"Gilles Deleuze - Desert Islands and Other Texts (1953-1974) (200","uid":3883687,"size":3470169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fe94240d14ef3e791723673cf76bb407f7abc83&amp;dn=Gilles+Deleuze+-+Desert+Islands+and+Other+Texts+%281953-1974%29+%28200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"arttorrents","files":1,"time":1194792466,"description":"LANGUAGE: English.\n\n&quot;One day, perhaps, this century will be Deleuzian,&quot; Michel Foucault once wrote. This book anthologizes 40 texts and interviews written over 20 years by renowned French philosopher Gilles Deleuze, who died in 1995. The early texts, from 1953-1966 (on Rousseau, Kafka, Jarry, etc.), belong to literary criticism and announce Deleuze&amp;#039;s last book, Critique and Clinic (1993). But philosophy clearly predominates in the rest of the book, with sharp appraisals of the thinkers he always felt indebted to: Spinoza, Bergson. More surprising is his acknowledgement of Jean-Paul Sartre as his master. &quot;The new themes, a certain new style, a new aggressive and polemical way of raising questions,&quot; he wrote, &quot;come from Sartre.&quot; But the figure of Nietzsche remains by far the most seminal, and the presence throughout of his friends and close collaborators, Felix Guattari and Michel Foucault. The book stops shortly after the publication of Anti-Oedipus, and presents a kind of genealogy of Deleuze&amp;#039;s thought as well as his attempt to leave philosophy and connect it to the outside -- but, he cautions, as a philosopher.\n\nGilles Deleuze (1925-1995) was Professor of Philosophy at the University of Paris VIII, Vincennes/Saint Denis. He published 25 books, including five in collaboration with FÃƒÂ©lix Guattari.","torrent":{"xt":"urn:btih:6fe94240d14ef3e791723673cf76bb407f7abc83","amp;dn":"Gilles+Deleuze+-+Desert+Islands+and+Other+Texts+%281953-1974%29+%28200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fe94240d14ef3e791723673cf76bb407f7abc83","infoHashBuffer":{"type":"Buffer","data":[111,233,66,64,209,78,243,231,145,114,54,115,207,118,187,64,127,122,188,131]},"announce":[],"urlList":[]}}