{"title":"Caleb Carr - The Alienist (Dr. Laszlo Kreizler #1)","uid":14627987,"size":287238655,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:71509a7dccf962775f592c311a784da2aec0806a&amp;dn=Caleb+Carr+-+The+Alienist+%28Dr.+Laszlo+Kreizler+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":64,"time":1463330147,"description":"The year is 1896, the place, New York City. On a cold March night New York Times reporter John Schuyler Moore is summoned to the East River by his friend and former Harvard classmate Dr. Laszlo Kreizler, a psychologist, or &quot;alienist.&quot; On the unfinished Williamsburg Bridge, they view the horribly mutilated body of an adolescent boy, a prostitute from one of Manhattan's infamous brothels.\r\n\r\nThe newly appointed police commissioner, Theodore Roosevelt, in a highly unorthodox move, enlists the two men in the murder investigation, counting on the reserved Kreizler's intellect and Moore's knowledge of New York's vast criminal underworld. They are joined by Sara Howard, a brave and determined woman who works as a secretary in the police department. Laboring in secret (for alienists, and the emerging discipline of psychology, are viewed by the public with skepticism at best), the unlikely team embarks on what is a revolutionary effort in criminology-- amassing a psychological profile of the man they're looking for based on the details of his crimes. Their dangerous quest takes them into the tortured past and twisted mind of a murderer who has killed before--and will kill again before the hunt is over.\r\n\r\nFast-paced and gripping, infused with a historian's exactitude, The Alienist conjures up the Gilded Age and its untarnished underside: verminous tenements and opulent mansions, corrupt cops and flamboyant gangsters, shining opera houses and seamy gin mills. Here is a New York during an age when questioning society's belief that all killers are born, not made, could have unexpected and mortal consequences. \r\n\r\nRead by George Guidall\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:71509a7dccf962775f592c311a784da2aec0806a","amp;dn":"Caleb+Carr+-+The+Alienist+%28Dr.+Laszlo+Kreizler+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71509a7dccf962775f592c311a784da2aec0806a","infoHashBuffer":{"type":"Buffer","data":[113,80,154,125,204,249,98,119,95,89,44,49,26,120,77,162,174,192,128,106]},"announce":[],"urlList":[]}}