{"title":"Fire and Ashes- Success and Failure in Politics by Michael Ignat","uid":10879649,"size":5772300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71bcd89e58dad7e950678c61c5d3c86f9eed5ddd&amp;dn=Fire+and+Ashes-+Success+and+Failure+in+Politics+by+Michael+Ignat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"gratefuldawg77","files":6,"time":1409019966,"description":"In 2005 Michael Ignatieff left his life as a writer and professor at Harvard University to enter the combative world of politics back home in Canada. By 2008, he was leader of the country's Liberal Party and poised--should the governing Conservatives falter--to become Canada's next Prime Minister. It never happened. Today, after a bruising electoral defeat, Ignatieff is back where he started, writing and teaching what he learned.\n\nWhat did he take away from this crash course in political success and failure? Did a life of thinking about politics prepare him for the real thing? How did he handle it when his own history as a longtime expatriate became a major political issue? Are cynics right to despair about democratic politics? Are idealists right to hope? Ignatieff blends reflection and analysis to portray today's democratic politics as ruthless, unpredictable, unforgiving, and hyper-adversarial.\n\nRough as it is, Ignatieff argues, democratic politics is a crucible for compromise, and many of the apparent vices of political life, from inconsistency to the fake smile, follow from the necessity of bridging differences in a pluralist society. A compelling account of modern politics as it really is, the book is also a celebration of the political life in all its wild, exuberant variety.","torrent":{"xt":"urn:btih:71bcd89e58dad7e950678c61c5d3c86f9eed5ddd","amp;dn":"Fire+and+Ashes-+Success+and+Failure+in+Politics+by+Michael+Ignat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71bcd89e58dad7e950678c61c5d3c86f9eed5ddd","infoHashBuffer":{"type":"Buffer","data":[113,188,216,158,88,218,215,233,80,103,140,97,197,211,200,111,158,237,93,221]},"announce":[],"urlList":[]}}