{"title":"Dizzy Gillespie - Charlie Parker - Town Hall, New York City, Jun","uid":8654246,"size":232332491,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:724bd51051c61c17da0b0ddeec595fbaf7d94837&amp;dn=Dizzy+Gillespie+-+Charlie+Parker+-+Town+Hall%2C+New+York+City%2C+Jun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"johnny39","files":31,"time":1373176625,"description":"Dizzy Gillespie - Charlie Parker\n\nTown Hall, New York City, June 22, 1945 \n\n Track Listing \n\n--------------------------------------------------------------------------------    \n   Song Title \n \n  1. Intro \n  2. Bebop \n  3. Night In Tunisia, A \n  4. Groovin' High \n  5. Salt Peanuts \n  6. Hot House \n  7. Fifty Second Street Theme \n\n Notes \n\n--------------------------------------------------------------------------------\n\nPersonnel: Dizzy Gillespie (trumpet); Charlie Parker (alto saxophone); Don Byas (tenor saxophone); Al Haig (piano); Curley Russell (double bass); Max Roach, Sid Catlett (drums).\n\nLiner Note Authors: Ira Gitler; Robert E. Sunenblick M.D.\n\nRecording information: Town Hall, New York, New York (06/22/1945).This is a live concert recording of Dizzy and Bird from Town Hall not previously known to have been recorded. With audio restoration by Ted Kendell, the sound is excellent. This is a discovered recording of Dizzy and Bird at bebop's inception.\n\n Review \n\n--------------------------------------------------------------------------------\n\nEntertainment Weekly (p.77)\n\n - &quot;...[A] joyful, well-recorded slice of essential jazz history....&quot; - Grade: A minus\nThe Wire (p.74) - &quot;If you're looking for the essence of bebop, in all its exhilarating glory before complacency and slickness set in, it's right here.&quot;\n \nAmazon.com\n\nDizzy Gillespie and Charlie Parker first became aware of each other in 1940 when the former was playing in Cab Calloway's band and the latter with Jay McShann. Two years later they were both living in New York City and a real friendship developed. By 1945 they were recording and gigging together, culminating in this Town Hall concert on June 22, 1945. These recordings languished for sixty years as acetates that weren't even known to exist in their entirety. That this set captures these two formidable players in their ascendancy and with such clarity is a staggering find. Here, with host Symphony Sid announcing the songs (this would have been for his radio show, but apparently never ended up in his possessions), an important chapter in American music is now restored. By the end of the summer of '45 Gillespie and Parker went their separate ways, both emerging with their own bands and reaching new heights of commercial success. --David Greenberger \n\nFred Kaplan, The New York Times July 31, 2005\n\nIt's an unlikely story, but the most stunning jazz discovery in a decade - the Rosetta Stone of bebop - was unearthed at an Elks Lodge in Chelmsford, Mass. The trove consisted of seven 12-inch acetate discs, on which was recorded a 40-minute concert by Dizzy Gillespie and Charlie Parker at Town Hall in New York on June 22, 1945. \nThat date is significant. The two musicians - Diz and Bird, as the world would soon know them - were still fairly obscure. (Most of the audience had probably come to hear other musicians on the bill, especially the tenor saxophonist Coleman Hawkins, who didn't show up.) The first Gillespie-Parker record had been in stores for only a few weeks. The second, produced on May 11, hadn't yet been released. \n\nIn short, these discs vividly transport us to the birth of modern jazz. \n\nIn those days of the 78 r.p.m. single, studio sessions were limited to about three minutes per song, solos to 15 or 20 seconds. At the Town Hall concert, the musicians were free to play the tunes - &quot;Bebop,&quot; &quot;Groovin' High,&quot; &quot;Hot House,&quot; &quot;A Night in Tunisia&quot; and &quot;Salt Peanuts,&quot; all jazz anthems by the end of that year but at the time still unknown - for twice as long, and at a furious tempo. Solos went on for two minutes or more, and they're blazing - Diz scaling heights on trumpet, Bird hitting speeds on alto sax, that no one had heard before. The studio recordings, great as they are, sound mellow, even quaint, by comparison. \n\nNow, 60 years after the concert, the small jazz label Uptown Records has sonically restored the acetates and transferred them to a CD titled simply &quot;Dizzy Gillespie-Charlie Parker: Town Hall, New York City, June 22, 1945.&quot; \n\nDiscovery of the Century (So Far)!!!!!!!!, July 13, 2005 \nBy  soundandimage (omaha, ne United States)\n\nIt's hard to believe the good fortune we have of being able to listen to this surprisingly well-recorded, previously lost Town Hall concert concert from June 22, 1945. Dizzy Gillespie, Charlie Parker, Don Byas, Al Haig, Curley Russell, Max Roach &amp; Big Sid Catlett are presented here just months after the first Bop records were recorded in a blistering concert MC'd by the redoubtable Symphony Sid Torin. This is Bop at it's inception, played in the heat of enthusiasm and discovery. Diz is a marvel on every cut, Bird plays as if his very life depended on it, Al Haig is allowed to stretch out as he never was on the original records and the rhythm section of Russell &amp; Roach were creating the sound of the future. Special guests Byas &amp; Big Sid are an added treat. The breaks &amp; solos on &quot;Night In Tunisia&quot; and &quot;Salt Peanuts&quot; have lost none of their ability to scare the living s**t out of musicians to this very day. If you have ANY interest in these artists and this music, DO NOT delay and buy this release as soon as you possibly can. Can I give Uptown Records &amp; this CD twenty stars?!?!?!?!? ","torrent":{"xt":"urn:btih:724bd51051c61c17da0b0ddeec595fbaf7d94837","amp;dn":"Dizzy+Gillespie+-+Charlie+Parker+-+Town+Hall%2C+New+York+City%2C+Jun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"724bd51051c61c17da0b0ddeec595fbaf7d94837","infoHashBuffer":{"type":"Buffer","data":[114,75,213,16,81,198,28,23,218,11,13,222,236,89,95,186,247,217,72,55]},"announce":[],"urlList":[]}}