{"title":"The Anthony Cumia Show 2015-04-27 Baltimore Riots - 6 hour show","uid":11859872,"size":1273092893,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:725f2ca3a351a42be7c8b48f7cb251b828e77cb4&amp;dn=The+Anthony+Cumia+Show+2015-04-27+Baltimore+Riots+-+6+hour+show&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"mothergoose58","files":2,"time":1430239378,"description":"6 hours of Baltimore Riots Coverage!\n\n\n*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuests: Joe Walsh, TJ Sotomayor, Taleeb Starkes, Lionel\n\nEpisode 152 - Today TACS goes full-on Baltimore beginning with live coverage of the Freddie Gray &quot;protests&quot;, Ant goes through some of the things the &quot;protesters&quot; are lobbing, the kid glove mentality of police tactics, bad behavior being expected, misinformation and delusion, and defending the memory of good people. After an insanely hilarious arrest, we watch part of a live press conference from the Baltimore PD, discuss the mayor's strategy, a few callers chime in, we see what it was like in Baltimore over the weekend, and Ant talks about consequence and weak administration. KtC tells a story of being reprimanded, we bring people together with a cat video, look through Monday's mail, go back to the insane scene in Baltimore, Ant suggests ways to fend off the &quot;protestors&quot;, a caller compares the &quot;protesters&quot; to domestic terrorists, and Anthony talks more about the mayor's speech. We then go into MAJOR overtime with brilliant play-by-play of the live coverage, Ant's theory on ratting people out on social media, we hear what the White House is saying, find out the mayor is now backpedaling, Joe Walsh calls in to discuss the situation, Ant attempts to predict what it will be like after dark in Baltimore tonight, we get specular call-ins from TJ Sotomayor, Taleeb Starkes, Lionel Media, and TACS ends with a bit more stellar coverage of the &quot;protests&quot; (riots).\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:725f2ca3a351a42be7c8b48f7cb251b828e77cb4","amp;dn":"The+Anthony+Cumia+Show+2015-04-27+Baltimore+Riots+-+6+hour+show","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"725f2ca3a351a42be7c8b48f7cb251b828e77cb4","infoHashBuffer":{"type":"Buffer","data":[114,95,44,163,163,81,164,43,231,200,180,143,124,178,81,184,40,231,124,180]},"announce":[],"urlList":[]}}