{"title":"Temple Of The Dog - Hunger Strike (2nafish)","uid":5916827,"size":143372292,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:72a0fdfd8a61ca7616ee017b17f59bdbb62269f1&amp;dn=Temple+Of+The+Dog+-+Hunger+Strike+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1288257759,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Hunger Strike&quot; is a song by the American rock band Temple of the Dog. Written by vocalist Chris Cornell, &quot;Hunger Strike&quot; was released in 1991 as the first single from the band's sole studio album, Temple of the Dog (1991). It was Temple of the Dog's most popular song. The song peaked at number four on the Billboard Mainstream Rock Tracks chart.\n\nThe music video for &quot;Hunger Strike&quot; was directed by Paul Rachman who also directed the 2006 punk documentary American Hardcore. A&amp;M decided to reissue the album and promote &quot;Hunger Strike&quot; as a single, with an accompanying music video. The video features the band performing the song on a beach and in a forest. The video was filmed at Discovery Park in Seattle, Washington. The West Point Lighthouse is featured in the video. There are two different versions of the video for the track.\n\nIn the summer of 1992, the album received new attention. Although it had been released more than a year earlier, A&amp;M Records realized that they had in their catalog what was essentially a collaboration between Soundgarden and Pearl Jam, who had both risen to mainstream attention in the months since the album's release with their respective albums, Badmotorfinger and Ten. A&amp;M decided to reissue the album and promote &quot;Hunger Strike&quot; as a single. &quot;Hunger Strike&quot; became the most successful song from Temple of the Dog on the American rock charts. The song peaked at number four on the Billboard Mainstream Rock Tracks chart and number seven on the Billboard Modern Rock Tracks chart. Jim Guerinot, A&amp;M's senior VP of marketing at the time, said, &quot;I don't think that anyone would have paid attention if &quot;Hunger Strike&quot; wasn't a great song.&quot; It still receives regular radio play on many hard rock radio stations.\n\nOutside the United States, the single was released in Australia, Canada, Germany, and the United Kingdom. In Canada, the song reached the top 50 on the Canadian Singles Chart. &quot;Hunger Strike&quot; reached the top 60 in the UK.\n\nDavid Fricke of Rolling Stone said, &quot;Cornell and Vedder...turn its four minutes into a veritable opera of rock-star guilt...Cornell turns on the Robert Plant-style napalm full blast, but it is Vedder's scorched introspection that brings the conscience in the song to a full boil. &quot;Hunger Strike&quot; was his first starring vocal on record; it is still one of his best.&quot;\n\nTemple of the Dog is the only studio album by the American rock band Temple of the Dog, released on April 16, 1991 through A&amp;M Records. The album is a tribute to Andrew Wood, the former lead singer of Malfunkshun and Mother Love Bone. Wood died on March 19, 1990 of a heroin overdose. The album has been certified platinum by the RIAA in the United States.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:72a0fdfd8a61ca7616ee017b17f59bdbb62269f1","amp;dn":"Temple+Of+The+Dog+-+Hunger+Strike+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72a0fdfd8a61ca7616ee017b17f59bdbb62269f1","infoHashBuffer":{"type":"Buffer","data":[114,160,253,253,138,97,202,118,22,238,1,123,23,245,155,219,182,34,105,241]},"announce":[],"urlList":[]}}