{"title":"Don't Starve Reign of Giants Steam Early Access rev. 99845","uid":10030224,"size":193193489,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:73045b2585f0fda4b93e1f13c89d821982bd18f6&amp;dn=Don%27t+Starve+Reign+of+Giants+Steam+Early+Access+rev.+99845&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ramasbmv","files":1,"time":1398329449,"description":"Here are the patch notes for our April 16, 2014 update. As with the previous updates, the additions we made to the game have been deliberately left vague.\n \nChanges:\nTweaked visual effects for overheating.\nChanged the placer icon of the Ice Flingomatic to better represent the effective range.\nGiants are more powerful in general.\nChanged giant loot into crafting mats instead of completed items.\nMade changes to the items that can be crafted with the giant's crafting materials.\nDragonfly Armour now doesn't provide as much protection. Enemies who hit you will be lit on fire.\nDown Thermantidote is now called the Luxury Fan. Increased number of uses to 15. Fires in the area of use will be put out.\nHibearnation Vest causes less hunger reduction.\nEyebrella is now a hat.\nAdditions:\nAdded additional craftables!\nAdded cookpot food recipes!\nBug Fixes:\nFixed a crash that happened when cookpots and drying racks burn down with food on them.\nCleaned up some Catcoon behaviours and crashes.\nCleaned up the behaviours and animations of some of the giants.\nFixed a crash that happened when using gunpowder on the g/moose egg.\nFixed improper eat prompts appearing for some characters.\nMoles aren't raised dirt anymore.\nPigs have gained a taste for foods they would previously ignore.\nFixed some bugs with Webber's eating habits.\nBuzzards no longer disappear when sleeping.\nVargs no longer use the Volt Goat hit sound.\nDragonfly SFX will now turn off on death.\nSpiders emerging from tumble weed will now properly recognize when the player is wearing a spider hat.\nWilson's &quot;Red Bird&quot; inspect has been changed.\nPoop no longer duplicates when trying to fertilize an invalid target.\nSanity eyes have learned to better hide themselves.\n \nHotfix 99777 - April 16\nItems dropped from giants now stack to 10.\nCoontail has art assets properly loaded.\nEating sanity restoring foods properly restores sanity again.\nHotfix 99845 - April 17\nAdded missing string for Cactus Flower.\nTurned off the controller debug menu.\nFixed an issue where Chester would not transform while playing a non-RoG save file.\nThe Molehat no longer functions when worn by entities other than the player.\nAdded some missing file references.\nRemoved some print spam from the Deerclops brain. ","torrent":{"xt":"urn:btih:73045b2585f0fda4b93e1f13c89d821982bd18f6","amp;dn":"Don%27t+Starve+Reign+of+Giants+Steam+Early+Access+rev.+99845","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73045b2585f0fda4b93e1f13c89d821982bd18f6","infoHashBuffer":{"type":"Buffer","data":[115,4,91,37,133,240,253,164,185,62,31,19,200,157,130,25,130,189,24,246]},"announce":[],"urlList":[]}}