{"title":"HAINIDES.greek music","uid":7756716,"size":318015414,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:742cf46cb3aaf9c05933709df15df8db4afaf043&amp;dn=HAINIDES.greek+music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"maxalexath","files":72,"time":1351120261,"description":"Some of the symptoms of a country in crisis: fovikotita (and therefore aggression), individualism (hence lack of vision), lack of courage and toil (fatalism-defeatism) antiparagogikotita.\nWell CHAINIDES are not from this country and living proof not with one but with two different and innovative proposals: the AGROTOKTINOTROFIKA and Metropolitan.\nThe first reason is the quasi-closed (semi) societies (the last two in southern Europe are those of Crete and the Roma) and syndiallegetai with minimal linguistic and musical forms of the eastern Mediterranean in ancient categories of lending new semantic content. In this project unique and different collaborated performers from all prefectures of Crete: Avissinos K., M. Liapakis, G. Xylouris (Psarogiorgis), G. Papadakis, M. and Tzouganakis Psarantonis.\nThe second proposal reflects anxieties post-industrial societies and the interaction of many disparate cultures through language and more complex musical structures. In this effort except Th.Rello who were with us in the heart of the experiment, participated and D.Poulikakos.\nGood listening\nCHAINIDES (D. Apostolakis, D. Zacharioudakis, T. Kanellos, M. Koti, D. Brent, M. Nikopoulos, Noni A., A. Skamnakis, E.Tsakiri)\n\n1990\nEstablished the Hainides Heraklion.\n\n\n1991\nReleased his first album titled Hainan.\nNote on the inside cover is then rector of the University of Crete, George Grammaticaki.\nDisk play Hainides\nDimitris Apostolakis, Dimitris Zacharioudakis, Kallis Spyridaki Miltos Paschalidis and George Laodikis\nand part amicably Michael Stavrakakis and Lambis Xylouris.\n\n\n1993\nReleased his second album titled World and dream is one in which participates Ross Daly and Socrates Sinopoulos.\nThe band has left Miltos Paschalidis and have joined Michael and George Stavrakakis Stavrakis.\n\n\n1994\nWith the album against the weather.\nThe University of Crete align production.\nAfter the release of the album leaves George Stavrakis.\n\n\n1997\nThe album The big trip.\nThe complex is part Kostis Avissinos.\nDisk involve Manolis Lydakis, amino Alagkampou, Sinopoulos Socrates, Pericles Papapetropoulos, Manolis Grandfather, Christos Constantinou, Achilles blinds, Haris Lambrakis, Helen Kalaitzidou.\nA year after the release of this album the band disbanded.\n\n\n2000\nThe Dimitris Apostolakis, Dimitris and Michalis Stavrakakis Zacharioudakis the old shape with Antonis Skamnaki, Alexis and Maria Koti Noni remake the band and released the double album The barefoot prince.\n\nDisk involve Psarantonis, Alkinoos Ioannidis, Vassilis Stavrakakis, Christos Constantinou, Socrates Sinopoulos, Tigran Sarkisian, Lefteris Gregory, John Noni, Noni Ersi and brass band from Keratea.\n\n\n2002\nThe album newscast.\nThe complex is part Takis Barbas retires after release of the album.\n\n\n2005\nThe album The charmers and Drakodonti, consisting of 2 cds, the charmer and Drakodonti.\nIn the complex have joined Periklis Tsoukalas and George Manolakis and has left Michael Stavrakakis.\nIn charmers participate Kostis Avissinos Pantelis Thalassinos John Haroulis, Socrates Malamas George Cochin, Achilles blinds, Kyriakos Gkouventas, Tigran Sarkisian, Vangelis Papageorgiou, Andreas scandal, Nikos Papanastasiou and children's choir of primary school pupils Nafplio Conservatory under the direction of John Noni.\nIn Drakodonti participate Psarantonis, polyphonic ensemble Chaonia, George Makris and Solis Barki.\n\n\n2007\nThe album Karagkiozis Contest in partnership with the puppeteer Danelis Athos.\nAfter the album's release leaves the band George Manolakis and fits Michael Nikopoulos.\n\n\n2008\nReleased a double live album The Descent of Clowns in partnership with MODE Plagal. The record is the record for joining the theater rocks, involving and Martha Frintzila, Kostis Avissinos and polyphonic Sanades female band.\nAfter the album's release leaves the band Periklis Tsoukalas and fall Dimitri Brent and Takis Kanellos.\n \n2011\nThe album Agrotoktinotrofika &amp; Metropolitan Area, which consists of two CD, the Agrotoktinotrofika and the Metropolitan.\nAgrotoktinotrofika to participate:\nKostis Avissinos, Manolis Liapakis, George Papadakis, MichalisTzouganakis, George Xylouris (Psarogiorgis) and Psarantonis.\nIn Metropolitan involve:\nKostis Avissinos, Dimitris Poulikakos, Theodore Rellos, Periklis Papapetropoulos and Cleopatra Vaya.","torrent":{"xt":"urn:btih:742cf46cb3aaf9c05933709df15df8db4afaf043","amp;dn":"HAINIDES.greek+music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"742cf46cb3aaf9c05933709df15df8db4afaf043","infoHashBuffer":{"type":"Buffer","data":[116,44,244,108,179,170,249,192,89,51,112,157,241,93,248,219,74,250,240,67]},"announce":[],"urlList":[]}}