{"title":"Power Electronics Handbook - (Malestrom)","uid":4689814,"size":25672833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7458e1abc78b47b1e17e734dd04d2a6fc3c8b4ea&amp;dn=Power+Electronics+Handbook+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1233352631,"description":" &lt;a href=&quot;http://www.image-upload.net/images/fmvj6ndeb1smmqnvnzq.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/fmvj6ndeb1smmqnvnzq.jpeg&lt;/a&gt;\n\nMuhammad H. Rashid , &quot;Power Electronics Handbook&quot;\nAcademic Press | 2001-08-24 | ISBN: 0125816502 | 336 pages | PDF \n\nSummary:Power electronics is a broad subject that deals with every aspect of electronic systems and devices. Any computer, machine, controller, game, etc., that is available today is dependent on the power electronics in those systems and devices to operate. Power electronics systems deal with the process of converting electrical power from one form to another. Power Electronics Handbook is specifically designed for the professional engineer in industry and includes contributions of over 60 authors primarily from industry.\nPower electronics is most frequently thought of because of its importance in supplying and converting an uninterruptable power supply to computers. The growth in computational power, communications applications, data storage, and memory systems has put the common layperson directly in contact with power engineering devices and challenges such as surge protectors and power failures. However, the field of power electronics is involved in all electronic devices and sytems. Examples include residential (refrigeration, heating, cooking, audio/video), commercial (lighting, office equipment, elevators), industrial (pumps, compressors, fans, robots, lasers, welding), transportation (automotive electronics, electric trains, battery chargers), and telecommunications (battery chargers, power supplies).\nAll engineers involved with system and device design must deal with the fundamentals and advances of power electronics. This Handbook is the result of an intensive search to develop a new major reference for this large professional market. All aspects of AC and DC power conversion are addressed and there is an emphasis on the design process throughout as well as safety and reliability. This is the most comprehensive treatment of all aspects of power electronics ever presented in one volume at such a reasonable price.\nThe book has 35 chapters covering all aspects of power electronics and its applications.\nauthors from 12 different countries contributed to the handbook. They are the leading researchers in the particular topic area of power electronics and are well known for their expertise\nThe book includes 8 chapters on the modern power semiconductor devices such as MCTs, IGBTs, SIDs, power MOSFETs and BJTs.\nThe book includes 10 chapters covering various types of power converters and the principles of operation and the methods for the analysis and design of power converters.\nThe book includes 11 chapters covering applications such as power supplies, electronics ballast, HVDC transmission, VAR compensation, motor drives, automotive systems and capacitor charging.\nThe book includes 4 chapters covering power quality issues, active filters, simulation and packaging of smart power systems.","torrent":{"xt":"urn:btih:7458e1abc78b47b1e17e734dd04d2a6fc3c8b4ea","amp;dn":"Power+Electronics+Handbook+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7458e1abc78b47b1e17e734dd04d2a6fc3c8b4ea","infoHashBuffer":{"type":"Buffer","data":[116,88,225,171,199,139,71,177,225,126,115,77,208,77,42,111,195,200,180,234]},"announce":[],"urlList":[]}}