{"title":"Lucy Kaplansky - Reunion [2012] [EAC,log,cue. FLAC]","uid":8101268,"size":234099067,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:746e0eeca1b6cc146e58f3b23b59ac0dda892aca&amp;dn=Lucy+Kaplansky+-+Reunion+%5B2012%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":14,"time":1359978910,"description":"Artist: Release: Reunion\nMusicBrainz: b8405b3d-f9bf-482d-a3d5-0444f45d8047\nReleased: 2012-09-25\nLabel: Red House Records\nCatalog#: RHR255\nCountry: US\nPackaging: Jewel Case\n\nTracklisting:\n\n01. Scavenger (04:02)\n02. The Beauty Way (04:11)\n03. Mother's Day (03:20)\n04. Life Is Beautiful (03:49)\n05. This Morning I Am Born Again (03:03)\n06. Reunion (03:42)\n07. Gone Gone Gone (03:47)\n08. I'll See You Again (04:41)\n09. My Father's Son (04:14)\n10. I'm Looking Through You (03:30)\n11. Sleep Well (03:24)\n\nI'm not sure how it was that I came upon Lucy Kaplansky's music. She's never been what anyone outside of certain songwriter circles would call &quot;famous,&quot; despite the fact that she came up through the same music scene which fostered Shawn Colvin and Suzanne Vega, not to mention songwriters' songwriters like John Gorka. Her name is a secret singer-songwriters used to share after shows, back in the late '90s and early '00s before we even had MySpace to use as a networking tool. Somewhere between &quot;I liked your set&quot; and &quot;Do you have somewhere to crash?&quot; there would be that moment of trading obscure influences. Dave Carter was one of those names you dropped, so was Kaplansky. \n\nI got out of that scene a while ago, so I don't know if those names fly around anymore. These days it's probably all Justin Vernon and Colin Meloy. Artists with names too strange and polysyllabic to find their way to the mainstream now dictate the mainstream's flow. (The internet has done awesome things for awkwardly named artists.) \n\nI didn't realize until I started gathering my thoughts to talk with Kaplansky about her new album, one big reason she remained an obscure influence of so many artists was because she quit music for a while, right around the time major labels started showing an interest in making deals with Greenwich Village songwriters. She said no and headed off to the professional world to become a psychologist instead. She adopted a daughter, lived a life. Then, in the '90s, she popped back into the songwriting world where she remains today. \n\nShe's collaborated at length with John Gorka and Nanci Griffith. She's participated in two separate songwriters-in-the-round collaborative albums: Cry Cry Cry with Dar Williams and Richard Shindell; and Red Horse with Gorka and Eliza Gilkyson. She's shown up in the background of other people's albums. When she was being courted by the majors, it was as a duet with Shawn Colvin. All this collaboration shouldn't, however, overshadow what Kaplansky is capable of doing - and has done - alone.","torrent":{"xt":"urn:btih:746e0eeca1b6cc146e58f3b23b59ac0dda892aca","amp;dn":"Lucy+Kaplansky+-+Reunion+%5B2012%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746e0eeca1b6cc146e58f3b23b59ac0dda892aca","infoHashBuffer":{"type":"Buffer","data":[116,110,14,236,161,182,204,20,110,88,243,178,59,89,172,13,218,137,42,202]},"announce":[],"urlList":[]}}