{"title":"Twelve Angry Men (Library Edition Audio CDs) by Reginald Rose","uid":12110232,"size":53317539,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:74af1d07730168e2d7f2dfdfb790eb62735698de&amp;dn=Twelve+Angry+Men+%28Library+Edition+Audio+CDs%29+by+Reginald+Rose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Horisarte","files":5,"time":1436551568,"description":"Twelve Angry Men (Library Edition Audio CDs) by Reginald Rose\n &lt;a href=&quot;\nhttp://i.imgur.com/HSQKamo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/HSQKamo.jpg&lt;/a&gt;\n\nOver the course of a steamy and tense afternoon, twelve jurors deliberate the fate of a 19 year-old boy alleged to have murdered his own father. A seemingly open and shut case turns complicated, igniting passions and hidden prejudices.\nA L.A. Theatre Works full-cast performance featuring: Dan Castellaneta, Jeffrey Donovan, Hector Elizondo, Robert Foxworth, James Gleason, Kevin Kilner, Richard Kind, Alan Mandell, Rob Nagle, Armin Shimerman, Joe Spano, Steve Vinovich\n\nFrom Publishers Weekly\n\nL.A. Theatre Works proves it knows how to package audio dramas with this new recording of Rose's classic play (which began as a 1954 episode of TV's Studio One and then was adapted to the screen in 1957 starring Henry Fonda). Sequestered in a closed room, twelve jurors must decide the fate of a young man who has been accused of first-degree murder and faces the death penalty. One juror must tactically argue to convince the other jurors that this case has significant &quot;reasonable doubt.&quot; The talented cast, including Richard Kind, Hector Elizondo, Robert Foxworth, Joe Spano and Dan Castellanetta, provide 85 minutes of riveting entertainment, recorded in front of a live audience. The most trying aspect of this audiobook is matching jurors with actors since the jurors are simply given numbers and not names. The back cover of the audiobook is very helpful; it offers a photo of each actor along with his name and juror number. But it can still be a bit frustrating since characters are never referred to by name or juror number. This slight confusion certainly will not prevent people from enjoying this illuminating play about American justice. (July) \n\nAudio CD\nPublisher: L.A. Theatre Works (June 20, 2006)\nLanguage: English\nISBN-10: 1580813402\nISBN-13: 978-1580813402","torrent":{"xt":"urn:btih:74af1d07730168e2d7f2dfdfb790eb62735698de","amp;dn":"Twelve+Angry+Men+%28Library+Edition+Audio+CDs%29+by+Reginald+Rose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74af1d07730168e2d7f2dfdfb790eb62735698de","infoHashBuffer":{"type":"Buffer","data":[116,175,29,7,115,1,104,226,215,242,223,223,183,144,235,98,115,86,152,222]},"announce":[],"urlList":[]}}