{"title":"India's Struggle for Independence epub by Bipan Chandra bipinjnu","uid":8977313,"size":1771046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7608be39b82cc895aaa4e6182b6ceef29c25310a&amp;dn=India%27s+Struggle+for+Independence+epub+by+Bipan+Chandra+bipinjnu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bipinjnu","files":4,"time":1380476061,"description":"Product Description\nThis is a study of India's independence movement, from an abortive revolt against the British in 1857 through the times which eventually lead to Indian Independence in 1947 seen from the Indian point of view. The book is based on primary sources, hundreds of interviews with those who took part in the struggle for freedom, and presents new information on the formation of the Indian National Congress and the British response to various uprisings. It also examines the personalities and influence of the leaders of the time and evolves a new and coherent view of the history of the period.\nAbout the Author\nBipan Chandra is a popular Indian historian/writer who specializes in the political and economic history of modern India. He has been involved with the Marxist school. Bipan Chandra is currently Chairman, National Book Trust, and Professor Emeritus, Jawaharlal Nehru University, New Delhi. He has been the President of the Indian History Congress, which endowed him with the life-time achievement award in 2008. He was appointed National Research Professor in 2006. Bipan Chandra was born in 1928 in Kangra, Himachal Pradesh. Chandra is the author of several books on nationalism, colonialism, and communalism in modern India.","torrent":{"xt":"urn:btih:7608be39b82cc895aaa4e6182b6ceef29c25310a","amp;dn":"India%27s+Struggle+for+Independence+epub+by+Bipan+Chandra+bipinjnu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7608be39b82cc895aaa4e6182b6ceef29c25310a","infoHashBuffer":{"type":"Buffer","data":[118,8,190,57,184,44,200,149,170,164,230,24,43,108,238,242,156,37,49,10]},"announce":[],"urlList":[]}}