{"title":"Fallen Angel v1 &amp; v2 - Re-upload","uid":4701854,"size":521386213,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:76134cae0f798f64c923470ce607c21b89c7ebe8&amp;dn=Fallen+Angel+v1+%26+v2+-+Re-upload&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1233745689,"description":"Re-upload with fixed #27\n\nFallen Angel is a creator owned comic book series by writer Peter David and artist David Lopez.  The series is unique among David's mainstream works in that it is not a superhero series. While not completely without humor, it is a very dark book with morally ambiguous characters.\n\nThe story focuses on Lee (also known as the Fallen Angel) who resides in the city of Bete Noire. The city is completely riddled with corruption, and supernatural characters who emerge at night, and is managed by the Magistrate, who answers to a mysterious organization. Lee is possibly the only force for justice in the city.  The city of Bete Noire is as much a character as a setting.  During the day the city has no crime at all, but at night it is a haven for crime and corruption. Known as &quot;the city that shapes the world&quot;, some say that the events that happen in the city influence major global events.\n\nThe series was originally published by DC Comics but was canceled with issue #20. It resumed publication through IDW Publishing and ran for 33 issues. It will resume publication as Fallen Angel: Reborn with a new storyline in July 2009.\n\nBefore the move to IDW, Peter David acknowledged that Fallen Angel was based on ideas he had been unable to use during his time writing Supergirl before it was cancelled, but stopped short of admitting that Lee was, in fact, Linda Lee Danvers (Supergirl). \nThough David remained coy as to whether the two characters were one and the same during the DC run of the title, after it moved to IDW, David revealed Lee's origin, which clearly showed that Lee was not Danvers.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:76134cae0f798f64c923470ce607c21b89c7ebe8","amp;dn":"Fallen+Angel+v1+%26+v2+-+Re-upload","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76134cae0f798f64c923470ce607c21b89c7ebe8","infoHashBuffer":{"type":"Buffer","data":[118,19,76,174,15,121,143,100,201,35,71,12,230,7,194,27,137,199,235,232]},"announce":[],"urlList":[]}}