{"title":"Dark Seed 1+2","uid":6931868,"size":231386455,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:761f8d19f9cf3bf893df4f9b61fa7baaa7670b8c&amp;dn=Dark+Seed+1%2B2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"esharoth","files":3,"time":1325685935,"description":"Title: Dark Seed 1+2\nGenre: adventure / mystery / horror\nReleased: 1995\nDeveloper: Cyberdreams\nPublisher: Cyberdreams\nDescription:\nDark Seed is an adventure game which capitalizes on the drawings of famous horror designer H. R. Giger as a source of background artwork and inspiration. You play Mike Dawson, an ad company manager who, in pursuit of his goal in life to become a writer, purchases a solitary mansion in a small town called Woodland Hills. Although the low cost and hush-hush transaction when purchasing the house do raise your suspicion, the solitary environment and sheer beauty of the house crush your common sense and you decide to buy the house. That's when trouble begins. Upon reaching the house, you suddenly feel tired. You fall asleep and wake up from a terrible dream, only to find out that your life has just become a nightmare: an unknown source has implanted a seed of darkness in your mind, and you only have three days to find a way to stop it.\n\nDark Seed II continues the nightmare of Mike Dawson as he recovers from a nervous breakdown from his earlier encounters with the Ancients. Back in his hometown, Mike's high school sweetheart, Rita, is found murdered after the high school reunion. Unfortunately, Mike cannot remember much about that night, even though others saw him with Rita. Now, as the prime suspect, he must find a way to prove his innocence.\n\nBonus content: manuals, quick reference guide.\n\nHow to play:\n1) Download the game;\n2) Mount or burn disc image;\n3) Run setup.exe to install;\n4) Launch the games using their desktop or start menu shortcuts.\n\n! Notice\nSometimes when exiting Dark Seed 2, the application won't close completely, but return you to Windows 3.1; in such cases, click on Program Manager once, then Close and finally OK when asked to end the Windows session.","torrent":{"xt":"urn:btih:761f8d19f9cf3bf893df4f9b61fa7baaa7670b8c","amp;dn":"Dark+Seed+1%2B2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"761f8d19f9cf3bf893df4f9b61fa7baaa7670b8c","infoHashBuffer":{"type":"Buffer","data":[118,31,141,25,249,207,59,248,147,223,79,155,97,250,123,170,167,103,11,140]},"announce":[],"urlList":[]}}