{"title":"American_Top_40_1979_July_28th","uid":10707084,"size":486117740,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:76429ac915a0733ad70380ed9b149da0c357b080&amp;dn=American_Top_40_1979_July_28th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1407306751,"description":"&quot;Hello again and welcome to American Top 40. I'm Casey Kasem and we're about to do our weekly countdown of the most popular songs in the USA.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nBonnie Pointer of The Pointer Sisters has her first solo hit, &quot;Heaven Must Have Sent You&quot; (at number 39).\n\nCasey notes the band Poco refers to the &quot;Pontchartrain&quot; in their hit, &quot;Heart Of The Night&quot; (at number 32). There really are no chart records being broken in this countdown, so Casey consults the AT40 (Guinness) Book of (World) Records which says the Lake Pontchartrain Causeway Bridge is the longest bridge in the world.\n\nLater, he says one artist in the countdown has a record collection so huge that if he stacked them all on a record player, Casey says the spindle would need to be 350 feet higher than the Empire State Building (and Amazon doesn't even carry the regular kind).\n\nThe highest debut of the week is &quot;After The Love Is Gone&quot; by Earth, Wind &amp; Fire (at number 32). They also have &quot;Boogie Wonderland&quot; at number 11.\n\nThe song &quot;Gold&quot; by John Stewart (with Stevie Nicks) is at number six. Casey reminds this is the first hit for the former member of the Kingston Trio, which is a band that formed in 1957 and continues to this day by replacing members as needed.\n\nA listener asks a question with no question mark! &quot;Dear Casey, I would like to know what song took the biggest jump to the number one spot.&quot; Casey relates the fantastic tale from April 4th, 1964, when &quot;Can't Buy Me Love&quot; by The Beatles leapt from number 26 all the way into the number one spot (which gave them the top five spots on the chart). Now there is a band that should have had a membership replacement program!\n\nCasey gives his Special Report on lawyers of the rock stars. One lawyer he spoke with said he was let go from Santana for being the wrong astrological sign.\n\n&quot;Shine A Little Light In My Life&quot; by the Electric Light Orchestra is in spot number eight this week. Casey tell the story of Jeff Lynne's search for the perfect ringing phone sound to open his single &quot;Telephone Line&quot; - a number seven hit for ELO in 1977. He dialed a local London number, then long distance to other cities in Britain, moved on to France, Belgium, the Netherlands, West Germany, Italy, and finally New York City before he was satisfied (that must be why the woman in the song broke up with him. ADD and a high phone bill).\n\nLW#1: Hot Stuff - Donna Summer\nLW#2: Ring My Bell - Anita Ward\nLW#1: Hot Stuff - Donna Summer\n40: Chuck E's In Love Again - Ricky Lee Jones\n39: Heaven Must Have Sent You - Bonnie Pointer\n38: Kiss In The Dark - Pink Lady\n37: Let's Go - The Cars\n36: Morning Dance - Spyro Gyra\n35: I'll Never Love This Way Again - Dionne Warwick\nLDD: Reminiscing - The Little River Band\n34: Days Gone By - Gerry Rafferty\nArchive: Whatever Gets You Through The Night - John Lennon\n33: The Devil Went Down To Georgia - The Charlie Daniels Band\n32: Heart Of The Night - Poco\n31: After The Love Is Gone - Earth, Wind &amp; Fire\n30: Suspicion - Eddy Rabbit\n29: Weekend - Wet Willie\n28: Up On The Roof - James Taylor\n27: Is She Really Going Out With Him - Joe Jackson\n26: One Way Or Another - Blondie\n25: Shadows In The Moonlight - Anne Murray\n24: People Of The South Wind - Kansas\n23: Sad Eyes - Robert John\nARCHIVE: I Can Help - Billy Swan\n22: Lead Me On - Maxine Nightingale\n21: Does Your Mother Know - ABBA\n20: I'm Getting Closer - Paul McCartney &amp; Wings\nLDD: I Will Survive - Gloria Gaynor\n19: Do It Or Die - Atlanta Rhythm Section\n18: My Sharona - The Knack\n17: She Believes In Me - Kenny Rogers\n16: Momma Can't Buy Me Love - Elton John\n15: I Was Made For Loving You - Kiss\n14: I Can't Stand It Anymore - Peter Frampton\n13: Ain't No Stopping Us - McFadden &amp; Whitehead\nARCHIVE: Kung-Fu Fighting - Carl Douglas\n12: You Can't Change That - Raydio\n11: Boogie Wonderland - Earth, Wind &amp; Fire\n10: Main Event - Barbara Streisand\n9: When You're In Love With A Beautiful Woman - Dr. Hook\n8: Shine A Little Light In My Life - Electric Light Orchestra\n7: I Want You To Want Me - Cheap Trick\n6: Gold - John Stewart\n5: Making It - David Naughton\n4: Hot Stuff - Donna Summer\n3: Good Times - Chic\n2: Ring My Bell - Anita Ward\n1: Bad Girls - Donna Summer","torrent":{"xt":"urn:btih:76429ac915a0733ad70380ed9b149da0c357b080","amp;dn":"American_Top_40_1979_July_28th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76429ac915a0733ad70380ed9b149da0c357b080","infoHashBuffer":{"type":"Buffer","data":[118,66,154,201,21,160,115,58,215,3,128,237,155,20,157,160,195,87,176,128]},"announce":[],"urlList":[]}}