{"title":"SFPE Handbook of Fire Protection Engineering 5th ed","uid":12709514,"size":108600527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77270f1c840a733b4b30832dd1f1714d1489844e&amp;dn=SFPE+Handbook+of+Fire+Protection+Engineering+5th+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1446884633,"description":"SFPE Handbook of Fire Protection Engineering 5th ed (Springer-SFPE, 2016).pdf\r\n\r\nISBN 9781493925643\r\n\r\nRevised and significantly expanded, the fifth edition of this classic work offers both new and substantially updated information. As the definitive reference on fire protection engineering, this book provides thorough treatment of the current best practices in fire protection engineering and performance-based fire safety. Over 130 eminent fire engineers and researchers contributed chapters to the book, representing universities and professional organizations around the world. It remains the indispensible source for reliable coverage of fire safety engineering fundamentals, fire dynamics, hazard calculations, fire risk analysis, modeling and more. With seventeen new chapters and over 1,800 figures, the this new edition contains: • Step-by-step equations that explain engineering calculations • Comprehensive revision of the coverage of human behavior in fire, including several new chapters on egress system design, occupant evacuation scenarios, combustion toxicity and data for human behavior analysis • Revised fundamental chapters for a stronger sense of context • Added chapters on fire protection system selection and design, including selection of fire safety systems, system activation and controls and CO2 extinguishing systems • Recent advances in fire resistance design • Addition of new chapters on industrial fire protection, including vapor clouds, effects of thermal radiation on people, BLEVEs, dust explosions and gas and vapor explosions • New chapters on fire load density, curtain walls, wildland fires and vehicle tunnels • Essential reference appendices on conversion factors, thermophysical property data, fuel properties and combustion data, configuration factors and piping properties","torrent":{"xt":"urn:btih:77270f1c840a733b4b30832dd1f1714d1489844e","amp;dn":"SFPE+Handbook+of+Fire+Protection+Engineering+5th+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77270f1c840a733b4b30832dd1f1714d1489844e","infoHashBuffer":{"type":"Buffer","data":[119,39,15,28,132,10,115,59,75,48,131,45,209,241,113,77,20,137,132,78]},"announce":[],"urlList":[]}}