{"title":"Jean Vanier - 2 books (pdf)","uid":8854685,"size":3351962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77870c2ed814d1ef343888c433dd2662fae0ea58&amp;dn=Jean+Vanier+-+2+books+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":7,"time":1377623255,"description":"Jean Vanier is a Canadian Catholic philosopher turned theologian, humanitarian, and the founder of L'Arche, an international federation of communities for people with developmental disabilities and those who assist them.\n\nHe's written numerous books, and two of them are in this torrent. Both are new scans in pdf format.\n\n\n1. The Broken Body\n\nback cover:\n\nHow can we discover the sources of wholeness, healing and hope amidst a broken and suffering world? Jean Vanier examines the roots of brokenness within the Jewish and Christian traditions and the meaning of the Good News of Jesus for our 20th-century world.\n\nThe Broken Body is written for all who wish to follow Jesus on the path to wholeness. Vanier calls the reader to come closer to people who suffer. He offers hope and encouragement, and the assurance that peace and joy can be found but only by first accepting the reality of suffering and the cross in one's own life and in the lives of others.\n\n\n2. Befriending the Stranger\n\nback cover:\n\nJean Vanier reflects on who we are and how we build our communities, and in particular asks, can we be truly compassionate towards others if we are not compassionate towards ourselves? In a series of six meditative pieces, he opens up God's invitation to us today, in the midst of all the violence and corruption of the world, to create new places of belonging and sharing, of peace and kindness, where each one is loved and accepted with one's own fragility, abilities and disabilities.\n\n---\n\nA fascinating interview with Vanier was broadcast on the American radio program On Being with Krista Tippett recently; it's available as a podcast. Well worth hearing.\n\n---\n\nWith luck, more Vanier will be posted here soon.","torrent":{"xt":"urn:btih:77870c2ed814d1ef343888c433dd2662fae0ea58","amp;dn":"Jean+Vanier+-+2+books+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77870c2ed814d1ef343888c433dd2662fae0ea58","infoHashBuffer":{"type":"Buffer","data":[119,135,12,46,216,20,209,239,52,56,136,196,51,221,38,98,250,224,234,88]},"announce":[],"urlList":[]}}