{"title":"The Afterlife of the Roman City - Architecture and Ceremony in L","uid":11356564,"size":10873095,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77e7f943c723d964f6328efed4b43cc396b6b439&amp;dn=The+Afterlife+of+the+Roman+City+-+Architecture+and+Ceremony+in+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1414949941,"description":"The Afterlife of the Roman City: Architecture and Ceremony in Late Antiquity and the Early Middle Ages by Hendrik W. Dey\nEnglish | 2014 | ISBN: 1107069181 | 296 pages | PDF | 10,3 MB\n\nThis book offers a new and surprising perspective on the evolution of cities across the Roman Empire in late antiquity and the early Middle Ages (third to ninth centuries AD). It suggests that the tenacious persistence of leading cities across most of the Roman world is due, far more than previously thought, to the persistent inclination of kings, emperors, caliphs, bishops, and their leading subordinates to manifest the glory of their offices on an urban stage, before crowds of city dwellers. \n\nLong after the dissolution of the Roman Empire in the fifth century, these communal leaders continued to maintain and embellish monumental architectural corridors established in late antiquity, the narrow but grandiose urban itineraries, essentially processional ways, in which their parades and solemn public appearances consistently unfolded. Hendrik W. Dey's approach selectively integrates urban topography with the actors who unceasingly strove to animate it for many centuries","torrent":{"xt":"urn:btih:77e7f943c723d964f6328efed4b43cc396b6b439","amp;dn":"The+Afterlife+of+the+Roman+City+-+Architecture+and+Ceremony+in+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77e7f943c723d964f6328efed4b43cc396b6b439","infoHashBuffer":{"type":"Buffer","data":[119,231,249,67,199,35,217,100,246,50,142,254,212,180,60,195,150,182,180,57]},"announce":[],"urlList":[]}}