{"title":"Best Laid Plans: The Tyranny of Unintended Consequences","uid":6630319,"size":824591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:783cbde9ce8ec1f2016d28530abfe426862eb312&amp;dn=Best+Laid+Plans%3A+The+Tyranny+of+Unintended+Consequences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1314309274,"description":"Best Laid Plans: The Tyranny of Unintended Consequences and How to Avoid Them \n\nHistorian and author Daniel Boorstin noted, &quot;The unintended consequences of man's enterprises have and will always be more potent, more widespread, and more influential than those he intended.&quot; Today, a Google web search for &quot;unintended consequences&quot; summons nearly two million pages citing the unexpected impacts of government policies, new technologies, management decisions, and the actions of individuals. Unfortunate unintended consequences are becoming increasingly problematic as our world becomes globally and electronically interconnected, causing the results of our decisions to resonate across the globe.\n\nIn Best Laid Plans, the author examines how any action can have cascading impacts across time, place, and sector, explaining the eight social mechanisms of unintended consequences that complicate matters and often defeat best laid plans. This book will be of great interest to managers, analysts, researchers, or other employees working for businesses, governments, and not-for-profit organizations, as well as general nonfiction readers who delight in learning about how the world works. \n\nFebruary 2011\nPublisher: Praeger\nFormat: Hardcover 208pp \n","torrent":{"xt":"urn:btih:783cbde9ce8ec1f2016d28530abfe426862eb312","amp;dn":"Best+Laid+Plans%3A+The+Tyranny+of+Unintended+Consequences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"783cbde9ce8ec1f2016d28530abfe426862eb312","infoHashBuffer":{"type":"Buffer","data":[120,60,189,233,206,142,193,242,1,109,40,83,10,191,228,38,134,46,179,18]},"announce":[],"urlList":[]}}