{"title":"Santana - MCMLXVIII (1996)@flac","uid":15332250,"size":397251333,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:78442b9ecc2406ffc0c11e0b7fe4f5030d0f802b&amp;dn=Santana+-+MCMLXVIII+%281996%29%40flac&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alekow1","files":20,"time":1468748738,"description":"\nPre-Debut Live Studio Jams\r\n\r\nYou’d think that these long-lost, pre-debut, pre-Woodstock studio jams (rehearsals, demos, auditions… whatever they actually are) would be a much bigger deal in musical archeology circles. \r\nRecorded at Pacific Studios in 1968, and featuring Carlos Santana, Michael Shrieve, Gregg Rolie, David Brown, Michael Carabello and Chepito Areas, these sizzling live-in-the-studio jams are probably what helped the band get signed and sound much like a lost album that never was. Fact is, however, these tapes have already been issued… a hundred different times, via a slew of cheapie, one-off labels and dozens of different titles (usually Acapulco Sunrise). Apparently someone besides CBS acquired the rights to these tapes decades ago and has licensed them to anyone, anywhere at any time. That’s… if they’re even licensed at all. \r\nTainted history aside, this set includes some great live jams, capturing the essence of one of Santana’s first incarnations – almost all instrumental, with high-energy percussion fueled by a jazzy/ethnic flavoring. This particular disc is probably the most legit of the bunch, (supposedly) issued by Virgin Records in 1996 (via Sky Ranch, the then-owners of said recordings?). Note that there are some minor sound issues on a track or two. If you want a hard copy, there are dozens of options, that are, surprisingly, more expensive than you’d expect – on labels like Rolled Gold, Bellevue, Hallmark, Dark Peak, Noble Price, Prime Cuts and, of course, LaserLight, with titles like Acapulco Sunrise, La Puesta del Sol, Jingo, Jin-Go-Lo-Ba, Early Magic, and Evolution: The Original Recordings, just to name a few. Careful, song titles are inconsistent, so you’ll need to look closely when dumpster diving for this long-ignored piece of rock history. \r\nAs for this Virgin/Sky Ranch disc, it appears to have a virtually non-existent profile, like it was never even released. (willardswormholes.com)\r\n\r\n \nhttp://i.imgur.com/gQStGp9.jpg\r\n\r\n\r\n01. Let's Get Ourselves Together    [2:04]\r\n02. Acapulco Sunrise    [2:31]\r\n03. Latin Tropical    [11:22]\r\n04. Santana Jam    [14:41]\r\n05. Coconut Grove    [2:23]\r\n06. Hot Tamales    [8:02]\r\n07. La Puerta Del Sol    [10:23]\r\n08. As The Years Go By    [3:48]\r\n\r\n\r\n\r\nCarlos Santana - Guitar\r\nDavid Brown - Bass\r\nMichael Shrieve - Drums\r\nGregg Rolie - Keyboards &amp; Vocals\r\nMichael Carabello - Percussion\r\nChepito Areas - Percussion\r\n\r\nRecorded at Pacific Recording Studios, San Mateo, California, 1968\r\n\r\n\r\nLabel: Sky Ranch / Virgin\r\nReleased 1996\r\nCatalogue: 7243 8414102 8 \r\n\r\nCodec: Flac\r\nCompression Level: 6\r\nQuality: High\r\n\r\n\r\nCD-rip by alekow (EAC and Flac)\r\nCovers Included (600dpi)\r\n\r\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:78442b9ecc2406ffc0c11e0b7fe4f5030d0f802b","amp;dn":"Santana+-+MCMLXVIII+%281996%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78442b9ecc2406ffc0c11e0b7fe4f5030d0f802b","infoHashBuffer":{"type":"Buffer","data":[120,68,43,158,204,36,6,255,192,193,30,11,127,228,245,3,13,15,128,43]},"announce":[],"urlList":[]}}