{"title":"Sons Of Otis/Queen Elephantine (2007)","uid":3664553,"size":63099126,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78b9c686424cc904342300399be3e1a8ed176f1b&amp;dn=Sons+Of+Otis%2FQueen+Elephantine+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"stormzsystem","files":5,"time":1176618419,"description":"192kbps Mp3. Spring 2007.\nApprox. 44 Minutes\n\nSONS OF OTIS\n1. Tales Of Otis     7:52\n2. Oxazejam     9:57\n\nQUEEN ELEPHANTINE\n3. The Battle Of Massacoit/\n    The Weapon Of The King Of Gods     25:51\n\n\nNOTE: TURN IT UP\n\nShelf classification:\nMetal / Doom / Stoner / Psychedelic / Experimental\n\nOn one hand we have Sons Of Otis ? veterans, and legends even, in the realm of stoner/doom, notoriously famous for producing some of the heaviest space rock humans have ever experienced. In their first release since 2004?s spectacular X,  the band produces two tracks that are unsettling in their barren atmosphere, with piercing other-wordly sounds attacking from the glow of a distant planet. We can almost sense a ghost running amidst the Siren cries of Ken Baluke?s guitar and the grumble of Frank Sargeant?s low end, sending chills down our backs and transmitting images of horror through the air. Thirteen years into the game, Sons Of Otis are again pushing the boundaries of the music they?re playing, challenging the accepted conventions of music. ?Tales Of Otis? is fundamentally a single, trudging bass riff that is surrounded by terrifying wails from Baluke?s guitar while ?Oxazejam? sounds slightly more traditionally Otis, with scorching blues riffage that sounds like nothing you?ve ever heard. ?Sons Of Otis are heroes... ?Tales Of Otis? has less notes than I have fingers and yet the song sends shivers down my back every time I listen to it,? said 17-year-old Queen Elephantine frontman Indrayudh Shome.\n\nOn the other hand we have Queen Elephantine ? the fresh newcomer, furtively rearing its head alongside the giant, preparing a devastating onslaught. These teenagers from Hong Kong earned a small following with their split with Elder in 2006. Now they present the world with ?The Battle Of Massacoit? ? a soundscape inspire by the last stand of a culture, the tribe of King Massasoit, leading off into the second phase, ?The Weapon Of The King Of Gods? a furious hymn to words by poet Adam Stephanus. The paralysis-inducing song slowly leads through several phases of droning mantra, opening portals and doorways down to the core of the Earth. ?I think cats will dig it. It?s very organic and jammy. Hit a bong and lay back and enjoy the ride,? suggests Ken Baluke of Sons Of Otis.\n\nBut the best effect is produced when these two groups join forces, when the disc is treated and heard as a cohesive unit. The three-track, forty-five minute album is deathly slow, with meditative psychedelic vibes driving through the entire breadth of this collection. By the end of it, the listener can expect to have lost all grasp on real time and space.\n","torrent":{"xt":"urn:btih:78b9c686424cc904342300399be3e1a8ed176f1b","amp;dn":"Sons+Of+Otis%2FQueen+Elephantine+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78b9c686424cc904342300399be3e1a8ed176f1b","infoHashBuffer":{"type":"Buffer","data":[120,185,198,134,66,76,201,4,52,35,0,57,155,227,225,168,237,23,111,27]},"announce":[],"urlList":[]}}