{"title":"Black Sabbath/The Eternal Idol[1987][2010][320KBPS][JPNSHM]","uid":11737764,"size":313157662,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78d57833b31ea3a67d83770dc579a3887999f7c3&amp;dn=Black+Sabbath%2FThe+Eternal+Idol%5B1987%5D%5B2010%5D%5B320KBPS%5D%5BJPNSHM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"LameDuck69","files":31,"time":1425627446,"description":"Black Sabbath - The Eternal Idol [2 CD's][1987][2010][Japan SHM-CD][DE]\n\n\n\nDisc 1:\n\n01. The Shining  \n02. Ancient Warrior  \n03. Hard Life To Love  \n04. Glory Ride  \n05. Born To Lose  \n06. Nightmare  \n07. Scarlet Pimpernel  \n08. Lost Forever  \n09. Eternal Idol\n10. Black Moon (The Shining Single B Side)\n11. Some Kind Of Woman (The Shining Single B Side) \n\n\nDisc 2:\n\n01. Glory Ride\n02. Born To Lose\n03. Lost Forever\n04. Eternal Idol\n05. The Shining\n06. Hard Life To Love\n07. Nightmare\n08. Ancient Warrior\n---------------------------------\n**320 KBPS CBR\n**Cover Art\n----------------------------------------------\nBlack Sabbath are an English rock band, formed in Birmingham in 1968, by guitarist and main songwriter Tony Iommi, bassist and main lyricist Geezer Butler, singer Ozzy Osbourne, and drummer Bill Ward. The band have since experienced multiple line-up changes, with guitarist Iommi being the only constant presence in the band through the years. Originally formed in 1968 as a blues rock band, the group soon adopted the Black Sabbath moniker and began incorporating occult themes with horror-inspired lyrics and tuned-down guitars. Despite an association with these two themes, Black Sabbath also composed songs dealing with social instability, political corruption, the dangers of drug abuse and apocalyptic prophecies of the horrors of war.\n\nOsbourne's regular abuse of drugs and alcohol led to his dismissal from the band in 1979. He was replaced by former Rainbow vocalist Ronnie James Dio. Following two albums with Dio, Black Sabbath endured countless personnel changes in the 1980s and 1990s that included vocalists Ian Gillan, Glenn Hughes, Ray Gillen and Tony Martin, as well as several drummers and bassists. In 1992, Iommi and Butler rejoined Dio and drummer Vinny Appice to record Dehumanizer. The original line-up reunited with Osbourne in 1997 and released a live album Reunion. Black Sabbath's 19th studio album, 13, which features all of the original members but Ward, was released in June 2013.\n\nBlack Sabbath are often cited as pioneers of heavy metal music. The band helped define the genre with releases such as Black Sabbath (1970), Paranoid (1970) and Master of Reality (1971). They were ranked by MTV as the &quot;Greatest Metal Band&quot; of all time, and placed second in VH1's &quot;100 Greatest Artists of Hard Rock&quot; list. Rolling Stone magazine ranked them number 85 in their &quot;100 Greatest Artists of All Time&quot;. They have sold over 70 million records worldwide. Black Sabbath were inducted into the UK Music Hall of Fame in 2005 and the Rock and Roll Hall of Fame in 2006. They have also won two Grammy Awards for Best Metal Performance.\n--------------------------------------------------------------------------------\nThe Eternal Idol is the thirteenth studio album by English rock band Black Sabbath, released in December 1987. It is the first Black Sabbath album to feature vocalist Tony Martin. It spent six weeks on the Billboard 200 chart, peaking at 168. It was also the last full album of new material by Black Sabbath to be released by Warner Bros. Records (in North America).\n--------------------------------------------------------------------------------\n\nBlack Sabbath:\n\n\nTony Iommi: guitar\nGeoff Nicholls: keyboard\nEric Singer: drums\nTony Martin: lead vocals\nBob Daisley: bass\n\n\nAdditional Musicians:\n\n\nBev Bevan: percussion (cymbal overdubs on &quot;Scarlet Pimpernel&quot; and &quot;Eternal Idol&quot;)\nRay Gillen: lead vocals (only on 2010 Deluxe Edition Disc 2)","torrent":{"xt":"urn:btih:78d57833b31ea3a67d83770dc579a3887999f7c3","amp;dn":"Black+Sabbath%2FThe+Eternal+Idol%5B1987%5D%5B2010%5D%5B320KBPS%5D%5BJPNSHM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78d57833b31ea3a67d83770dc579a3887999f7c3","infoHashBuffer":{"type":"Buffer","data":[120,213,120,51,179,30,163,166,125,131,119,13,197,121,163,136,121,153,247,195]},"announce":[],"urlList":[]}}