{"title":"Electronic Projects From The Next Dimension","uid":4435619,"size":86021032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78f47dc0b34fd85d94c5aa09a3cc49e8d23943dd&amp;dn=Electronic+Projects+From+The+Next+Dimension&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Siliconsniper","files":1,"time":1223515200,"description":"For years paranormal scientists have explored the detection and documentation of spirits, auras, ESP, hypnosis, and many more phenomena through electronics. Electronic Projects from the Next Dimension provides useful information on building practical circuits and projects, and applying the knowledge to unique experiments in the paranormal field. The author writes about dozens of inexpensive projects to help electronics hobbyists search for and document their own answers about instrumental transcommunication (ITC), the electronic voice phenomenon (EVP), and paranormal experiments involving ESP, auras, and Kirlian photography.\n\n\nAlthough paranormal studies are considered esoteric, Electronic Projects from the Next Dimension teaches the technical skills needed to make devices that can be used in many different kinds of experiments. Each section indicates how the circuit can be used in paranormal experiments with suggestions about procedures and how to analyze the results.\n\nProvides unique projects for believers and skeptics.\nPerfect for any level of electronics experience.\nLearn from these basics projects and design your own applications.","torrent":{"xt":"urn:btih:78f47dc0b34fd85d94c5aa09a3cc49e8d23943dd","amp;dn":"Electronic+Projects+From+The+Next+Dimension","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78f47dc0b34fd85d94c5aa09a3cc49e8d23943dd","infoHashBuffer":{"type":"Buffer","data":[120,244,125,192,179,79,216,93,148,197,170,9,163,204,73,232,210,57,67,221]},"announce":[],"urlList":[]}}