{"title":"Dare.Dorm.20.XXX.DVDRip.x264-XCiTE","uid":10306967,"size":2598442443,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:795cae87a2934e53a71f0e67a5d8c7a7cfff3815&amp;dn=Dare.Dorm.20.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"xxxlavalxxx","files":6,"time":1402101911,"description":"Category All Sex, Legal Teen, Reality, College Girls, Orgies, Dare Dorm's Dare Dorm Series\n\n&quot;Art Fun - When I think of an art project, I think of storyboards, color wheels, rulers, erasers and all nighters. These kids somehow managed to get loads of paint, covered their dorm with plastic and paper and got a bunch of hot ass chicks to come over and paint each other up. There was paint flying all over the place. Their clothes were drenched in it also. The next move was to get naked and continue with steamy body paint. If you have never seen a sex party with a bevy of beauties covered in hues of blues, red, yellow, etc. then you are in for a surprise. Treat your palette to these pretty girls working hard on an art project you will not soon forget.\n&quot;Whipped Cream - My favorite things this new year are bored girls. I can't believe this is the kinda party they make when they are bored, and horny. So, three really smokin' hot girls decide to have a few friends over, but they have to bring whipped cream. Once everybody was there, and the whipped cream came out, things got really sweet and kinky. Licking tits, licking ass, whipped cream everywhere, crazy blow jobs, doggy style. This party had it all, and don't get me started on the ending.\n&quot;Titty Pong - The party begins with three of the hottest chicks, getting ready for the party, by drinking and taking shots. Later on, few more show up with beer, and the part got started. Of course, the beer pong party became the naked beer pong party, in just a few rounds, and that's when everything really got crazy. Shortly after, it was not about the game at all, and became all about the bunch of hot ass naked chicks blowing the dudes. Some people kept playing beer pong, but I can't imagine how they did that when all these gorgeous girls are getting banged on the beds.&quot;\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=68775066067829675546.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=68775066067829675546.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=36214097422076291867.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=36214097422076291867.jpeg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:795cae87a2934e53a71f0e67a5d8c7a7cfff3815","amp;dn":"Dare.Dorm.20.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"795cae87a2934e53a71f0e67a5d8c7a7cfff3815","infoHashBuffer":{"type":"Buffer","data":[121,92,174,135,162,147,78,83,167,31,14,103,165,216,199,167,207,255,56,21]},"announce":[],"urlList":[]}}