{"title":"The Handbook of Forensic Neuropsychology 2nd Edition[BSS]","uid":6614188,"size":14797313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79a6604b6920c2eb0c388ae4851b52589a6c43fd&amp;dn=The+Handbook+of+Forensic+Neuropsychology+2nd+Edition%5BBSS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313718778,"description":"This book brings together excellent contributions spanning the historic basis of neuropsychology in forensic practice, ethical and legal issues, and practical instruction....The editors have done an outstanding job in providing us with a volume that represents state-of-the-art in forensic neuropsychology. This volume also will be useful for graduate students, fellows, and practitioners in clinical neuropsychology.&quot;\n\n--Igor Grant, MD,\nExecutive Vice Chair, UCSD Department of Psychiatry\n\nThis book serves as an updated authoritative contemporary reference work intended for use by forensic neuropsychologists, psychiatrists, neurologists, neurosurgeons, pediatricians, attorneys, judges, law students, police officers, special educators, and clinical and school psychologists, among other professionals.\n\nThis book discusses the foundations of forensic neuropsychology, ethical/legal issues, practice issues and special areas and populations. Key topics discussed include the principles of brain structure and function, history of clinical neuropsychology, neuropsychology of intelligence, normative and scaling issues, and symptom validity testing and neuroimaging.\n\nSpecial areas and populations will include disability and fitness for duty evaluations, aging and dementia, children and adolescents, autism spectrum disorders, substance abuse, and Neurotoxicology. A concluding section focuses on the future of forensic neuropsychology.\nAbout the Author\n\nDr. Lawrence Hartlage has served as president of the National Academy of Neuropsychology; the American Psychological Association division of Neuropsychology; and the American Board of Professional Neuropsychology. Elected to Fellow status by seven divisions of the American Psychological Association, he was a charter Fellow of the American Psychological Society and listed in the inaugural &quot;Who's Who in Medicine and Healthcare.&quot; He has served as consultant to the Canadian Research Council; Center for Disease Control; North Atlantic Treaty Organization; National Institutes of Health and U.S. Surgeon General.\n\n\nArthur MacNeill Horton, Jr., is in independent practice as Director of the Neuropsychology Clinic at Psych Associates of Maryland in Towson, Columbia and Bethesda, Maryland and consults on neuropsychology and drug abuse research issues.. He holds Diplomates in Clinical Psychology and Behavioral Psychology from the American Board of Professional Psychology and in Neuropsychology from the American Board of Professional Neuropsychology. Dr. Horton is the author/editor of over 15 books, more than 30 book chapters, and over 150 journal articles. He is a past-president of the American Board of Professional Neuropsychology, a doctoral-level certification board in neuropsychology, the Coalition of Clinical Practitioners in Neuropsychology (CCPN), and the National Academy of Neuropsychology (NAN). In addition, Dr. Horton was a member of the State of Maryland Board of Examiners of Psychologists for two terms. He recently co-authored The Test of Verbal Conceptualization and Fluency (TVCF), a measure of executive functions in children, adults, and the elderly.\n\n\n\n# Hardcover: 608 pages\n# Publisher: Springer Publishing Company; 2 edition (February 18, 2010)\n# Language: English\n# ISBN-10: 0826118852\n# ISBN-13: 978-0826118851","torrent":{"xt":"urn:btih:79a6604b6920c2eb0c388ae4851b52589a6c43fd","amp;dn":"The+Handbook+of+Forensic+Neuropsychology+2nd+Edition%5BBSS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79a6604b6920c2eb0c388ae4851b52589a6c43fd","infoHashBuffer":{"type":"Buffer","data":[121,166,96,75,105,32,194,235,12,56,138,228,133,27,82,88,154,108,67,253]},"announce":[],"urlList":[]}}