{"title":"Ottmar Liebert - Nouveau Flamenco [1990][EAC][FLAC]","uid":5614741,"size":295190017,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79c0ec39228420364eda59c8f8e14638ea280e33&amp;dn=Ottmar+Liebert+-+Nouveau+Flamenco+%5B1990%5D%5BEAC%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mscprt","files":20,"time":1276025453,"description":"Nouveau Flamenco - Ottmar Liebert\n\nAMG Review\tby Jonathan Widran\n\nAlmost overnight, the success of Ottmar Liebert's groundbreaking 1990 debut Nouveau Flamenco catapulted Higher Octave Music into one of the industry's top indie labels and introduced the instrumental world to a fresh, exotic sound unlike any other. Quickly hitting the pole position on Billboard's new age chart, the album took the world by storm. It was certified gold in the U.S. in 1993, platinum in 1997, achieved gold status in Canada and Mexico, and platinum in New Zealand and Australia. More than a simple repackaging of its best-selling release of all time, Higher Octave's release of Nouveau Flamenco 1990-2000 Special Edition is a true treasure featuring vibrant new mixes of all the original tracks as well as six previously unreleased songs recorded before or during the original sessions. Though he has gone on to build an amazing catalog with Epic Records, Liebert's love for Nouveau Flamenco ensured his personal involvement in the new release. Gary Lyons, who engineered the guitarist's last three albums, was hired to remix the old tracks and copy the songs from the original, primitive 1/2-inch tapes they were on to two-inch tapes. Liebert also got great joy out of rediscovering three songs that didn't make the original release, and three more that he recorded just prior to the Nouveau Flamenco project. These include the contemplative &quot;Lonely Hours,&quot; the clap-along fun of &quot;Morning Sky,&quot; a contemplative &quot;La Memoria/Shadows,&quot; the gentle &quot;Sudden Shadows,&quot; and contemplative closer &quot;Under Blue Moon&quot; -- all fine, of course, but not quite on the melodic and rhythmic-hypnotic level of classics like &quot;Barcelona Nights.&quot; Nouveau Flamenco 1990-2000 Special Edition is, nonetheless a great opportunity for both longtime and new fans to rediscover the magic of when Ottmar Liebert began his extraordinary journey.\n\n\n\tTrack\tTitle\t\t\t\tTime \t\n   \t 1 \tBarcelona Nights \t\t4:02\n   \t 2 \tHeart Still/Beating \t\t4:06\n  \t 3\t3 Women Walking \t\t4:21\n  \t 4 \t2 the Night (Fast Cars/4 Frank) 4:19\n  \t 5 \tPassing Storm \t\t\t3:54\n  \t 6 \tSanta Fe \t\t\t4:17\n  \t 7 \tSurrender 2 Love \t\t4:29\n  \t 8 \tWaiting 4 Stars 2 Fall \t\t4:54\n  \t 9 \tRoad 2 Her Home \t\t4:14\n  \t10 \tAfter the Rain \t\t\t3:16\n  \t11 \tFlowers of Romance \t\t3:13\n  \t12 \tMoon Over Trees \t\t1:46\n  \t13 \tShadows \t\t\t3:14\n","torrent":{"xt":"urn:btih:79c0ec39228420364eda59c8f8e14638ea280e33","amp;dn":"Ottmar+Liebert+-+Nouveau+Flamenco+%5B1990%5D%5BEAC%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c0ec39228420364eda59c8f8e14638ea280e33","infoHashBuffer":{"type":"Buffer","data":[121,192,236,57,34,132,32,54,78,218,89,200,248,225,70,56,234,40,14,51]},"announce":[],"urlList":[]}}