{"title":"Journey 24 Bit Vinyl Pack","uid":8715932,"size":5933066132,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79c0ef63ecaf4a9d05dec5dcb2254ea1f169dcd3&amp;dn=Journey+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1374330910,"description":"\n  Journey 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Album Rock, Arena Rock, Hard Rock, Prog-Rock, Soft Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 3,200 kbps\n  Bit Depth 24 \n  Sampling Rate: 96,000 Hz\n\n  1975 Journey (CBS 80724 Holland)\n  1977 Next\n  1987 Infinity (Columbia US Promo)\n  1978 Infinity (Friday Music 180g LP)\n  1980 Departure (Columbia US Original)\n  1981 Escape (Columbia US Original)\n  1986 Raised On Radio\n\n  During their initial 14 years of existence (1973-1987), Journey altered their musical approach and their personnel extensively while becoming a top touring and recording band. The only constant factor was guitarist Neal Schon, a music prodigy who had been a member of Santana in 1971-1972. The original unit, which was named in a contest on KSAN-FM in San Francisco, featured Schon, bassist Ross Valory, drummer Prairie Prince (replaced by Aynsley Dunbar), and guitarist George Tickner (who left after the first album). Another former Santana member, keyboard player and singer Gregg Rolie, joined shortly afterward. This lineup recorded Journey (1975), the first of three moderate-selling jazz-rock albums given over largely to instrumentals.\n\n  By 1977, however, the group decided it needed a strong vocalist/frontman and hired Steve Perry. The results were immediately felt on the fourth album, Infinity (1978), which sold a million copies within a year. (By this time, Dunbar had been replaced by Steve Smith.) Evolution (1979) was similarly successful, as was Departure (after which Rolie was replaced by Jonathan Cain). Following a live album, Captured (1981), Journey released Escape, which broke them through to the top ranks of pop groups by scoring three Top Ten hit singles, all ballads highlighting Perry's smooth tenor: &quot;Who's Crying Now,&quot; &quot;Don't Stop Believin',&quot; and &quot;Open Arms.&quot; The album topped the charts and sold millions. Frontiers (1983), featuring the hit &quot;Separate Ways,&quot; was another big success, after which Perry released a double-platinum solo album, Street Talk (1984). When the group got back together to make a new album, Valory and Smith were no longer in the lineup and Raised on Radio (1986) was made by Schon, Perry, and Cain, who added other musicians for a tour.\n\n  Following the tour, Journey disbanded. Perry went into a prolonged period of seclusion as Schon and Cain formed Bad English with vocalist John Waite. Bad English had several hit singles, including the chart-topper &quot;When I See You Smile,&quot; before breaking up. Perry returned to recording in 1994, releasing For the Love of Strange Medicine. Although the album went gold, it was a commercial disappointment by previous standards. In 1996, Perry, Schon, Cain, Valory, and Smith staged a Journey reunion, releasing the million-selling Trial by Fire, which featured the gold-selling Top 20 single &quot;When You Love a Woman,&quot; and going on tour. Perry and Smith opted out of the reunion after the tour, but Journey continued, hiring a new lead singer, Steve Augeri (formerly of Tall Stories), and a new drummer, Bad English's Deen Castronovo, who made their debuts on &quot;Remember Me,&quot; a track on the 1998 Armageddon soundtrack. The band next reconvened in 2001. Arrival, Journey's 11th new studio album, was released in April, followed by a national tour.\n\n  The band received a star on the Hollywood Walk of Fame on January 21, 2005. That same year they released a new album, Generations, and embarked on their 30th anniversary tour. Shows on the tour stretched over three hours long and were divided into two sets -- one focusing on pre-Escape material, the other on post-Escape material. The archival release Live in Houston 1981: The Escape Tour appeared on both DVD and CD in 2006, the same year that the group brought Jeff Scott Soto aboard as a replacement for Augeri, who developed a throat infection that prevented him from singing.\n\n  However, Soto's time with the band was limited; in 2007, Journey announced that they had parted ways with the singer and were once again seeking a frontman. They found him in Arnel Pineda, a Filipino vocalist that they discovered after seeing him perform on YouTube. Pineda made his debut with the band in 2008, the same year that Journey released Revelation. Fueled by the adult contemporary hit &quot;After All These Years,&quot; Revelation was a surprise hit that wound up going platinum. Journey returned in the summer of 2011 with Eclipse, a concept album that saw the band tie together its progressive rock beginnings with its '80s arena rock peak.","torrent":{"xt":"urn:btih:79c0ef63ecaf4a9d05dec5dcb2254ea1f169dcd3","amp;dn":"Journey+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c0ef63ecaf4a9d05dec5dcb2254ea1f169dcd3","infoHashBuffer":{"type":"Buffer","data":[121,192,239,99,236,175,74,157,5,222,197,220,178,37,78,161,241,105,220,211]},"announce":[],"urlList":[]}}