{"title":"[SexArt] Michaela Issizu (Stalker)  SD MP4","uid":11718049,"size":209543984,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7b5280f734d47e221e9281af4cd2e75078c9f050&amp;dn=%5BSexArt%5D+Michaela+Issizu+%28Stalker%29++SD+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"H4ckuos","files":1,"time":1424685367,"description":"Andrej Lupin isn't afraid to take chances, and this adds a welcome element of unpredictability to his work. He can tackle challenging subjects like the death of spouse (&quot;Soldier&quot;) or the blissful joy of love at first sight (&quot;My City My Love&quot;), and achieve satisfying results at either extreme. In &quot;Stalker&quot; the director tackles the erotic thriller, and the results are compelling, and sure to be controversial. The soundtrack is ominous as Michaela Isizzu appears, her cozy pink polka dot hoodie visually at odds with the sinister music. As Lupin's camera huddles in the shadows outside her windows Michaela disrobes, enters the bathroom, and takes a leisurely bath, lost in the process of bathing, alone with her thoughts, if not, in fact, actually alone. After toweling off, Isizzu applies body oil to her stunning physique, and after donning an oversized white t-shirt she reclines on her bed. Relaxed and refreshed, Michaela begins to masturbate, unaware and oblivious of the voyeur lurking and looking. Michaela continues to savor this most private and personal of interludes, legs spread wide, glistening fingers stroking and plunging with ever increasing vigor into her pussy. She rolls from her back and onto her belly, flexing her haunches and humping against her pumping fingers. Will there be a &quot;happy ending&quot; to Michaela's after-hours autoerotic interlude? Draw the curtains, lock the door, and see for yourself in &quot;Stalker.&quot;\n &lt;a href=&quot;\nhttp://xxxhost.info/img-54eaeb4b1fe0c.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-54eaeb4b1fe0c.html&lt;/a&gt;","torrent":{"xt":"urn:btih:7b5280f734d47e221e9281af4cd2e75078c9f050","amp;dn":"%5BSexArt%5D+Michaela+Issizu+%28Stalker%29++SD+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5280f734d47e221e9281af4cd2e75078c9f050","infoHashBuffer":{"type":"Buffer","data":[123,82,128,247,52,212,126,34,30,146,129,175,76,210,231,80,120,201,240,80]},"announce":[],"urlList":[]}}