{"title":"Black Sabbath - The LIVE EVIL video (excerpts and trailer)","uid":6012056,"size":225013359,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7b5c0ba27381027b0e17d7548b855d1278f5e369&amp;dn=Black+Sabbath+-+The+LIVE+EVIL+video+%28excerpts+and+trailer%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thumbsplus","files":13,"time":1291494880,"description":"\n\nThese stills were given to me by Paul May, who owns the Beta-Max master of this very rare film from the MOB RULES tour. The footage was meant to be used as a Warner Brothers promotional film and contains a time code on the bottom of the screen (which has been cropped for these samples). The complete reel is 28 minutes long and is actually silent, except for the last 5 minutes or so when the opening of &quot;Heaven And Hell&quot; is performed. The rest of the audio track is dubbed sound from the LIVE EVIL album. The perfect sync on &quot;Heaven And Hell&quot; indicates that the album track more than likely originated from these shows. The reels are somewhat fragmentary, so there are not any complete songs, just a series of shots ranging from wide to extremely close-up.\n\n\n\nYou can download complete MPEG-1 versions of these reels below! These are large downloads (20-50 MB per file), so a broadband internet connection is recommended!\nPart 1 Part 2 Part 3\nPart 4 Part 5\n&quot;Heaven And Hell&quot; [unused promo with synched sound]\n&quot;Heaven And Hell&quot; [version 2 - no WB watermark; synched by Sean B.C.]\nTeaser footage from forthcoming LIVE EVIL bootleg DVD\n\nIn addition to the footage above, there are also two other reels of footage from this show. Reel #2 has a running time of 19 minutes and includes the following songs: &quot;Iron Man&quot; ,&quot;E5150&quot;, &quot;Neon Knights&quot; (part of), &quot;N.I.B.&quot; and &quot;Children of the Sea&quot; (Cuts). Reel #3 is 31 minutes long and includes: &quot;Heaven &amp; Hell&quot;, &quot;Iommi Solo&quot;, &quot;The Sign of the Southern Cross&quot;, &quot;Voodoo&quot;, &quot;Black Sabbath&quot;. There is also 8mm silent audience footage from Greensboro, NC - 2/16/82 and San Antonio, TX - 5/13/82 in existence, but both are extremely rare. The only known complete film (with sound) from this tour is a fair audience film from the Hammersmith Odeon in London - 1/2/82.\nThe Live Evil album was actually compiled from recordings the band did at the Dallas, San Antonio and Seattle (4/24/82) shows, so it makes sense that they would have done filming here as well.\nAs of summer 2003, a Russian bootleg company has been advertising a forthcoming LIVE EVIL DVD-R release. You can view the trailer for this above. It appears to be an an audio-synched version of these Texas films. It's my hope that this will contain ALL of the known reels from San Antonio and Dallas.\nI've received a great deal of mail regarding these films, so it's my hope that everyone will enjoy viewing these long closeted rarities. A million thanks tp everyone who helped make this feature possible - Shigeru Sato, Paul May, Sean Big Canoe and Alexander Rack","torrent":{"xt":"urn:btih:7b5c0ba27381027b0e17d7548b855d1278f5e369","amp;dn":"Black+Sabbath+-+The+LIVE+EVIL+video+%28excerpts+and+trailer%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5c0ba27381027b0e17d7548b855d1278f5e369","infoHashBuffer":{"type":"Buffer","data":[123,92,11,162,115,129,2,123,14,23,215,84,139,133,93,18,120,245,227,105]},"announce":[],"urlList":[]}}