{"title":"Rain.Blood.Chronicles.Mirage-RELOADED","uid":9187228,"size":795104689,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7bc179627b0e350abd5ff02a4e81cd6453bd0a30&amp;dn=Rain.Blood.Chronicles.Mirage-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Thhaque","files":2,"time":1384325707,"description":"Rain Blood Chronicles: Mirage (c) Origo Games\n\n\n11/2013: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Action, Adventure\nPlatformer\n\nTold as a Wuxia story, which literally means &quot;martial hero&quot;, Mirage captures\nthe essence of a broad genre of Chinese fiction concerning the adventures of\nmartial artists\n\nShrouded in secrecy, an organization of assassins wreak havoc on the local\npopulace. Two assassins Soul and Shang, find a window of opportunity to\nstrike while all their enemies can be found in one place. Their mission is\nsimple: take down all their enemies or die in the attempt. They will face\nmany challenges and discover lost secrets as they embark on a perilous\njourney against terrible odds\n\nTake control of Soul and Shang and wield two separate martial arts styles to\ndefeat their foes\n\nSoul is an orphan born with the temperament of a master. His skills are\nself-taught and so lack refinement, but his potential is undeniable. He\nfavors Dark Wound, a short bladed weapon given to him by his adoptive father\nrumored to be one of the Night Masters\n\nShang Zuo is a calm, unflappable fighter of average skill, but who possesses\na centered view of all things powerful enough to influence physical objects\nThis Sword Temper skill allows him to destroy objects without moving a muscle\nand to knock arrows out of the sky with but a single thought. Together they\nwill face the unknown and harness new skills as they face down a terrible\nconspiracy\n\nMirage Features\n* 2 against the world Tag team in and out as either protagonist at any time\n* or play together for local multiplayer experience\n* Gear up Discover new weapons, abilities, and unique items to bloody your\nfoes\n* 8 distinct levels Fight your way through an army of minions and face a\ntrue challenge by encountering a unique Boss at every Stage\n* Learn the truth Secrets abound and the full story of Mirage may be\ndiscovered by a collection of books, letters, and drawings strewn about the\nmartial world. Players may unravel the full tale by discovering these items\nand rewards\n* Over 100 Achievements to earn and discover\n\nMinimum System Requirements:\nOS: Windows XP, Windows 7, Windows 8\nProcessor: Intel Pentium3, AMD Athlon Series\nMemory: 1 GB RAM\nGraphics: ATI Radeon X1800, Nvidia GeForce 6800\nDirectX: Version 9.0\nNetwork: Broadband Internet connection\nHard Drive: 3 GB available space\n\nInstallation info: \n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game","torrent":{"xt":"urn:btih:7bc179627b0e350abd5ff02a4e81cd6453bd0a30","amp;dn":"Rain.Blood.Chronicles.Mirage-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bc179627b0e350abd5ff02a4e81cd6453bd0a30","infoHashBuffer":{"type":"Buffer","data":[123,193,121,98,123,14,53,10,189,95,240,42,78,129,205,100,83,189,10,48]},"announce":[],"urlList":[]}}