{"title":"Egghead by Bo Burnham (epub)","uid":9371294,"size":14556440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d27a60fe937aa40223afb696a1f782ccd54ea1b&amp;dn=Egghead+by+Bo+Burnham+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"maawolfe36","files":-1,"time":1387532089,"description":"&quot;Egghead, or, You Can't Survive on Ideas Alone&quot; by Bo Burnham. \n\nThis is a DRM-removed epub version of the book. \n\n\n\nInformation from Barnes and Noble description:\n\nA strange and charming collection of hilariously absurd poetry, writing, and illustration from one of today's most popular young comedians...\nEGGHEAD: Or, You Can't Survive on Ideas Alone\nBo Burnham was a precocious teenager living in his parents' attic when he started posting material on YouTube. 100 million people viewed those videos, turning Bo into an online sensation with a huge and dedicated following. Bo taped his first of two Comedy Central specials four days after his 18th birthday, making him the youngest to do so in the channel's history. Now Bo is a rising star in the comedy world, revered for his utterly original and intelligent voice. And, he can SIIIIIIIIING!\nIn EGGHEAD, Bo brings his brand of brainy, emotional comedy to the page in the form of off-kilter poems, thoughts, and more. Teaming up with his longtime friend, artist, and illustrator Chance Bone, Bo takes on everything from death to farts in this weird book that will make you think, laugh and think, &quot;why did I just laugh?&quot;\n\n\n\n\nIf you enjoy this, please support the author by buying the book. \n\n\nUploaded by maawolfe36 on The Pirate Bay. ","torrent":{"xt":"urn:btih:7d27a60fe937aa40223afb696a1f782ccd54ea1b","amp;dn":"Egghead+by+Bo+Burnham+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d27a60fe937aa40223afb696a1f782ccd54ea1b","infoHashBuffer":{"type":"Buffer","data":[125,39,166,15,233,55,170,64,34,58,251,105,106,31,120,44,205,84,234,27]},"announce":[],"urlList":[]}}