{"title":"Microsoft Office 2003 Pro [ENG]","uid":3543954,"size":596690944,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7dc24a0eef2070cc9d11e5c31c71e0567b63db68&amp;dn=Microsoft+Office+2003+Pro+%5BENG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"extazy87","files":1,"time":1161539018,"description":"Microsoft Office is a suite of productivity programs created or purchased by Microsoft and developed for Microsoft Windows, and Apple Computer&amp;#039;s Mac OS and Mac OS X operating systems. As well as the core office applications, the Microsoft Office brand includes associated servers and Web-based services. Recent versions of Office are now called the &quot;Office system&quot; rather than the &quot;Office suite&quot; to reflect the fact that they include servers as well.\n\nOffice made its first appearance in 1989 on the Macintosh, with a version for Windows following it in 1990 [1]. It was initially a marketing term for a bundled set of applications that were previously marketed and sold separately. The main selling point was that buying the bundle was substantially cheaper than buying each of the individual applications on their own. The first version of Office contained Microsoft Word, Microsoft Excel, and Microsoft PowerPoint. Additionally, a &quot;Pro&quot; version of Office included Microsoft Access and Schedule Plus. Over the years the Office applications have grown substantially closer together from a technical standpoint, sharing features such as a common spell checker, OLE data integration, and the Microsoft Visual Basic for Applications scripting language. Microsoft also positions Office as a development platform for line-of-business software.","torrent":{"xt":"urn:btih:7dc24a0eef2070cc9d11e5c31c71e0567b63db68","amp;dn":"Microsoft+Office+2003+Pro+%5BENG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dc24a0eef2070cc9d11e5c31c71e0567b63db68","infoHashBuffer":{"type":"Buffer","data":[125,194,74,14,239,32,112,204,157,17,229,195,28,113,224,86,123,99,219,104]},"announce":[],"urlList":[]}}