{"title":"Madonna - Blond Ambition Tour live From Yokohama, Japan DVD-5 [N","uid":8403625,"size":4618703098,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7ff9a83793eca477a0db978ea87694a2c34434ec&amp;dn=Madonna+-+Blond+Ambition+Tour+live+From+Yokohama%2C+Japan+DVD-5+%5BN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"hilario_felipe","files":11,"time":1366748294,"description":"Blond Ambition World Tour Live (credited as Live! Madonna: Blond Ambition World Tour 90 in the video sequence) is a video album by American singer-songwriter Madonna. It was released only on Laserdisc by Pioneer Artists as part of the sponsorship deal of the 1990 Blond Ambition World Tour. It contains the final tour date recorded in Nice, France. The release had previously been shown and produced by American network HBO as a television special.\n\nIn 1992, the Laserdisc release won the Best Music Video, Long Form category at the 34th Grammy Awards. This was the first Grammy award Madonna received in her career.\n\nBackground\n\nThe video album was released only on Laserdisc by Pioneer Artists as part of the sponsorship deal of the 1990 Blond Ambition World Tour and was released to promote the Laserdisc format. It contains the final tour date filmed at Stade de l'Ouest in Nice, France on August 5, 1990 which had previously been shown and produced by American network HBO as part of a television special Live! Madonna: Blond Ambition World Tour 90.[1] Another TV special with the same name was broadcasted on December 24, 1990 in Europe containing a live date from the tour, filmed in Barcelona, Spain on August 1, 1990, produced by Italian channel Rai Uno who had previously produced the 1987 concert special Madonna in Concerto, which was released commercially as Ciao Italia: Live from Italy in 1988.\n\nIn 1992, the Laserdisc release won the Best Music Video, Long Form category at the 34th Grammy Awards. This was the first Grammy award Madonna received in her career. The award was granted to Madonna, David Mallet and Mark &quot;Aldo&quot; Miceli (video directors) and Anthony Eaton (video producer).[2]\nOther releases\n\nAnother version of the Blond Ambition World Tour was released commercially, Blond Ambition: Japan Tour 90, on VHS and Laser Disc on July 25, 1990. It was released in Japan only by Sire Records and Warner-Pioneer and contains a date filmed at Yokohama Stadium in Yokohama, Japan on April 27, 1990. Another release, Blond Ambition Tour 1990, was released on DVD in Germany only in 2005 by Falcon Neue Medien which had obtained a licence to release it only in that country. Neither Madonna nor Warner Bros. Records authorized the release, which features poor-quality footage from a show filmed in Houston, Texas in May 1990. The same footage was released in the UK in October 2007 by Quantum Leap Video.\nFormats\n\nPioneer still hold the rights to this Laserdisc only release and there have been no plans to release it on DVD.[3]\nTrack listing\n\n    &quot;Express Yourself&quot; (with &quot;Everybody&quot; introduction)\n    &quot;Open Your Heart&quot;\n    &quot;Causing a Commotion&quot;\n    &quot;Where's the Party&quot;\n    &quot;Like a Virgin&quot;\n    &quot;Like a Prayer&quot;\n    &quot;Live to Tell&quot;\n    &quot;Oh Father&quot;\n    &quot;Papa Don't Preach&quot;\n    &quot;Sooner or Later&quot;\n    &quot;Hanky Panky&quot;\n    &quot;Now I'm Following You&quot;\n    &quot;Material Girl&quot;\n    &quot;Cherish&quot;\n    &quot;Into the Groove&quot;\n    &quot;Vogue&quot;\n    &quot;Holiday&quot;\n    &quot;Family Affair&quot;/&quot;Keep It Together&quot;\n\nProduction credits\n\n    Director: David Mallet\n    Producer: Anthony Eaton\n    Executive Producer: Freddy De Mann\n    Art Direction: Christopher Ciccone\n    Choreography: Vince Patterson\n    Assistant Choreographer: Kevin Alexander Stea\n\nFormat: DVD\nColours: NTSC\nAudio: Dobly Digital 2.0\nSubtitles: No\nExtras: Interactive menu with chapter selection.\nSize: 4.30GB\n\nYoutube Channel:\n\nPage:","torrent":{"xt":"urn:btih:7ff9a83793eca477a0db978ea87694a2c34434ec","amp;dn":"Madonna+-+Blond+Ambition+Tour+live+From+Yokohama%2C+Japan+DVD-5+%5BN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ff9a83793eca477a0db978ea87694a2c34434ec","infoHashBuffer":{"type":"Buffer","data":[127,249,168,55,147,236,164,119,160,219,151,142,168,118,148,162,195,68,52,236]},"announce":[],"urlList":[]}}