{"title":"Contemporary New Zealand Cinema From New Wave to Blockbuster","uid":11677837,"size":5142887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80034fca8d5f880dca96fa40fccd5c936de3af56&amp;dn=Contemporary+New+Zealand+Cinema+From+New+Wave+to+Blockbuster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1422948659,"description":"New Zealand cinema burst onto the global stage in the 1970s and has maintained its high-profile international presence with such films as Whalerider, the Lord of the Rings trilogy and Once Were Warriors. Contemporary New Zealand Cinema is an astute analysis of this fascinating industry and the most thorough book available on a vibrant filmmaking culture. The book explores the industry, questions of aesthetics and form, nation and identity through the full range of filmmaking in New Zealand. It also highlights specific contexts, including Maori, documentary and short filmmaking, literary adaptations, the development of the national Film Commission, marketing and censorship, as well as questions of bicultural relations, spirituality, masculinity and disability--that have a created a cinema of global significance. Included is a comprehensive filmography that details all New Zealand feature and television films.\n\nPublisher: I. B. Tauris (November 11, 2008)\nLanguage: English\nISBN-10: 1845118375\nISBN-13: 978-1845118372\n\nEditorial Reviews\nReview\n&quot;'This collection is a timely summary of one of the world's youngest film cultures and reflects the vibrancy, resourcefulness and heart of New Zealand filmmaking. A valuable resource.' Gaylene Preston, New Zealand's Filmmaker Laureate 2001 'Comprehensive, provocative and fascinating, this volume is a must for film scholars around the globe who are interested in the unique, challenging and engaging national cinema of New Zealand.' Professor Barbara Creed, University of Melbourne&quot;\nAbout the Author\n\nIan Conrich is Director of the Centre for New Zealand Studies, Birkbeck, University of London and Chair of the New Zealand Studies Association. He is the editor or co-editor of eleven books, including New Zealand - A Pastoral Paradise? (2000) and New Zealand Fictions: Literature and Film (2007).\n\nStuart Murray is Senior Lecturer in Postcolonial Literatures, University of Leeds. His books include Never a Soul at Home: New Zealand Literary Nationalism and the 1930s (1998) and Representing Autism: Culture, Narrative, Fascination (2008)","torrent":{"xt":"urn:btih:80034fca8d5f880dca96fa40fccd5c936de3af56","amp;dn":"Contemporary+New+Zealand+Cinema+From+New+Wave+to+Blockbuster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80034fca8d5f880dca96fa40fccd5c936de3af56","infoHashBuffer":{"type":"Buffer","data":[128,3,79,202,141,95,136,13,202,150,250,64,252,205,92,147,109,227,175,86]},"announce":[],"urlList":[]}}