{"title":"EnigmaT Set Rips { Cuts } - July 3rd, 2014","uid":10477973,"size":907936864,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:80b849539ac3f41c0b7b9e93a96f384dfb7f85f0&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+3rd%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EnigmaT","files":110,"time":1404365961,"description":"A&amp;Z with KeyPlayer - Drosia  (Cut From A&amp;F Set)-enTc\nAaron Olson feat. Sarah Jane Neild - Walking On Fire (Nick Sentience Remix) (Set Rip)-enTc\nActive Limbic System - Karahana (Alexey Sonar Remix) (Cut From Solarstone Set)-enTc\nAitra - Morning In The City (Cut From Datt Set)-enTc\nAlan Crown - Monarch (Original Mix) (Cut From Antillas Set)-enTc\nAlen Milivojevic - Rather (Cut From Graham Set)-enTc\nAllen Watts - Tunnel Vision (Cut From Abstract Set)-enTc\nAlucard - Autumn Breeze (Cut From Solarstone Set)-enTc\nAndy Elliass &amp; ARCZI - Adieu (Original Mix) (Cut From Elliass Set)-enTc\nAntillas &amp; Dankann - Black Rain (Original Mix) (Cut From Antillas Set)-enTc\nArthur Barbosa - Cold Ocean (Original Mix) (Cut From 9Axis Set)-enTc\nArtsever - Stars Of Sound (Cut From KvA Set)-enTc\nAxelpolo &amp; M.Pravda Feat. Tom Tyler - It Is Over (Original Mix) (Cut From Shah Set)-enTc\nBeatsole &amp; Izzy Meusen - The Marine Wave (Original Mix) (Cut From Shah Set)-enTc\nBlasterjaxx - Legend Comes To Live (Cut From W&amp;W Set)-enTc\nBoyan &amp; Boyer - Sweet Sensation (Cut From KvA Set)-enTc\nChris Cockerill &amp; Phil Lee - Watershed (Splattered Implant Remix) (Cut From OzzyXPM Set)-enTc\nChronosapien - Troya (Original Mix) (Cut From Rajha Set)-enTc\nCJ Peeton - Love's Tapestry (Sergey Hromov Remix) (Cut From Lazarus Set)-enTc\nCold Rush - Temptation (Original Mix) (Cut From Saux Set)-enTc\nDankann - OZone (Club Mix) (Cut From Antillas Set)-enTc\nDavid Guetta feat. JD Davis - The World Is Mine (Joren Heelsing Uplifting Mix) (Cut From Amy Set)-enTc\nDead Boy In A Swimming Pool - Smallest of Dots (Dino Lenny Original Mix) (Set Rip)-enTc\nDerb - Derb (Jacob van Hage Remix) (Cut From Ferry Set)-enTc\nDominik Ramiro - Island Of Sun (Original Mix) (Cut From Shah Set)-enTc\nDreamy - Everything Is Possible (Kinetica Remix) (Cut From A&amp;F Set)-enTc\nDreamy - Just Run (Cut From A&amp;F Set)-enTc\nDriftmoon &amp; Geert Huinink feat. Kim - Worlds Which Break Us (Intro Mix) (Cut From Saux Set)-enTc\nDuKa - Spring (Original Mix) (Cut From 9Axis Set)-enTc\nEddie Lung &amp; Dj T.H. With Solid Skill - Winds Of Change (LTN Remix) (Cut From Shah Set)-enTc\nFinal Fantasy - I Close My Eyes (Solid State Bootleg Remix) (-CLASSIC- Cut From skoen Set)-enTc\nFlatlex - Strangeness (Original Mix) (Cut From Arctic Set)-enTc\nFunabashi with Kaystone - A Walk To Remember (Cut From Abstract Set)-enTc\nFurkan Senol - Elenora (Mhammed El Alami &amp; Johannes Fischer Remix) (Cut From Suzy Set)-enTc\nGalantis - Smile (Max Elto Remix) (Cut From Tiesto Set)-enTc\nGareth Emery feat. Gavin Beach - Eye Of The Storm (Sunset &amp; First Effect Remix) (Set Rip)-enTc\nGareth Emery ft Gavin Beach - Eye Of The Storm (Jesser ReMode) (Cut From KvA Set)-enTc\nGenix - Makoto (Original Mix) (Cut From Holland Set)-enTc\nHaig &amp; Raffi - Votum Separatum (Original Mix) (Cut From Shah Set)-enTc\nHaris C - Angelica's Dream (Original Mix) (Set Rip)-enTc\nHarlan Buskes Feat. Alana Aldea - Remember Me (Original Mix) (Cut From Shah Set)-enTc\nHillsong United - Oceans (Nick Fiorucci &amp; Angels Canon Remix) (Cut From KvA Set)-enTc\nHoyaa - Scent Of Music (Original Mix) (Cut From Shah Set)-enTc\nHyrdrogenio - Sparkle (KURA Remix) (Cut From Tritonal Set)-enTc\nID - Love For You (Cut From Ferry Set)-enTc\nInnerlight - Moment to Rise (Original Mix) (Set Rip)-enTc\nJames Poulton - Panoramic (Original Mix) (Cut From Saux Set)-enTc\nJavah feat. Claire Willis - Nights Like These (Dub Mix) (Cut From Photographer Set)-enTc\nJimij - Farlight (Original Mix) (Cut From Solarstone Set)-enTc\nJose Amnesia Feat. Anthya - Don`t Breathe (Beatsole Remix) (Cut From Shah Set)-enTc\nJuventa feat. Kelly Sweet - Superhuman (Cut From Tritonal Set)-enTc\nKago Pengchi - Sinabro (Original Mix) (Cut From Holland Set)-enTc\nKago Pengchi - The Phantom (Original Mix) (Cut From Holland Set)-enTc\nKill FM - Giants (Cut From Juventa Set)-enTc\nKill FM feat. Helena Jean - Don't Go Dark (Original Mix) (Cut From Tritonal Set)-enTc\nKRONO - Redlight (Pretty Pink Remix) (Cut From Armada Set)-enTc\nKyau &amp; Albert - Down (Sebastien Remix) (Cut From KvA Set)-enTc\nLiam Wilson - Kiss (Cut From Kearney Set)-enTc\nMac &amp; Taylor - Back To Bosh (Original Mix) (Cut From UKTuni Set)-enTc\nMadutec - Lion (Marco P Remix) (Cut From Graham Set)-enTc\nMake One - Neon Light (Original Mix) (Cut From ReOrder Set)-enTc\nMakJ &amp; M83 - DNA (Showtek Edit) (Cut From W&amp;W Set)-enTc\nMako - Our Story (Kevin Easy Remix) (Cut From Gold Set)-enTc\nMark Sixma - Shadow (W&amp;W Edit) (Cut From W&amp;W Set)-enTc\nMateusz - Shanty (Cut From Dinaire Set)-enTc\nMatt Bowdidge - Sinister (Indecent Noise Hard Mix) (Cut From Ex Driver Set)-enTc\nMax Eito - Shadow Of The Sun (Adventure Club Remix) (Cut From W&amp;W Set)-enTc\nMax Graham - Redemption (Cut From Graham Set)-enTc\nMax Graham - Struggle (Cut From Graham Set)-enTc\nMendoza - Love Druggie (Jeremy Olander Remix) (Cut From Tritonal Set)-enTc\nMetronome - We're Going Home (Original Mix) (Cut From Arctic Set)-enTc\nMistol Team - Algarrobal (Cut From Solarstone Set)-enTc\nO.B.M Notion &amp; Cosmic Heaven - Melancholy (Cut From A&amp;F Set)-enTc\nO.B.M Notion &amp; Cosmic Heaven - Melancholy (John Sunlight Remix) (Cut From Suzy Set)-enTc\nOldfix - Indiana (Original Mix) (Cut From Rajha Set)-enTc\nOmega Drive - Fuck The Stealers (Original Mix) (Cut From UKTuni Set)-enTc\nOpt-in - Escalator (Original Mix) (Cut From OzzyXPM Set)-enTc\nOsvaldo Nugroho - People In Your Life (Original Mix) (Set Rip)-enTc\nPaul Rigel - Elemental (Marcel Kenenberg Remix) (Cut From Abstract Set)-enTc\nPhotographer - Night Rush (Uplifting Mix) (Cut From UKTuni Set)-enTc\nPhysical Phase &amp; Veera - Rock My Body (Original Mix) (Cut From 9Axis Set)-enTc\nPryda - Shadows (Dart Rayne &amp; Yura Moonlight Remix) (Cut From W&amp;W Set)-enTc\nRandall Glenn - Immense (Ronski Speed Remix) (Cut From A&amp;F Set)-enTc\nRapha - Goodbye (Cut From KvA Set)-enTc\nRaytheon - Caldera 2014 (Ahmed Romel Remix) (Cut From Magdelayna Set)-enTc\nReLocate vs Robert Nickson - Jetpack (Original Mix) (Cut From Sneijder Set)-enTc\nRene Ablaze &amp; Jack Noise - Sunset (Six Senses Remix) (Cut From Suzy Set)-enTc\nRene Ablaze - Glowing (Angelique Remix) (Cut From Sneijder Set)-enTc\nShingo Nakamura -Thousands of Sounds (Original Mix) (Cut From Brolinsky Set)-enTc\nSolarstone - 4ever (2014 Retouch) (Cut From Solarstone Set)-enTc\nSonar Zone - Renewal (Andy Wood Remix) (Cut From Photographer Set)-enTc\nSoundGate - Destiny (Original Mix) (Cut From 9Axis Set)-enTc\nSpartaque &amp; Konstantin Yoodza - Satisfaction (Cut From Graham Set)-enTc\nStafford Brothers &amp; Mits - Stadium (Cut From W&amp;W Set)-enTc\nStoneface &amp; Terminal - Sonus (Cut From KvA Set)-enTc\nSunlight Project - Acrobaleno (Original Mix) (Cut From Rajha Set)-enTc\nSure I Can - Santa Barbara (Cut From KvA Set)-enTc\nSure-I-Can - Santa Barbara (Original Mix) (Cut From Saint-Jules Set)-enTc\nTecnomind - The Depths Of My Soul (Original Mix) (Cut From 9Axis Set)-enTc\nTenishia - Benedictus (Tenishia Other Mix) (Cut From Antillas Set)-enTc\nThe Thrillseekers - This Is All We Have (Cut From Solarstone Set)-enTc\nThomas Gold &amp; Borgeous - Beast (Cut From W&amp;W Set)-enTc\nThomas Vink &amp; Lewi - Disco Shit (Original Mix) (Cut From Armada Set)-enTc\nUCast - Slipstream (Original Mix) (Cut From Saint-Jules Set)-enTc\nUDM &amp; Alex Best - Wind Of Hope (Original Mix) (Cut From Sneijder Set)-enTc\nUltimate - Imagination (Cut From A&amp;F Set)-enTc\nUrban Legend and Overdoze - Urbandoze (Original Mix) (-SHORT- Cut From Arctic Set)-enTc\nVlad Gee - One's Man Hope (NoMosk Remix) (Cut From A&amp;F Set)-enTc\nWill Rees - Withhold (Jase Thirlwall Remix) (Cut From Kearney Set)-enTc\nYves De Lacroix feat. Marell - Destroyves (Original Mix) (Cut From Lange Set)-enTc\n","torrent":{"xt":"urn:btih:80b849539ac3f41c0b7b9e93a96f384dfb7f85f0","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+3rd%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80b849539ac3f41c0b7b9e93a96f384dfb7f85f0","infoHashBuffer":{"type":"Buffer","data":[128,184,73,83,154,195,244,28,11,123,158,147,169,111,56,77,251,127,133,240]},"announce":[],"urlList":[]}}