{"title":"Understanding the Discrete Element Method","uid":12501921,"size":12775938,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80c626eadca3dd6d29ccdb1e242f8f6c67afe512&amp;dn=Understanding+the+Discrete+Element+Method&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1443380512,"description":"Understanding the Discrete Element Method - Hans-Georg Matuttis and Jian Chen (Wiley, 2014).pdf\r\n\r\nISBN 9781118567203\r\n\r\nThe aim of this book is to advance the field of granular and multi-body studies while giving readers a more thorough understanding of the discrete element method (DEM). By working through this volume, researchers will be better equipped for independent work and will develop an ability to judge methods related to the simulation of polygonal particles.\r\n\r\nWhen materials are not handled as fluids, they are dealt with mostly in granular form (e.g. cement, sand, grains, powders). Granular materials are characterized by abrupt transitions from loose to dense, from flowing to static states, and vice versa. Many problems in natural disasters (earthquakes, landslides, etc.) are also of a &quot;granular&quot; nature. Continuum methods have been applied in these fields, but lack any intrinsic mechanism to account for the transitions, behavior that is inherently discontinuous. The &quot;natural&quot; approach is to use particle simulation methods, often called the &quot;discrete element method&quot;, where bodies in the physical system and the simulation match one to one. The field of discrete element simulation has changed little since the early 1990s, when simulations predominantly used spherical particles. The aim of this book is to show the practicability and usefulness of non-spherical discrete element simulations. Phenomena from related fields (mechanics, solid state physics, etc.) are discussed, which as test cases are sometimes not applicable due to intriguing reasons. Understanding both the pitfalls and applications will help one to predict the outcome of simulations and use the predictions for the design of future experiments.\r\n\r\nIntroduces the discrete element method (DEM) starting from the fundamental concepts (theoretical mechanics and solid state physics), with 2D and 3D simulation methods for polygonal and polyhedral particles\r\nExplains the basics of coding DEM, requiring little previous knowledge of granular matter or numerical simulation\r\nHighlights numerical tricks and pitfalls that are usually only recognized after years of experience, using relevant simple experiments to illustrate applications\r\nPresents a logical approach starting with the mechanical and physical bases, followed by a description of the techniques and their applications\r\nWritten by key authors presenting ideas on how to model the dynamics of angular particles using polygons and polyhedrals\r\nAccompanying website includes MATLAB programs providing the simulation code for two-dimensional\r\nconvex polygons\r\nThis book is ideal for researchers and graduate students who deal with particle models in areas such as fluid dynamics, multi-body engineering, finite element methods, virtual reality, the geosciences, and multi-scale physics. Computer scientists involved with solid modeling and game programming will also find this book a useful reference for the design of physics engines","torrent":{"xt":"urn:btih:80c626eadca3dd6d29ccdb1e242f8f6c67afe512","amp;dn":"Understanding+the+Discrete+Element+Method","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80c626eadca3dd6d29ccdb1e242f8f6c67afe512","infoHashBuffer":{"type":"Buffer","data":[128,198,38,234,220,163,221,109,41,204,219,30,36,47,143,108,103,175,229,18]},"announce":[],"urlList":[]}}