{"title":"Ultra Tag Editor 2.4.3 full {RAR Multilang Serial}","uid":4206511,"size":1422753,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:80d222f2e25ffda4ec57348f8930636d8981dea0&amp;dn=Ultra+Tag+Editor+2.4.3+full+%7BRAR+Multilang+Serial%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fil76","files":1,"time":1211831838,"description":"For Me The Best!!!\n\nUltra Tag Editor is an easy-to-use tag editor and music organizer. The program works with MP3 (ID3v1, ID3v2.2, ID3v2.3 and ID3v2.4) and OGG Vorbis (vorbis comments) files. Ultra Tag Editor supports both basic ID3v1 tag fields, like title, artist, album, etc. and additional ID3v2 fields, like lyrics, lyricist, disc#, Internet radio (station name, owner and URL), composer, etc.\n\nUltra Tag Editor allows you to... \nrename music files using tag information;\ncopy tag from one format to another (ID3v1 to ID3v2 and vice versa);\ngenerate tags from filenames;\nget tags from freedb - free online source of information about CDs;\nautomatically fill in track numbers;\ncompare ID3v1 and ID3v2 tags;\nremove tags;\nlisten to music using built-in player;\nedit genre list;\ncreate M3U and PLS playlists;\nexport tags to HTML, CSV, XLS and text files;\nview music file information (duration, bitrate, sample rate, version, encoder, etc.)\nUltra Tag Editor key features.\n\nPowerful file renamer. File renamer allows you to rename files using information in tags. Before renaming Ultra Tag Editor displays preview window where you can change some filenames. After renaming the program allows you to undo all made changes.\n\nfreedb support. Ultra Tag Editor supports freedb that can be used to complete missing or incorrect tags. Just select whole album and sort it by track number.\n\nCopying tag from one version to another. Use this tool to synchronize tag versions. Before copying you can choose tag fields to be copied.\n\nExport to HTML, CSV and XLS formats. With Ultra Tag Editor you can export information about your music collection to the most commonly used file formats.\n\nGenerating tags using filenames. Ultra Tag Editor has a feature to get information from the filenames using masks and substitute it to the tags.\n\nCreating playlists. You can create M3U and PLS playlists that are compatible with almost all multimedia players.\n\nBuilt-in mp3/ogg player. Ultra Tag Editor has a built-in player which is very useful for management of huge music collections. You don&amp;#039;t need to switch between tag editor and player. Moreover, the program allows you to delete music files you don&amp;#039;t need or move them to other folders.\n\nAuto Track. You can automatically fill in track numbers. Just sort tracks in the required order, select them and use this tool.\n\nDisplaying file information. With Ultra Tag Editor you can view media information about music files: duration, file size, mode (mono, stereo, etc.), bitrate, sample rate, encoder, etc.\n\nCapitalization and spaces. All program tools have an ability to change output strings. You can change capitalization (lower case, UPPER CASE, etc.) and remove spaces or replace them with underscores.","torrent":{"xt":"urn:btih:80d222f2e25ffda4ec57348f8930636d8981dea0","amp;dn":"Ultra+Tag+Editor+2.4.3+full+%7BRAR+Multilang+Serial%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80d222f2e25ffda4ec57348f8930636d8981dea0","infoHashBuffer":{"type":"Buffer","data":[128,210,34,242,226,95,253,164,236,87,52,143,137,48,99,109,137,129,222,160]},"announce":[],"urlList":[]}}