{"title":"[Audiobook] James Watson - DNA, The Secret of Life","uid":3967382,"size":607458225,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:818bd312ac3e6319db4cf43f7f21db55e9f07af6&amp;dn=%5BAudiobook%5D+James+Watson+-+DNA%2C+The+Secret+of+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rjeong","files":14,"time":1199814277,"description":"Please seed me!\n\nJames Watson, DNA -- The Secret of Life - 14 Discs\n &lt;a href=&quot;\nhttp://www.amazon.com/DNA-Secret-James-D-Watson/dp/0739302620/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/DNA-Secret-James-D-Watson/dp/0739302620/&lt;/a&gt;\nJames Watson, of Watson and Crick fame. He and his co-author Andrew Berry have produced a clear and easygoing history of genetics, from Mendel through genome sequencing. Watson offers readers a sense of immediacy, a behind-the scenes familiarity with some of the most exciting developments in modern science. He gleefully reports on the research juggernaut that led to current obsessions with genetic engineering and cloning. Aided by profuse illustrations and photos, Watson offers an enthusiastic account of how scientists figured out how DNA codes for the creation of proteins--the so-called &quot;central dogma&quot; of genetics. But as patents and corporations enter the picture, Watson reveals his concern about the incursions of business into the hallowed halls of science.\n    After 1975, DNA was no longer solely the concern of academics trying to understand the molecular underpinnings of life. The molecule moved beyond the cloisters of white-coated scientists into a very different world populated largely by men in silk ties and sharp suits.\nIn later chapters, Watson aims barbs at those who are concerned by genetic tinkering, calling them &quot;alarmists&quot; who don&amp;#039;t understand how the experiments work. It is in these arguments that Watson may lose favor with those whose notions of science were born after Silent Spring. Nevertheless, DNA encompasses both sides of the political issues involved in genetics, and Watson is an enthusiastic proponent of debate on the subject.\n\naudio\naudiobook\n","torrent":{"xt":"urn:btih:818bd312ac3e6319db4cf43f7f21db55e9f07af6","amp;dn":"%5BAudiobook%5D+James+Watson+-+DNA%2C+The+Secret+of+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"818bd312ac3e6319db4cf43f7f21db55e9f07af6","infoHashBuffer":{"type":"Buffer","data":[129,139,211,18,172,62,99,25,219,76,244,63,127,33,219,85,233,240,122,246]},"announce":[],"urlList":[]}}