{"title":"The Once - Row Upon Row of the People They Know [2011][EAC,log,c","uid":8322212,"size":238980700,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:82f22a8e55e4f849ae4f4693262084ad616f8503&amp;dn=The+Once+-+Row+Upon+Row+of+the+People+They+Know+%5B2011%5D%5BEAC%2Clog%2Cc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":14,"time":1364709622,"description":"Artist: The Once\nRelease: Row Upon Row of the People They Know\nReleased: 2011\nLabel: Borealis Records\nCatalog#: BCD212\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Canada\nStyle: Folk, World, &amp; Country, \n\n\nTracklisting\n\n01. Cradle Hill\n02. Jack the Sailor \n03. You're My Best Friend \n04. My Husband's Got No Courage \n05. Valley of Kilbride \n06. Charlie's \n07. By the Glow of the Kerosene Light \n08. A Round Again \n09. Ode to a Broken Heart \n10. Song for Memory \n\nHaving dismissed themselves as mere &quot;participants&quot; on their award-winning 2009 self-titled debut, Newfoundland folk trio the Once return as very much the &quot;creators&quot; of their follow-up, Row Upon Row of the People They Know. Named after a line from a poem by fellow Canadian George Murray, a piece that also provided the inspiration for the grandiose closer, Song for Memory, its ten tracks show that the band members still remain fond of their hometown's traditional sea shanties and folk tales (Jack the Sailor, Valley of Kilbride). \n\nBut elsewhere, the accomplished multi-instrumentalists lean toward a more contemporary sound, whether it's the impassioned and gutsy nu-folk reworking of 17th century ballad My Husband's Got No Courage, the sparse but inspired banjo-plucking cover version of Queen's You're My Best Friend, or the feel-good A Round Again, which drifts into theatrical pop territory with its finger-clicking rhythms, impressive three-part harmonies, and rousing singalong finale. \n\nThe more melancholic offerings, which allow front woman Geraldine Hollett's beautifully lilting vocals to come to the forefront, are no less captivating, from the slightly gothic atmospherics of Charlie's to the mournful Celtic-tinged Ode to a Broken Heart to the emotive accordion-led rendition of Wince Coles' By the Glow of the Kerosene Light. \n\nA bold leap forward from their first offering, Row Upon Row of the People They Know is an always engaging listen that pays respect to their folk heritage while also staking their claim to become part of it. [AMG: Jon O'Brien - 3.5/5]","torrent":{"xt":"urn:btih:82f22a8e55e4f849ae4f4693262084ad616f8503","amp;dn":"The+Once+-+Row+Upon+Row+of+the+People+They+Know+%5B2011%5D%5BEAC%2Clog%2Cc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f22a8e55e4f849ae4f4693262084ad616f8503","infoHashBuffer":{"type":"Buffer","data":[130,242,42,142,85,228,248,73,174,79,70,147,38,32,132,173,97,111,133,3]},"announce":[],"urlList":[]}}