{"title":"The All-American Rejects - The All-American Rejects","uid":5739415,"size":349910383,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:830dfa3c2d6081b48e8151ec70f0cb3574573dee&amp;dn=The+All-American+Rejects+-+The+All-American+Rejects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ddawg","files":-1,"time":1280945713,"description":" &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/f8/9e/f42c225b9da0e79b79bcb010.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/f8/9e/f42c225b9da0e79b79bcb010.L.jpg&lt;/a&gt;\n\n\nTitle: The All-American Rejects\nArtist: The All-American Rejects\nAudio CD (February 4, 2003) \nOriginal Release Date: 2003 \nNumber of Discs: 1 \nGenre: Power Pop\nFormat: flac\n\n\nTrack Listing:\n\n01. My Paper Heart\n02. Your Star\n03. Swing, Swing\n04. Time Stands Still\n05. One More Sad Song\n06. Why Worry\n07. Don\\'t Leave Me\n08. Too Far Gone\n09. Drive Away\n10. Happy Endings\n11. The Last Song \n\n\nAmazon.com\nWhile comparisons to nerd-rock dandies Weezer are probably inevitable for the fabulously named All-American Rejects, discerning listeners will note that where the cheeky lyrics about painfully awkward love end, the group\\'s rhythmic force picks up, positioning the Oklahoma crew more as a geeky Green Day than the above-named preppy pop dabblers. No shame in that -- on their major label debut, the All-American Rejects marry punk and pop with a clear sense of purpose and no particular loyalty to either form, cherry-picking the best of each and arriving at a spiky, effervescent middle ground. Singer Tyson Ritter is especially convincing in his role as hapless lover. But on tracks like the muscular \\&quot;Too Far Gone\\&quot; and the vaguely orchestral \\&quot;The Last Song,\\&quot; Ritter\\'s comrades drive the whole shebang home with instrumental freight. And you\\'d have to be pretty hard-hearted not to find yourself echoing the sing-singy strains of \\&quot;Swing Swing\\&quot; and \\&quot;My Paper Heart.\\&quot; Fans of ironic pop -- Box Car Racer, Fountains of Wayne, and their ilk -- get crackin\\'.\n\nAllmusic Review:\nBig hooks abound on this forceful debut by power pop whiz kids Nick Wheeler and Tyson Ritter. Though not yet old enough to legally buy an alcoholic drink in the year 2002, All-American Rejects are capable songwriters, accomplished vocalists, and skilled instrumentalists. Guitar-driven and underpinned with a humane-sounding drum machine cranking out frenetic backbeats, each cut on this self-titled debut brims with harmonies that recall the early Who and classic Beach Boys. Bolstered by the brash bar band bravado akin to the Replacements, the Goo Goo Dolls, and Fastball in all their ragged glory, All-American Rejects passionately render songs about girls, love, self-doubt, and youthful abandon. Cuts such as \\&quot;Too Far Gone\\&quot; employ a sympathetic orchestral backdrop, while tracks including \\&quot;Drive Away,\\&quot; \\&quot;My Paper Heart,\\&quot; and \\&quot;One More Sad Song\\&quot; prove that loud guitars and a broken heart make great rock &amp; roll. A talented band destined for great things, All American Rejects are primed to be embraced by the masses. \n \n","torrent":{"xt":"urn:btih:830dfa3c2d6081b48e8151ec70f0cb3574573dee","amp;dn":"The+All-American+Rejects+-+The+All-American+Rejects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"830dfa3c2d6081b48e8151ec70f0cb3574573dee","infoHashBuffer":{"type":"Buffer","data":[131,13,250,60,45,96,129,180,142,129,81,236,112,240,203,53,116,87,61,238]},"announce":[],"urlList":[]}}