{"title":"Margaret Thatcher - The Great Speeches [flac] 2004","uid":11354542,"size":795417690,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:83289db3ddfe9155bf0a9ea5c0913eddcbaf02cc&amp;dn=Margaret+Thatcher+-+The+Great+Speeches+%5Bflac%5D+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1414928476,"description":"---------------------------------------------------------------------\nMargaret Thatcher - The Great Speeches\n---------------------------------------------------------------------\n\nArtist...............: Margaret Thatcher\nAlbum................: The Great Speeches\nGenre................: Speech\nSource...............: CD\nYear.................: 2004\nRipper...............: EAC (Secure mode) / LAME 3.92\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 32 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: VorbisComment\n &lt;a href=&quot;\nhttp://image.bayimg.com/3abfda763be3bb6b21f64def43b7ca95cc048f7d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/3abfda763be3bb6b21f64def43b7ca95cc048f7d.jpg&lt;/a&gt; \n\nFull Scans, also uploaded as V6\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Margaret Thatcher - Interview After Maiden Speech [01:10]\n2. Margaret Thatcher - Interview on first day as a Minister[01:39]\n3. Margaret Thatcher - Speech to the 1966 Conservative Party Conference[00:43]\n4. Margaret Thatcher - Speech to the 1971 Conservative Party Conference[03:11]\n5. Margaret Thatcher - Speech to the National Union of Teachers Conference[00:53]\n6. Margaret Thatcher - Speech in Finchley during the October 1974 General Election[02:21]\n7. Margaret Thatcher - Comments on winning the Leadership of the Conservative Party[01:21]\n8. Margaret Thatcher - Speech to Finchley Conservatives [01:23]\n9. Margaret Thatcher - Speech to Conservatives 'Wreckers in our Midst'[01:09]\n10. Margaret Thatcher - Speech to Conservative Local Government Conference on Devolution[00:45]\n11. Margaret Thatcher - Party Election Broadcast [01:01]\n12. Margaret Thatcher - Party Election Broadcast 2 [04:38]\n13. Margaret Thatcher - Remarks on the steps of 10 Downing Street - 'Where there is Discord...'[01:28]\n14. Margaret Thatcher - Speech to the 1980 Conservative Party Conference - 'The Lady's Not for Turning...'[04:21]\n15. Margaret Thatcher - Speech in the House of Commons on the Invasion of the Falkland Islands[04:16]\n16. Margaret Thatcher - Remarks in the Downing Street on the retaking of South Georgia[01:49]\n17. Margaret Thatcher - Remarks at the opening of a business facility in Finchley[01:17]\n18. Margaret Thatcher - Statement on the Argentinian Surrrender[01:55]\n19. Margaret Thatcher - Speech in Port Howard, Falkland Islands[03:28]\n20. Margaret Thatcher - Speech on HMS Antrim [00:35]\n21. Margaret Thatcher - Remarks on the economy - 'Frit' [00:46]\n22. Margaret Thatcher - Speech to the Scottish Conservative Conference[04:11]\n23. Margaret Thatcher - Speech to the Conservative Youth Rally[00:40]\n24. Margaret Thatcher - Speech to the 1984 Welsh Conservative Conference[00:55]\n25. Margaret Thatcher - Remarks following the IRA Bombing in Brighton[00:22]\n26. Margaret Thatcher - Speech to the 1984 Conservative Party Conference[04:40]\n27. Margaret Thatcher - Speech to the 1985 Scottish Conservative Conference[07:11]\n28. Margaret Thatcher - Speech to a Joint Session of Congress[00:35]\n29. Margaret Thatcher - Remarks on the Anglo Irish Agreement[01:11]\n30. Margaret Thatcher - Speech on the Westland Affair [02:07]\n31. Margaret Thatcher - Speech at the signing of the Channel Tunnel Fixed Link Treaty[00:14]\n32. Margaret Thatcher - Speech to 1986 Conservative Central Council[01:08]\n33. Margaret Thatcher - Speech on the bombing of Libya [01:14]\n34. Margaret Thatcher - Speech on Election Night [02:21]\n35. Margaret Thatcher - Speech to the College of Europe [05:07]\n36. Margaret Thatcher - Speech to the General Assembly of the Church of Scotland[07:54]\n37. Margaret Thatcher - Speech to the 1989 Conservative Party Conference[11:06]\n38. Margaret Thatcher - Speech to the 1990 Conservative Party Conference[17:27]\n39. Margaret Thatcher - Statement on the Rome Summit - No No No![01:20]\n40. Margaret Thatcher - Speech at the Lord Mayor's Dinner [00:57]\n41. Margaret Thatcher - Remarks after the first Leadership Election ballot[01:11]\n42. Margaret Thatcher - Speech in the Confidence Debate - &quot;I'm enjoying this!&quot;[02:15]\n43. Margaret Thatcher - Remarks on leaving Downing Street [00:21]\n44. Margaret Thatcher - Speech on Europe [01:09]\n45. Margaret Thatcher - Speech on Europe 2 [01:52]\n46. Margaret Thatcher - Speech on Conservative Candidates [11:15]\n47. Margaret Thatcher - Maiden Speech in the House of Lords [12:08]\n48. Margaret Thatcher - Remarks in support of William Hague [01:13]\n49. Margaret Thatcher - Speech to a Conservative Conference Fringe Meeting on Europe[01:23]\n50. Margaret Thatcher - Speech to Conservative Election rally - &quot;The Mummy Returns!&quot;[00:46]\n51. Margaret Thatcher - Speech in the Confidence Debate - &quot;I'm enjoying this!&quot; FULL VERSION[32:51]\n52. Margaret Thatcher - Speech in Port Stanley, Falkland Islands[11:04]\n53. Margaret Thatcher - Sketch from Yes Prime Minister [00:46]\n54. Margaret Thatcher - Message to Conservative Activists [01:55]\n55. Margaret Thatcher - Maggie's Last Party [05:36]\n\nPlaying Time.........: 03:17:02\nTotal Size...........: 756.29 MB\n &lt;a href=&quot;\nhttp://news.bbc.co.uk/2/hi/uk_news/politics/3505707.stm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://news.bbc.co.uk/2/hi/uk_news/politics/3505707.stm&lt;/a&gt;\n\n\nThe speeches of Lady Thatcher are to be released as a boxed set of CDs.\nThe three-disc compilation of the Conservative former prime minister's greatest hits includes a speech set to acid house music.\n\nMargaret Thatcher: The Great Speeches, published by politics bookshop Politicos, will include such landmark tracks as 'The lady's not for turning'. &quot;Some of her speeches still live on today,&quot; Politicos store owner Iain Dale told the BBC.\n\n'Power of speaking'\n\nThe 198-minute compilation will include 50 tracks - a mixture of full speeches and shorter clips - and will show how Lady Thatcher's platform style evolved. Mr Dale is expecting the CD to be a popular seller, with a high volume of advance orders. &quot;There's a big Thatcher fan club, who will buy anything about her,&quot; he told BBC News Online. And he expects interest from the United States, where political speech compilations are &quot;big business&quot;.\n\nMr Dale also anticipates a visit from the current Conservative leader, Michael Howard, who he says has already bought &quot;Thatcher-related products&quot; from the politics store. Margaret Thatcher: The Great Speeches, due out next month, includes serious speeches and some &quot;bonus material&quot;, including the former premier's appearance in a Yes Minister sketch and the mixing of her words and acid house music. Lady Thatcher's speeches became part of the political landscape from the late 1970s through to her ousting as prime minister in 1990.\n\nPower\n\n&quot;Her style of speaking developed over the years and she did become a much more powerful, more eloquent speaker,&quot; Mr Dale told BBC Radio 4's Today programme. &quot;She wasn't a natural orator. When she was first in government in the early Seventies she had a very clipped speech, and she obviously had some elocution lessons. &quot;But as she got into power, her power of speaking increased, and she got the self-confidence which politicians get once they get into power.&quot; Many of her best-known quotes are phrases rather than speeches, such as the &quot;No, no, no&quot; she threw back to proposals from Jacques Delors, then president of the European Commission.\n\n'Frit'\n\nOr when she turned to her own Grantham roots for a dialect word to accuse Labour's Denis Healey of being afraid of a general election, saying he was &quot;frit&quot;. Party conferences were an opportunity for set-piece attacks, and these included &quot;You turn if you want to, the lady's not for turning&quot; in 1980, when she was under pressure to change economic direction. In the case of her &quot;dead parrot&quot; conference speech, attacking the Liberal Democrats in 1990, Mr Dale says that Mrs Thatcher had never heard of the Monty Python references being parodied, but she was still able to deliver the joke and get a laugh.\n\nIron lady\n\nOther phrases have become associated with the Thatcher era, such as being &quot;the Iron Lady&quot;. This phrase was coined by a Soviet newspaper - and in 1976, Mrs Thatcher said that she was ready to accept it as a compliment. Lady Thatcher can also lay claim to presenting one of the first political warnings against global warming. Back in 1988, in a speech to the Royal Society, she raised the then little recognised problem of a &quot;global heat trap which could lead to climatic instability&quot;. In the same year, she delivered a key tract for Eurosceptics, as her Bruges Speech called for a less integrationist approach to the European Union.\n\nMusic producer Charles Bailey, who has mixed versions of the speeches of Labour veteran Tony Benn says that Lady Thatcher's delivery lends itself to this type of CD presentation - and it is &quot;right on the button and sexy&quot;","torrent":{"xt":"urn:btih:83289db3ddfe9155bf0a9ea5c0913eddcbaf02cc","amp;dn":"Margaret+Thatcher+-+The+Great+Speeches+%5Bflac%5D+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83289db3ddfe9155bf0a9ea5c0913eddcbaf02cc","infoHashBuffer":{"type":"Buffer","data":[131,40,157,179,221,254,145,85,191,10,158,165,192,145,62,221,203,175,2,204]},"announce":[],"urlList":[]}}