{"title":"Jimmy Page &amp; Robert Plant (Led Zeppelin) No Quarter","uid":5189531,"size":72673045,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:83c92f324282160b7d2f4a24f8fa76931258455d&amp;dn=Jimmy+Page+%26+Robert+Plant+%28Led+Zeppelin%29+No+Quarter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"muzik62","files":-1,"time":1259613920,"description":"Jimmy Page and Robert Plant - No Quarter\n\nmp3 128 kbits\n\n-------- Tracks ----------\n1. Nobody's Fault But Mine\n2. Thank You\n3. No Quarter\n4. Friends\n5. Yallah\n6. City Don't Cry\n7. Since I've Been Loving You\n8. Battle of Evermore\n9. Wonderful One\n10. That's the Way\n11. Gallows Pole\n12. Four Sticks\n13. Kashmir\n\nThis album is amazing. When I first bought it I didnt expect much, just the same old songs Ive heard befor, but when I listened I was surprised. When I first got the album the first thing I did was look through the booklet. I could see by all the different weird and exotic istruments that this album was going to be great. The first song I listened to was 'Since Ive Been Loving You'. Straight away I could see 'Jimmy can still play'. This song is one of the greatest songs Led Zeppelin ever did but its still not one of the highlights on this album for me. From the oldies the songs which really grabed my attention were: 'The Battle of Evermore'. Its still a great song and the new percussion added to it sounds great and the extra vocals sang by the tradditional Indian singer (or something) are really beautiful; 'Four Sticks'. This new version sounds great played acousticly with bongos or something similar and the beautiful sound of the African vocal group singing harmony; 'Kashmir'. This version just blows my mind. The weird Indian instruments sound amazing, I have no idea how they create that sound. Its an extended and powerful arrangement with loads of different changes not on the original arrangement. The new songs are great. they managed to create a beautiful mystical sound to them. My particular favorate is 'Yallah'. My final verdict is: Page and Plant have created a beautiful and culturally diverse album. Any serious musician should have a copy because of the wide range of instruments and different cultural musical and vocal sounds. This album ranks among my favorate Led Zeppelin albums, and I have heard them all.\n\nmuzik62","torrent":{"xt":"urn:btih:83c92f324282160b7d2f4a24f8fa76931258455d","amp;dn":"Jimmy+Page+%26+Robert+Plant+%28Led+Zeppelin%29+No+Quarter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83c92f324282160b7d2f4a24f8fa76931258455d","infoHashBuffer":{"type":"Buffer","data":[131,201,47,50,66,130,22,11,125,47,74,36,248,250,118,147,18,88,69,93]},"announce":[],"urlList":[]}}