{"title":"The B-52's - Time Capsule, Songs for a Future Generation [Specia","uid":10112169,"size":537476002,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:83ce44522c946de65c3743335aee077fac989744&amp;dn=The+B-52%27s+-+Time+Capsule%2C+Songs+for+a+Future+Generation+%5BSpecia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1399533965,"description":"The B-52's - Time Capsule, Songs for a Future Generation [Greatest Hits CD] (FLAC)\n\n\nThis is a HQ CD [FLAC] extraction of Time Capsule, Songs for a Future Generation [Greatest Hits CD] from the band &quot;The B-52's&quot; which i am a huge fan of :) \n\nTime Capsule: Songs For a Future Generation is a greatest hits album released by the B-52's in 1998. The album presents sixteen of their single releases and fan-favorite album tracks in chronological order, with the addition of two newly recorded songs exclusive to this collection. One of them, &quot;Debbie&quot;, is a tribute to Debbie Harry of Blondie. Also exclusive to this release is the &quot;Original Unreleased Mix&quot; of their 1986 song &quot;Summer of Love&quot;. Editions released in Brazil, Europe and Japan have a different track listing to the US release. The album cover features the five founding band members standing in front of the Unisphere.\n\nAs noted in the book &quot;The B-52's Universe&quot;, the band intended this to be a larger box set consisting of singles, demos, outtakes, and new tracks, but Warner made the band trim it down. The band had remastered many tracks for the box, and were able to release more of them by using alternate tracklistings in different territories. \n\nThe B-52s (styled as The B-52's prior to 2008) are an American new wave band, formed in Athens, Georgia in 1976. The original line-up consisted of Fred Schneider (vocals, percussion, keyboards), Kate Pierson (organ, bass, vocals), Cindy Wilson (vocals, bongos, tambourine, guitar), Ricky Wilson (guitars), and Keith Strickland (drums, guitars, synthesizers, various instruments). Following Ricky Wilson's death in 1985 Strickland switched full-time to guitar. The band subsequently added various musicians for their live shows. This included Sara Lee or Tracy Wormworth on (bass), Zachary Alford or Sterling Campbell on (drums, percussion) and Pat Irwin or Paul Gordon (keyboards &amp; guitars).\n\nRooted in new wave and 1960s rock and roll, the group later covered many genres ranging from post-punk to pop rock. The &quot;guy vs. gals&quot; vocals of Schneider, Pierson, and Wilson, sometimes used in call and response style (&quot;Strobe Light,&quot; &quot;Private Idaho&quot;, and &quot;Good Stuff&quot;), are a trademark. \n\n\n\nThe B-52's - Time Capsule, Songs for a Future Generation [Greatest Hits CD] (FLAC) folder contains:\n\nCD\n1.  Planet Claire\n2.  Rock Lobster\n3.  Private Idaho\n4.  Quiche Lorraine (Live)\n5.  Mesopotamia\n6.  Summer Of Love \n7.  Channel Z\n8.  Deadbeat Club\n9.  Love Shack\n10. Roam\n11. Good Stuff\n12. Is That You Mo-Dean?\n13. (Meet) The Flintstones\n14. Give Me Back My Man\n15. Hallucinating Pluto\n\n\nFile properties info for the CD (FLAC) files using Media Player Classic: \n   Audio: FLAC (framed) 44100Hz stereo 1411kbps\n   Duration: 00:00:00 (varied)\n   Exact Audio Copy V1.0 beta 3\n\n\n\nalso 5 photos and info, log and cue text files\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Time_Capsule:_Songs_for_a_Future_Generation&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Time_Capsule:_Songs_for_a_Future_Generation&lt;/a&gt; \n    \n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.5\n\n\n*Media Player Classic Home Cinema*   &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n*a first for me, i have 2 seperate torrents with seperate folders for both the CD and DVD inside one main folder :)\n","torrent":{"xt":"urn:btih:83ce44522c946de65c3743335aee077fac989744","amp;dn":"The+B-52%27s+-+Time+Capsule%2C+Songs+for+a+Future+Generation+%5BSpecia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ce44522c946de65c3743335aee077fac989744","infoHashBuffer":{"type":"Buffer","data":[131,206,68,82,44,148,109,230,92,55,67,51,90,238,7,127,172,152,151,68]},"announce":[],"urlList":[]}}