{"title":"Strategic.War.in.Europe-PROPHET","uid":8831128,"size":257012009,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8479803cec5bafe44283fb2ab466157281c92308&amp;dn=Strategic.War.in.Europe-PROPHET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1376984295,"description":"Strategic War in Europe  (c) Wastelands Interactive\n\nrelease date ...: August 2766\nprotection .....: -\n# of discs .....: 1\nlanguages ......: EN\n\n\nDESCRiPTiON:\n~~~~~~~~~~~~~\nA tabletop wargame on right on your PC! Strategic War in Europe allows you to play a computer game which looks and plays as a tabletop wargame, but you don't need to find a human opponent. Strategic War in Europe is a grand strategy game where you command one or more of the 25 countries in the game. War, diplomacy, technological progress, recruitment, conquest this is all in your hands. There are no restrictions to the actions you can perform during your turn: unit movement, purchase, attack, technology investment, reinforcement, all of those can be done at any moment during the turn. Strategic War in Europe features a large map scale that doesn't overwhelm, perfect for newer players and for multiplayer! Maintain convoys and supply lines, transport troops through the sea, secure air supremacy and hope for good weather all of those are ingredients of ultimate victory. There are multiple ways to achieve victory, allowing nearly unlimited replayability. The war in Europe begins!\n\nFEATURES:\n~~~~~~~~~~\n* Six unique scenarios spanning the time between 1939-1944\n* An expansive map of Europe and North Africa that is 68 hexes wide and 47 hexes high\n* Ability for players to control up to 25 countries across the three World War II alliances (Allies, Axis, USSR)\n* Five scaling difficulty settings for each country for added challenge and replayability\n* Build your army to attack from land, sea, and air\n* Accessible economy and production system\n* Supply system based on convoys and railroads\n* Technology system that expands five unique areas of research\n* Dynamic weather system that affects the tide of war\n* Units can be boosted by commanders and gather experience, which can change the course of war\n* Possibility to customize many aspects of the game, as Fog of War, or tracking AI movement\n* Reports which allow to easily check what happens in the past\n* Unlimited number of players in hotseat mode\n* Up to 4 players in PBEM mode\n\nMiNiMUM SYSTEM REQUiREMENTS:\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n* OS: XP, Vista, 7\n* CPU: 1.5Ghz, AMD 2000+\n* RAM: 1024 MB\n* Video/Graphics: DirectX 9 compatible video card with 256 MB RAM\n* Display Resolution: Variable, 960x600\n* Sound: DirectX 9 compatible\n* Hard drive: 600 MB\n\nRECOMMENDED SYSTEM REQUiREMENTS:\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n* OS: XP, Vista, 7\n* CPU: dual core or better\n* RAM: 2048 MB\n* Video/Graphics: DirectX 9 compatible video card with 512 MB RAM\n* Display Resolution: Full HD\n* Sound: DirectX 9 compatible\n* Hard drive: 600 MB\n\niNSTALL NOTES:\n~~~~~~~~~~~~~~\n1- Unpack, burn or mount\n2- Install the game\n3- Go To Hell! ","torrent":{"xt":"urn:btih:8479803cec5bafe44283fb2ab466157281c92308","amp;dn":"Strategic.War.in.Europe-PROPHET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8479803cec5bafe44283fb2ab466157281c92308","infoHashBuffer":{"type":"Buffer","data":[132,121,128,60,236,91,175,228,66,131,251,42,180,102,21,114,129,201,35,8]},"announce":[],"urlList":[]}}