{"title":"Geoffrey Hartman - A Scholar's Tale [memoir] (2007)","uid":8832422,"size":252184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:848ae86bbb89f47bd671f2a4c399b26fd5d55a02&amp;dn=Geoffrey+Hartman+-+A+Scholar%27s+Tale+%5Bmemoir%5D+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1377022328,"description":"Geoffrey Hartman - A Scholar's Tale: Intellectual Journey of a Displaced Child of Europe (Fordham University Press, 2007).\n\nISBN: 9780823228324 | 208 pages | EPUB\n\n\nFor more than fifty years, Geoffrey Hartman has been a pivotal figure in the humanities and a giant in literary criticism. In his first book, in 1954, he helped establish the study of Romanticism as key to the problems of modernity. Later, his writings were crucial to the explosive developments in literary theory in the late seventies, and he was a pioneer in Jewish studies, trauma studies, and studies of the Holocaust. At Yale, he was a founder of its Judaic Studies program, as well as of the first major video archive for Holocaust testimonies.\n\nGenerations of students have benefited from Hartman's generosity, his penetrating and incisive questioning, the wizardry of his close reading, and his sense that the work of a literary scholar, no less than that of an artist, is a creative act. \n\nAll these qualities shine forth in this intellectual memoir, which will stand as his autobiography. Hartman describes his early education, uncanny sense of vocation, and development as a literary scholar and cultural critic. He looks back at how his career was influenced by his experience, at the age of nine, of being a refugee from Nazi Germany in the Kindertransport. He spent the next six years at school in England, where he developed his love of English literature and the English countryside, before leaving to join his mother in America.\n\nHartman treats us to a &quot;biobibliography&quot; of his engagements with the major trends in literary criticism. He covers the exciting period at Yale handled so controversially by the media and gives us vivid, richly sympathetic portraits, in particular, of Harold Bloom, Paul de Man, Jacques Derrida, and Erich Auerbach.\n\nAll this is set in the context of his gradual self-awareness of what scholarship implies and how his personal displacements strengthened his calling to mediate between European and American literary cultures. Anyone looking for a rich, intelligible account of the last half-century of combative literary studies will want to read Geoffrey Hartman's unapologetic scholar's tale.\n\n\nReviews\n\n&quot;Geoffrey Hartman returns us to a time when a serious engagement with literature and its variety of interpretations was an integral, even passionate, part of the intellectual life. These deeply thoughtful reflections on his long and distinguished scholarly career traverse the landscape of literary studies over the last several decades in all of its complexity and richness. A Scholar's Tale defines the life of the mind at a level of erudition and elegance that few other intellectual memoirs have achieved.&quot; -- Alvin H. Rosenfeld, Indiana University\n\n&quot;[Hartman] has written a rather different book: the record of a stellar career as a scholar, critic, and teacher that spans decades of changes in the academy to be sure, but one which insists on the primacy of the intellectual life.&quot; -- Bryn Mawr Review of Comparative Literature\n\n&quot;Hartman's unsentimental tale plots a fascinating course through a critic's mind.&quot; -- Forward\n\n&quot;In the end, what is perhaps most compelling about Professor Hartman's story is his life-long engagement with the matter of Judaism, his own complex relation to Jewish identity.&quot; -- Jewish Book World\n\n&quot;[A] lucid and intriguing autobiographical memoir.&quot; -- London Review of Books\n\n&quot;In the first several pages of this remarkable volume, Hartman immediately plunges the reader into his literary and referential universe by alluding to such disparate notables as John Crowe Ransom, William Wordsworth, John Milton, Mel Gibson, and Eva Hoffman. Intertextual references abound throughout, providing a glimpse into the author's learned, searching mind. He recounts his own escape from the Nazis on a Kindertransport in 1939, connecting that event to the literary scholar he became. Hartman devotes most of his memoir to his intellectual journey--from his romance with the Romantic poets and new criticism to his experimentation with other theoretical approaches and eventual turn to Holocaust and genocide studies. Along the way, he recounts his years at Yale; his friendships with Harold Bloom, Jacques Derrida, Paul de Man, and Erich Auerbach; and the evolution of his own approach to literary interpretation, which, perforce, constitutes the trajectory of 20th-century literary history. Rather than chapter titles, the book includes sidebar summaries that guide the reader through the sometimes dizzying and pithy reflections on German philosophy, deconstruction, academic politics, cultural studies, Marxism, and Judaic studies. Highly recommended.&quot; -- Choice\n\n&quot;A genuine rarity; this kind of intellectual autobiography scarcely exists in this country.&quot; -- New York Sun\n\n&quot;In this richly detailed memoir, Geoffrey Hartman recalls the events of a truly extraordinary intellectual career and reflects on the larger issues they illuminate. Describing himself as an 'Unexile,' Hartman chronicles his physical and critical itinerary as a nine-year-old refugee from Nazi Germany to the pinnacle of the American academy. His characteristic modesty cannot obscure the fact that Hartman has been a crucial, even an iconic, figure in humanistic scholarship for over fifty years. A Scholar's Tale tells us almost as much about ourselves as it does about its distinguished author.&quot; -- Geoffrey Harpham, Director, National Humanities Center\n\n&quot;Illuminates the evolution of a career at some of the most exciting and volatile moments in literary studies in the United States in the last half of the century. . . Its erudition and intellectual range and curiosity are absolutely astounding -- a model of Bildung and scholarly commitment that is enviable and instructive.Â An invaluable record and a moving book.&quot; -- Marianne Hirsch, Columbia University\n\n&quot;Geoffrey Hartman concludes his memoir, A Scholar's Tale, with a tribute to Erich Auerbach, whom he describes as a 'truly literary scholar . . . freely rehearsing an incrrdible wealth of knowledge.' This is a perfect description of Hartman himself, who, like Auerbach, is a master of the detailed verbal analysis that procedes from and flowers into a lived understanding of the poetic imagination and its twin gestures of grand ambition and the acknowledgment of an inevitable failure to realize them. Hartman is keenly aware of his own abilities and limitations and knows that they are indistinguishable. He speaks of his attraction to 'literary forms with a small footprint and large resonance.' In the past fifty and more years, Hartman's own footprint in the critical landscape has grown ever larger, and the resonance of his accomplishments continually deepens. This is an unusually self-aware memoir, which reminds us of what can be at stake in the dedication of a life to the curious enterprise of paying endless attention to words.&quot; -- Stanley Fish, Florida International University\n","torrent":{"xt":"urn:btih:848ae86bbb89f47bd671f2a4c399b26fd5d55a02","amp;dn":"Geoffrey+Hartman+-+A+Scholar%27s+Tale+%5Bmemoir%5D+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"848ae86bbb89f47bd671f2a4c399b26fd5d55a02","infoHashBuffer":{"type":"Buffer","data":[132,138,232,107,187,137,244,123,214,113,242,164,195,153,178,111,213,213,90,2]},"announce":[],"urlList":[]}}