{"title":"Eternity of Sound and the Science of Mantra","uid":11760285,"size":467776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8514ffb5fe13cccc94393abe861e7433c2ce3f59&amp;dn=Eternity+of+Sound+and+the+Science+of+Mantra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426563023,"description":"The knowledge of Sabd Brahm - Nad Brahm is an important branch of the Indian School of Spirituality. The science and philosophy of Sabd Brahm encompasses the methodology and effects of mantra-jap, prayers, collective chanting and sadhanas of the ved-mantras and that of the Nad Brahm deals with the genesis, expansion and influence of music. The volume 19 of the &quot;Pt. Shriram Sharma Acharya Vangmaya&quot; series presents truly rare and detailed information and guidance on this topic. The present book is compiled from the English translation of the first two chapters of this volume that focus on the cosmic dimensions of sound and the science of mantras. Acharya Sharma's elucidation of the esoteric and complex subject matter of Sabd Brahm and Mantras is indeed lucid, logical and scientific. The book also outlines - how the modern science could offer multifaceted benefits toward the incessant welfare of human society by constructive investigations in the Science of Mantras","torrent":{"xt":"urn:btih:8514ffb5fe13cccc94393abe861e7433c2ce3f59","amp;dn":"Eternity+of+Sound+and+the+Science+of+Mantra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8514ffb5fe13cccc94393abe861e7433c2ce3f59","infoHashBuffer":{"type":"Buffer","data":[133,20,255,181,254,19,204,204,148,57,58,190,134,30,116,51,194,206,63,89]},"announce":[],"urlList":[]}}