{"title":"Civilization 3 Collection","uid":3392156,"size":2042064154,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8527f40c2a49c98c4e25551bc64be9599f438783&amp;dn=Civilization+3+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"independence","files":10,"time":1128451812,"description":"= SID MEIERS'S CIVILIZATION III =\n\n== Contents ==\n\n* Civilization 3\n* Civilization 3 Play The World (By Razor1911)\n* Civilization 3 Conquests (By DEViANCE)\n* Game updates: Play The World: v1.27f, Conquests: 1.22\n* CD-fix (By FairLight)\n\n== Civilization 3 ==\n\nSid Meier's Civilization III is the ultimate version of the original and definitive empire building game. Civilization III is an exciting journey through time where players are challenged to\ncreate their own version of history as they match wits against the world's greatest leaders and build, expand and rule a world dominating civilization to stand the test of time.\n\n== Play The World ==\n\nFeaturing new multiplayer and single player features, Civilization III: Play the World pits you against the best Civilization players from all corners of the earth via the Internet. With new\nonline modes of play like &quot;turnless&quot; and fast-paced games like Regicide and Elimination, the battle for the ultimate in bragging rights will be intense!\n\nEight new civilizations including new leaders and units provide even more challenges and strategic options. A powerful Scenario Editor allows players to construct their dream scenario and\nshare it with players from around the world. Play scenarios created by others, or build your own -- replayability is now truly limitless with the new benchmark in strategy gaming!\n\n== Conquests ==\n\nSeven new Civilizations deliver all new leaders, units, special abilities, victory conditions, wonders, terrain, resources, city improvements, and governments - offering endless variations\nin quests to rule the world. Improved multiplayer support, intense diplomatic situations, and new editor enhancements round out this second expansion pack for what Time Magazine calls &quot;the\ngreatest computer strategy game of all time.&quot;\n\n\nhttp://www.civ3.com/\n\n\n\nIf you like the game, show your support by buying it!\n\nCivilization 4 Release Date: 28 Oct 2005","torrent":{"xt":"urn:btih:8527f40c2a49c98c4e25551bc64be9599f438783","amp;dn":"Civilization+3+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8527f40c2a49c98c4e25551bc64be9599f438783","infoHashBuffer":{"type":"Buffer","data":[133,39,244,12,42,73,201,140,78,37,85,27,198,75,233,89,159,67,135,131]},"announce":[],"urlList":[]}}