{"title":"The First World War DVDrip [documentary]","uid":4555176,"size":7802597376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8653a67e6733a6f158220e042a4bb6a143b0b60f&amp;dn=The+First+World+War+DVDrip+%5Bdocumentary%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"K1L0GR4m","files":-1,"time":1228454183,"description":"Television has tended to look at the First World War through a veil of tears, seeing only a tragic waste of life in the mud of Flanders. This definitive series strips away ninety years of myopia to get back to the reality of the war.\n\nThis was a global conflict from the start, involving nations in every continent and people of all classes and races. Using fresh archive footage and specially shot material from authentic locations in 22 countries, the multi-layered series demolishes myths and answers key questions from the origins of the war to its bitter end.\n\nUniversally acclaimed as one of the finest documentary series ever made about the Great War. The First World War is a powerful, original and truly comprehensive account of the conflict.\n\nIt places the war in truly Global military context as never before, exploring many of the little known campaigns, battles and actions as well as the better known conflict on the Western Front.\n\nThe series combines previously unseen footage from newly accessible archives in Central and Eastern Europe with exclusive film of many of the battlefields as they are today, studies key participants and weaponry, and diary entries and letters home from soldiers, officers and commanders.\n\n\n","torrent":{"xt":"urn:btih:8653a67e6733a6f158220e042a4bb6a143b0b60f","amp;dn":"The+First+World+War+DVDrip+%5Bdocumentary%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8653a67e6733a6f158220e042a4bb6a143b0b60f","infoHashBuffer":{"type":"Buffer","data":[134,83,166,126,103,51,166,241,88,34,14,4,42,75,182,161,67,176,182,15]},"announce":[],"urlList":[]}}