{"title":"Mistabishi - Drop (2009) 320kbps","uid":5250190,"size":152081576,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86690c038c2d2f8ad20208bdf229be2dd6b6f746&amp;dn=Mistabishi+-+Drop+%282009%29+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"burgersnchips","files":14,"time":1262305724,"description":"As the economic downturn continues Mistabishi drops his awesome debut on Hospital, a label bucking the trend and going from strength to strength. Having written off Ã‚Â£24 billion in one quarter in his previous job at one of the worlds banking giants, our very own Nick Leeson has swapped the trading platforms of the city office for sequencing software in the studio, and his suit and tie for a hoody and jeans. Hold on tight now, as we get ready to Drop!\n\nLaunching himself onto the dnb scene with the Virus single 'Sex &amp; Drugs' and straight onto Hospital with 'No Matter What' Mistabishi has been ruffling feathers throughout the drum+bass community with tracks that go against the grain in every way. The found-sounds of 'Printer Jam' and 'Wipe Your Tears' get the forum nerds nattering, while the reflective melancholy of 'The View From Nowhere' and 'From Memory' are sure to get noticed. Not afraid to court controversy, Mistabishi is also capable of turning in dancefloor stormers - The ravey Piano-led anthem 'No Matter What', which found favour with Jo Whiley at Radio One, being a case in point.\n\nThis is an album full of characters and voices with stories to tell. There is the unknown soldier who provided the vocal for 'Wipe Your Tears' (courtesy of a chance encounter in a West London greasy spoon), a lecture from Gordon Gecko on the benefits of the free market on 'Greed' and the depraved sexual deviance of 'Damage' - what's the safe-word?.\n\nArguably the most challenging long player on Hospital in a long time; this devastating debut is sure to have a lasting impact.\n\n\nMP3, 320kbps, Stereo, Enjoy!","torrent":{"xt":"urn:btih:86690c038c2d2f8ad20208bdf229be2dd6b6f746","amp;dn":"Mistabishi+-+Drop+%282009%29+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86690c038c2d2f8ad20208bdf229be2dd6b6f746","infoHashBuffer":{"type":"Buffer","data":[134,105,12,3,140,45,47,138,210,2,8,189,242,41,190,45,214,182,247,70]},"announce":[],"urlList":[]}}