{"title":"Port Forwarding Configuration v1.0.144","uid":4756885,"size":2936912,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:866f1cec9f1fb02b1ac3e5f0ca1ce507237931ac&amp;dn=Port+Forwarding+Configuration+v1.0.144&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"akhiugo","files":3,"time":1236509837,"description":"Port.Forwarding.Configuration.v1.0.144\n\n\nAutomatically forward your ports with PFConfig. If you are trying to run \nan application that requires ports to be forwarded, you can skip the \nwork and just use PFConfig. With PFConfig, you don't have to learn how \nto setup your router. It's so easy to use, you just pick the program \nfrom a list and say 'Update Router'.\n\n\nFeatures:\n\nConfigures your routers port forwarding section for you.\n\nIncreases security by allowing you to forward ports when you need them, \nand stop forwarding them when you do not.\n\nOptimizes the use of your routers available memory.\n\nEliminates the hassle of logging in to your router everytime you want \nto make a change to your port forwarding setup.\n\n\nAutomatically Forwards Ports:    \n\nWhen you want to run an application that requires a port to be forwarded, \nwith PFConfig all you have to do is select that application from the \nlist and choose Forward this app. If you want to forward different apps \nto different computers, you simply put the other computers address in \nand we take care of the rest.\n\n\nOptimized Use of Ports:    \n\nWhen you use PFConfig, our advanced optimization routines will actually \ncombine multiple applications into less entries in your router. You can \nfrequently forward more applications than your router would otherwise \nsupport.\n\n\nHuge Increases in Security:   \n\nWhen you use PFConfig, it is incredibly easy to forward ports as you need \nthem, and turn them off when you do not. Turning off your forwarded \nports when not in use is a huge increase in security.\n\n\nNever Login to your Router Again:    \n\nWith PFConfig, you do not have to log in to your router to add and remove \nforwarded ports. Simply tell PFConfig which ports to forward and where \nto forward them, and the rest is taken care of for you. You can pretty \nmuch forget your routers password.\n\n\nINSTALL NOTES:\n\nRun PFCSetup1.0.144.exe and register with details provided.\n\n\n\nPlease help your fellow pirates by seeding after download!","torrent":{"xt":"urn:btih:866f1cec9f1fb02b1ac3e5f0ca1ce507237931ac","amp;dn":"Port+Forwarding+Configuration+v1.0.144","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866f1cec9f1fb02b1ac3e5f0ca1ce507237931ac","infoHashBuffer":{"type":"Buffer","data":[134,111,28,236,159,31,176,43,26,195,229,240,202,28,229,7,35,121,49,172]},"announce":[],"urlList":[]}}