{"title":"THE WIZARD OF OZ","uid":4586666,"size":4933545984,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:86731da128c93dcf5418bf899e5c40da6872693f&amp;dn=THE+WIZARD+OF+OZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mesotonica","files":17,"time":1229649890,"description":" &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0032138/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0032138/&lt;/a&gt;\n\n\nDorothy anhela viajar &quot;mÃƒÂ¡s allÃƒÂ¡ del arco iris&quot; a una tierra diferente y su deseo se hace realidad cuando un tornado se la lleva junto a su perrito al mundo de Oz. Pero la aventura sÃƒÂ³lo acaba de comenzar; Dorothy, tras ofender a la Malvada Bruja del Oeste (Margaret Hamilton), y por sugerencia de la Bruja Buena del Norte, (Billie Burke), se dirige por el camino amarillo hacia la Ciudad Esmeralda, donde vive el todopoderoso Mago de Oz, que puede ayudar a la niÃƒÂ±a a regresar a Kansas. Por el camino, se hace amiga del EspantapÃƒÂ¡jaros (Ray Bolger), el Hombre de Hojalata (Jack Haley) y el LeÃƒÂ³n Cobarde (Bert Lahr). El EspantapÃƒÂ¡jaros ansÃƒÂ­a un cerebro, el Hombre de Hojalata quiere un corazÃƒÂ³n y el LeÃƒÂ³n desea el coraje que le falta; como creen que el Mago les puede ayudar a ellos tambiÃƒÂ©n, deciden unirse a Dorothy en su odisea hasta la Ciudad Esmeralda.\n\nIn this charming film based on the popular L.Frank Baum stories, Dorothy and her dog Toto are caught in a tornado's path and somehow end up in the land of Oz. Here she meets some memorable friends and foes in her journey to meet the Wizard of Oz who everyone says can help her return home and possibly grant her new friends their goals of a brain, heart and courage.  Written by Dale Roloff\n\nDorothy lives on a farm in Kansas until a cyclone arrives, and picks her, her house, and her dog up and deposits them in the land of Oz. Things in Oz are strange and beautiful, but Dorothy just wants to get back home. She's helped by the Good Witch of the North, but she's also in trouble with the Wicked Witch of the West, who seeks revenge for the death of her sister; the Wicked Witch of the East, for which she blames Dorothy. Written by Murray Chapman {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;bdd0c8c7c7d1d8fddece93c8cc93d2c793dcc8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nWhen a nasty neighbor tries to have her dog put to sleep, Dorothy takes her dog Toto, to run away. A cyclone appears and carries her to the magical land of Oz. Wishing to return, she begins to travel to the Emerald City where a great wizard lives. On her way she meets a Scarecrow who needs a brain, a Tin Man who wants a heart, and a Cowardly Lion who desperately needs courage. They all hope the Wizard of Oz will help them, before the Wicked Witch of the West catches up with them.\n\n","torrent":{"xt":"urn:btih:86731da128c93dcf5418bf899e5c40da6872693f","amp;dn":"THE+WIZARD+OF+OZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86731da128c93dcf5418bf899e5c40da6872693f","infoHashBuffer":{"type":"Buffer","data":[134,115,29,161,40,201,61,207,84,24,191,137,158,92,64,218,104,114,105,63]},"announce":[],"urlList":[]}}