{"title":"Breaking.Point.2015.S01E01.Alex.HDTV.x264-DaViEW","uid":11689383,"size":298122749,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:872410db51c652ba015f4364c03c1b2fba406363&amp;dn=Breaking.Point.2015.S01E01.Alex.HDTV.x264-DaViEW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"duranie","files":1,"time":1423455514,"description":"Breaking.Point.2015.S01E01.Alex.HDTV.x264-DaViEW\n\n\n\nFamilies across the nation are on the brink of destruction as their lives have been hijacked by a criminal loved one... this is their BREAKING POINT, Investigation Discovery's new docudrama. From Sam Mettler, the creator and executive producer of the long-running series &quot;Intervention,&quot; this groundbreaking reality series features subjects who believe they are participating in a documentary about their life of crime. What they don't know is they will soon face an intervention that offers only two choices: accept treatment or face the possibility of prison time. Each surprise intervention is conducted by top criminal defense attorney and certified intervention professional, Darren Kavinoky, whose insights into illegal behavior are based not only in professional clinical interest - but, also his passion, borne of personal experience fighting his own addictions to drugs and alcohol, and committing crimes that led him to handcuffs, himself.\n\nTold in gripping verite-style, these are the stories of lost souls who walk life's tightrope, edging closer and closer to a great fall, while dragging their loved ones down with them. Through BREAKING POINT, the criminals and their families confront their darkest demons with the hope of finally finding a road to redemption. Each episode follows real criminals through their daily lives and starkly reveals the devastation their behavior has brought to themselves, their families and friends. Kavinoky enters to lend his authentic viewpoint stemming from his own personal experience, which could have led him to the same untimely end awaiting those who cannot, or will not, recover. Kavinoky and the extensive BREAKING POINT team have made it their mission to stop the madness that can lead only to jails, institutions, or death.\n\n\n\n\nSummary:\nAlex, 26, is a violent criminal and a prostitute. Combined with her addiction to crack and heroin, she is rapidly spiraling out of control. Fearing for her safety, her large family has banded together in hopes of saving her life.\n\n\n----------------------\n\ntitle........: alex\ngenre(s).....: unscripted/reality-tv/lifestyle/crime/drugs\nruntime......: 43:15\nsize.........: 284MB\nresolution...: 720x404\nvideo........: x264\naudio........: AAC 2ch\nair date.....: 01/15/15","torrent":{"xt":"urn:btih:872410db51c652ba015f4364c03c1b2fba406363","amp;dn":"Breaking.Point.2015.S01E01.Alex.HDTV.x264-DaViEW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"872410db51c652ba015f4364c03c1b2fba406363","infoHashBuffer":{"type":"Buffer","data":[135,36,16,219,81,198,82,186,1,95,67,100,192,60,27,47,186,64,99,99]},"announce":[],"urlList":[]}}