{"title":"Renal Nursing, 4E (Wiley) [PDF] [StormRG]","uid":11079317,"size":15503956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88861b8944496f20ff509a56258483d1691f6b8e&amp;dn=Renal+Nursing%2C+4E+%28Wiley%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":2,"time":1411380347,"description":"Author: Nicola Thomas\nPaperback: 418 pages\nPublisher: Wiley-Blackwell; 4 edition (January 28, 2014)\nLanguage: English\nISBN-10: 1118410645\nISBN-13: 978-1118410646\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nRenal Nursing is a comprehensive evidence-based guide to nursing in the field of nephrology and kidney care. This fully updated fourth edition discusses the stages of chronic kidney disease, prevention and early management, pre-dialysis care, haemodialysis and peritoneal dialysis, transplantation, investigations and nutrition. It also includes key information on renal care in infancy, childhood and early adolescence. The underlying anatomy, physiology and psychology of kidney disease are reviewed in depth, along with the skills and knowledge required to provide support, treatment and high-quality care.\n\nSpecial features:\n\nFully grounded in the NHS National Service Framework for renal services\nNew chapter on patient involvement in renal care\nContent and references fully updated to reflect changes in policies, evidence, care and management\nBegins with the basics and covers all the vital material required by anyone working in renal care\nRenal Nursing is an ideal reference text for nurses undertaking post-registration renal courses, student nurses undertaking a placement in a renal ward, specialist renal dietitians, pharmacists and other professions allied to medicine.","torrent":{"xt":"urn:btih:88861b8944496f20ff509a56258483d1691f6b8e","amp;dn":"Renal+Nursing%2C+4E+%28Wiley%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88861b8944496f20ff509a56258483d1691f6b8e","infoHashBuffer":{"type":"Buffer","data":[136,134,27,137,68,73,111,32,255,80,154,86,37,132,131,209,105,31,107,142]},"announce":[],"urlList":[]}}