{"title":"Dave Cooper: Mutant Zone # 1-3 (Aircel)","uid":8751014,"size":107446770,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:88fc8bbb862516e36595aac9a3457245247f50e5&amp;dn=Dave+Cooper%3A+Mutant+Zone+%23+1-3+%28Aircel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fudoh101","files":3,"time":1375030835,"description":"Dave Cooper\nMutant Zone\nThree issues published by Aircel 1991\nGreat early Dave art\n\nDavid Charles Cooper is a cartoonist, commercial illustrator and a graphic designer who lives in Ottawa, Canada.[1] In addition to comics, Cooper has worked extensively as a designer, producer, and creator in the field of animation. Several of his designs were used on Futurama, notably various areas of the Planet Express office.\nCooper became a published cartoonist in his teens, creating science fiction comics stories for Barry Blair's Aircel Comics. After gradually giving up working for Aircel, Cooper spent a few years in a band before eventually returning to comics. In his 20s he created books such as Puke and Explode and Cynthia Petal's Really Fantastic Alien Sex Frenzy, lavishly illustrated stories that featured dark subject matter with incongruous &quot;cute&quot; touches such as letter i's dotted with little circles. (Puke and Explode has a cameo in the 1995 film Crumb, when R. Crumb briefly examines the cover in a comics store and then rather disdainfully passes it by.) Cooper also contributed to Fantagraphics' Duplex Planet Illustrated.\nWith Suckle, his graphic novel published in 1997, Cooper broke through to a new level of critical acclaim with the story of an innocent, childlike fellow, Basil, who is confronted by strange, sexualized horrors in a futuristic world. It was nominated for the Harvey Award. He followed this up with the even darker book Crumple (first serialized in the pages of Zero Zero), about a square-headed little man in a world ultimately overrun by militant feminists, and the multi-issue series Weasel, which featured the ongoing story Ripple, about a frustrated illustrator who enters an obsessive relationship with one of his models. With each book, Cooper's work grew darker in subject matter, while more accomplished visually. During this time, Cooper also contributed to Nickelodeon's children's magazine along with other anthologies. He also created a line of deluxe toys with the firm Critterbox Toys.","torrent":{"xt":"urn:btih:88fc8bbb862516e36595aac9a3457245247f50e5","amp;dn":"Dave+Cooper%3A+Mutant+Zone+%23+1-3+%28Aircel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88fc8bbb862516e36595aac9a3457245247f50e5","infoHashBuffer":{"type":"Buffer","data":[136,252,139,187,134,37,22,227,101,149,170,201,163,69,114,69,36,127,80,229]},"announce":[],"urlList":[]}}