{"title":"Jeff Cavins - The Mystery of Suffering (3-disc audio series)","uid":15617691,"size":81835755,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:895059706550655f8914285e0744968b9967c4f7&amp;dn=Jeff+Cavins+-+The+Mystery+of+Suffering+%283-disc+audio+series%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"catholicstuff","files":3,"time":1471847083,"description":"Jeff Cavins - The Mystery of Suffering (3-disc audio series)\r\n\r\n&quot;If anyone wants to be a follower of mine, let him renounce himself and take up his cross every day and follow me&quot; -- Luke 9:23\r\n\r\nLike death and taxes, none of us can escape suffering. We all suffer through personal problems like poor health and the loss of family members, as well as natural disasters, war and other tragedies in our world. Our tribulations range from small disappointments to problems so serious we question God's meaning or purpose, even to the point where we &quot;complain to God about God!&quot;\r\n\r\nPersonal Struggle: Now, in the powerful Lenten-style series, The Mystery of Suffering, popular Catholic author and host of EWTN's Life on the Rock, Jeff Cavins unpacks the history of suffering to unveil its true meaning. In this intimate presentation, Jeff reveals his own personal struggle that he was only able to overcome through God's grace. You'll share how Jeff's agonizing ordeal of enduring many months of physical pain and mental anxiety became God's way to lead him to a penetrating study of why suffering exists. And why Christ had to suffer (not just die) and his discovery of real-life practical steps that you can take to help you work through the inevitable suffering that will occur in your life.\r\n\r\nOriginal Sin: You will discover new insight into the story of the fall of man, as Jeff Cavins unpacks Holy Scripture. His profound perspective will open your eyes to this familiar story in a way you have never known before. You'll discover what Adam's choices really were and why he remained silent when confronted by the serpent. You'll also uncover God's perfect plan in instituting the punishment of Adam and Eve and find out the truth about suffering which becomes a recurring theme throughout all of Sacred Scripture. After you listen to this amazing series, your perspective on the place of suffering in the plan that God established for the salvation of all mankind will be changed forever.\r\n\r\nGod Sends His Only Son: After discovering the real meaning of original sin and its ramifications, Holy Week will have a new significance in your life. You'll delve into the history of the Old Testament and Christ's fulfillment of God's covenant promises. In a point-by-point comparison, Jeff unwraps how Jesus does everything that Adam should have done, revealing that the story of creation and the fall of man is not just a mythological fairy tale, as some have come to believe, but a prophecy of how Jesus would empty Himself out for the sins of the world.\r\n\r\nBecome Like Jesus: Whether you are in the heart of your own personal challenge, or are the support of a loved one going through theirs, this fascinating tape series will bring deeper meaning to the struggles of life. In all, Jeff offers fifteen practical examples for anyone in need of offering up their suffering, or seeking to enrich their own personal experience of Lent. Find out what God's plan is for your life and how He allows you to participate in the redemption of the world through your sufferings, by completing &quot;what is lacking in Christ's afflictions for the sake of his body, that is, the Church.&quot; Your spiritual life will truly blossom this Lent as you uncover new insight into the Passion and Death of Our Lord.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:895059706550655f8914285e0744968b9967c4f7","amp;dn":"Jeff+Cavins+-+The+Mystery+of+Suffering+%283-disc+audio+series%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"895059706550655f8914285e0744968b9967c4f7","infoHashBuffer":{"type":"Buffer","data":[137,80,89,112,101,80,101,95,137,20,40,94,7,68,150,139,153,103,196,247]},"announce":[],"urlList":[]}}