{"title":"Futurama - Season 7b - Complete","uid":8907917,"size":2431767074,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:897a529e2b439a912a5a8368c329f24d86aeaddf&amp;dn=Futurama+-+Season+7b+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"stormcld","files":13,"time":1378948989,"description":"Futurama is an American animated science fiction sitcom created by Matt Groening and developed by Groening and David X. Cohen for the Fox Broadcasting Company. The series follows the adventures of a late-20th-century New York City pizza delivery boy, Philip J. Fry, who, after being unwittingly cryogenically frozen for one thousand years, finds employment at Planet Express, an interplanetary delivery company in the retro-futuristic 31st century. The series was envisioned by Groening in the late 1990s while working on The Simpsons, later bringing Cohen aboard to develop storylines and characters to pitch the show to Fox.\n\nIn June 2009, producing studio 20th Century Fox announced that Comedy Central had picked up the show for 26 new half-hour episodes, which began airing in 2010 and 2011. The show was renewed for a seventh season, with the first half airing in June 2012 and the second set for early summer 2013.It was later revealed that the seventh season would be the final season, as Comedy Central announced that they would not be commissioning any further episodes. The series finale aired on September 4, 2013, though Groening has said he will try to get it picked up by another network.\n\nA crossover episode with The Simpsons is scheduled to be released during that show's 25th season\n\nSeason 7-B episodes 14---26\n\n","torrent":{"xt":"urn:btih:897a529e2b439a912a5a8368c329f24d86aeaddf","amp;dn":"Futurama+-+Season+7b+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"897a529e2b439a912a5a8368c329f24d86aeaddf","infoHashBuffer":{"type":"Buffer","data":[137,122,82,158,43,67,154,145,42,90,131,104,195,41,242,77,134,174,173,223]},"announce":[],"urlList":[]}}