{"title":"Meet the Robinsons (2007) DD5.1 NL+Eng Subs And Language Retail ","uid":6889362,"size":4580168627,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:89e8919b075d6b892ad04d19f18ad7154ddb1a02&amp;dn=Meet+the+Robinsons+%282007%29+DD5.1+NL%2BEng+Subs+And+Language+Retail+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Saggin","files":-1,"time":1323908176,"description":"Meet the Robinsons (2007) DD5.1 NL+Eng Subs And Language Retail\n\n[img]http://www.uploadplaatjes.nl/plaatjes/8/311341.jpg[/img]\n\nVerenigde Staten\nAnimatie / Familie\n95 minuten\n\ngeregisseerd door Stephen J. Anderson\nmet de stemmen van Jordan Fry, Ethan Sandler en Wesley Singerman\n\nDe briljante, twaalfjarige Lewis woont in een weeshuis en hoopt met zijn nieuwste uitvinding, de \nGeheugen Scanner, de vroege herinneringen aan zijn moeder terug te halen. Maar voordat hij zijn \nantwoorden krijgt, wordt het apparaat gestolen door de gemene 'Bowler Hat Guy' en zijn metgezel, de duivelse hoed Doris. \nLewis heeft alle hoop voor de toekomst al opgegeven, maar dan verschijnt de geheimzinnige jongen \nWilbur Robinson die hem in een tijdmachine meeneemt naar de toekomst. Daar ontmoet Lewis het \nietwat vreemde gezin van Wilbur, de Robinsons, en voelt hij voor het eerst hoe het is om echt familie te hebben. \nIn een wereld vol vliegende auto's en zwevende steden moeten ze de Bowler Hat Guy zien te vinden om de toekomst veilig te stellen.\n\n[img]http://www.uploadplaatjes.nl/plaatjes/8/311343.jpg[/img]\n\n'Meet the Robinsons' is gebaseerd op het boek &quot;Een dag met Wilbur Robinson&quot; van William Joyce. \nHet is na 'Chicken Little' uit 2005, de tweede lange computeranimatiefilm die Walt Disney ontwikkelde buiten hun vaste studio Pixar. \nTijdens het productieproces werd Pixar eigendom van Disney en kwam Pixar-oprichter John Lasseter \naan het hoofd te staan van de creatieve afdeling. \nLasseter had zoveel nieuwe tips voor regisseur Stephen J. Anderson dat in de laatste tien maanden \nvoordat 'Meet the Robinsons' in de bioscoop zou verschijnen bijna 60 procent van de film opnieuw werd gemaakt, met nieuwe verhaallijnen, personages en actiescÃƒÂ¨nes.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/34422&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/34422&lt;/a&gt;\n\nUnited  States\nAnimation / Family\n95 minutes\n\ndirected by Stephen J. anderson\nwith the voices of Jordan Fry, Ethan Sandler and Wesley Sing Erman\n\nThe brilliant twelve-year-old Lewis lives in an orphanage and hopes that his latest invention, the\nMemory Scanner, early memories of his mother to retrieve. But before he\nreplies, the device is stolen by the evil &quot;Bowler Hat Guy and his companion, the\nevil hat Doris.\nLewis has all already given up hope for the future, but it appears the mysterious boy\nWilbur Robinson, who in a time machine into the digital future. Lewis will meet the\nsomewhat strange family of Wilbur, the Robinsons, and he feels for the first time what it's really family have.\nIn a world full of flying cars and floating cities, they see the Bowler Hat Guy to find\nfuture secure.\n\nMeet the Robinsons &quot;is based on the book&quot; A Day with Wilbur Robinson &quot;by William Joyce.\nIt is after &quot;Chicken Little&quot; in 2005, the second long animated feature that Walt Disney developed \ncomputeroutside their regular studio Pixar.\nDuring the production became the property of Disney and Pixar Pixar founder John Lasseter came\nat the head of the creative department.\nLasseter had so many new tips for director Stephen J. Anderson in the last ten months\nbefore &quot;Meet the Robinsons&quot; was to appear in theaters almost 60 percent of the movie was\nmade, with new storylines, characters and action scenes.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0396555&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0396555&lt;/a&gt;\n\n\nSpotinformatie    \nFORM..........................: DVD5\nSOURCE....................: Retail PAL\nAUDIO.........................: DD5.1 (English + NL+ Vlaams Gesproken)\nSUBTITELS...............: Dutch + English\nMENU........................: Ja\nSCREEN..................: 16X9 Anamorphic Widescreen {1.78:1}\nCOVER.......................: Ja\n\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\n","torrent":{"xt":"urn:btih:89e8919b075d6b892ad04d19f18ad7154ddb1a02","amp;dn":"Meet+the+Robinsons+%282007%29+DD5.1+NL%2BEng+Subs+And+Language+Retail+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89e8919b075d6b892ad04d19f18ad7154ddb1a02","infoHashBuffer":{"type":"Buffer","data":[137,232,145,155,7,93,107,137,42,208,77,25,241,138,215,21,77,219,26,2]},"announce":[],"urlList":[]}}