{"title":"Routledge Critical Thinkers series - on philosophy &amp; theory","uid":4831882,"size":42533224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a16f682fb888615126a765b924ccfad9e80b89d&amp;dn=Routledge+Critical+Thinkers+series+-+on+philosophy+%26+theory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"th-mach","files":33,"time":1239165708,"description":"Most books in this torrent are high-quality pdf files.  The text of the Zizek is a bit messed up, but it's readable.\n\nRoutledge Critical Thinkers\n\nAmerican Theorists of the Novel (Routledge Critical Thinkers) - Peter Rawlings.pdf\nAntonio Gramsci (Routledge Critical Thinkers) - Steve Jones.pdf\nCyberculture Theorists (Routledge Critical Thinkers) - David Bell.pdf\nEdward Said (Routledge Critical Thinkers) - Bill Ashcroft , Pal Ahluwalia.pdf\nEmmanuel Levinas (Routledge Critical Thinkers) - Sean Hand.pdf\nEve Kosofsky Sedgwick (Routledge Critical Thinkers) - Jason Edwards.pdf\nFeminist Film Theorists (Routledge Critical Thinkers) - Shohini Chaudhuri.pdf\nFredric Jameson (Routledge Critical Thinkers) - Adam Roberts.pdf\nFriedrich Nietzsche (Routledge Critical Thinkers) - Lee Spinks.pdf\nGayatri Chakravorty Spivak (Routledge Critical Thinkers) - Stephen Morton.pdf\nGilles Deleuze (Routledge Critical Thinkers) - Claire Colebrook.pdf\nHannah Arendt (Routledge Critical Thinkers) - Simon Swift.pdf\nHomi K. Bhabha (Routledge Critical Thinkers) - David Huddart.pdf\nJacques Derrida (Routledge Critical Thinkers) - Nicholas Royle.pdf\nJacques Lacan (Routledge Critical Thinkers) - Sean Homer.pdf\nJean Baudrillard (Routledge Critical Thinkers) - Richard J. Lane.pdf\nJean-Francois Lyotard (Routledge Critical Thinkers) - Simon Malpas.pdf\nJudith Butler (Routledge Critical Thinkers) - Sara Salih.pdf\nJulia Kristeva (Routledge Critical Thinekrs) - Noelle McAfee.pdf\nMartin Heidegger (Routledge Critical Thinkers) - Timothy Clark.pdf\nMaurice Blanchot (Routledge Critical Thinkers) - Ullrich Haase, William Large.pdf\nMichel Foucault (Routledge Critical Thinkers) - Sara Mills.pdf\nPaul de Man (Routledge Critical Thinkers) - Martin McQuillan.pdf\nPaul Ricoeur (Routledge Critical Thinkers) - Karl Simms.pdf\nPaul Virilio (Routledge Critical Thinkers) - Ian James.pdf\nRoland Barthes (Routledge Critical Thinkers) - Graham Allen.pdf\nSigmund Freud (Routledge Critical Thinkers) - Pamela Thurschwell.pdf\nSimone de Beauvoir (Routledge Critical Thinkers) - Ursula Tidd.pdf\nSlavoj Zizek (Routledge Critical Thinkers) - Tony Myers.pdf\nStuart Hall (Routledge Critical Thinkers) - Jamee Procter.pdf\nTheodor Adorno (Routledge Critical Thinkers) - Ross Wilson.pdf\nTheorists of Modernist Poetry (Routledge Critical Thinkers) - Rebecca Beasley.pdf\nTheorists of the Modern Novel (Routledge Critical Thinkers) - Deborah Parsons.pdf\n\nPlease remember to seed.","torrent":{"xt":"urn:btih:8a16f682fb888615126a765b924ccfad9e80b89d","amp;dn":"Routledge+Critical+Thinkers+series+-+on+philosophy+%26+theory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a16f682fb888615126a765b924ccfad9e80b89d","infoHashBuffer":{"type":"Buffer","data":[138,22,246,130,251,136,134,21,18,106,118,91,146,76,207,173,158,128,184,157]},"announce":[],"urlList":[]}}