{"title":"Spanky And Our Gang - Like to Get to Know You (1968)","uid":4788372,"size":31743689,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8a794afd31238d40dfcc44db0a7369af05a6a768&amp;dn=Spanky+And+Our+Gang+-+Like+to+Get+to+Know+You+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Iron_Horse","files":14,"time":1237633520,"description":"Spanky And Our Gang - Like to Get to Know You (1968)\nMp3 128 mbit/s\nIncluded: CD Front Cover and this Info\n\nSpanky and Our Gang was an American 1960s folk-rock band led by Elaine &quot;Spanky&quot; McFarlane. The band derives its name from Hal Roach's popular Our Gang comedies of the 1930s (known to modern audiences as The Little Rascals). McFarlane was nicknamed &quot;Spanky&quot; because one of the band members, perhaps influenced by her last name, said that she resembled Our Gang star George &quot;Spanky&quot; McFarland. The group was known for its vocal harmonies.\n\nThe group's first album, simply titled Spanky and Our Gang, was released by Mercury Records on August 1, 1967, and included three popular songs that were released as singles. These were &quot;Sunday Will Never Be The Same&quot; (their biggest hit, which reached number #9 on the U.S. Billboard Hot 100 chart in the summer of 1967) followed by &quot;Making Every Minute Count&quot; and &quot;Lazy Day&quot; (both of which made the Top 30 that fall). Both &quot;Sunday Will Never Be The Same&quot; and &quot;Lazy Day&quot; sold over one million copies.\n\nTheir second album, Like To Get To Know You, was released in April 1968. Two singles were released: &quot;Sunday Mornin'&quot; in the spring, which reached #30, and &quot;Like To Get To Know You&quot;, which reached #17 in the summer of 1968. The album version of &quot;Like To Get To Know You&quot; begins with a humorous conversation. The single's B-side, &quot;Three Ways From Tomorrow&quot;, also received considerable airplay. The album also included their rendition of the classic &quot;Stardust&quot; and a version of &quot;Everybody's Talkin'&quot;, best known as a hit single for Harry Nilsson and the theme song for the movie Midnight Cowboy.\n\nIn October 1968 the group suffered a tragedy when at age 27 their lead guitarist Malcolm Hale died of carbon monoxide poisoning due to a faulty space heater (Hale's death has also been ascribed to bronchopneumonia). The group disbanded shortly afterwards. Mercury released a third album, Anything You Choose b/w Without Rhythm Or Reason, in January 1969. It contained two popular songs, &quot;Give a Damn&quot; and &quot;Yesterday's Rain&quot;.\n\n&quot;Give a Damn&quot; was released as a single in the summer of 1968. In spite of being banned in several states because of the profanity in its title - and in some cases due to the fact that it was a comment on racial equality that became the theme song for the New York Urban Coalition - the song became a regional hit where released and overall made #43. It was also performed live on an episode of The Smothers Brothers Comedy Hour, resulting in CBS Standards and Practices division receiving numerous complaints about the song's title being used during 'family viewing hours'. One such complaint reportedly came from Richard Nixon (Tom Smothers, 'Geraldo' Interview, 1987). Ironically, &quot;Give A Damn&quot; would become John Lindsay's campaign song during his successful run for Mayor of New York.\n\nAfter the band's break-up, &quot;Spanky&quot; enjoyed some success as a solo artist. She also toured for years with the Mamas and the Papas, singing primarily the parts previously performed by the late Cass Elliot.\n\nTracklist:\n01. Swingin' Gate\n02. Prescription For The Blues\n03. Three Ways From Tomorrow\n04. My Bill\n05. Sunday Mornin'\n06. Everybody's Talkin'\n07. Suzanne\n08. Stuperflabbergasted\n09. Like To Get To Know You\n10. Chick-A-Ding-Ding\n11. Stardust\n12. Coda (I Like To Get To Know You)\n\nLineup:\nElaine &quot;Spanky&quot; McFarlane (born 19 June 1942, Peoria, Illinois) - vocals\nNigel Pickering (born 15 June 1929, Pontiac, Missouri) - rhythm guitar, vocals\nPaul &quot;Oz&quot; Bach (24 June 1939, Paw Paw, West Virginia - 21 September 1998, Asheville, North Carolina) - bass guitar, vocals (1966-67)\nMalcolm Hale (17 May 1941, Butte, Montana - 30 October 1968, Chicago, IL) - lead guitar, trombone, vocals (died of carbon monoxide poisoning).\nJohn &quot;The Chief&quot; Seiter (born 17 August 1944, St Louis, Missouri) - drums, vocals (1967-69)\nKenny Hodges (born 3 August 1936, Jacksonville, Florida) - bass, vocals (1968-69)\nLefty Baker (born 7 January 1939, Roanoke, Virginia - 11 August 1971, California) - lead guitar, banjo, vocals (1968-69)","torrent":{"xt":"urn:btih:8a794afd31238d40dfcc44db0a7369af05a6a768","amp;dn":"Spanky+And+Our+Gang+-+Like+to+Get+to+Know+You+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a794afd31238d40dfcc44db0a7369af05a6a768","infoHashBuffer":{"type":"Buffer","data":[138,121,74,253,49,35,141,64,223,204,68,219,10,115,105,175,5,166,167,104]},"announce":[],"urlList":[]}}