{"title":"Finkbeiner-Jasons-Secret History of Science's Postwar Elite(2","uid":4653206,"size":1195830,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8aaa02f085694c7198c5d1fa14bedfe5fd9e0dc4&amp;dn=Finkbeiner-Jasons-Secret+History+of+Science%5C%27s+Postwar+Elite%282&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1232122592,"description":"This is Ann Finkbeiner's mindblowing book The Jasons - The Secret History of Science's Postwar Elite (2006) which takes a provocative inside look at the elite scientists who have worked behind the scenes to influence American science and policy for half a century. At a dinner honoring Freeman Dyson, Finkbeiner heard the physicist allude to government advisors called &quot;the Jasons,&quot; a group little known except to Pentagon insiders. The first author to devote a book to the Jasons, she explains that they are a self-selecting cadre of scientists independent of the government who evaluate military technologies at the frontier of physical feasibility. Their group is a child of the Manhattan Project by way of the cold war, and they count among their ranks scientific stars like Freeman Dyson and Murray Gell-Mann, and among their mentors Edward Teller and Hans Bethe. They've inherited a mission from the Manhattan Project - to counsel the government on the military uses of pure science and have gathered every summer since 1960 to solve highly classified problems for the Department of Defense and the intelligence community. Aside from a brief media firestorm during the Vietnam War, they've worked in utter secrecy with unparalleled freedom. Fiercely patriotic and stubbornly independent, the Jasons have been directly responsible for breakthroughs ranging from the electronic battlefield to the &quot;Star Wars&quot; missile defense technologies to the national system for predicting global climate. But their mission to keep a vigil over applied science has led them into both moral dilemmas and political stews. Among the projects credited to the JASONS, with all too little detail, are missile defense, directed energy weapons, extremely low frequency (ELF) communications to reach submerged submarines, nuclear event detection, sensors and night vision for Vietnam. Finkbeiner discusses throughout the book the conflict between the scientific imperative to discuss hypotheses and findings opening, and the demands for secrecy imposed on these brilliant minds. These truly astonishing scientists have dedicated much work to improving the security of the country, and have suffered enormous moral guilt over the misuse of their most profound discoveries. We learn about how their work has changed their lives AND ours. The Jasons is a spellbinding and meticulously researched history that reveals the critical scientific advances and the unintended consequences of the Jasons' shadowy work as well as the fascinating personalities of the Jasons themselves. Part social history, part biography, and definitely a large part philosophy of science, this book deserves a wide audience. 115 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:8aaa02f085694c7198c5d1fa14bedfe5fd9e0dc4","amp;dn":"Finkbeiner-Jasons-Secret+History+of+Science%5C%27s+Postwar+Elite%282","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aaa02f085694c7198c5d1fa14bedfe5fd9e0dc4","infoHashBuffer":{"type":"Buffer","data":[138,170,2,240,133,105,76,113,152,197,209,250,20,190,223,229,253,158,13,196]},"announce":[],"urlList":[]}}