{"title":"The Krondor - Antara Collection","uid":4271502,"size":3437098391,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8abb7d5a83b74563962d471366d354c606bae4ef&amp;dn=The+Krondor+-+Antara+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"iamokaw","files":31,"time":1214956337,"description":"This torrent is your complete guide to the world of Krondor and the universe it inhabits. The CDs are direct rips of the discs from my personal collection. It includes: \n\n1. The World of Krondor - this rare promotional disc, made to promote Return to Krondor, came with Sierra Game&amp;#039;s old magazine. It includes the entire original Sierra Game Betrayal at Krondor, promotional material for Return to Krondor, as well as a bibliography for Raymon E. Feist, the game&amp;#039;s writer, who would go ont o write a book series based on it (and yes, I know he had written others before it, but he has stated that he got the idea for the Krondor books while writing the game. Trust me.) \n\n2. Betrayal in Antara - while Return to Krondor was billed as the sequal to Betrayal, Antara came between the two, and was, at the very least, set in the same universe (and featured the same game play. \n\n3. Return to Krondor - the finale to the game series. \n\n4. The complete works of Raymond E. Feist - Thanks go to frost999 for uploading these. This includes the books he wrote based on the Krondor games, and the many other books written before and after, based in the same universe. \n\n\nMy upload speed sucks, so do the community a favor: Download ALL of this torrent (even if you only want one of the games), and then seed, seed, seed! \n\nAnd remember the law of ethical P2P: Pay for what you can find and afford. Download what you can not. Share it all.","torrent":{"xt":"urn:btih:8abb7d5a83b74563962d471366d354c606bae4ef","amp;dn":"The+Krondor+-+Antara+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8abb7d5a83b74563962d471366d354c606bae4ef","infoHashBuffer":{"type":"Buffer","data":[138,187,125,90,131,183,69,99,150,45,71,19,102,211,84,198,6,186,228,239]},"announce":[],"urlList":[]}}