{"title":"Big pharma an sicko industrial fucker that just wants money","uid":3759004,"size":1763292758,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ad5f5e733eee7de374bc79d728f23fbf6193c1f&amp;dn=Big+pharma+an+sicko+industrial+fucker+that+just+wants+money&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"W8OR","files":6,"time":1185920738,"description":"How fucked we get by the pharmaceutical industry... total corruption\n\nBig Bucks, Big Pharma\n(45 min, Ronit Ridberg, 2005) Big Bucks, Big Pharma pulls back the curtain on the multi-billion dollar pharmaceutical industry to expose the insidious ways that illness is used, manipulated, and in some instances created, for capital gain. Media scholars and health professionals help us understand the ways in which direct-to-consumer (DTC) pharmaceutical advertising glamorizes and normalizes the use of prescription medication, and works in tandem with both industry-sponsored medical education/research and promotion to doctors. Big Bucks, Big Pharma challenges us to ask important questions about the consequences of relying on a for-profit industry for our health and well-being. From the Media Education Foundation.\n\nBig Pharma is one of Washington\\'s most powerful interest groups. \n============================================\nPBS.FRONTLINE.Dangerous.Prescription\nAs medications assume ever-larger roles in health care, the importance of FDA approval mounts. But what do average Americans know about the FDA process? What happens when a drug product harms consumers, and what role do drug companies play in approving and monitoring drugs? DANGEROUS PRESCRIPTION offers a FRONTLINE investigation into the FDA and drug safety, showing how effective the FDA is at identifying drugs that don\\'t work or cause harm.\nibobaine on\n\nWe Become Silent - The Last Days of Health Freedom (2006)\nInternational award-winning filmmaker Kevin P. Miller of Well TV announced the release of a new documentary about the threat to medical freedom of choice. \\'We Become Silent: The Last Days of Health Freedom\\' details the ongoing attempts by multinational pharmaceutical interests and giant food companies ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ in concert with the WTO, the WHO and others ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ to limit the publicÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s access to herbs, vitamins and other therapies.\n\\'We Become SilentÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ is narrated by Dame Judi Dench, the noted UK actress who has won multiple Golden Globe awards, an Oscar, and a Tony for her on-stage work, in addition to dozens of other honors throughout her prestigious career.\nhttp://video.google.com/videoplay?docid=451097355502728465&amp;q=we+become+silent\n\nWe Become Silent\nPharmaceutical giants and other globalized bureaucratic interests are threatening our very health freedoms. Our access to natural foods, vitamins, and herbs will be severely crippled, and eventually non existent.\nQUOTES FROM THIS DOCUMENTARY\n    ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½Fear preys on the most vulnerable among us. Fear sells. And nowhere is fear peddled more shamelessly than in the fields of medicine and human nutrition. And of course the fear mongers are also praying on fear of disease. And the solution that the fear mongers give us are drugs. Yet drugs are the single most dangerous thing we can put in our mouths.ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½\\&quot;Fear anesthetizes us. It coerces us, making us believe we can do little on our own to prevent or treat disease. And forces whole nations to kneel at the alters of the drug industries. ItÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s a sad fact that pharmaceuticals have become the dope of modern man. And make no mistake, we are addicted. Last year between 3 and 5 billion prescriptions were written in the U.S. alone.ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½\n    ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½But the fear machine is well oiled by petrochemical dollars, and a near worldwide monopoly in health care. It works overtime to prevent the truth about dietary supplements from getting out to the public. Governments, particularly in Europe and the United States seem all to eager to comply with the robber barons of health care.ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½\n    ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½There are some who say this battle cannot be won. We are the David, they are the Goliath. But itÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s too important to sit it out and allow the multinational corporations and the regulators to inform us what our freedoms should be. If we donÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½t demand medical freedom of choice we will lose it. ItÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s critical that the people of Europe, the people of Asia, Africa, the Americas and the rest of the world come together so we can protect our health freedom for our generation and those of the future.ÃƒÆ’Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½\n\n============================================\n\nAlso included is information about antiaddictive substances that big pharma don\\'t want to sell = cause there is no money in making humans independent. Good customers take their pill every day, huh.\n\nfor more information about very addictive drugs and a possible solution download:  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3757612/DEATH_DRUGS_and_a_possible_solution&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3757612/DEATH_DRUGS_and_a_possible_solution&lt;/a&gt;\n\n============================================= &lt;a href=&quot; http://thepiratebay.se/tor/3745546/Meth_torrent&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/tor/3745546/Meth_torrent&lt;/a&gt; biggest video collection ever about the very addictive drug meth amphetamine\n=============================================\nmethadone and fuck\n\n\n","torrent":{"xt":"urn:btih:8ad5f5e733eee7de374bc79d728f23fbf6193c1f","amp;dn":"Big+pharma+an+sicko+industrial+fucker+that+just+wants+money","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ad5f5e733eee7de374bc79d728f23fbf6193c1f","infoHashBuffer":{"type":"Buffer","data":[138,213,245,231,51,238,231,222,55,75,199,157,114,143,35,251,246,25,60,31]},"announce":[],"urlList":[]}}