{"title":"Refuge and Resilience - Promoting Resilience and Mental Health a","uid":12833690,"size":1855345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8afe4a30bb749e77b03e52140c8387dcfe651c46&amp;dn=Refuge+and+Resilience+-+Promoting+Resilience+and+Mental+Health+a&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1448416440,"description":"Refuge and Resilience - Promoting Resilience and Mental Health among Resettled Refugees and Forced Migrants (Springer, 2014).pdf\r\n\r\nTaking an interdisciplinary approach and focusing on the social and psychological resources that promote resilience among forced migrants, this book presents theory and evidence about what keeps refugees healthy during resettlement. The book draws on contributions from cultural psychiatry, anthropology, ethics, nursing, psychiatric epidemiology, sociology and social work.\r\n\r\nConcern about immigrant mental health and social integration in resettlement countries has given rise to public debates that challenge scientists and policy makers to assemble facts and solutions to perceived problems. Since the 1980s, refugee mental health research has been productive but arguably overly-focused on mental disorders and problems rather than solutions. Social science perspectives are not well integrated with medical science and treatment, which is at odds with social reality and underlies inadequacy and fragmentation in policy and service delivery. Research and practice that contribute to positive refugee mental health from Canada and the U.S. show that refugee mental health promotion must take into account social and policy contexts of immigration and health care in addition to medical issues. Despite traumatic experiences, most refugees are not mentally ill in a clinical sense and those who do need medical attention often do not receive appropriate care. As recent studies show, social and cultural determinants of health may play a larger role in refugee health and adaptation outcomes than do biological factors or pre-migration experiences. This book’s goal therefore is to broaden the refugee mental health field with social and cultural perspectives on resilience and mental health","torrent":{"xt":"urn:btih:8afe4a30bb749e77b03e52140c8387dcfe651c46","amp;dn":"Refuge+and+Resilience+-+Promoting+Resilience+and+Mental+Health+a","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8afe4a30bb749e77b03e52140c8387dcfe651c46","infoHashBuffer":{"type":"Buffer","data":[138,254,74,48,187,116,158,119,176,62,82,20,12,131,135,220,254,101,28,70]},"announce":[],"urlList":[]}}