{"title":"Dark Skies Invasion (2015) S01E01 Special Edition 720p","uid":11893148,"size":417938361,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8b8007a2918eb68fb49ad7b6ae0ec04862360ff8&amp;dn=Dark+Skies+Invasion+%282015%29+S01E01+Special+Edition+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"MovieMash","files":39,"time":1431059161,"description":"FAN EDIT - MASHUP - CROSSOVER\nSPECIAL EDITIONS VERSION 2.0 (New INTROs, New Credits, Higher Bitrates)\n\nSeason 1 Episode 1\nThe Silence embark throughout history altering our history as we know it. Spanning from the Jurassic age to 10,000 BC to the death of Christ continuing to the Wild West and up to Roswell 1947. This episode is short but takes you directly into episode 2\n\n**1280x544 Resolution** 720p HD Quality\n**Dolby Pro Logic Stereo*\n\nSeries OUTLINE:\nSelf contained fan edit films that has a slight hint of a continual storyline that connects each episode, but each Episode is considered a separate fan film set in the same universe. It is a soap opera drama of movies connecting into a bigger storyline or self contained watchable fan edit films. The concept surrounds the Silence Aliens from Doctor Who who try to invade our history through any means possible be it Alien abductions, Alien take overs, spiritual possession, or Alien zombie parasites. As the series continues each episode brings us closer to the silence, but every episode always remains as a self contained fan film.\n-------------------------\nSynopsis OUTLINE:\nHUMANITIES FINAL BATTLE AGAINST THE SILENCE.\n-------------------------\nThis series in a sense is a sequel to the hit 1996 series called &quot;Dark Skies&quot; on NBC which inspired this project to begin with.\nDark Skies TV show was a weekly TV show based around historical events that had a Alien Twist intertwined into history.\nMy series is kinda similar to this concept: Example: Apollo 11 they find Aliens on the moon&quot;\n\nEventually the story in later episodes stray away from Dark skies, but I tried to keep this crossover to historical events and time periods. Series starts in the ancient past and works it way up to our current future and beyond","torrent":{"xt":"urn:btih:8b8007a2918eb68fb49ad7b6ae0ec04862360ff8","amp;dn":"Dark+Skies+Invasion+%282015%29+S01E01+Special+Edition+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b8007a2918eb68fb49ad7b6ae0ec04862360ff8","infoHashBuffer":{"type":"Buffer","data":[139,128,7,162,145,142,182,143,180,154,215,182,174,14,192,72,98,54,15,248]},"announce":[],"urlList":[]}}