{"title":"Flanker 2.5 + Upgrade, &amp; Manuals (PC-XP)","uid":5142701,"size":535009488,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8b88caa7dbe21726ab43122139d02da8c2b469be&amp;dn=Flanker+2.5+%2B+Upgrade%2C+%26+Manuals+%28PC-XP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1257033639,"description":"Flanker 2.5 for PC - Windows 98, ME, or XP                         Rel. 03/26/2002\n\n\nFormat:        CD-R\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        Jet Combat Simulation\nPlatform:      PC - WinXP, 98, or ME Only (Failed to Install for Vista).\nProtection:    CD-Checks (No Crack Needed Just Mount Image and Play).\nRequirements:  Joystick Recommended \n\n\nCompressed with WinRar, Game was tested on XP and ran fine.\nTry 7zip its free google it, if you don't have WinRar.\n\n\nMinimum system requirements:\n\n*  Pentium III 300 MHz or equivalent\n*  32 MB RAM\n*  700 MB of free HDD space\n*  8 MB DirectX compatible graphics card\n*  DirectX compatible sound card\n*  8x CD-ROM\n\n\nRelease Notes - This Game will work for Win98, ME, or WinXP it doesn't work for \n                Vista.\n\n\nInstallation Instructions:\n\n1. Mount the Image with Dameon Tools (Included in Download).\n\n2. Install Game by running Setup.exe.\n\n3. Extract Patch 2.51 to Game directory If you want to upgrade.\n\n5. Make Sure ISO is mounted.\n\n6. If you have Windows XP go to Game Directory Right Click Flanker.exe click\n   properties, select compatibility for Win98/ME.\n\n7. If Your Firewall says Flanker 2.5 is attempting to montior user activies when\n   you run the game click allow and select remember settings or the game won't\n   run. (Don't worry it isn't virus or spyware its joystick and keycommands for \n   game).\n\n8. Done!\n\n\nNote: The 2.51 Patch may not work for the Training Missions, if you want to do \n      that don't use patch and stay with version 2.50. After you complete training \n      missions you can update later with the 2.51 patch if you want to.\n\n\nGame Description:\n\nDust off that old Joystick and get to Flying!\n\nFlanker 2.0 is the second major release of SSI's realistic air combat simulator based on the Russian Su-27 &amp; Su-33 Flanker. Like its predecessor, the game features a comprehensive simulation of the jets' avionics and weapons systems, with a focus on beyond-visual-range air-to-air combat. Mastery of the Flanker's various radar and weapon systems is essential to the player's survival, a task made all the more difficult by the fact that the instrumentation is entirely labeled in Russian.\n\nImprovements for this second release include 3D accelerated texture-mapped graphics and the addition of the Su-33 naval variant of the Flanker. The main difference would be that the Su-27 is a pure air superiority fighter while the Su-33 retains a ground attack role. Beyond that, however, there is little difference between the two planes.\n\nThe game underwent several updates, culminating in version 2.51. Incremental improvements included flight model and weapons model revisions, graphic and stability enhancements, the addition of wingman commands, and the ability to fly the MiG-29 jet fighter.\n\n\nGame Pics Included.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:8b88caa7dbe21726ab43122139d02da8c2b469be","amp;dn":"Flanker+2.5+%2B+Upgrade%2C+%26+Manuals+%28PC-XP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b88caa7dbe21726ab43122139d02da8c2b469be","infoHashBuffer":{"type":"Buffer","data":[139,136,202,167,219,226,23,38,171,67,18,33,57,208,45,168,194,180,105,190]},"announce":[],"urlList":[]}}