{"title":"Chemical Technology - An Integral Textbook","uid":14803625,"size":22972031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bac377ed41e9418411dbd5a92112b45379a2610&amp;dn=Chemical+Technology+-+An+Integral+Textbook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1465152047,"description":"Chemical Technology - An Integral Textbook - A. Jess, P. Wasserscheid (Wiley-VCH, 2013).pdf\r\n\r\nISBN 978-3-527-30446-2\r\n\r\nThis textbook provides an integral and integrated treatment of industrial-relevant problems for students of both chemistry and chemical engineering.\r\n\r\nAs such, this work combines the four disciplines of chemical technology - chemistry, thermal and mechanical unit operations, chemical reaction engineering and general chemical technology - and is organized into two main parts. The first covers the fundamentals, as well as the analysis and design of industrial processes, while the second section presents 20 concrete processes, exemplifying the inherent applied nature of chemical technology. These are selected so that they all differ with respect to at least one important aspect, such as the type and design of the reactor, the chemistry involved or the separation process used. As a result, readers will recapitulate, deepen and exercise the chemical and engineering principles and their interplay, as well as being able to apply them to industrial practice.\r\n\r\nInstructive figures, rules of thumb for swift but reliable estimating of parameters, data of chemical media, and examples utilizing data from industrial processes facilitate and enhance the study process. A small general survey of selected modern trends, such as multifunctional and micro reactors, or new solvents for homogeneous catalysis, such as ionic liquids, point out to the reader that this is not a concluded discipline,\r\nbut a developing field with many challenges waiting to be solved","torrent":{"xt":"urn:btih:8bac377ed41e9418411dbd5a92112b45379a2610","amp;dn":"Chemical+Technology+-+An+Integral+Textbook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bac377ed41e9418411dbd5a92112b45379a2610","infoHashBuffer":{"type":"Buffer","data":[139,172,55,126,212,30,148,24,65,29,189,90,146,17,43,69,55,154,38,16]},"announce":[],"urlList":[]}}