{"title":"Stossel.2013.09.12.[The World's Police].Fox Business.CF.avi","uid":8930474,"size":342857256,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8ca385b0ac148f385c7c3c135de8e49c1aa0885b&amp;dn=Stossel.2013.09.12.%5BThe+World%27s+Police%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"skJGZV6z","files":-1,"time":1379460438,"description":"----------\n\nSTOSSEL - [Are We the World's Police?] - Fox Business Network\n2013, September 12, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nI hate Bashar Al-Assad and what he's done in Syria. But I also hate what's going on in North Korea, Iran, Somalia, China, Russia, The Congo and other places around the world.\n\nSo when should America intervene? What's our responsibility as the world's biggest superpower?\n\nCongressman Steve Israel says Syria is a special case because they used chemical weapons and they must be held accountable.\n\nZuhdi Jasser, the founder and president of the American Islamic Forum for Democracy, says America should take action in Syria. He debates Fox News military analyst Colonel David Hunt, who is more skeptical.\n\nRecent polls show more Democrats than Republicans support a military strike. Is this hypocrisy... liberals and conservatives changing their position depending who holds the presidency? Historian Thaddeus Russell explains why he answers &quot;no.&quot;\n\nKarima Bennoune, author of &quot;Your Fatwa Does Not Apply Here,&quot; grew up in Algeria. She says both the right and the left don't know what they are talking about when it comes to the Middle East.\n\nSome Americans say, instead of bombing people... we should win hearts and minds with foreign aid, build schools, give them money and food. But Christopher Coyne, author of &quot;Doing Bad By Doing Good&quot; says we should stop all foreign aid.\n\nBut who in the government should decide when we go to war? What does the constitution say? Judge Andrew Napolitano explains.\n\nSome call those of us who don't want to go to war, &quot; isolationists&quot;. We libertarians are NOT isolationists. Let tourism flow. Let us trade with people of every nation. It's said, when goods cross borders, armies don't.\n\nThere are times when we have to go to war. This is not one of those times. I want to be engaged in the world without being in charge of it.","torrent":{"xt":"urn:btih:8ca385b0ac148f385c7c3c135de8e49c1aa0885b","amp;dn":"Stossel.2013.09.12.%5BThe+World%27s+Police%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ca385b0ac148f385c7c3c135de8e49c1aa0885b","infoHashBuffer":{"type":"Buffer","data":[140,163,133,176,172,20,143,56,92,124,60,19,93,232,228,156,26,160,136,91]},"announce":[],"urlList":[]}}