{"title":"Advanced Topics in Quantum Field Theory - A Lecture Course (Male","uid":8014487,"size":28324535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d2ece81012abd80e50a183361d5a9340ba60ac6&amp;dn=Advanced+Topics+in+Quantum+Field+Theory+-+A+Lecture+Course+%28Male&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1358078354,"description":"M. Shifman - Advanced Topics in Quantum Field Theory: A Lecture Course\nPublished: 2012-02-20 | ISBN: 0521190843 | PDF | 640 pages\n\n\nSince the advent of Yang-Mills theories and supersymmetry in the 1970s, quantum field theory - the basis of the modern description of physical phenomena at the fundamental level - has undergone revolutionary developments. This is the first systematic and comprehensive text devoted specifically to modern field theory, bringing readers to the cutting edge of current research. The book emphasizes nonperturbative phenomena and supersymmetry. It includes a thorough discussion of various phases of gauge theories, extended objects and their quantization, and global supersymmetry from a modern perspective. Featuring extensive cross-referencing from traditional topics to recent breakthroughs in the field, it prepares students for independent research. The side boxes summarizing the main results and over 70 exercises make this an indispensable book for graduate students and researchers in theoretical physics.\nDevoted specifically to modern field theory, this is an indispensable book for graduate students and researchers in theoretical physics. It emphasizes nonperturbative phenomena and supersymmetry, and discusses various phases of gauge theories, extended objects and their quantization, and global supersymmetry from a modern perspective.","torrent":{"xt":"urn:btih:8d2ece81012abd80e50a183361d5a9340ba60ac6","amp;dn":"Advanced+Topics+in+Quantum+Field+Theory+-+A+Lecture+Course+%28Male","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d2ece81012abd80e50a183361d5a9340ba60ac6","infoHashBuffer":{"type":"Buffer","data":[141,46,206,129,1,42,189,128,229,10,24,51,97,213,169,52,11,166,10,198]},"announce":[],"urlList":[]}}