{"title":"Alpha Protocol [EUR][PS3][Multi5][Spanish][www.consolasatope.com","uid":6063273,"size":5161714385,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:8d38bc94b810f3813dc40fb2673a728e73768430&amp;dn=Alpha+Protocol+%5BEUR%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"consolasatope","files":52,"time":1293213151,"description":"Plataforma: PS3\nGÃƒÂ©nero: Accion/RPG\nTematica: Espionaje\nRegiÃƒÂ³n: EUR\nDesarrollo: Obsidian Entertainment\nDistribuciÃƒÂ³n: SEGA\nIdiomas: Multi5 Spanish\nOnline: Si\nMultijugador: No\nFormato: FullBRD - 5.37 Gb\nCompresiÃƒÂ³n: Rar - 4.8 Gb\nHDD: Externo\nMÃƒÂ©todo de carga: Ps3key Firm 4.5 + iopen Manager 2.1I rev 2 stealth\n\nResumen:\nIntroduccion\nEn 2009, un misil de defensa estadounidense de alta tecnologÃƒÂ­a cae en manos enemigas y abate un vuelo comercial que sobrevuela la Europa del Este. Cientos de pasajeros y toda la tripulaciÃƒÂ³n mueren en el siniestro, y ahora queda descubrir a los culpables para darles su merecido. El responsable de la misiÃƒÂ³n serÃƒÂ¡ Michael Thorton, el agente del gobierno al que encarnarÃƒÂ¡s en el juego.\n\nSe trata una conspiraciÃƒÂ³n de plena actualidad donde podrÃƒÂ¡s moldear a Thorton a tu antojo e ir decidiendo poco a poco quÃƒÂ© habilidades te conviene perfeccionar. Conforme avances, podrÃƒÂ¡s ampliar tu repertorio de ataques, personalizar las armas como te plazca, servirte de ingeniosos artilugios o tender trampas. Pero ÃƒÂ¡ndate con ojo, porque cada paso que des (por pequeÃƒÂ±o que sea), harÃƒÂ¡ entrar en acciÃƒÂ³n al resto de los personajes: un sistema de reacciones inteligente que hace de Alpha Protocol el juego de rol mÃƒÂ¡s emocionante e imprevisible de todos los tiempos.\n\nCaracteristicas\nSistema de interacciÃƒÂ³n revolucionario: En el mundo del juego, inspirado en el rol, todo lo que hagas y digas determinarÃƒÂ¡ el curso de los acontecimientos, asÃƒÂ­ que piensa bien lo que haces. Este efecto dominÃƒÂ³, caracterÃƒÂ­stico de Alpha Protocol, harÃƒÂ¡ que los encuentros con tus aliados y enemigos afecten a tus relaciones, den giros a la trama o te den acceso a nuevas misiones.\nDomina el oficio: Moldea a Thorton a tu antojo. Perfecciona la punterÃƒÂ­a y las tÃƒÂ©cnicas de ataque cuerpo a cuerpo mÃƒÂ¡s mortÃƒÂ­feras, aprende a usar artilugios de todo tipo y mucho mÃƒÂ¡s.\nArmado hasta los dientes: Accede a un inmenso arsenal de armas y personalÃƒÂ­zalas con innumerables accesorios.\nÃ‚Â¿En quiÃƒÂ©n confiar?: A lo largo del juego, Thorton se las verÃƒÂ¡ con todo un elenco de amigos y enemigos. La clave es ir forjando relaciones mediante el sistema de diÃƒÂ¡logo para conseguir informaciÃƒÂ³n privilegiada, obtener armas nuevas y mucho mÃƒÂ¡s. Recuerda que tÃƒÂº decides en quiÃƒÂ©n y cuÃƒÂ¡ndo depositar tu confianza.\nElige tu propia senda: Recuerda que todas tus decisiones tienen consecuencias inmediatas y que no hay respuestas correctas ni incorrectas, sino que cada jugador vivirÃƒÂ¡ una historia ÃƒÂºnica con distintos finales. TÃƒÂº decides si te conviene dejar escapar a un terrorista y seguir otro rastro o si te vendrÃƒÂ­a bien liquidar a un objetivo aunque les lleves la contraria a tus superiores","torrent":{"xt":"urn:btih:8d38bc94b810f3813dc40fb2673a728e73768430","amp;dn":"Alpha+Protocol+%5BEUR%5D%5BPS3%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d38bc94b810f3813dc40fb2673a728e73768430","infoHashBuffer":{"type":"Buffer","data":[141,56,188,148,184,16,243,129,61,196,15,178,103,58,114,142,115,118,132,48]},"announce":[],"urlList":[]}}