{"title":"Hi-Tek - Hi-Teknology 2 - The Chip (2006)","uid":4336277,"size":75392166,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8dc73639dd26aa893594f1244d617153c1f5157c&amp;dn=Hi-Tek+-+Hi-Teknology+2+-+The+Chip+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cancelchristmas","files":-1,"time":1218329679,"description":"Hi-Tek&amp;#039;s second installment of his Hi-Teknology saga is a much more balanced, and finer product than the first. The young, inspiring producer has obviously learned quite a lot as one of Aftermath&amp;#039;s heavyweight producers, with Dr. Dre as his mentor, and Dre&amp;#039;s influence on Tek is evident in a few of the tracks on this album. At the same time, Hi-Tek&amp;#039;s production remains as original as its ever been.\n\nTracks like &quot;Where It Started At,&quot; which is one of the hottest singles released this year, put this album in the territory it&amp;#039;s reached. Jadakiss, Papoose, Raekwon, and Talib all guest on that song, and as can be expected from those four talented emcees, this posse cut is undeniably ill. Dion is also on the hook, and he finds himself on this album quite a good bit; which is actually welcome, seeing as he has a pleanant tone of voice, which is different from most R&amp;B cats out today.\n\n&quot;1-800 Homicide&quot; is, musically, a trip back to Dre&amp;#039;s style on 2001; in fact, the beat would sound completely at home on that album had it not come out 7 years ago. The Game and Dion are both on this track, and while The Game delivers his typical name-dropping fare, Dion provides an infectious hook, and the beat is too hard to pass up. It&amp;#039;s only a shame how criminally short this song is.\n\n&quot;Music For Life&quot; is the most powerful cut on the album, featuring Busta Rhymes, Nas, Marsha(of Floetry), Common, and the late Dilla. Now, while I&amp;#039;m all for preserving Dilla&amp;#039;s legacy, and I know his friends lost a great person, I really think that he&amp;#039;s being slightly over-exposed by his friends, as he&amp;#039;s had numerous songs in dedication to him on some of 2006&amp;#039;s most acclaimed releases. I say this out of complete respect for Jay Dee himself; I don&amp;#039;t want to see his legacy disgraced in the same way other hip-hop artists are after they leave this earth. Nonetheless, this is still an amazing song. Everyone drops an ill verse, and the production is top-notch, much like everything else found on the album.\n\nOther stand-out tracks include &quot;The Chip,&quot; &quot;Keep It Moving,&quot; &quot;Josephine,&quot; and &quot;So Tired.&quot; With the all-star casts, including hip-hop heavyweights like Ghostface Killah, Q-Tip, Busta Rhymes, Raekwon, Common, Talib Kweli, The Game, Jadakiss, and Nas, to highly underrated emcees like Devin The Dude, Bun B, and Papoose, this album delivers from start to finish, and should move a decent amount of units. No matter how well it sells, it&amp;#039;s still one of this year&amp;#039;s finest achievements, and Hi-Tek was able to compile one dope album.\n\n\nTracklist:\n\n 1. The Oracle (intro) - 0:15\n 2. The Chip - 1:41\n 3. Keep It Moving Feat. Dion, Q-tip &amp; Kurupt - 4:01\n 4. Think I Got A Beat Feat. Lil&amp;#039; Tone - 1:37\n 5. Can We Go Back Feat. Talib Kweli &amp; Ayak - 3:23\n 6. Josephine Feat. The Willie Cottrell Band, Ghostface Killah &amp; Pretty Ugly - 4:41\n 7. March Feat. Busta Rhymes - 4:01\n 8. Where It Started At (ny) Feat. Dion, Jadakiss, Papoose,Talib Kweli &amp; Raekwon - 4:45\n 9. 1-800-homicide Feat. The Game &amp; Dion - 1:44\n10. Money Don&amp;#039;t Make U Rich Feat. Strong Arm Steady - 3:26\n11. Baby We Can Do It Feat. Nok &amp; Haze (czarnok) - 3:37\n12. Let It Go Feat. Dion &amp; Talib Kweli - 3:55\n13. People Going Down Feat. The Willie Cottrell Band - 2:50\n14. So Tired Feat. Dion, Bun B., Devin The Dude &amp; Pretty Ugly - 4:51\n15. Music For Life Feat. J. Dilla, Nas, Common, Busta Rhymes &amp; Marsha Ambrosius Of Floetry - 6:48","torrent":{"xt":"urn:btih:8dc73639dd26aa893594f1244d617153c1f5157c","amp;dn":"Hi-Tek+-+Hi-Teknology+2+-+The+Chip+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc73639dd26aa893594f1244d617153c1f5157c","infoHashBuffer":{"type":"Buffer","data":[141,199,54,57,221,38,170,137,53,148,241,36,77,97,113,83,193,245,21,124]},"announce":[],"urlList":[]}}