{"title":"Caminando entre Dinosaurios 1 sangre nueva [DVDRip][Spanish]","uid":6407840,"size":542107776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e22a2cd7d71715326920dff44c0d72f790ea99a&amp;dn=Caminando+entre+Dinosaurios+1+sangre+nueva+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"virana","files":-1,"time":1305876438,"description":"Caminando entre Dinosaurios\n\n\n\nSi existe una serie de documentales por excelencia que hable del mundo de los dinosaurios y sea mundialmente conocida, ÃƒÂ©sa es &quot;Caminando entre Dinosaurios&quot;. Esta serie de documentales fue una gran innovaciÃƒÂ³n por parte de la BBC ya que mostrÃƒÂ³ a los animales como podrÃƒÂ­an haber vivido, como se cree que vivieron despuÃƒÂ©s de tantos aÃƒÂ±os de estudios de sus fÃƒÂ³siles, en lugar de mostrar a paleontÃƒÂ³logos y cientÃƒÂ­ficos hablando del tema.\n\nOs dejo una reseÃƒÂ±a que encontrÃƒÂ© en la que hablan de la serie y muestra un ÃƒÂ­ndice de contenidos de los capÃƒÂ­tulos:\n\nTitulo Original: Walking with Dinosaurs\nAÃƒÂ±o: 1999\nDuracion: 6 episodios de 30'\nPais: Reino Unido\nDirector: John Lynch\nGuion: Andrew Wilks\nProductora: BBC\n\nSinopsis:\n\nLa serie creÃƒÂ³ una nueva lÃƒÂ­nea en los documentales sobre dinosaurios. En lugar de basar el metraje en la usual sucesiÃƒÂ³n de entrevistas a paleontÃƒÂ³logos y escenas de excavaciones y museos, los episodios de Walking with Dinosaurs se desarrollan como los documentales comunes sobre vida salvaje, tomando un animal como protagonista y mostrando su interacciÃƒÂ³n diaria con el medio, sus presas, depredadores y otros seres vivos que lo rodean. Varios lugares de Nueva Caledonia, Estados Unidos, Chile y Australia, entre otros, se seleccionaron para recrear los ecosistemas mesozoicos de Europa, AmÃƒÂ©rica y la AntÃƒÂ¡rtida debido a su flora similar a las comunes en cada una de las ÃƒÂ©pocas mostradas. En cuanto a los animales, la mayorÃƒÂ­a fueron reconstruidos y animados por ordenador, aunque en algunos casos se optÃƒÂ³ por construir animatrÃƒÂ³nics (sobre todo para los primeros planos) y en muy contadas ocasiones se usaron &quot;animales-actores&quot; para dar vida a sus primitivos parientes (caso del tuÃƒÂ¡tara y la cacerola de las Molucas). En todo momento, los animadores y guionistas contaron con el asesoramiento de expertos en dinosaurios como Peter Dodson, Peter Larson y James Farlow, a los que se puede ver en el CÃƒÂ³mo se hizo explicando el por quÃƒÂ© los Diplodocus no podÃƒÂ­an levantar el cuello mÃƒÂ¡s allÃƒÂ¡ de sus hombros o a quÃƒÂ© se debe el que no aparezca en la serie ninguna de las populares peleas entre el Tyrannosaurus rex y algÃƒÂºn dinosaurio cornudo.\n\n\n\nInformaciÃƒÂ³n:\n\nCapitulo 1 - Sangre Nueva\n\nHace 220 millones de aÃƒÂ±os, TriÃƒÂ¡sico superior, Arizona. Los dinosaurios son todavÃƒÂ­a un grupo de reciente apariciÃƒÂ³n, poco diversificado y no muy abundante, pero que comienza a desplazar a otros animales mÃƒÂ¡s primitivos como los cinodontos, dicinodontos y arcosaurios basales. Animales que aparecen:\n\n\n\nCoelophysis (dinosaurio terÃƒÂ³podo)\nPeteinosaurus (pterosaurio)\nPlacerias (dicinodonto)\nPlateosaurus (dinosaurio prosaurÃƒÂ³podo)\nPostosuchus (arcosaurio basal)\nThrinaxodon (cinodonto)\nDipnoo sin identificar.\nLibelula (vida real).\n\nLugar de filmaciÃƒÂ³n: Nueva Caledonia","torrent":{"xt":"urn:btih:8e22a2cd7d71715326920dff44c0d72f790ea99a","amp;dn":"Caminando+entre+Dinosaurios+1+sangre+nueva+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e22a2cd7d71715326920dff44c0d72f790ea99a","infoHashBuffer":{"type":"Buffer","data":[142,34,162,205,125,113,113,83,38,146,13,255,68,192,215,47,121,14,169,154]},"announce":[],"urlList":[]}}