{"title":"Slipknot 9.0 Live [FLAC+MP3](Big Papi) 2-CD Set","uid":9861788,"size":1142358922,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8e4d3f721238bb593af3e3f74408bd148d89f094&amp;dn=Slipknot+9.0+Live+%5BFLAC%2BMP3%5D%28Big+Papi%29+2-CD+Set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Big-Papi","files":54,"time":1396308112,"description":"Source: Roadrunner Records 168 618 115-2 2-CD Set + Fresh Cover Art Scan\n\n\n\nOMG just hear the drums banging.  The drums.......the drums.....the drums.....\n\n- Big Papi\n\n\nBy John\nNow, for every 10 people that love this band, there are 10 that despise them. Isn't that the great thing about opinions? Well, i'm sure by reviewing this I may be alienating myself from the underground BM scene for which I have loved many years. However, I don't care. I have been a Slipknot fan since 99. This is easily their best, it seems they are slightly limited in the studio, live though, nothing holds them back. The song's sound twice as heavy and they did a great job. I have always been a fan of live albumm's so this was a great suprise. i remember watching the &quot;Disasterpieces&quot; dvd a few years ago and hoping for a live album. I figured if the new album did well, there would be a good chance a live album would appear. Well, i'm sure you know the rest of the story. This is Slipknot. This is live in the eye of the storm.\n\nChapter no. 1:\n\n1. The Blister Exists: After a short intro, the song kicks into full gear and is much heavier than the studio version. Great way to kick off the album. 5/5\n\n2. (Sic): Classic song from their first album. The drumming is wonderful and it really gets your blood pumping. Exspecially 23 seconds into it when the classic &quot;Here comes the pain.&quot; sample plays. 5/5\n\n3. Disasterpieces: My favorite Slipknot song ever. &quot;Are you ready for a f**king war?&quot; The song fully kicks in 1 minute into it. Corey's vocals aren't as dark as they are on the album but still great. 10/5\n\n4. Before I Forget: An emotional track. My favorite song off of Vol.3 the live version is as good as the studio one, Corey's vocals are awesome here. James guitar is even better that the studio 5/5\n\n5. Left Behind: Lead single off the Iowa album, I would have rather seen &quot;My Plague&quot; rather than this but still a great song. 4.5/5\n\n6. Liberate: as soon as Mick starts that single riff, you can FEEL the excitement in the crowd, the song does not dissapoint, live version is better than the studio one actually. 5/5\n\n7. Vermilion: I never was really sure of this song on the Vol. 3 album (part one or two) I t hought there we pretty good but never though that highly of them. However, like many songs they're actually better live. This is no exception. Corey's vocal's are almost spoken word like at the start. Haunting song live. 6/5\n\n8. Pulse of the Maggots: When I first heard this song a few months prior to the release of Vol. 3 I always thought this would be a song that they would rip up live (in a positive way) they don't let down. The siren kicks in and Corey's passionate intro/speech. Then Chris, Clown and Joey kick in with their drumming. A song to get hte blood pumping.\n\n9. Purity: &quot;This next song...is about a girl in a box&quot; On the first version of the &quot;Slipknot&quot; album. My second favorite Slipknot song ever. A truly dark and gritty song. Great live as well. One of the best here. 10/5\n\n10. Eyeless: Another classic track from their first album, 133's influences really shine here. 4.5/5\n\n11. Drum Solo: A long solo from Joey. Showing how great of a drummer he is. I mean, if he could fill in for Frost during Satyricon's American tour, I would not exspect anything less.4/5\n\n12. Eeyore: Hidden track from their first album. A song that just crushes, a mosh pit anthem at Slipknot shows. A good way to finsih off the first disk. Some of the most distorted guitar's Slipknot has ever used. 4.5/5\n\nChapter no. 2:\n\n1. Three Nil: Definetly a favorite of mine off Vol. 3. This song builds into a giant. Sid shines here. 4.5/5\n\n2. the Nameless: I always enjoyed this track and it is actually better live too. The clean guitar portions are very emotional and so are Corey's vocals. One of the highlights off disk 2. A good suprise 5/5\n\n3. Skin Ticket: a song Slipknot NEVER played live before. Corey even announces they have never done it live vefore and it may be a &quot;train wreck&quot; it isn't though. It loses some of the atmosphere the studio version has. Still great though. Anything but a train wreck. 5/5\n\n4. Everything Ends: Another track I didn't exspect to hear. A fast paced song, with lyrics regarding Corey's attempted suicide as a teen over you guessed it....an ex-girlfriend. Joey does an incredible job here. Corey has a great &quot;speech&quot; at the end of this song. 4.5/5\n\n5. The Heretic Anthem: A true &quot;anthem&quot; from the &quot;Iowa&quot; album. has the o so classic chorus. Another song which is better live. Corey's &quot;speech&quot; in the previous song is actually refering to this one. 5/5\n\n6. Iowa: Geez, does Paul do a great job here. I love his bass here. A classic song, which is actually suprising to hear live. One of the darkest songs Slipknot has to offer. The atmosphere is still here. 5/5\n\n7 Duality: Lead single off of Vol.3 Corey's vocals in the intro always remidned me of &quot;Wait &amp; Bleed&quot; crowd really gets into this one. 5/5\n\n8. Spit it out: Actually, my favorite song off this album. So much better than the studio version. Few songs get me as pumped as &quot;Spit it Out&quot; live does. The studio version is about 2:30 minutes the live version is 5:29. The whole &quot;Zero Bulls**t&quot; thing is great. This is the song with the most crowd interaction. 25/10.\n\n9. People = S**t: One of the most &quot;fist pumping&quot; song's off &quot;Iowa&quot; is even more intense live. One of the heaviest song's here. 5/5.\n\n10. Get This: Lyric wise, a joke song. Off the &quot;Slipknot&quot; digi-pack. Hyper and fun is the best way to describe this. 4/5\n\n11. Wait and Bleed: more haunting vocals from Corey. Classic song and beautiful lyrics. The crowd is singing along the whole time. 6/5\n\n12. Surfacing: Classic live song. Also, the perfect closing song. Between the lovable angst in the chorus to Mick's screeching guitar. A memorable end to a memorable album. 5/5\n\nSo, in conclusion. This is one of my favorite live album's as well as my favorite Slipknot album. If you love slipknot, get this know. They're not called one of the best live acts ever for nothing.\n\n\n---------------------------------------------------------------------\nSlipknot - 9.0: Live\n---------------------------------------------------------------------\n\nArtist...............: Slipknot\nAlbum................: 9.0: Live\nGenre................: Pop/Rock\nSource...............: CD\nYear.................: 2005 11 01\n\nFLAC\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 71 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 264kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n--------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Slipknot - The Blister Exists [06:24]\n2. Slipknot - Three Nil [05:03]\n3. Slipknot - (Sic) [03:52]\n4. Slipknot - The Nameless [05:28]\n5. Slipknot - Disasterpiece [06:47]\n6. Slipknot - Skin Ticket [06:03]\n7. Slipknot - Before I Forget [04:24]\n8. Slipknot - Everything Ends [05:03]\n9. Slipknot - Left Behind [03:44]\n10. Slipknot - The Heretic Anthem [04:08]\n11. Slipknot - Iowa [06:37]\n12. Slipknot - Liberate [03:48]\n13. Slipknot - Duality [06:07]\n14. Slipknot - Vermilion [05:55]\n15. Slipknot - Pulse of the Maggots [05:06]\n16. Slipknot - Spit It Out [05:29]\n17. Slipknot - People = S#!t [05:53]\n18. Slipknot - Purity [05:12]\n19. Slipknot - Eyeless [04:19]\n20. Slipknot - Get This [02:44]\n21. Slipknot - Drum Solo [03:58]\n22. Slipknot - Wait and Bleed [03:44]\n23. Slipknot - Eeyore [02:16]\n24. Slipknot - Surfacing [05:50]\n\nPlaying Time.........: 01:58:06","torrent":{"xt":"urn:btih:8e4d3f721238bb593af3e3f74408bd148d89f094","amp;dn":"Slipknot+9.0+Live+%5BFLAC%2BMP3%5D%28Big+Papi%29+2-CD+Set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e4d3f721238bb593af3e3f74408bd148d89f094","infoHashBuffer":{"type":"Buffer","data":[142,77,63,114,18,56,187,89,58,243,227,247,68,8,189,20,141,137,240,148]},"announce":[],"urlList":[]}}