{"title":"Altern 8 - Full On Mask Hysteria (FLAC - EAC)","uid":6502559,"size":449593012,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8ee5dd18047c96b63d1692249afbc8446bd07b5f&amp;dn=Altern+8+-+Full+On+Mask+Hysteria+%28FLAC+-+EAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1309300130,"description":"Altern 8: Profile\n\nAltern-8 is an Early UK Rave music duo band featuring Mark Archer and Chris Peat. They were one of the UK rave\nbands of the late 1980s and early 1990s whose trademark was loud electronic tracks with a heavy bass line.\nAltern-8's members wore facemasks and chemical warfare suits. The band was signed to Network Records\nbased in Stratford House, Birmingham, England.\n\nAltern-8 was formed in Stafford in 1990, as a side project to the already successful Nexus 21\n(a name chosen because of its &quot;futuristic House sound), when both members were 21. From the outset the\nband's objective was to develop their style which was heavily influenced by the musical elements of other\nDetroit House music artists Derrick May, Juan Atkins and Kevin Saunderson, as well as the Chicago sound\nof Phuture and early electronic heroes Kraftwerk.\n\nAltern-8 tunes changed the world of Rave music, influencing many artists, with their mixture of the sounds\nof the Roland TB-303, 808 and 909 with breakbeats and familiar samples. At the time in the UK, outdoor\nrave events were legal, and Altern-8 had a reputation for turning up to play at major unofficial events.\nThey helped to define harder House tracks relying more heavily on bass and volume. The use of more\nbass and eclectic noises gradually evolved Altern-8's music away from the earlier House music style.\nThe duo, dressed in chemical warfare suits and dancing &quot;like electrified monkeys&quot;,\ntook part in a large number of live performances.\n\nNotable Altern-8 tracks include &quot;Activ-8&quot;, &quot;E-vapor-8&quot;, &quot;Frequency&quot;, &quot;Brutal-8-E&quot;, &quot;Armageddon&quot;, &quot;Move my body&quot;,\n&quot;Hypnotic St-8&quot; and &quot;Infiltrate 202&quot;. The band produced an album on the Network Records label in 1992\ncalled Full On... Mask Hysteria. However when Rave music went out of fashion they started to get involved in the\nevolution of Dance music, an off-shoot of Rave music. In 1992, Peat entered as a candidate for the Stafford constituency\nin the General Election representing the Hardcore (Altern8-ive) party. He polled 158 votes and finished in fourth place.\nIn 1993, Archer began producing as Slo Moshun with Danny Taurus, responsible for Bells of N.Y., and Xen Mantra.\n\nAltern-8's somewhat surreal image made for dramatic photographs and videos, but the same PR that helped to sell\ntheir music was eventually used against the rave movement, as the UK tabloid press published stories about the\ndangers of ecstasy, illegal raves and their impact on the countryside, resulting in the Criminal Justice and Public Order\n\n\n\nAlbum Reviews (c/o www.discog.com)\n\nAn absolute masterclass in old school breaks, sampling and down right funky hardcore.\nThese guys set the bar not only for their tunes but for their amazing live show. I had the the pleasure and\nthe privilege of seeing them perform this entire album in Orlando Fl in 1992. Stunning.\nThis record is a must have for anyone that considers themselves old school.\nThe top tracks on this release are:\nInfiltrate 202\nE-Vapor-8 with it's infectious female vocal\nHypnotic ST-8\nBrutal-8-E\n\nGreat to see this available as an official reissue, as it had become rather expensive to get\nhold of, and with extra trax too. But true collectors need not fear, the original pressing remains the real thing,\nas it is disappointing to find this reissue dogged by a common mastering fault in this &quot;every man and his dog\ncan master using PC / mac / media player / itunes&quot; age. Every track is separated by a 2 second gap,\nand given that many of the tracks run together with effects, crowd noise etc, this spoils the flow of the\nalbum when on continuous play.\n\nLike the first reviewer i have just managed to get a mint copy for a reasonable price.\nThis album holds its price more consistently than any other rave album-Compilation. That tells you\nsome think.All the tracks our brilliant rave stompers recieving massive play at large scale raves.If your\ninto your old skool you will no that altern 8 appeared on &quot;top of the pops&quot; sporting there whacky image.\nThey got the camera man to zoom in on the &quot;vicks vapour rub&quot;.A nudge'nudge wink'wink to the ravers.\nwhich completly by passed the bbc sensors ! Because they just did not get it.I think this album is excellant\nbut the prodigy's experience expanded version is just a little bit better sounding thats my personal opinion\nthats not to say this is any less of an album.You will notice there tracks appeared in most compilations this\nshows how popular they were. Even thou some of the tunes have a commercial feel to them they have\naged extremely well.I play the cd all the time my favorites our &quot;Move My Body&quot;and infiltrate 202\n\n\n\n---------------------------------------------------------------------\nAltern 8 - Full On Mask Hysteria\n---------------------------------------------------------------------\n\n\nArtist..................................: Altern 8\nAlbum......................: Full On Mask Hysteria\nGenre......................................: House\nSource........................................: CD\nYear........................................: 1992\n\nRipper: Exact Audio Copy 1.0 b1 &amp; HL-DT-STDVDRRW GSA-H20L\n\nCodec...........: Free Lossless Audio Codec (FLAC)\nVersion.........: reference libFLAC 1.2.1 20070917\nQuality.......: Lossless, (avg. compression: 54 %)\nChannels..............: Stereo / 44100 HZ / 16 Bit\nTags...............................: VorbisComment\n\nInformation...: Original 1992 14 track UK pressing\n\nRipped by.............: BSW on 6/28/2011\nPosted by.............: BSW on 6/28/2011\nNews Server..........: news.astraweb.com\n\nNews Group(s).: alt.binaries.sounds.mp3.metal.full.albums\n\nIncluded....: NFO, SFV, M3U, LOG, CUE\nCovers................: Front Back CD\n\n\n\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n\n1. Move My Body [04:56]\n2. Infiltrate 202 [05:36]\n3. E-Vapor-8 [05:19]\n4. 8's Revenge [04:29]\n5. Frequency [05:27]\n6. Real Time Status [04:47]\n7. First Of May [05:12]\n8. Hypnotic ST-8 [05:23]\n9. Activ-8 [05:32]\n10. Brutal-8-E [05:48]\n11. A D-8 With Plezure [05:54]\n12. Armageddon [05:49]\n13. Give It To Baby [04:47]\n14. Re-Indulge [06:12]\n\n\nPlaying Time.........: 01:15:17\nTotal Size..........: 407.32 MB\n\nNFO generated on.....: 6/26/2011 12:51:04 AM\n\n\n\n---------------------------------------------------------------------\n\nBarcode: 5 016846 104425 &gt;\nMatrix Number: TOPCD1 10195541 03 % MADE IN U.K. BY PDO\n\n---------------------------------------------------------------------\n\n\n:: Generated by Music NFO Builder v1.21a - www.nfobuilder.com ::\n","torrent":{"xt":"urn:btih:8ee5dd18047c96b63d1692249afbc8446bd07b5f","amp;dn":"Altern+8+-+Full+On+Mask+Hysteria+%28FLAC+-+EAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ee5dd18047c96b63d1692249afbc8446bd07b5f","infoHashBuffer":{"type":"Buffer","data":[142,229,221,24,4,124,150,182,61,22,146,36,154,251,200,68,107,208,123,95]},"announce":[],"urlList":[]}}