{"title":"Pale Blue Dot","uid":14350505,"size":153180951,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8ee98587363b6c949593a15e83c01c7a41fb1943&amp;dn=Pale+Blue+Dot&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Beanhh123","files":24,"time":1461019241,"description":"In a tour of our solar system, galaxy and beyond, Cornell astronomer Sagan meshes a history of astronomical discovery, a cogent brief for space exploration and an overview of life-from its origins in the oceans to humanity's first emergence to a projected future where humans ``terraform'' and settle other planets and asteroids, Earth having long been swallowed by the sun. Maintaining that such relocation is inevitable, the author further argues that planetary science is of practical utility, fostering an interdisciplinary approach to looming environmental catastrophes such as ``nuclear winter'' (lethal cooling of Earth after a nuclear war, a widely accepted prediction first calculated by Sagan in 1982). His exploration of our place in the universe is illustrated with photographs, relief maps and paintings, including high-resolution images made by Voyager 1 and 2, as well as photos taken by the Galileo spacecraft, the Hubble Space Telescope and satellites orbiting Earth, which show our planet as a pale blue dot. A worthy sequel to Sagan's Cosmos","torrent":{"xt":"urn:btih:8ee98587363b6c949593a15e83c01c7a41fb1943","amp;dn":"Pale+Blue+Dot","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ee98587363b6c949593a15e83c01c7a41fb1943","infoHashBuffer":{"type":"Buffer","data":[142,233,133,135,54,59,108,148,149,147,161,94,131,192,28,122,65,251,25,67]},"announce":[],"urlList":[]}}