{"title":"The Beatles - This Boy [original promo].VOB","uid":9932172,"size":71368704,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:90aef369c79d061ca5e5e5f1c19f6d95f48ebc93&amp;dn=The+Beatles+-+This+Boy+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1397117057,"description":"The Beatles - This Boy [original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;This Boy&quot; is a song by English rock band the Beatles released in November 1963 as the B side of the British Parlophone single &quot;I Want to Hold Your Hand&quot;. The Beatles performed it live on 16 February 1964 for their second appearance on The Ed Sullivan Show. It also appears as the third track on side one of the American release, Meet the Beatles!. &quot;This Boy&quot; was remastered for compact disc by George Martin and released in 1988 on the Past Masters, Volume One compilation. On 9 September 2009 it was re-released on the two CD set Past Masters, as part of the remastering of the original Beatles' catalogue, and was included in The Beatles Stereo Box Set and in The Beatles in Mono box set.\n\nIts composition was an attempt by John Lennon at writing a song in the style of Motown star Smokey Robinson, specifically his song &quot;I've Been Good To You&quot;, which has similar circular doo-wop chord changes, melody and arrangement. The tune and arrangement also has an uncanny resemblance to 'You Don't Understand Me', a B side to a Bobby Freeman single. Paul McCartney cites the Teddy Bears' 1958 hit &quot;To Know Him Is To Love Him&quot; as also being influential. Lennon, McCartney, and George Harrison join together to sing an intricate three-part close harmony in the verses and refrain\n\nThe Beatles recorded &quot;This Boy&quot; on 17 October 1963. On the same day they recorded &quot;I Want To Hold Your Hand&quot;, the group's first fan club Christmas single, and a version of &quot;You Really Got A Hold On Me&quot;.\n\nThey recorded fifteen takes of &quot;This Boy&quot;, followed by two overdubs. The song was recorded with a rounded ending, although it was faded out during a mixing session on 21 October. Two takes were joined together to make the final master, with the edit between the middle eight and final verse (1:28).\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/This_Boy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/This_Boy&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/manafaaFH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/manafaaFH&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:02:07\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:90aef369c79d061ca5e5e5f1c19f6d95f48ebc93","amp;dn":"The+Beatles+-+This+Boy+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90aef369c79d061ca5e5e5f1c19f6d95f48ebc93","infoHashBuffer":{"type":"Buffer","data":[144,174,243,105,199,157,6,28,165,229,229,241,193,159,109,149,244,142,188,147]},"announce":[],"urlList":[]}}