{"title":"Transport Tycoon Deluxe (OpenTTD 6.0.3 for Win32)","uid":4775821,"size":6049554,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:90db19fdfef9d1f74ff92eaf005c699e5e6d40ba&amp;dn=Transport+Tycoon+Deluxe+%28OpenTTD+6.0.3+for+Win32%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Eddon","files":-1,"time":1237210534,"description":"Open TTD 6.0.3 for Windows 2000/XP/Vista (32 bit) with all required data and no graphic modifications in one self-extracting 7-Zip file.\n\n\n\nTRANSPORT TYCOON DELUXE (TTD) is a computer game developed by Chris Sawyer and published by MicroProse in 1995. It is business simulation game, presented in an isometric view in 2D with 8-bit graphic by Simon Foster, in which the player is in control of a transport company, and can compete against rival companies to make as much profit as possible by transporting passengers and various goods by road, rail, sea or by air.\n\nOPENTTD duplicates the original game's features but also has numerous additions, including canals, revised rail station construction, and additional airports. Perhaps the most significant feature compared to the original game is its multiplayer capability. It offers LAN and Internet play via public, worldwide servers for up to eleven players. OpenTTD also includes numerous usability improvements not present in Transport Tycoon Deluxe.\nIt incorporates many features from TTDPatch, and like TTDPatch is available under the GNU GPL.\nThe game's legality has been questioned by some, since the initial versions were created by disassembling the binary from the official release.\n\n(c) Wikipedia","torrent":{"xt":"urn:btih:90db19fdfef9d1f74ff92eaf005c699e5e6d40ba","amp;dn":"Transport+Tycoon+Deluxe+%28OpenTTD+6.0.3+for+Win32%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90db19fdfef9d1f74ff92eaf005c699e5e6d40ba","infoHashBuffer":{"type":"Buffer","data":[144,219,25,253,254,249,209,247,79,249,46,175,0,92,105,158,94,109,64,186]},"announce":[],"urlList":[]}}