{"title":"Carmen Boulter - The Pyramid Code","uid":5185452,"size":1037449216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:911e98e016d5da6c8d13f7411088c4e8bcb248e7&amp;dn=Carmen+Boulter+-+The+Pyramid+Code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bravos2u","files":-1,"time":1259442877,"description":"The Pyramid Code is a fascinating new five-part series that explores the pyramid fields and temples in Egypt and megalithic sites around the world, looking for clues to sophisticated technology in the ancient world. The series is based on the extensive research done in Egypt and around the world by Dr. Carmen Boulter of the University of Calgary. The Pyramid Code features interviews with geologists, physicists, archaeologists, engineers, and authors and asks the questions: Who were the ancients and what did they know? Could the pyramids be much older than traditional Egyptology would have us believe? Could it be that the ancients were more technologically advanced than we are today? Why do we have so little understanding of the ancient Egyptians?\n\nThe Pyramid Code episodes\n\n1. The Band of Peace\n\nThis episode raises questions about the purpose of the pyramids, challenging the story traditional Egyptology tells. See rare footage of six distinct pyramid sites near the Great Pyramid, with evidence of superior technology and sophisticated knowledge of science and the cosmos.\n\n2. High Level Technology\n\nIn this episode, evidence that the Ancient Egyptians used high level technology to construct pyramids and temples is shown. Scientists discuss the source of this power and its application in the ancient world. Our science is just beginning to grasp what the ancients clearly understood.\n\n3. Sacred Cosmology\n\nDeciphering the meaning of strange symbols in Egyptian art gives insight into ancient knowledge of sacred cosmology. A new way of interpreting hieroglyphics is presented, indicating that the ancients had sophisticated understanding of physics, biology and celestial mechanics. The team goes on an expedition into the open desert in search of a remote site of extreme antiquity called nabta playa. Here, Neolithic stone circles were found marking the motion of the same stars as were tracked in pharonic civilization. The possible connection is discussed.\n\n4. The Empowered Human\n\nThe empowered human proposes that the pyramid builders were living in a Golden Age. They had more refined senses, and experienced higher levels of consciousness, which gave them superior abilities to those we have today. The sacred feminine was honored and existed in balance with the masculine.\n\n5. A New Chronology\n\nAfter examining the evidence presented in the series, it seems clear the dates given by traditional Egyptology don t fit. Carefully considering cycles of time through gold, silver, bronze and iron ages of Plato's Great Year, a new chronology emerges that illuminates Ancient Egypt.\n &lt;a href=&quot;\nhttp://www.amazon.com/Pyramid-Code-Carmen-Boulter/dp/B002KLPB06/ref=sr_1_1?ie=UTF8&amp;s=dvd&amp;qid=1259436544&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Pyramid-Code-Carmen-Boulter/dp/B002KLPB06/ref=sr_1_1?ie=UTF8&amp;s=dvd&amp;qid=1259436544&amp;sr=8-1&lt;/a&gt;\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nMAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Getting The Message Out, Openly!\n","torrent":{"xt":"urn:btih:911e98e016d5da6c8d13f7411088c4e8bcb248e7","amp;dn":"Carmen+Boulter+-+The+Pyramid+Code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"911e98e016d5da6c8d13f7411088c4e8bcb248e7","infoHashBuffer":{"type":"Buffer","data":[145,30,152,224,22,213,218,108,141,19,247,65,16,136,196,232,188,178,72,231]},"announce":[],"urlList":[]}}