{"title":"Leaving Lucy Pear - Anna Solomon [EN EPUB] [ebook] [p_s]","uid":15711151,"size":3099276,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9165d8d12106a9d9c99404d96f0c8d27defbb9c9&amp;dn=Leaving+Lucy+Pear+-+Anna+Solomon+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"perfect_stan","files":1,"time":1472573682,"description":"Leaving Lucy Pear by Anna Solomon\r\nEnglish | 2016 | Historical Fiction | 3 MB\r\n\r\n\r\nA big, heartrending novel about the entangled lives of two women in 1920s New England, both mothers to the same unforgettable girl.\r\nOne night in 1917 Beatrice Haven sneaks out of her uncle’s house on Cape Ann, Massachusetts, leaves her newborn baby at the foot of a pear tree, and watches as another woman claims the infant as her own. The unwed daughter of wealthy Jewish industrialists and a gifted pianist bound for Radcliffe, Bea plans to leave her shameful secret behind and make a fresh start. Ten years later, Prohibition is in full swing, post-WWI America is in the grips of rampant xenophobia, and Bea’s hopes for her future remain unfulfilled. She returns to her uncle’s house, seeking a refuge from her unhappiness. But she discovers far more when the rum-running manager of the local quarry inadvertently reunites her with Emma Murphy, the headstrong Irish Catholic woman who has been raising Bea’s abandoned child—now a bright, bold, cross-dressing girl named Lucy Pear, with secrets of her own.\r\nIn mesmerizing prose, award-winning author Anna Solomon weaves together an unforgettable group of characters as their lives collide on the New England coast. Set against one of America’s most turbulent decades, Leaving Lucy Pear delves into questions of class, freedom, and the meaning of family, establishing Anna Solomon as one of our most captivating storytellers.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:9165d8d12106a9d9c99404d96f0c8d27defbb9c9","amp;dn":"Leaving+Lucy+Pear+-+Anna+Solomon+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9165d8d12106a9d9c99404d96f0c8d27defbb9c9","infoHashBuffer":{"type":"Buffer","data":[145,101,216,209,33,6,169,217,201,148,4,217,111,12,141,39,222,251,185,201]},"announce":[],"urlList":[]}}