{"title":"Barbarella: Queen of the Galaxy","uid":3971470,"size":1468270592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:91d7b43649acdadd9133cac52e318f30ccccecf6&amp;dn=Barbarella%3A+Queen+of+the+Galaxy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"greasetrap","files":2,"time":1200026649,"description":"After an in-flight anti-gravity striptease (masked by the film&amp;#039;s opening titles), Barbarella (Jane Fonda), a 41st century astronaut, lands on the planet Lythion and sets out to find the evil Durand Durand in the city of Sogo, where a new sin is invented every hour. There, she encounters such objects as the Exessive Machine, a genuine sex organ on which an accomplished artist of the keyboard, in this case, Durand Durand himself, can drive a victim to death by pleasure, a lesbian queen who, in her dream chamber, can make her fantasies take form, and a group of ladies smoking a giant hookah which, via a poor victim struggling in its glass globe, dispenses Essance of Man. You can&amp;#039;t help but be impressed by the special effects crew and the various ways that were found to tear off what few clothes our heroine seemed to possess. Based on the popular French comic strip.  Written by alfiehitchie\n-imdb.com\n\n-A noble attempt at trying to describe a movie, and as good as anyone will ever do trying to describe one of the most bizarre space operas ever made.","torrent":{"xt":"urn:btih:91d7b43649acdadd9133cac52e318f30ccccecf6","amp;dn":"Barbarella%3A+Queen+of+the+Galaxy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d7b43649acdadd9133cac52e318f30ccccecf6","infoHashBuffer":{"type":"Buffer","data":[145,215,180,54,73,172,218,221,145,51,202,197,46,49,143,48,204,204,236,246]},"announce":[],"urlList":[]}}