{"title":"Frank Zappa - Ship Arriving Too Late TQMP","uid":5147049,"size":258278808,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9250ef5007b55816fc9a0a3553fa7538433807f2&amp;dn=Frank+Zappa+-+Ship+Arriving+Too+Late+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":22,"time":1257326575,"description":"Released in May 1982, Ship Arriving Too Late to Save a Drowning Witch marks Frank Zappa's entrance into the 1980s. From this point on, his rock records would focus on single, simple rock songs (the previous year's You Are What You Is had them organized in interconnecting suites) with occasionally more complex instrumental numbers. The recipe would be extended to The Man From Utopia (1983) and Them or Us (1984). Side one features three studio songs that would never be performed on stage. By 1981, Zappa had become a master at manipulating vocal tracks, a technique featured in each of them, but most successfully in &quot;Valley Girl,&quot; where daughter Moon Unit (aged 14 at the time) pastiches rich girls from the San Fernando Valley. Released as a single, it became a novelty hit, climbing into the Top 40 in the U.S., a rare (and not necessarily sought-after) experience for Zappa. Side two presents three live tracks, two of which are difficult rock instrumentals. &quot;Drowning Witch&quot; may be one of his hardest pieces to perform. This album clearly lacks ambition and tends to get lost among the man's humongous discography, but it should not be overlooked. It contains a few good songs (&quot;No Not Now&quot; is quite entertaining), strong guitar work from Zappa and Steve Vai, and it is not defaced by the cold 1980s sound of subsequent albums. \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                       &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:9250ef5007b55816fc9a0a3553fa7538433807f2","amp;dn":"Frank+Zappa+-+Ship+Arriving+Too+Late+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9250ef5007b55816fc9a0a3553fa7538433807f2","infoHashBuffer":{"type":"Buffer","data":[146,80,239,80,7,181,88,22,252,154,10,53,83,250,117,56,67,56,7,242]},"announce":[],"urlList":[]}}