{"title":"NEOScavenger v0.980","uid":9160612,"size":29593800,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:925fbbfb374cf484c6941c7ddf41e109cf7434ea&amp;dn=NEOScavenger+v0.980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Rafeweisz","files":1,"time":1383867540,"description":"NEO Scavenger is a post-apocalyptic outdoor survival simulation. The player controls a character through a series of turns played on a hexagonal map. Each turn consumes some of the character's supply of food and water and decreases the character's sleep meter. The objective of the game is to ensure the character's survival. This requires that the player scavenge supplies from ruined settlements in the area. Scavenging can be risky as it may alert nearby looters and raiders to the player's activities, but it is necessary if the player wishes to survive in the wasteland; clothes, weapons, food, and tools quickly become a necessity for the wandering player. Recipes are available which require the player to gather certain items and combine them together to create other items.[4]\n\nThe player can suffer from a variety of illnesses including hypothermia, diarrhea, dehydration, and malnutrition. Left untreated, the character could die. Illnesses can be treated or avoided by using certain items in the game. For example, to ward against hypothermia, the player should quickly obtain a pair of pants.\n\nPC Gamer's Tom Sykes said of the game, &quot;Compared to other post-apocalyptic RPGs, NEO Scavenger feels like the real deal, with a central character who lives the harsh life of a wastelander rather than simply borrowing the aesthetic.\n\n------------------------------------------\n\nHow long can you survive the post-apocalyptic wastelands of NEO Scavenger? In the near-future, supernatural activity and human warfare have fragmented mankind into pockets of civilization struggling to survive in wild and dangerous lands. You awaken alone in an abandoned facility with no food nor water, and only a hospital gown and some mysterious items as clues to your identity.\n\nNEO Scavenger (playable as a stand-alone download or in the browser via Flash) is a game where you must survive in the wasteland long enough to figure out who you are. Each turn you must decide where to go, how to scavenge for supplies, and how to deal with anything and anyone you encounter. And with each passing minute, the pit in your stomach grows, your dehydration worsens, your muscles tire, and your body temperature drops in the cold autumn air. Choose your starting abilities carefully, because they and your wit are the only tools you have in the apocalypse!","torrent":{"xt":"urn:btih:925fbbfb374cf484c6941c7ddf41e109cf7434ea","amp;dn":"NEOScavenger+v0.980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"925fbbfb374cf484c6941c7ddf41e109cf7434ea","infoHashBuffer":{"type":"Buffer","data":[146,95,187,251,55,76,244,132,198,148,28,125,223,65,225,9,207,116,52,234]},"announce":[],"urlList":[]}}