{"title":"WebYoung - Samantha Rone, Riley Reid (My First Trainer)","uid":12755115,"size":356108128,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9289614a246214adcd43c15bb3d2cd2486bf45d3&amp;dn=WebYoung+-+Samantha+Rone%2C+Riley+Reid+%28My+First+Trainer%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"feeldabyte","files":1,"time":1447438659,"description":"\nScreens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n  \nhttp://imgkiss.com/image/feliy \nhttp://imgkiss.com/image/fep9d\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nEach time Riley gets up in the morning and takes the measurement of her weight she seems a lil' perturbed, but body weight aside, she's always eager to go to the gym and run in order to get the much needed exercise her tiny nubile body and her growing teenage brain needs. When Samantha Rone shows up they're surprised to see one another there. Samantha is used to coming in the morning, but Riley frequents the afternoon.\r\n\r\nSamantha isn't used to working out as much, and she's never really known what to do at the gym besides, you know, weights and run... but Riley ensures her that they can find a new routine that Samantha will enjoy, and Riley will get some experience showing off her new training techniques. Riley helps Sam through some of the workouts she likes to do including some weight lifting and bicycle crunches and eventually Riley notices Sam's impeccable posture. Sam is into the exercise Riley helps her thorough until it starts to get a bit harder. But soon it's really clear that they have a chemistry that neither of them were expecting.\r\n\r\nOnce Sam's exercises are over Riley suggests a nice long stretch. Soon Sam and Riley are closer than they've been before, and they just can't help keeping their hands off one another. Soon the yoga poses turn into kissing for the first time, and coming to terms with their inner lesbian. Sam is surprised Riley has an eye for her. After a little reluctance Sam is ready to let her inner lesbian shine! Riley and Sam work at each other's budding bodies until Sam's phone rings. Sam's mother is on the line and she has to go, but Riley isn't just ready to let Sam go just yet. They kiss more and soon start to peel one another's clothes off, licking one another with a lesbian hunger they never expected. Will Sam's mother be upset she's taking so long?\r\n\r\n\r\nSail to another one :\r\n  \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:9289614a246214adcd43c15bb3d2cd2486bf45d3","amp;dn":"WebYoung+-+Samantha+Rone%2C+Riley+Reid+%28My+First+Trainer%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9289614a246214adcd43c15bb3d2cd2486bf45d3","infoHashBuffer":{"type":"Buffer","data":[146,137,97,74,36,98,20,173,205,67,193,91,179,210,205,36,134,191,69,211]},"announce":[],"urlList":[]}}