{"title":"Dungeon.Defenders-SKIDROW","uid":6756240,"size":1875186113,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:92e117a93218a047ef71d6663e8901e72586e6c5&amp;dn=Dungeon.Defenders-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".Dude.","files":-1,"time":1319042799,"description":"\nS  K  I  D  R  O  W\n                         .the leading force.\n\n                           proudly presents\n             Dungeon Defenders (c) Trendy Entertainment\n\n\n 19-10-2011........Release Date &lt;-&gt; Protection...............Steam\n Action/RPG...........Game Type &lt;-&gt; Disk(s)..................1 DVD\n\n\n RELEASE NOTES\n\n\nDungeon Defenders is a Tower Defense Action-RPG where you must save the\nland of Etheria from an Ancient Evil! Create a hero from one of four\ndistinct classes to fight back wave after wave of enemies by summoning\ndefenses and directly participating in the action-packed combat!\n\nCustomize and level your character, forge equipment, gather loot,\ncollect pets and more! Take your hero through multiple difficulty modes\nand challenge/survival missions to earn more experience &amp; even better\ntreasure. Join your friends with 4-player online and local\n(splitscreen) co-op to plan your strategies together or compete in PvP\nDeathmatch.\n\nFeatures:\n\n4-player Online and Local Co-Op - Team-up with up to 3 friends to\ndefend cooperatively, with character classes that support each other's\nstrengths and weaknesses. Dynamically combine local (splitscreen) and\nonline players and leave/join any time, so that the game s always full.\n\nTower-Defense Meets Action-RPG - Choose your class, customize your\ncharacter &amp; equipment, strategically assemble your defenses, and\nparticipate directly in action-packed battle to preserve your castle\nagainst the invading horde!\n\n4 Distinct Character Classes - Each character class has a different\nskill tree, set of towers, and even basic attacks! You can choose if\nyou want to play stealthy, turn invisible, and plant traps behind enemy\nlines with the Huntress or go all out, block off choke points, and\nbrutally beat your foes into submission with the Squire!\n\nLoot and Level-Up - Grab the mounds of money and items that your\ndefeated foes drop and trade them or store them for later use in your\nItem Box! Getting kills and completing waves earns you experience\npoints, which can be used to upgrade your characters, skills,\nequipment, and towers on a per-statistic basis. Do you want to enhance\nHit Points, Attack Rate, Damage, etc? The choice is yours... Store your\nmassive overflow of money in the 'Mana Bank' and then spend it to\nimprove your equipment or trade with other players. Proudly show off\nyour best equipment in your own 'Adventurer s Tavern', without fear of\nitem theft!\n\nTons of Enemies and Huge Boss Fights - Over 100 simultaneous enemies\nwill attempt to tear through your defenses and gigantic Boss Monsters\nwill appear to rain down havoc upon everyone. Only by employing the\nmost effective defensive strategies, teamwork, and strong characters\nwill you defeat such devilish foes! Many enemy types run the gamut from\nbig dumb Orcs swinging huge axes, to lithe Dark Elves that strike from\nthe shadows, to crazy kamikaze goblins! Can you defeat the epic boss\nbattles and collect the special loot while still defending your\ncrystals?\n\nMission &amp; Game Play Variety - Each level has a different visual\nsetting, layout, enemy types, traps, and distinct surprises. To collect\nall the loot and reach the highest levels you must take your character\nthrough 4 difficulty modes, survival missions, challenge maps, and\nmore! Some maps force you to have mobile defenses, guarding a crystal\nwhich warps around the map. Others have YOU attacking enemy\nencampments!\n\nCollect and Trade Pets Online - A variety of pets exist to assist you\nin the land of Etheria, each with distinct behaviors. These pets can be\nleveled-up and customized to match your unique play-style. They can\neven be traded online with other players!\n\nSecure Trading System - Afraid another player won't live up to their\nword? Use our secure trading system to trade your precious weapons,\narmor, and pets with other players online! Watch your name and fame\nspread online, as people seek out the best pet raisers or item forgers!\n\nA Mountain of Stats - Every shot you take, kill you make, and defense\nyou build is logged and recorded for posterity. Pore over the\nvoluminous charts and graphs at the end of each session to analyze your\nteam's performance, quickly review your best statistics for each level,\nand compare your data online with other players to see who is the\ngreatest hero of all. Furthermore, your Achievements are visible for\nall to see within your very own Adventurer's Tavern, and the highest\nscores for each of your heroes are ranked on the worldwide\nleaderboards!\n\n\n INSTALL NOTES\n\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder to the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!\n\n\n GREETINGS\n\n\nTo all friends of the family and honorable rival groups!\n\nScreens: &lt;a href=&quot;\nhttp://www.imagebam.com/image/d27deb154746033&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/d27deb154746033&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imagebam.com/image/b76a42154746084&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/b76a42154746084&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imagebam.com/image/16e7cb154746108&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/16e7cb154746108&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imagebam.com/image/ca9be5154746143&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/ca9be5154746143&lt;/a&gt;","torrent":{"xt":"urn:btih:92e117a93218a047ef71d6663e8901e72586e6c5","amp;dn":"Dungeon.Defenders-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e117a93218a047ef71d6663e8901e72586e6c5","infoHashBuffer":{"type":"Buffer","data":[146,225,23,169,50,24,160,71,239,113,214,102,62,137,1,231,37,134,230,197]},"announce":[],"urlList":[]}}