{"title":"Situationist International Anthology","uid":8160158,"size":1871159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:932c872356cf6b433b826b6a331e7952b6c445f6&amp;dn=Situationist+International+Anthology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ledpup","files":-1,"time":1361235423,"description":"Format: MOBI (Kindle) and EPUB\n\nLiterary Nonfiction. Politics. Critical Theory. Art. \n\nIn 1957 a few European avant garde groups came together to form the Situationist International. Picking up where the dadaists and surrealists had left off, the situationists challenged people's passive conditioning with carefully calculated scandals and the playful tactic of detournement. Seeking a more extreme social revolution than was dreamed of by most leftists, they developed an incisive critique of the global spectacle-commodity system and of its &quot;Communist&quot; pseudo-opposition, and their new methods of agitation helped trigger the May 1968 revolt in France. Since then--although the SI itself was dissolved in 1972, situationist theories and tactics have continued to inspire radical currents all over the world. The SITUATIONIST INTERNATIONAL ANTHOLOGY, generally recognized as the most comprehensive and accurately translated collection of situationist writings in English, presents a rich variety of articles, leaflets, graffiti and internal documents, ranging from early experiments in &quot;psychogeography&quot; to lucid analyses of the Watts riot, the Vietnam War, the Prague Spring, the Chinese Cultural Revolution and other crises and upheavals of the sixties. For this new edition the translations have all been fine-tuned and over 100 pages of new material have been added.","torrent":{"xt":"urn:btih:932c872356cf6b433b826b6a331e7952b6c445f6","amp;dn":"Situationist+International+Anthology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"932c872356cf6b433b826b6a331e7952b6c445f6","infoHashBuffer":{"type":"Buffer","data":[147,44,135,35,86,207,107,67,59,130,107,106,51,30,121,82,182,196,69,246]},"announce":[],"urlList":[]}}