{"title":"Citadels (ENG/MULTI6) FAIRLIGHT","uid":8743072,"size":2269811890,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9357a19363e1c2ab6164684d84202006a073732d&amp;dn=Citadels+%28ENG%2FMULTI6%29+FAIRLIGHT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DMeTaLx","files":2,"time":1374844040,"description":"General Information:\nYear Of Release : 2013\nGenre : Strategy (Real-Time)\nDeveloper : Games Distillery\nPublisher : BitComposer Games\nPublication Type : Pirates\nLanguage : Russian / English / German / French / Spanish / Italian\nVoice Language : English\nMedicine : Present\nAuthor : FAIRLIGHT\n\nSystem Requirements:\n* Operating System: Windows XP / Vista / 7 / 8\n* Processor: 2.5 GHz\n* Memory: 2 GB\n* Video Card: 1 GB with Shader Model 3.0\n* HDD: 3 GB\n* DirectX: 9.0c\n\nDescription:\nDawn Britain. Country ruled by a wise and just King Arthur, who is honored and respected by his subjects loyal supporters - Knights of the Round Table, but Arthur's enemies are not asleep. Are united their forces with the armies of the Saxons and the northerners, they're going to attack Camelot and King realizes that his kingdom threatens destruction. Hoping to stave off the inevitable, he decided to take a desperate step and agrees to go on a great sacrifice. Alas, all to no avail. The onset of peace is fragile and unstable, this is the calm before the storm. On the horizon you can see the final battle. What was the cause of all these events? Venture into the past to see the new legend of King Arthur with his own eyes. Witness the most important events in the life of the legendary ruler until his last attempt to save his kingdom and loyal supporters of the terrible future. Will you save the honor and glory and majesty of Camelot?\n\nFeatures:\n- That the legend of King Arthur, you have not seen! Citadels - A new interpretation of the old legends of King Arthur, which covers the entire life of the legendary ruler and the events that followed his death. The two campaigns will allow you to look at the events from the point of view of both sides involved in the war.\n- Legendary characters are fighting with you and provide invaluable support! Perform tasks to enlist the help of legendary companions. Commanding them, you will be able to find a strategy that will lead you to victory.\n- You will not be bored - and it does not matter whether you're playing alone or with other players! In addition to the campaign mode of the game has several multiplayer modes. Battle with your friends against computer opponents or challenge each other to find out which one of you is more worthy of the title of this strategy.\n\nInstallation:\n* Burn or mount.\n* Install.\n* Play the game.","torrent":{"xt":"urn:btih:9357a19363e1c2ab6164684d84202006a073732d","amp;dn":"Citadels+%28ENG%2FMULTI6%29+FAIRLIGHT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9357a19363e1c2ab6164684d84202006a073732d","infoHashBuffer":{"type":"Buffer","data":[147,87,161,147,99,225,194,171,97,100,104,77,132,32,32,6,160,115,115,45]},"announce":[],"urlList":[]}}