{"title":"Hannah Howell - Wherlocke Series  (Book 1-5) Epub","uid":10506155,"size":2829167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93a6c3a164acbed0d19c3389aa51839b73889993&amp;dn=Hannah+Howell+-+Wherlocke+Series++%28Book+1-5%29+Epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"karaokeking123","files":-1,"time":1404772201,"description":"Hannah Howell - Wherlocke Series  (Book 1-5) Epub\n\n\nOverview: Hannah Dustin Howell is a best-selling American author of over 40 historical romance novels. Many of her novels are set in medieval Scotland. She also writes under the names Sarah Dustin, Sandra Dustin, and Anna Jennet.\nGenre: Paranormal Romance\n\n1. If He's Wicked: She saves his life... For Chloe Wherlocke, it all begins with a vision - a glimpse into the future that foretells a terrible plot against Lord Julian Kenwood and his newborn son. Chloe's psychic gift allows her to save the child from certain death, but the earl remains in grave peril...But when he steals her heart...Julian Kenwood knows someone is trying to kill him and he suspects his scheming wife and her lover are behind the plot. But Julian is shocked when Chloe, a captivating, dark-haired stranger, warns him that sinister forces are indeed at hand - and exposes a devastating secret that changes his life forever...Will she resist - or surrender? As Chloe reveals her plan to save Julian, neither can deny the attraction that grows each moment they're together. Chloe knows the highborn earl could never love her as she loves him. But when danger strikes closer than ever, Chloe must risk everything - or lose Julian forever...\n\n2. If He's Sinful: Secrecy and intrigue ignite dangerous passions in &quot;New York Times&quot; bestselling author Hannah Howell's seductive new novel...It is whispered throughout London that the members of the Wherlocke family are possessed of certain unexplainable gifts. But Lord Ashton Radmoor is skeptical - until he finds an innocent beauty lying drugged and helpless in the bedroom of a brothel. The mystery woman is Penelope Wherlocke, and her special gift of sight is leading her deep into a dangerous world of treachery and betrayal. Ashton knows he should forget her, yet he's drawn deeper into the vortex of her life, determined to keep her safe. But Penelope is no ordinary woman, and she's never met the man strong enough to contend with her unusual abilities. Until now...\n\n3. If He's Wild: Lady Alethea Vaughn Channing is haunted by a vision of a man in danger - the same man who she has seen in dreams time and time again. She doesn't even know his name, and yet she feels the connection between them, knows she is the only one standing between him and disaster. But rakish Lord Hartley Greville is capable of protecting himself, as he has proven more than once in his perilous work as a spy for the crown. If he's to carry out his duty, he'll need to put aside the achingly beautiful woman with the strange gift. And yet, when Alethea's visions reveal a plot that could endanger children, Hartley will not be able to ignore the destiny that binds them together - or resist the passion burning between them.\n\n4. If He's Dangerous: When Lorelei Sundun first finds Sir Argus Wherlocke in her garden, she's never heard of the mysterious Wherlocke clan-or their otherworldly abilities. That changes the moment she watches Argus-the most tantalizing man she's ever seen-disappear before her very eyes. What she's witnessed should be impossible. But so should falling in love with a man she's only just met.\n\nPursued by a madman intent on harnessing the Wherlockes' talents as weapons, Argus meant to seek help from his family, not to involve a duke's lovely daughter in the struggle. But now, the enchanting Lorelei is his only hope for salvation-and the greatest temptation he's ever faced.\n\n5. If He's Tempted: Lady Olympia Wherlocke has the gift of foresight. When Lady Agatha Mallam asks Olympia to locate her brother so he can rescue her from an arranged marriage, she knows exactly where to find Lord Brant Mallam, Earl of Fieldgate. What happens next is something she never envisioned. Since his betrothed died, Lord Brant Mallam has drowned his sorrow with wine and women. His dissolute ways have only emboldened his calculating mother. But with the help of the enchanting Olympia, he concocts a daring plan to end his mother's devious designs for his sister. While each step in their bold scheme works to perfection, the sins of the past could unravel a growing desire that neither Olympia nor Brant can control.\n","torrent":{"xt":"urn:btih:93a6c3a164acbed0d19c3389aa51839b73889993","amp;dn":"Hannah+Howell+-+Wherlocke+Series++%28Book+1-5%29+Epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93a6c3a164acbed0d19c3389aa51839b73889993","infoHashBuffer":{"type":"Buffer","data":[147,166,195,161,100,172,190,208,209,156,51,137,170,81,131,155,115,136,153,147]},"announce":[],"urlList":[]}}