{"title":"The Hawkeye [Clint Barton] Collection (1964-2012)","uid":9765037,"size":2358256109,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9430a3687bbce7a6ad304eb6eccc6181410c1c42&amp;dn=The+Hawkeye+%5BClint+Barton%5D+Collection+%281964-2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1394866015,"description":"For more information about this comic, please see the wikilink here:\n\nEveryone loves Hawkguy...err, Hawkeye, right? For 50 years, the sharpshooting archer has been around in the Marvel Universe, and yet is still severely under-appreciated. It is somewhat remarkable that Matt Fraction and David Aja have managed to turn his solo title into the best-selling, award-winning book it has become, given his limited success in that area previously. Clint Barton is infuriating, reckless, plays by his own rules, and is a mess in terms of inter-personal relationships. However, Clint has heart and tremendous courage and earns his keep (and beyond) as a non-superpowered member of The Avengers (and often, the only one of the group with that distinction). Still, he never gives up, always fights for what is right to the bitter end and even if he's the last man standing, you know somehow he will find a way to pull through. Those characteristics deserve to be celebrated.\n\nSo, this torrent is a love letter to that Marvel marksman extraordinaire. It contains all of Hawkeye's solo efforts - including all volumes of his own series, Solo Avengers stuff, every miniseries and one-shot - and also notable Avengers material and his entire run as leader of the Thunderbolts, along with some extra stuff thrown in for good measure. If you are fan or are looking for a place to start - you've come to the right collection. Full contents are as follows:\n\n-Tales Of Suspense 57, 60, 64 [First Appearances] (1964-1965, Webrips)\n-Assorted Avengers Issues (1965-1987), which all feature great Hawkeye stories: issues Avengers v1 16 (joining the team), 64, 65, 109, 174, 189, 202, 223 + Annual 16 and Giant-Size 02\n-Assorted Singles, GNs &amp; One-Shots, which has: Captain America v1 179, 317; Defenders v1 09 (Hawkeye vs. Iron Man, round 2), Ghost Rider v1 27, Incredible Hulk v2 166, Marvel Team-Up v1 92 (with Hawkeye and Spider-Man), and Hawkeye - Earth's Mightiest Marksman TPB.\n-Hawkeye v1 01-04 (1983)\n-Hawkeye v2 01-04 (1994)\n-Hawkeye v3 01-08 (2003-2004)\n-West Coast Avengers 01-04 (1984, DuckDodgers-DCP) [a mini which kicked off that spin-off as Hawkeye forms his team)\n-Solo Avengers &amp; Avengers Spotlight 01-40 (1987-1991) (which changed names in the middle but the full run almost completely features Hawkeye stories and team-ups; split into two folders in reading order with the correct names)\n-Thunderbolts v1 20-75 (1998-2003) (Hawkeye takes over as leader of the team from #21 through it's initial conclusion in #75)\n-New Avengers - The Reunion 01-04 (2009, Minutemen-Shamil)\n-Dark Reign - Hawkeye 01-05 (2009-2010, Minutemen+) \n-Hawkeye - Blindspot 01-04 (2011, Digital, Zone-Empire)\n-Hawkeye &amp; Mockingbird 01-06 + Ex (2010, Digital, Empire) (including the Sketchbook issue as a bonus)\n-Widowmaker 01-04 (2011, Bchry-DCP) (which also serves as a conclusion to Hawkeye &amp; Mockingbird and should be read together)\n-Ultimate Hawkeye 01-04 (2011, Digital, Zone-Empire)\n-Avengers - Solo 01-05 (2012, DCP+) (almost entirely a Hawkeye tale)\n\nMany legendary writers and artists are in this package, including Roy Thomas, Gene Colan, Steve Englehart, Sal Buscema, Stan Lee, Jack Kirby, and George Perez. I have also managed to find several copies of these comics that have not been torrented before outside of random hitlists and are in much better quality than what was available previously - webrips of Tales of Suspense, tpb scans of some Avengers issues and Minutemen scans of Dark Reign + Digital copies of Hawkeye &amp; Mockingbird. All the scanner groups are credited in either the title of the folder or the comic itself, otherwise the credit was not obviously listed but is likely an early scan. These include Minutemen, Zone-Empire, Bchry-DCP, DuckDodgers-DCP, and more. Thanks to all of them for their hard work, and PLEASE SEED this one - it's big, but worth it IMHO. Also thanks to all original uploaders, especially STFMaryville for his earlier take on the Hawkeye essentials. Even if you don't need the whole thing, I am sure you will find something to enjoy - as I said to begin, everyone loves Hawkguy! Enjoy! :-)","torrent":{"xt":"urn:btih:9430a3687bbce7a6ad304eb6eccc6181410c1c42","amp;dn":"The+Hawkeye+%5BClint+Barton%5D+Collection+%281964-2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9430a3687bbce7a6ad304eb6eccc6181410c1c42","infoHashBuffer":{"type":"Buffer","data":[148,48,163,104,123,188,231,166,173,48,78,182,236,204,97,129,65,12,28,66]},"announce":[],"urlList":[]}}