{"title":"A_Dirty_Shame [NC-17] (sickboy88)","uid":3402648,"size":734323077,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:953f1cf020a6549d7ca55557400d07e268d79563&amp;dn=A_Dirty_Shame+%5BNC-17%5D+%28sickboy88%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sickboy88","files":3,"time":1130559337,"description":"A Dirty Shame (2004)\n\nIMDB Link:\n\nhttp://www.imdb.com/title/tt0365125/\n\n----\n\nI am back in business now, at least for a little while. ;)\n\nThis is the new John Waters movie...however THIS verion is the *NC17* rated version...NOT the rated &quot;R&quot; version recently released by a very shitty ripper.  Tired of going to the local video store, and only finding the rated &quot;R&quot; version, with half of the movie cut away?  Want to rent the NC17 version? Tough shit, no one rents it, you must buy it...or simply DOWNLOAD it now, for free.\n\nNC17 is a very rare rating for the USA...come and see what the max rating in the USA looks like before becoming rated &quot;X&quot;.\n\nThis movie is great...&quot;Johnny Knoxville&quot; even plays the main character...fun stuff...a must see.\n\nExternal English and Spanish subs in VOBsub format.\n\n----\n\nMini Plot:\n\nLust is in the air on Harford Road and Sylvia Stickles, a grumpy, repressed middle-aged Baltimorean, doesn't like it. Though Sylvia's handsome husband Vaughn still has marital urges, his wife could not be less interested -- she has more important things to do. Not only does Sylvia run the family's Pinewood Park and Pay convenience store, she's also responsible for watching over her exhibitionist daughter Caprice. A go-go dancer known to her adoring fans as Ursula Udders, Caprice and her stupendously enlarged breasts are currently under house arrest after several nude and disorderly violations. But Sylvia's world is turned upside down one day after suffering a concussion in a freak traffic accident. Sexy tow-truck driver Ray-Ray Perkins rushes to her aid, and the stricken Sylvia realizes he is no ordinary service man; he's a sexual healer who brings Sylvia's hidden cauldron of lust to the boiling point.\n\n----\n\nEncoded by: sickboy88\nCodec: XviD 1.1.0 Beta 2\nBitrate: 960 kb/s AVG\nAspect: 640x352 = 1.82:1\nAudio: English, 128 kb/s VBR AVG Stereo @ 48K Hz\nSubtitles: External: English, Spanish - VOBsub Format\nRuntime: 01:28:50\nFPS: 23.976\n\n----\n\nIf you are going to watch this, you'll want to install the NEW XviD codec:\n\nNow at Beta 2!\n\nhttp://www.koepi.org/XviD-1.1.0-Beta2-04042005.exe\n\nFor top quality, make sure you use the XviD decoder configerator, and turn\non (Y) and (UV) deblocking, and the new feature of\nXviD 1.1.0 (Y) and (UV) DERINGING.\n\nIf you have a slow computer, please turn off pre-processing. I don't want\nanother stupid motherfucker telling me that my movies are out of sync\nbecause they are totally computer illiterate.","torrent":{"xt":"urn:btih:953f1cf020a6549d7ca55557400d07e268d79563","amp;dn":"A_Dirty_Shame+%5BNC-17%5D+%28sickboy88%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953f1cf020a6549d7ca55557400d07e268d79563","infoHashBuffer":{"type":"Buffer","data":[149,63,28,240,32,166,84,157,124,165,85,87,64,13,7,226,104,215,149,99]},"announce":[],"urlList":[]}}