{"title":"Herbie Hancock - Gershwin's World 1998 TQMP [FLAC]","uid":4480160,"size":350685820,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:95af1a4769402e001c5f8f911d4f1c60b96c65b4&amp;dn=Herbie+Hancock+-+Gershwin%5C%27s+World+1998+TQMP+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Breezin","files":21,"time":1225532441,"description":"Quotes from amazon.com (avg 5 star rating) \n\n&quot;I saw Herbie Hancock live for the first time in London in the early 80's, accompanying Winton Marsalis. He blew me away, for the range of his technique and conceptual genius.On this album, he soars on gilded wings, portraying his vision of Gershwin, aided by the stellar cast he has surrounded himself with.The sound of Wayne Shorter's Tenor horn brings back memories of that all -time great band of Miles in the 60's.The amazing vision that Herbie has, which he gathered under Miles, is shown at its fullest here, in the mental and aural concepts he explores.He takes Gershwin's compositions to their limits, expanding them with a subtle intensity which breaks into white flame on tracks like &quot; Summertime&quot;, a piece now so common that one would think it impossible to reignite it with new life. But reignite it he does, with Joni's smoky,etheral/erotic vocals and that piano. The incorporation of African percussionists is a master stroke, and underpins the themes with a breathy freshness. It is marvellous to hear Stevie Wonder exploring those cadences which show here where Rap and Hip hop came from. There are no duds here-this is a coming together of all that is finest in American and world music, united in the vision of genius-Gershiwn and Herbie Hancock. If your are not a jazz fan, if you listen to one &quot;jazz&quot; album a year, but if you listen to musci of any sort, listen to this. Majestic,marvellous, this is a master work for all.&quot; \n\n&quot;Just when you thought you'd heard all of gershwin.. a jazz master such as herbie hancock brings together this talented bunch and gives us a whole new definition of his work. A new approach to gershwin which leaves me gasping. The album flows beautifully from end to end and can be considered a summation of the &quot;feel&quot; of gershwin from the point of view of the arranger herbie hancock. Herbie has always been one of my favorite jazz aritsts, and this album is no exception to his excellent musicmanship. If you've liked herbie's albums before, I'd put this one right up there with 1+1, headhunters, and all his other defining albums.. Herbie has definately created a winner here.&quot; \n\nBrought to you by TQMP. (The Quality Music Project) \n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :) \n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s \nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt; \n\nPlease feel free to join the TQMP project! \nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..) \n\nYou can find all TQMP uploads at: www.thepiratebay.se (Simply use the TQMP searchtag :) \n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;680a1a0d0d1201062804011e0d460604&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:95af1a4769402e001c5f8f911d4f1c60b96c65b4","amp;dn":"Herbie+Hancock+-+Gershwin%5C%27s+World+1998+TQMP+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95af1a4769402e001c5f8f911d4f1c60b96c65b4","infoHashBuffer":{"type":"Buffer","data":[149,175,26,71,105,64,46,0,28,95,143,145,29,79,28,96,185,108,101,180]},"announce":[],"urlList":[]}}