{"title":"Money and Power. How Goldman Sachs Came To Rule The World ","uid":8230027,"size":2827677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95e88cf50a84b06bea5fcce9e77068bae41e1e61&amp;dn=Money+and+Power.+How+Goldman+Sachs+Came+To+Rule+The+World+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1362704811,"description":"Money and Power. How Goldman Sachs Came To Rule The World By William D. Cohan\n2011 | 672 Pages | ISBN: 184614454X | EPUB | 3 MB\n\n\n\nFrom the bestselling, prize-winning author of THE LAST TYCOONS and HOUSE OF CARDS, a revelatory history of Goldman Sachs, the most dominant, feared, and controversial investment bank in the world\n\nFor much of its storied 142-year history, Goldman Sachs has projected an image of being better than its competitors--smarter, more collegial, more ethical, and far more profitable. The firm--buttressed by the most aggressive and sophisticated p.r. machine in the financial industry--often boasts of &quot;The Goldman Way,&quot; a business model predicated on hiring the most talented people, indoctrinating them in a corporate culture where partners stifle their egos for the greater good, and honoring the &quot;14 Principles,&quot; the first of which is &quot;Our clients' interests always come first.&quot;\n\nBut there is another way of viewing Goldman--a secretive money-making machine that has straddled the line between conflict-of-interest and legitimate deal-making for decades; a firm that has exerted undue influence over government since the early part of the 20th century; a company composed of &quot;cyborgs&quot; who are kept in line by an internal &quot;reputational risk department&quot; staffed by former CIA operatives and private investigators; a workplace rife with brutal power struggles; a Wall Street titan whose clever bet against the mortgage market in 2007--a bet not revealed to its clients--may have made the financial ruin of the Great Recession worse.","torrent":{"xt":"urn:btih:95e88cf50a84b06bea5fcce9e77068bae41e1e61","amp;dn":"Money+and+Power.+How+Goldman+Sachs+Came+To+Rule+The+World+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95e88cf50a84b06bea5fcce9e77068bae41e1e61","infoHashBuffer":{"type":"Buffer","data":[149,232,140,245,10,132,176,107,234,95,204,233,231,112,104,186,228,30,30,97]},"announce":[],"urlList":[]}}