{"title":"National Geographic The Hunt for Hitlers Scientists DVB Xvid mp3","uid":4229774,"size":780488704,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:969885c2341863f70fdcde6671e404f3f49f6beb&amp;dn=National+Geographic+The+Hunt+for+Hitlers+Scientists+DVB+Xvid+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"circlensess","files":1,"time":1212987707,"description":"Movies : Documentary : TV Rip : English\nThe Hunt for Hitlers Scientists\n\nWar Documentary hosted by Paul Brightwell and published by National Geographic in 2005 - English narration\n\n\n\nInformation\n------------------------------\n\nIn the closing months of World War II, defeat was looming for the Germans. The invasion of Normandy on June 6, 1944 -- D-Day -- opened a second Allied front, and the Allies began overtaking a host of German positions; Paris was liberated on August 25; Romania and Bulgaria surrendered in quick succession. But the Nazis did not intend to go down without a fight -- and without inflicting as much damage as possible on the Allies. To do so, they employed or planned to employ an increasingly deadly array of military weapons -- from ballistic missiles to rocket planes to, perhaps, the atomic bomb.\n\nThe British, American, and Russian governments were not content to sit idly by, waiting to be slammed by the advanced technology. Covert teams of commandos and agents were sent ahead of the front lines and deep into Germany, hunting for both the weapons and the scientists and engineers who&amp;#039;d created them. For British and American operatives, failure was not an option. If they didn&amp;#039;t capture the Nazi technology and scientists, agents of the burgeoning Soviet Union might -- and that could spell disaster in a post-war world already feeling the chill of the impending cold war.\n\n\nAllied agents focused their efforts on three key Nazi technologies:\n\nThe V-2 Rocket\nGermany&amp;#039;s Vergeltungswaffen 2 (or &quot;weapon of reprisal&quot;) rocket, a successor to the earlier V-1 &quot;buzz bomb,&quot; was first launched successfully toward Western Europe on September 8, 1944. The behemoth, 46-foot-tall weapon -- devised by scientist Wernher von Braun (see sidebar), head of the Nazi rocket program -- streaked across the skies faster than the speed of sound and carried over a ton of explosives. More frightening was the weapon&amp;#039;s accuracy. A series of internal and external rudders and a guidance system near the nose controlled the flight of the rocket-fuel powered missile, so that it could hit a particular city from a distance of over two hundred miles. The V-2 was the world&amp;#039;s first ballistic missile. More than 3,000 V-2s, produced in an underground factory called the Mittelwerk, were rained onto Europe in the months before Germany&amp;#039;s surrender.\n\nHot on the trail of the V-2, von Braun, and his scientists were American and Russian agents. Each group wanted not just to stop the rain of bombs, but also to acquire the technology for themselves.\n\nThe Messerschmitt 163 Komet\nThis bizarre and revolutionary plane, brainchild of German aircraft designer Helmut Walter, was powered with a unique combination of fuels: T-Stoff (a mixture of 80 percent hydrogen peroxide and 20 percent water) and C-Stoff (a mixture of hydrazine hydrate, methyl alcohol, and water) that were ignited with oxygen from the plane&amp;#039;s exhaust. The powerful cocktail accelerated the fighter to speeds of 550 miles per hour and flung it to a maximum altitude of nearly 40,000 feet in just three and a half minutes. The tailless plane, also known as the &quot;Flying Bomb,&quot; had numerous drawbacks. It took off from a trolley and touched down -- without landing gear -- on a skid running down the center of the bottom of the plane. It could sustain only 8 minutes of powered flight.\n\nDespite the plane&amp;#039;s limitations, the Allies were eager to get their hands on it. The British deployed the top secret 30/Commando/Assault Unit, or 30 AU, an elite squad of operatives drawn from the three branches of the military, the Army, Royal Navy, and Royal Air Force (and organized by Ian Fleming, who later created James Bond), who specialized in infiltrating behind the front lines, ahead of the advancing Allied forces.\n\nThe Atomic Bomb\nIn 1938, German physicists in Berlin were the first to discover fission, the splitting of the atom -- and the basic process behind nuclear weapons. Although World War II had not yet started, the feat caused great alarm in the United States. If the Germans could split the atom, would an atomic bomb be next?\n\nThis concern ultimately led to the formation of the Manhattan Project, the United States government&amp;#039;s secret endeavor to build the bomb. As expected, a team of German scientists, led by physicist Werner Heisenberg, had already left the starting gates of the race toward the bomb -- and they quickly began to collect and stockpile the uranium that would fuel it.\n\nThe American government, with no way of knowing how close the Germans were to success (it turns out, not very), launched a dramatic post-D-Day mission to search Germany for the bomb project, Heisenberg and his team, and the uranium. The mission, manned by a crack team of agents and led by Lieutenant Colonel Boris T. Pash, was code-named Alsos, the Greek word for &quot;grove,&quot; in honor of General Leslie R. Groves, the head of the Manhattan Project.\n\nScreenshots\n------------------------------\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD MPEG-4 codec\nVideo Bitrate: 1950 KB/s\nVideo Aspect Ratio: 16:9\nVideo Resolution: 688 x 384\nAudio Codec: MPEG-1 Layer 3 (MP3)\nAudio BitRate: 160 KB/s (CBR)\nAudio Channels: 2 Ch\nRunTime: 00:47\nFramerate: 25 FPS\nNumber Of Parts: 1\nPart Size: 744 MB\nEncoded by: gavin63\nSubtitles: No TV Cap\nSource: DVB\n\n\n\ned2k\nPlease add to your ed2k share folder to help with the release\n\n\nwww mvgroup org avi\n","torrent":{"xt":"urn:btih:969885c2341863f70fdcde6671e404f3f49f6beb","amp;dn":"National+Geographic+The+Hunt+for+Hitlers+Scientists+DVB+Xvid+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"969885c2341863f70fdcde6671e404f3f49f6beb","infoHashBuffer":{"type":"Buffer","data":[150,152,133,194,52,24,99,247,15,220,222,102,113,228,4,243,244,159,107,235]},"announce":[],"urlList":[]}}