{"title":"The Fortune at the (PDF) Bottom of the Pyramid Eradicating Pover","uid":7993511,"size":2468376,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96cbf8857ef153c0892fe2801ddc1c9dc0984c18&amp;dn=The+Fortune+at+the+%28PDF%29+Bottom+of+the+Pyramid+Eradicating+Pover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KatQwerty","files":3,"time":1357547074,"description":"Publication Date: September 3, 2009 | ISBN-10: 0137009275 | ISBN-13: 978-0137009275 | Edition: Revised\nDrawing on Prahalad's breakthrough insights in The Fortune at the Bottom of the Pyramid, great companies worldwide have sought to identify, build, and profit from new markets amongst the world's several billion poorest people, while at the same time helping to alleviate poverty. Five years after its first publication, this book's ideas are no longer &quot;theory&quot;: they are proven, profitable reality. In the 5th Anniversary Edition, Prahalad thoroughly updates his book to reveal all that's been learned about competing and profiting &quot;at the bottom of the pyramid.&quot; Prahalad outlines the latest strategies and tactics that companies are utilizing to succeed in the developing world. He interviews several innovative CEOs to discuss what they've learned from their own initiatives, including the Unilever business leader who's built a billion-dollar business in India. You'll find a new case study on Jaipur Rugs' innovative new global supply chain; updates to earlier editions' key cases; and up-to-the-minute information on the evolution of key industries such as wireless, agribusiness, healthcare, consumer goods, and finance. Prahalad also offers an up-to-date assessment of the key questions his ideas raised: Is there truly a market? Is there scale? Is there profit? Is there innovation? Is this a global opportunity? Five years ago, executives could be hopeful that the answers to these questions would be positive. Now, as Prahalad demonstrates, they can be certain of it.","torrent":{"xt":"urn:btih:96cbf8857ef153c0892fe2801ddc1c9dc0984c18","amp;dn":"The+Fortune+at+the+%28PDF%29+Bottom+of+the+Pyramid+Eradicating+Pover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96cbf8857ef153c0892fe2801ddc1c9dc0984c18","infoHashBuffer":{"type":"Buffer","data":[150,203,248,133,126,241,83,192,137,47,226,128,29,220,28,157,192,152,76,24]},"announce":[],"urlList":[]}}