{"title":"Artboard v. 1.3 [K]racked","uid":6981795,"size":74911800,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:97e74bf7d53afebc6aded1bf5d32a0661fa7c1b2&amp;dn=Artboard+v.+1.3+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"polisdavid","files":-1,"time":1327427523,"description":"Official Web Site: &lt;a href=&quot; http://www.mapdiva.com/artboard/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.mapdiva.com/artboard/&lt;/a&gt;\n\nArtboard is a simple and direct vector drawing application that includes everything you need to create your own graphics and illustrations.\n\nArtboard delivers with hundreds of awesome styles and fully editable clip art, including speech bubbles, shiny buttons, maps and flags, people factory, and home planning. Artboard stands apart with powerful stacked styles that go way beyond simple fill and stroke, providing a wide range of spectacular effects.\n\nDesign logos, posters, floor plans, technical drawings, fun fashions, Web graphics, and more.\n\nSimple. Powerful. Fun.\n\nKey features of Artboard:\n\n* Over 20 simple and direct tools for drawing rectangles, stars, circles,\n  lines, curves, text and navigating\n\n* Pre-designed templates to create fliers, invitations, signs, and business\n  cards\n\n* Beautifully rendered text available with outline, shadow, mask, and text\n  on path\n\n* Perfectly crisp anti-aliased graphics\n\n* Layers-based drawing\n\n* Smooth Bezier curves\n\n* Page and poster-tiled printing\n\n* Automatic graph paper\n\n* Pen tablet support\n\n* Export for web and print the most popular graphics formats PNG,\n  JPG, PDF, and TIFF supporting resolutions from 72 to 600-dpi\n\n* Quick access to iPhoto, Pictures folder, and Smart folders via Image\n  Browser\n\n* Drag-and-drop between popular productivity apps\n\n* Many more features\n\nWhat's New\n\n* Added Format Bar to simplify and enhance overall workflow.\n\n* Enhanced and reorganized built-in collection of styles and clip-art.\n\n* Added built-in orientation video and help resources panel.\n\n* Improved controls for stroke line cap and join settings.\n\n* Smarter 'Offset Copy' operation preserves original type of objects such\n  as polygons and round rectangles.\n\n* Export now supports only exporting the selected objects.\n\n* Export for raster formats such as JPEG, TIFF and PNG use a new\n  pathway to avoid the lack of support in PDF for transparent gradients.\n  Transparent gradients are now exported correctly for JPEG, TIFF and\n  PNG formats.\n\n* 'Outline Path' operation made smarter and enhanced to work with special\n  stroke styles such as arrows, tapered, tagged and rough strokes.\n\n* Library Manager now creates a simpler and more useful default structure\n  for new collections.\n\n* User created collections are now named based on the logged-in user\n  name.\n\n* Wording of 'locked' styles and clip-art changed to indicate 'editable'\n  instead, to make it clear what locking really means. Unlock/Lock icon\n  changed to a pencil or crossed pencil.\n\n* Enhanced help.\n\n* New preference added for changing the freehand drawing smoothing \n  factor.\n\n* Locked layers no longer incorrectly accept pasted objects or moved\n  layers.\n\n* Numerous minor bug fixes.\n\nSystem Requirements: \n\nIntel Mac, OS X.6 or greater\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:97e74bf7d53afebc6aded1bf5d32a0661fa7c1b2","amp;dn":"Artboard+v.+1.3+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97e74bf7d53afebc6aded1bf5d32a0661fa7c1b2","infoHashBuffer":{"type":"Buffer","data":[151,231,75,247,213,58,254,188,106,222,209,191,93,50,160,102,31,167,193,178]},"announce":[],"urlList":[]}}