{"title":"Otis Smokey Smothers  Sings the Back Porch Blues (blues)(mp3@320","uid":6613141,"size":170679935,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:97e9c6ea14c86abae859f53f77d03d2b9cf6b91a&amp;dn=Otis+Smokey+Smothers++Sings+the+Back+Porch+Blues+%28blues%29%28mp3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":32,"time":1313626233,"description":"OTIS SMOKEY SMOTHERS  SINGS THE BACKPORCH BLUES\nLabel Ace \nOriginal Year 1962\nFormat:Mp3@320\n\n\n\nOtis &quot;Smokey&quot; Smothers's 1962 LP Sings the Backporch Blues is a rare and coveted blues album. This CD puts it into wide circulation and then some, not only presenting all 12 of the songs from the original album (as the first dozen tunes on the disc), but adding nine alternate takes and four tracks from 1962-1963 singles. The album is perhaps overestimated due to its rarity, but it's solid Chicago blues, owing much to the sort of mid-tempo shuffle that Jimmy Reed had made so much in vogue by the early '60s. Smothers has a relaxed, almost effortless vocal style, and the LP is a rare chance to hear Freddy King working as a session guitarist. King actually plays in a slightly more restrained and traditional style here than he did on his solo recordings. King Records wanted Smothers to play in a Jimmy Reed style, and frankly it did on the whole sound too close to Reed, sharing the flaw of songs that were too similar to each other. Occasionally he breaks out of that mold, as in the minor-key &quot;Crying Tears,&quot; though that sounds rather close to some of Otis Rush's early sides, or &quot;I Ain't Gonna Be No Monkey Man No More,&quot; which has the kind of jerky R&amp;B feel that Reed usually didn't mine. The 1962-1963 singles are somewhat more fully produced and Smothers seems a little more at ease, with the grooves flowing in a nice punchy shuffle, though &quot;Twist With Me Annie&quot; suffers from sounding like the umpteenth attempt to make a takeoff on Hank Ballard's old &quot;Work With Me Annie&quot; series of R&amp;B hits. All nine of the alternate takes are alternates of songs from Sings the Backporch Blues itself, and these are thoughtfully separated from the dozen official takes themselves to enhance listening pleasure. ~ Richie Unterberger\n\nTracklist\n1. I Can't Judge Nobody\n2. Come On Rock Little Girl\n3. Honey I Ain't Teasin'\n4. You're Gonna Be Sorry\n5. (What I Done For You) Give It Back\n6. Smokey's Love Sick Blues\n7. I've Been Drinking Muddy Water\n8. Crying Tears\n9. Midnight and Day\n10. Blind and Dumb Man Blues\n11. What Am I Going to Do\n12. I Ain't Gonna Be No Monkey Man No More\n13. The Case Is Closed\n14. Way Up in the Mountains of Kentucky\n15. Hello Little School Girl\n16. Twist with Me Annie\n17. I've Been Drinking Muddy Water (previously unissued alternate take)\n18. Blind and Dumb Man Blues (previously unissued take 1)\n19. Honey I Ain't Teasin' (previously unissued take 2)\n20. Smokey's Love Sick Blues (previously unissued take 1)\n21. Come on Rock Little Girl (previously unissued alternate incomplete take)\n22. Midnight and Day (previously unissued take 1 incomplete)\n23. (What I Done for You) Give It Back (previously unissued take 1)\n24. I Ain't Gonna Be No Monkey Man No More (previously unissued take 2)\n25. You're Gonna Be Sorry (previously unissued take 1)\n\nOriginally released on King (779).\n","torrent":{"xt":"urn:btih:97e9c6ea14c86abae859f53f77d03d2b9cf6b91a","amp;dn":"Otis+Smokey+Smothers++Sings+the+Back+Porch+Blues+%28blues%29%28mp3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97e9c6ea14c86abae859f53f77d03d2b9cf6b91a","infoHashBuffer":{"type":"Buffer","data":[151,233,198,234,20,200,106,186,232,89,245,63,119,208,61,43,156,246,185,26]},"announce":[],"urlList":[]}}