{"title":"Abarat - Clive Barker","uid":12091289,"size":261378457,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:98026cd12ec0dbe14880e1492ba6ae98962a6dbc&amp;dn=+Abarat+-+Clive+Barker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gbgarista","files":41,"time":1436055610,"description":"Written by Clive Barker\nRead by Richard Ferrone\nFormat: MP3\nUnabridged\n\nIt begins in the most boring place in the world: Chickentown, U.S.A. There lives Candy Quackenbush, her heart bursting for some clue as to what her future might hold. When the answer comes, it's not one she expects. Out of nowhere comes a wave, and Candy, led by a man called John Mischief (whose brothers live on the horns on his head), leaps into the surging waters and is carried away.\n\nWhere? To the Abarat: a vast archipelago where every island is a different hour of the day, from The Great Head that sits in the mysterious twilight waters of Eight in the Evening, to the sunlit wonders of Three in the Afternoon, where dragons roam, to the dark terrors of Gorgossium, the island of Midnight, ruled over by the Prince of Midnight himself, Christopher Carrion.\n\nCandy has a place in this extraordinary world: she is here to help save the Abarat from the dark forces that are stirring at its heart. Forces older than Time itself, and more evil than anything Candy has ever encountered.\n\nThis is one of my favorite series. Splitting this one into chapters was a project I put a lot of love into. I really hope ya'll enjoy these three","torrent":{"xt":"urn:btih:98026cd12ec0dbe14880e1492ba6ae98962a6dbc","amp;dn":"+Abarat+-+Clive+Barker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98026cd12ec0dbe14880e1492ba6ae98962a6dbc","infoHashBuffer":{"type":"Buffer","data":[152,2,108,209,46,192,219,225,72,128,225,73,43,166,174,152,150,42,109,188]},"announce":[],"urlList":[]}}