{"title":"Young Mr. Lincoln (Henry Fonda) [1939] .avi","uid":4990638,"size":669771728,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:981444a60615fc95bca1154ec750826382b88c7d&amp;dn=Young+Mr.+Lincoln+%28Henry+Fonda%29+%5B1939%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alien99","files":1,"time":1247016247,"description":"I cropped the first 22 seconds of this to remove some unwanted text on it.\ni also lost sound on this portion of it, after several converision tries i decided to leave this part without sound.\n\n\n\n\tHenry Fonda\t... \tAbraham Lincoln\n\tAlice Brady\t... \tAbigail Clay\n\tMarjorie Weaver\t... \tMary Todd\n\tArleen Whelan\t... \tSarah Clay\n\tEddie Collins\t... \tEfe Turner\n\tPauline Moore\t... \tAnn Rutledge\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0032155/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0032155/&lt;/a&gt;\n\nUser Rating:   7.6/10\n\nTrivia:\nHenry Fonda originally turned down the role of Lincoln, saying he didn't think he could play such a great man. He changed his mind after John Ford asked him to do a screen test in full makeup. After viewing himself as Lincoln in the test footage, Fonda liked what he saw, and accepted the part. He later told an interviewer, &quot;I felt as if I were portraying Christ himself on film.&quot; \n\n\n\nYoung Mr. Lincoln marks the first film of the director/star collaboration of John Ford and Henry Fonda. I recall years ago Fonda telling that as a young actor he was understandably nervous about playing Abraham Lincoln and scared he wouldn't live up to the challenge.\n\nJohn Ford before the shooting starts put him at ease by saying he wasn't going to be playing the Great Emancipator, but just a jack-leg prairie lawyer. That being settled Fonda headed a cast that John Ford directed into a classic film.\n\nThis is not a biographical film of Lincoln. That had come before in the sound era with Walter Huston and a year after Young Mr. Lincoln, Raymond Massey did the Pulitzer Prize winning play by Robert Sherwood Abe Lincoln in Illinois. Massey still remains the definitive Lincoln.\n\nBut as Ford said, Fonda wasn't playing the Great Emancipator just a small town lawyer in Illinois. The film encompasses about 10 years of Lincoln's early life. We see him clerking in a general store, getting some law books from an immigrant pioneer family whose path he would cross again later in the story. And his romance with Ann Rutledge with her early death leaving Lincoln a most melancholy being.\n\nFast forward about 10 years and Lincoln is now a practicing attorney beginning to get some notice. He's served a couple of terms in the legislature, but he's back in private practice not really sure if politics is for him.\n\nThis is where the bulk of the action takes place. The two sons of that family he'd gotten the law books from way back when are accused of murder. He offers to defend them. And not an ordinary murder but one of a deputy sheriff.\n\nThe trial itself is fiction, but the gambit used in the defense of Richard Cromwell and Eddie Quillan who played the two sons is based on a real case Lincoln defended. I'll say no more.\n\n\n\n","torrent":{"xt":"urn:btih:981444a60615fc95bca1154ec750826382b88c7d","amp;dn":"Young+Mr.+Lincoln+%28Henry+Fonda%29+%5B1939%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"981444a60615fc95bca1154ec750826382b88c7d","infoHashBuffer":{"type":"Buffer","data":[152,20,68,166,6,21,252,149,188,161,21,78,199,80,130,99,130,184,140,125]},"announce":[],"urlList":[]}}