{"title":"Jackie De Shannon - The Definitive Collection  FLAC","uid":5610402,"size":488378171,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:98cbf9be94b396795546694aeff3d6a20ffa4718&amp;dn=Jackie+De+Shannon+-+The+Definitive+Collection++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"keeybee","files":37,"time":1275836164,"description":"Please seed!\n\nJackie DeShannon (born Sharon Lee Myers on August 21, 1944 in Hazel, Kentucky, is an American singer-songwriter with a string of hit song credits from the 1960s onwards. She was one of the first female singer-songwriters of the rock 'n' roll period.\nSharon Myers adopted the name Jackie DeShannon, believed to be the name of an Irish ancestor. Executives at Liberty Records thought the name Sharon Myers would not help sell records. (Wiki)\nShe recorded, and had hits with &quot;Needles and Pins&quot; and her own &quot;When You Walk In The Room&quot;. Both songs covered by The Searchers in UK. Tracey Ullman recorded &quot;Breakawy&quot; on her first album &quot;You broke my heart in 17 places&quot; 1983.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Jackie_DeShannon&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Jackie_DeShannon&lt;/a&gt;\n\n\nJackie De Shannon - The Definitive Collection\nWhat The World Need Now Is... Jackie De Shannon - The Definitive Collection\nThis compilation 1994\n\n01  Jackie De Shannon - The Definitive Collection - Buddy\n02  Jackie De Shannon - The Definitive Collection - Heaven Is Being With You\n03  Jackie De Shannon - The Definitive Collection - You Won't Forget Me\n04  Jackie De Shannon - The Definitive Collection - Needles and Pins\n05  Jackie De Shannon - The Definitive Collection - Hellos and Goodbyes\n06  Jackie De Shannon - The Definitive Collection - When You Walk In the Room\n07  Jackie De Shannon - The Definitive Collection - Till You Say You'll Be Mine\n08  Jackie De Shannon - The Definitive Collection - Breakaway\n09  Jackie De Shannon - The Definitive Collection - Should I Cry (Alternate Take)\n10  Jackie De Shannon - The Definitive Collection - I Remember the Boy\n11  Jackie De Shannon - The Definitive Collection - Dream Boy\n12  Jackie De Shannon - The Definitive Collection - Don't Turn Your Back On Me\n13  Jackie De Shannon - The Definitive Collection - What The World Needs Now Is Love\n14  Jackie De Shannon - The Definitive Collection - Lifetime Of Loneliness\n15  Jackie De Shannon - The Definitive Collection - Come and Get Me\n16  Jackie De Shannon - The Definitive Collection - Splendor In The Grass (Version #1)\n17  Jackie De Shannon - The Definitive Collection - For Granted\n18  Jackie De Shannon - The Definitive Collection - Windows and Doors\n19  Jackie De Shannon - The Definitive Collection - I Can Make It With You\n20  Jackie De Shannon - The Definitive Collection - 500 Miles From Yesterday\n21  Jackie De Shannon - The Definitive Collection - Where Does The Sun Go\n22  Jackie De Shannon - The Definitive Collection - It Shines On You Too\n23  Jackie De Shannon - The Definitive Collection - Reason To Believe\n24  Jackie De Shannon - The Definitive Collection - The Weight\n25  Jackie De Shannon - The Definitive Collection - Come and Stay With Me (Remix)\n26  Jackie De Shannon - The Definitive Collection - Put A Little Love In Your Heart\n27  Jackie De Shannon - The Definitive Collection - Love Will Find a Way\n28  Jackie De Shannon - The Definitive Collection - Brighton Hill\n29  Jackie De Shannon - The Definitive Collection - Laurel Canyon (Advertisement)\n30  Jackie De Shannon - The Definitive Collection - Put A Little Love In Your Heart (Advertisement)\n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:jifexqqhldje&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:jifexqqhldje&lt;/a&gt;","torrent":{"xt":"urn:btih:98cbf9be94b396795546694aeff3d6a20ffa4718","amp;dn":"Jackie+De+Shannon+-+The+Definitive+Collection++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98cbf9be94b396795546694aeff3d6a20ffa4718","infoHashBuffer":{"type":"Buffer","data":[152,203,249,190,148,179,150,121,85,70,105,74,239,243,214,162,15,250,71,24]},"announce":[],"urlList":[]}}