{"title":"Osho_The Last Testament Vol-2 #26-life is accidental.mp4","uid":15397035,"size":567019843,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:994e294a52a9ba221b8e17de7a58852a80fe907f&amp;dn=Osho_The+Last+Testament+Vol-2+%2326-life+is+accidental.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1469406524,"description":"\nOsho:\r\nThe Last Testament, vol.2-Chapter # 26 \r\n 17 September 1985 pm in Sanai Grove \r\nINTERVIEW WITH METRO MEDIA, LOS ANGELES, CA\r\n\r\n...\r\nSERIOUS QUESTION: YOU KNEW SHEELA FOR A LONG TIME.\r\nA:* Non-serious answer: Not very long, and not very much.\r\nQ:* HOW WAS SHE ABLE TO FOOL YOU, DO YOU THINK?\r\nA:* Just accidental.\r\nQ:* AN ACCIDENT?\r\nA:* Life is accidental. We are talking just an accident, nothing predestined.\r\n......\r\n\r\n\r\nQ:* HAVE YOU TRAVELLED AT ALL OUTSIDE OREGON IN THE UNITED STATES?\r\n\r\nA:* No, just in New Jersey I was for three months in the beginning when we were searching for the land. So I had a very beautiful castle, one-hundred year old, and really a piece of art, and we renovated it and made it completely new. We enjoyed the renovation of the old place, but by that time it was finished I had to come here and started making this place.\r\n\r\nNow we have rooms for five thousand sannyasins with all modern facilities. The whole city is centrally air-conditioned. Perhaps this is the first commune which is completely air-conditioned, with all the facilities and comforts, because I don't believe in poverty. I believe just in super comfort.\r\n\r\nQ:* DO YOU HAVE MORE BUILDING TO DO HERE?\r\n\r\nA:* Yes. We will -- just this case has to be finished, because the case is there we cannot build anything. It is under litigation. Once the litigation is over, we are going to make. But not big buildings, we don't want to make New York. We can make. Our place is three times bigger than New York, but we will make small chalets like Switzerland on all the hills around. We want it to be a fairy land....\r\n\r\ndownload free Osho books and audios from oshoworld(dot)com","torrent":{"xt":"urn:btih:994e294a52a9ba221b8e17de7a58852a80fe907f","amp;dn":"Osho_The+Last+Testament+Vol-2+%2326-life+is+accidental.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"994e294a52a9ba221b8e17de7a58852a80fe907f","infoHashBuffer":{"type":"Buffer","data":[153,78,41,74,82,169,186,34,27,142,23,222,122,88,133,42,128,254,144,127]},"announce":[],"urlList":[]}}