{"title":"The Way Home by George Pelecanos {dwg}","uid":11580334,"size":2712138,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99d8776816a3b28ea6486976bfe9b6267a4a64a2&amp;dn=The+Way+Home+by+George+Pelecanos+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1417119648,"description":"Christopher Flynn is trying to get it right. After years of trouble and rebellion that enraged his father and nearly cost him his life, he has a steady job in his father's company, he's seriously dating a woman he respects, and, aside from the distrust that lingers in his father's eyes, his mistakes are firmly in the past.\n\nOne day on the job, Chris and his partner come across a temptation almost too big to resist. Chris does the right thing, but old habits and instincts rise to the surface, threatening this new-found stability with sudden treachery and violence. With his father and his most trusted friends, he takes one last chance to blast past the demons trying to pull him back.\n\nLike Richard Price or William Kennedy, Pelecanos pushes his characters to the extremes, their redemption that much sweeter because it is so hard fought. Pelecanos has long been celebrated for his unerring ability to portray the conflicts men feel as they search and struggle for power and love in a world that is often harsh and unforgiving but can ultimately be filled with beauty","torrent":{"xt":"urn:btih:99d8776816a3b28ea6486976bfe9b6267a4a64a2","amp;dn":"The+Way+Home+by+George+Pelecanos+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99d8776816a3b28ea6486976bfe9b6267a4a64a2","infoHashBuffer":{"type":"Buffer","data":[153,216,119,104,22,163,178,142,166,72,105,118,191,233,182,38,122,74,100,162]},"announce":[],"urlList":[]}}