{"title":"Just Write it! - Greta Solomon.pdf","uid":9860518,"size":1210419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a7840a18c56638ad2477476780bfc6b24908351&amp;dn=Just+Write+it%21+-+Greta+Solomon.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1396288090,"description":"Just Write It! is a writing skills book with a difference.\nIt teaches students to unblock their preconceptions and negative thoughts about writing. This helps them to achieve the marks that they are capable of and to realize their full potential. \nAuthored by a professional writer and writing coach, this book uses a proven method and set of techniques that unlock creativity and teach students to fully articulate their thoughts and tackle any written task. \nQuizzes, exercises and checklists allow students to assess their current writing behaviour and track their improvement. Students are first introduced to general skills and techniques before learning how to apply these skills to the most common types of writing they are likely to face. \n\nThis unique book covers topics including:\n\nDeveloping a positive attitude to writing\nUsing objects to kick-start creativity\nGenerating ideas and turning them into arguments\nApplying your new knowledge to essays, dissertations, reports and articles\nWriting your way to your dream job\n\n&quot;The biggest stumbling block for some students is their writing skills, yet the ability to articulate yourself in writing is vital for success. Just Write It! is a reader-friendly, step by step book, which demystifies academic writing and breaks the process down into bite-sized chunks. It gives great practical advice in simple stages, which guide the reader to developing their writing skills.&quot;\nVanessa Heaslip, Senior Lecturer in Adult Nursing, Bournemouth University, UK\n&quot;This is a well-designed book to support undergraduates through their university journey. It is user-friendly with its clear, easy to follow structure. This book is a great support mechanism to help undergraduates to achieve. I highly recommend this text - it is an essential resource for undergraduates!&quot;\nEmma Jackson, University of Worcester, UK","torrent":{"xt":"urn:btih:9a7840a18c56638ad2477476780bfc6b24908351","amp;dn":"Just+Write+it%21+-+Greta+Solomon.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a7840a18c56638ad2477476780bfc6b24908351","infoHashBuffer":{"type":"Buffer","data":[154,120,64,161,140,86,99,138,210,71,116,118,120,11,252,107,36,144,131,81]},"announce":[],"urlList":[]}}