{"title":"Grateful Dead - Go to Heaven (1980) 2013 HDTracks 24-96-FLAC","uid":11157398,"size":858239441,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9b319845fd0809877f69c848fbc8a9b8025514a9&amp;dn=Grateful+Dead+-+Go+to+Heaven+%281980%29+2013+HDTracks+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"hal4000","files":-1,"time":1412456644,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nTime has somewhat mellowed the general disdain that critics and Deadheads alike leveled at Go to Heaven upon its release in May of 1980. Granted, none of these readings come close to their perfunctory live counterparts. However, that argument holds true for a vast majority of the Dead's studio catalog -- which had now grown to include 16 albums. Additionally, this disc marked the beginning of keyboardist Brent Mydland's tenure -- who had joined the band in the spring of the previous year and would remain for a decade. All eight of the songs -- not including &quot;Antwerp's Placebo (The Plumber),&quot; which is a 38-second instrumental percussion track -- had either already worked their way into the Dead's live performance repertoire, or would in due time. These include &quot;Althea,&quot; &quot;Feel Like a Stranger,&quot; and &quot;Saint of Circumstance,&quot; as well as the raucous rock &amp; roll opening cut, &quot;Alabama Getaway&quot; -- which was likewise often the band's opening number in concert during the early '80s. (In a somewhat Prankster-esque sense of irony, &quot;Don't Ease Me In&quot; -- the disc's final number -- also closed many a first set during this era; additionally notable about the track is that it was one of the first songs the band performed back in 1965 -- when they were known as the Warlocks.) In terms of the quality of material, Go to Heaven includes few gems. Primary among them are Bob Weir's &quot;Lost Sailor&quot; and &quot;Saint of Circumstance&quot; pairing. While obviously not as thoroughly developed as it would become in concert, the lilting melody and fluctuating tempos are reminiscent of his &quot;Weather Report Suite&quot; from the 1973 release Wake of the Flood. The groovin' Jerry Garcia-sung ballad &quot;Althea&quot; is yet another example of a tune that would take on bolder and brighter hues as a concert staple for the remainder of the Dead's performance life.\n\nHDTracks PCM-24Bit-96Khz-FLAC.","torrent":{"xt":"urn:btih:9b319845fd0809877f69c848fbc8a9b8025514a9","amp;dn":"Grateful+Dead+-+Go+to+Heaven+%281980%29+2013+HDTracks+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b319845fd0809877f69c848fbc8a9b8025514a9","infoHashBuffer":{"type":"Buffer","data":[155,49,152,69,253,8,9,135,127,105,200,72,251,200,169,184,2,85,20,169]},"announce":[],"urlList":[]}}