{"title":"The Hidden Oasis - Paul Sussman","uid":9710476,"size":760979,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d21aab667e50b3a12f89f0981ae5b1bf3d95852&amp;dn=The+Hidden+Oasis+-+Paul+Sussman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1394106478,"description":"Egypt 2153 BC \nEighty priests set out under cover of darkness into the western desert, taking with them a mysterious object swathed in cloth. Four weeks later, having reached their destination, they calmly slit each other's throats...Albania, 1986 A plane takes off from a remote airfield, bound for the Sudan. On board a cargo that will forever change the Middle East. Somewhere over the Sahara the plane disappears...The western desert, the present day A group of Bedouin discover a mummified corpse half-buried in the dunes. With it are a roll of camera film and a miniature clay obelisk inscribed with a curious hieroglyphic sign...Three unconnected events Or so it seems until Freya Hannen arrives in Egypt for the funeral of her sister, a desert explorer who has inexplicably taken her own life...For Freya it is the start of a terrifying, life-or-death adventure - one that will lead her and Egyptologist Flin Brodie deep into the forbidding wastes of the Sahara. Their goal: one of archaeology's greatest mysteries and the astonishing secret at its heart...","torrent":{"xt":"urn:btih:9d21aab667e50b3a12f89f0981ae5b1bf3d95852","amp;dn":"The+Hidden+Oasis+-+Paul+Sussman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d21aab667e50b3a12f89f0981ae5b1bf3d95852","infoHashBuffer":{"type":"Buffer","data":[157,33,170,182,103,229,11,58,18,248,159,9,129,174,91,27,243,217,88,82]},"announce":[],"urlList":[]}}