{"title":"Micromechanics and Nanosimulation of Metals and Composites","uid":15471769,"size":69818533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d70e65a3e3208a52aa7327448a06c7d2a279f4d&amp;dn=Micromechanics+and+Nanosimulation+of+Metals+and+Composites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470145526,"description":"Micromechanics and Nanosimulation of Metals and Composites - Siegfried Schmauder, Leon Mishnaevsky Jr. (Springer, 2009).pdf\r\n\r\nThe strength of metallic materials determines the usability and reliability of all the machines, tools and equipment around us. Yet, the question about which mechanisms control the strength and damage resistance of materials and how they can be optimised remains largely unanswered. How do real, heterogeneous ma- rials deform and fail? Why can a small modification of the microstructure increase the strength and damage resistance of materials manifold? How can the strength of heterogeneous materials be predicted? The purpose of this book is to present different experimental and computational analysis methods of micromechanics of damage and strength of materials and to demonstrate their applications to various micromechanical problems. This book summarizes at a glance some of the publications of the Computational Mechanics Group at the IMWF/MPA Stuttgart, dealing with atomistic, micro- and meso- chanical modelling and experimental analysis of strength and damage of metallic materials. In chapter 1, the micromechanisms of damage and fracture in different groups of materials are investigated experimentally, using direct observations and inverse analysis. The interaction of microstructural elements with the evolving damage is studied in these experiments. Chapter 2 presents different approaches to the - cromechanical simulation of composite materials: embedded unit cells, multiphase finite elements and multiparticle unit cells. Examples of the application of these models to the analysis of deformation and damage in different materials are given. Chapter 3 deals with the methods of numerical modelling of damage evolution and crack growth in heterogeneous materials","torrent":{"xt":"urn:btih:9d70e65a3e3208a52aa7327448a06c7d2a279f4d","amp;dn":"Micromechanics+and+Nanosimulation+of+Metals+and+Composites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d70e65a3e3208a52aa7327448a06c7d2a279f4d","infoHashBuffer":{"type":"Buffer","data":[157,112,230,90,62,50,8,165,42,167,50,116,72,160,108,125,42,39,159,77]},"announce":[],"urlList":[]}}