{"title":"NCIS Season 12 DVD 1 (NLsubs) TBS B-SAM","uid":11825551,"size":4393770238,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9dcb90f75a765dff1e26a6b183b69cf1737a3b0d&amp;dn=NCIS+Season+12+DVD+1+%28NLsubs%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Mad_Parrot","files":25,"time":1429481340,"description":"\n \nNCIS Season 12 DVD 1\n\nLand : Verenigde Staten\nGenre: Drama, Action\n\n\n\n\n\n\n\nNederlands:\n\nNCIS gaat over een groep speciale agenten in dienst van NCIS \n(Naval Criminal Investigative Service) hun doel is onderzoek \nte doen naar alle misdaden die gelinkt zijn aan de marine. \nDit kan lopen van moord op een marinier tot spionage op militair \ndomein, van drugsdealen tot verkrachting. Ze doen het op hun \neigen onorthodoxe manier, maar krijgen dit toch gedaan.\n\n\n\nEngels:\n\n\nThe twelfth season of the police procedural drama NCIS premiered on September 23, 2014, in the same time slot as in the previous seasons, Tuesdays at 8 pm. This is the first season in which NCIS: Los Angeles did not air after NCIS. This season, NCIS: New Orleans aired after NCIS.[1] The entire season eleven cast renewed their contracts and returned for the new season.[2] The premiere episode aired on September 23, 2014 and was seen by 18.23 million people.[3]\n\nThe main antagonist of the season is Sergei Mishnev, played by Alex Veadov. This character first appears in the premiere episode &quot;Twenty Klicks&quot;.In episode four, &quot;Choke Hold&quot;, one of Sergei's associates is sent to the United States to kill a Russian scientist that refused to work with him. Anton Pavlenko (previously seen in &quot;Twenty Klicks&quot;), portrayed by Lev Gorn, a Russian counselor, reappears in this episode. Veadov returns as Sergei in &quot;Check&quot; where he &quot;gets personal&quot; with Gibbs by killing Gibbs' ex-wife Diane the same way that Caitlin Todd was killed, stalking Rebecca, another of Gibbs' ex-wives, and staging murders mimicking the deaths of Mike Franks and Jenny Shepard. Sergei returns again in &quot;Cabin Fever&quot; where he is killed by Tobias Fornell, who was also married to Diane at one point and who was dealing with intense grief and depression following Diane's murder. It is revealed that Sergei and Ari Haswari are half brothers from Ari's mother, whereas Ari and Ziva David were half brother and sister from their father, Eli David.\n\n\n\nActeurs:\n\nMark Harmon as Leroy Jethro Gibbs, Special Agent in Charge assigned to Washington's Navy Yard\nMichael Weatherly as Anthony DiNozzo, Special Agent, second in command\nPauley Perrette as Abby Sciuto, Forensic Specialist attached to NCIS\nDavid McCallum as Dr. Donald Mallard, Chief Medical Examiner\nSean Murray as Timothy McGee, Special Agent\nRocky Carroll as Leon Vance, Director of NCIS\nBrian Dietzen as Jimmy Palmer, Assistant Medical Examiner\nEmily Wickersham as Eleanor Bishop, Probationary Agent\nDVD-1\n01.Twenty Klicks\n02.Kill the Messenger\n03.So It Goes\n04.Choke Hold\n \n18 Nov. 2014 \nTwenty Klicks \nGibbs and McGee are shot down in a Naval helicopter over remote parts of Russia while on a mission to escort an NCIS computer geek safely home. Meanwhile, the gang at home anxiously work to help bring them all home safely. \n\n\n \n25 Nov. 2014 \nKill the Messenger \nA Navy Commander is murdered near the White House, it is learned that he was on his way to talk to the President. Gibbs and his team must determine if it is because of his relationship with the President or because of his marital problems. \n\n\n\n2 Dec. 2014 \nSo It Goes \nFlashbacks into his past help tell the tale for Dr. Mallard as he and Bishop travel to England in search of answers to find out why an Englishman murdered in the United States would have a list of deceased Navy men on his person. \n\n\n9 Dec. 2014 \nChoke Hold \nAfter a scientist is decapitated by a strangulation device in a park, Gibbs and his team search for the woman who was her former research partner in Russia in order to learn who is behind her murder. They learn it may be a familiar foe. \n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : Dvd 5\nBron          : Web-DL 1080P\nMenu          : Ja\nAudio         : Engels DD 5.1\nExtra's       : Nee\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Drama, Action\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0364845/episodes?season=12&amp;ref_=tt_eps_sn_12&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0364845/episodes?season=12&amp;ref_=tt_eps_sn_12&lt;/a&gt;\n\nVerrast???? \n\n\nKom eens kijken bij \n\n &lt;a href=&quot;\nHttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nHttp://black-sam.org&lt;/a&gt;","torrent":{"xt":"urn:btih:9dcb90f75a765dff1e26a6b183b69cf1737a3b0d","amp;dn":"NCIS+Season+12+DVD+1+%28NLsubs%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dcb90f75a765dff1e26a6b183b69cf1737a3b0d","infoHashBuffer":{"type":"Buffer","data":[157,203,144,247,90,118,93,255,30,38,166,177,131,182,156,241,115,122,59,13]},"announce":[],"urlList":[]}}