{"title":"ShareX v11.2.0","uid":15596173,"size":9951568,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9dd58ed5350077796407656e85c136a52c285f1e&amp;dn=ShareX+v11.2.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LxByte","files":2,"time":1471569437,"description":"ShareX 11.2.0 - 2016-08-19\r\n\r\nAdded option to check for pre-releases in Application settings window. Future updates will initially release as pre-release and if release is stable enough, it will be released to rest of people\r\nRegion capture (Ctrl + Printscreen) related changes:\r\nAdded freehand drawing tool\r\nAdded freehand region tool\r\nWhen drawing with freehand you can hold Shift to draw direct lines which will work like polygon capture\r\nAlso you can hold Ctrl while drawing to move entire freehand shape\r\nAfter shape is created in freehand region, node will be shown at last point which you can drag it to continue drawing\r\nWhen region capture opened show current region type at top momentarily\r\nRemoved freehand &amp; polygon capture from capture menu because region capture has better version of it now\r\nPressing Ctrl + Z will undo shape additions (So you can hold it to remove all previously added shapes)\r\nAfter any shape is created Arrow keys will resize from bottom right instead of top left, you can hold Alt to resize from top left\r\nSupport using W, A, S, D keys to move or resize shapes\r\nWhen dragging resize nodes, node will center to cursor position that way magnifier can point exact pixel at corner\r\nQ key will swap between multi region mode and quick region mode\r\nFor non rectangle shape regions output will be cut with anti aliasing\r\nWhen right click before open options menu select shape under cursor\r\nNote: If you have low FPS then hiding tips with F1 will increase FPS greatly because text rendering every frame is costly\r\nAllow reordering hotkeys in Hotkey settings window\r\nShareX main window: Added &quot;Download&quot; button to task right click menu for tasks which have file URL\r\nAdded transfer.sh file uploader\r\nTask settings -&gt; Image tab: Added auto use JPEG image format option instead of previous Image Format 2 option\r\nShareX will save temporary files to Temp/ShareX folder and clean this folder on startup\r\nRemoved anonymous upload support from lithi.io (by @lithium720)\r\nAdded abort screen recording hotkey\r\nScreen color picker format option moved to Task settings -&gt; Tools tab from Advanced tab and have popup to show all formats (If you are using custom value for this setting you need to reconfigure it)\r\nScreen color picker: $hex format will be lowercase and $HEX will output uppercase hexadecimal color info\r\nUpdate OCR.Space to use new NA API endpoints\r\n\r\nShareX - the Swiss Knife of the screenshot tools.\r\nVersion 11 has great changes, check the changelog link at the end of the description\r\n\r\nTake a screenshot or a screencast, have it uploaded and get the URL copied to your clipboard with a single hotkey.\r\n\r\nFree, open source, lightweight and free from advertisements!\r\n\r\nAdvanced screenshot capture, screen recorder, file sharing and productivity tool.\r\n\r\nVarious methods of capturing screenshots including full screen, window, monitor, region, freehand, scrolling, and more.\r\n\r\nCustomizable after capture tasks such as annotating, adding effects, watermarking, uploading, printing and other actions.\r\n\r\nUpload any files using configurable hotkeys, clipboard upload, drag &amp; drop or from the Windows Explorer context menu.\r\n\r\nSupports over 50 different image, text, and file hosting services such as Imgur, FTP, Dropbox, Pastebin etc. Also supports many URL shortening and sharing services.\r\n\r\nContains tools like a screen color picker, an image editor, a ruler, a DNS changer, a QR code generator, a directory indexer and more.\r\n\r\nUnlimited customizable workflows with hotkey specific settings.\r\n\r\nProgram that you can trust with over 8 years of active development.\r\n   \nhttps://getsharex.com/   \nhttps://github.com/ShareX/ShareX/wiki/Changelog","torrent":{"xt":"urn:btih:9dd58ed5350077796407656e85c136a52c285f1e","amp;dn":"ShareX+v11.2.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd58ed5350077796407656e85c136a52c285f1e","infoHashBuffer":{"type":"Buffer","data":[157,213,142,213,53,0,119,121,100,7,101,110,133,193,54,165,44,40,95,30]},"announce":[],"urlList":[]}}