{"title":"Glenn Harrold - Overcome Addictions","uid":4642444,"size":31956878,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9dec89bf324a8bf17e0d4c1803de43c569a1be82&amp;dn=Glenn+Harrold+-+Overcome+Addictions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prince213","files":3,"time":1231768604,"description":"Product Details\n\n    * Language: English\n    * Type: Audio Book\n    * Format: MP3 @ 128 Kbps\n    * Publisher: Diviniti Publishing (May 2005)\n\nProduct Description\n\nThis superb high quality hypnotherapy CD by the UKs best selling hypnotherapist Glenn Harrold, combines powerful clinical hypnotherapy techniques with state of the art digital recording technology. This title is part of the highly successful Diviniti Publishing Hypnosis range, which is well established as the UKs best selling self-help audiotapes and CDs. This empowering 33 minute Hypnotherapy session will help the listener to release any addictive pattern of behaviour. It will help with all types of addiction including: Food, Alcohol, Gambling, Drugs, TV, Internet, Sex, Computers, Shopping, Nicotine, Caffeine, Dieting, Chocolate, Nail biting, Work, etc etc. On the CD you will hear a pleasant English voice and 60 B.P.M sound effects guiding you into a deeply relaxed state of mental and physical relaxation. In this very receptive relaxed state you are given a number of post hypnotic and direct suggestions to help you free yourself of the addiction and to create a positive healthy replacement. There are also a number of background echoed affirmations, which pan from left to right in your headphones. This deeply relaxing and powerful method of delivering multiple suggestions simultaneously to the unconscious mind can facilitate positive changes very quickly. At the end of the recording you will be gently brought back to full waking consciousness with a combination of suggestion and music. There are also a number of positive subliminal suggestions (listed inside), which are embedded in the fade out music and facilitate the overall effect. This powerful CD gives you a completely safe and very effective way of overcoming any addictive pattern of behaviour and taking back control. Short 350 word description - A superb high quality hypnosis audio CD combining skilled hypnotherapy techniques with state of the art digital recording technology. From the UKs best selling self-help CDs by Glenn Harrold. A calming voice guiding the listener into a completely relaxed state. This empowering 33 minute Hypnotherapy session will help the listener to release any addictive pattern of behaviour.\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:9dec89bf324a8bf17e0d4c1803de43c569a1be82","amp;dn":"Glenn+Harrold+-+Overcome+Addictions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dec89bf324a8bf17e0d4c1803de43c569a1be82","infoHashBuffer":{"type":"Buffer","data":[157,236,137,191,50,74,139,241,126,13,76,24,3,222,67,197,105,161,190,130]},"announce":[],"urlList":[]}}