{"title":"David Bromberg - 1st Album","uid":7930532,"size":60242760,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9df2514875a18362cc46b712546789f885a5ef13&amp;dn=David+Bromberg+-+1st+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jazznbluz","files":-1,"time":1355705849,"description":"Years after he left Columbia University, where he majored in music, David Bromberg graduated from sideman status on his Columbia Records debut. Bromberg has paid his dues, playing guitar on Jerry Jeff Walker's chart single &quot;Mr. Bojangles,&quot; among dozens of other recording sessions and gigs as a backup musician. Notably, he played on Bob Dylan's Self Portrait and New Morning albums, and, though uncredited, Dylan has reportedly returned the favor, contributing harmonica on this LP's searing final track, &quot;Sammy's Song.&quot; Just before that comes the jocular highwayman romp &quot;The Holdup,&quot; co-written by Bromberg and George Harrison, with a lead guitar part that sounds characteristic of the co-author. Those may be Bromberg's heaviest friends, but he also employs a batch of folk and country compatriots throughout the album, among them David Amram, Norman Blake, and Vassar Clements. Typical of a debut album, this one finds the artist determined to demonstrate the range of his talent, and that range extends from pop/rock to bluegrass, with lots of blues and folk-blues thrown in. Bromberg sings in a matter-of-fact style, often with a comic edge, although he also brings out pathos in such tracks as &quot;Dehlia&quot; and &quot;Sammy's Song.&quot; The album seems to be a combination of live and studio recordings, the better to bring out the spirit of the music, and the musicians spark each other with lively performances. Bromberg may still be more of a player than a frontman, and more of a tradtionalist than a songwriter, but this disc presents a new wrinkle in some very familiar styles, suggesting that it's possible for an accomplished sideman to move downstage and take over the spotlight. \n","torrent":{"xt":"urn:btih:9df2514875a18362cc46b712546789f885a5ef13","amp;dn":"David+Bromberg+-+1st+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df2514875a18362cc46b712546789f885a5ef13","infoHashBuffer":{"type":"Buffer","data":[157,242,81,72,117,161,131,98,204,70,183,18,84,103,137,248,133,165,239,19]},"announce":[],"urlList":[]}}