{"title":"Nero 12 Platinium Edition","uid":14550419,"size":1142623621,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9e14056569374d7ff673d1b63d601697df3b7d62&amp;dn=Nero+12+Platinium+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"annuaireweb","files":4,"time":1462649857,"description":"Nero 12 est, comme d'habitude, une suite vraiment simple et complète, mais composée d'outils qui, pris, indépendamment, demanderaient a être un peu plus poussés (Nero burning ROM mis à part). Un logiciel à recommander aux utilisateurs qui cherchent la simplicité sans, malgré tout, renoncer à l'efficacité ?\r\n\r\nBien connu pour son logiciel de gravure Nero Burning ROM, Nero livre encore cette année une nouvelle version de sa suite multimédia nommée tout simplement Nero.Proposant des solutions simples destinées à simplifier la « vie multimédia » de l'utilisateur lambda, on retrouve au programme de cette 12ème mouture :\r\n- Nero Burning ROM, le logiciel de gravure de Blu-Ray, DVD et CD-ROM\r\n- Nero BackItUp, une solution très efficace pour sauvegarder ses données sur disque, support optique ou en ligne. L'interface du logiciel est un modèle de simplicité et la sauvegarde automatique permet de mettre ses fichiers en sécurité sans la moindre intervention (désormais compatible avec les disques de plus de 2To).\r\n- Nero Video, un logiciel de montage (un peu trop) simple et sans fioriture\r\n- Nero Recode, un logiciel de conversion vidéo\r\n- Nero Kwik Media, permettant de gérer et de synchroniser l'ensemble de ses médias audio, photo et vidéo,On retrouve également dans cette suite les logiciels\r\n- Nero Express, logiciel de copie et de gravure rapide et simplifié puis\r\n- Nero Rescue Agent permettant de récupérer des données sur un disque abimé.\r\n\r\nNotons, pour finir, l'ajout de la compatibilité Windows 8 et, de ce fait, l'intégration d'un lanceur « Modern UI » certes pratique mais que l'éditeur aurait peut-être gagné à travailler un peu plus.Pour cette mouture 12, la version Platinum apporte principalement la lecture de Blu-Ray 3D.\r\n\r\nNiveau montage vidéo : la stabilisation ainsi que des effets rétros pour la vidéo et, pour finir, l'extraction et la conversion de Blu-Ray.\r\n\r\nRemarque :  assez étonnamment pour un logiciel commercial, la version d'évaluation de Nero 12, tentera d'installer une barre d'outils pour vos navigateurs ; veillez à bien décocher les options la concernant lors de la phase d'installation du logiciel.\r\n\r\nSi vous rencontrez des problèmes de désinstallation, nous vous conseillons d'utiliser Nero General CleanTool pour éliminer proprement toutes traces du programme sur votre PC","torrent":{"xt":"urn:btih:9e14056569374d7ff673d1b63d601697df3b7d62","amp;dn":"Nero+12+Platinium+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e14056569374d7ff673d1b63d601697df3b7d62","infoHashBuffer":{"type":"Buffer","data":[158,20,5,101,105,55,77,127,246,115,209,182,61,96,22,151,223,59,125,98]},"announce":[],"urlList":[]}}