{"title":"Tigresses and Other Man-Eaters (1979)","uid":15494313,"size":719744921,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9e516a34b4e3b20ffead2f4f06af49e059b2111b&amp;dn=Tigresses+and+Other+Man-Eaters+%281979%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"distinc","files":4,"time":1470415717,"description":"Tigresses and Other Man-Eaters (1979)\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=9576893425\r\n \nhttp://imagedisco.net/?g=9133469062\r\n\r\n\r\nPlot:\r\n\r\nWhile taking a break from having sex, the &quot;tigress&quot; host tells four stories that prove all women are really sexual &quot;tigresses&quot; at heart. The first story is about Holly - a woman who beats both Lou and Larry at sports, then makes a double date and surprises them with an offer for a threesome. The second story is about Jill - a woman who likes cruising harbors to take an able-bodied seaman home. The third story is about Naomi and Nancy - a pair of twins who walk across each other after a long time apart. Nancy tells Naomi she has a boyfriend now, but Naomi makes out with her until their secret is revealed as they engage in incestuous sex. Eventually, Nancy's African American boyfriend arrives and they just silently welcome him for a threesome. After they are done, Naomi is about to leave, but the couple invite her to live with them as a triplet. The fourth and last story is about Rosita - a strictly Spanish speaking South American businesswoman. Rosita arranges for two American businessmen - Peter and Boris - to finish their business meeting at her home. Boris also brings over his secretary Pat. Rosita dances with Peter and then walks him to another room. The curious Pat and Boris follow them into what turns out to be the bedroom and have sex there themselves. Eventually the two couples join each other in an orgy. At one point, Peter takes a break in the kitchen, where he engages in anal sex with Rosita's lusty maid, Anita. After the businessmen leave with their business deal approved, the viewers learn that Rosita knew English all along but finds it horny to masquerade herself to men about it.\r\n\r\nGenre:Classic , Hardcore , Interracial , Lesby , Threesome","torrent":{"xt":"urn:btih:9e516a34b4e3b20ffead2f4f06af49e059b2111b","amp;dn":"Tigresses+and+Other+Man-Eaters+%281979%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e516a34b4e3b20ffead2f4f06af49e059b2111b","infoHashBuffer":{"type":"Buffer","data":[158,81,106,52,180,227,178,15,254,173,47,79,6,175,73,224,89,178,17,27]},"announce":[],"urlList":[]}}