{"title":"Stardust","uid":5168026,"size":61986382,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9f85114d2e93fcc2ad1ce2c7a16659d0c6503c1b&amp;dn=Stardust&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1258526525,"description":"Stardust was the first solo prose novel by Neil Gaiman.  It is usually published as a novel with illustrations by Charles Vess.  Stardust has a different tone and style from most of Gaiman's prose fiction, being consciously written in the tradition of pre-Tolkien English fantasy, following in the footsteps of authors such as Lord Dunsany and Hope Mirlees.\n\nStardust begins in a small English town named Wall, located a night's drive away from London. Wall is named after an old rock wall to its east, in which there is a small opening leading to a forest. This opening is a portal to the magical world of Faerie. It is carefully guarded by two watchmen at all times, except once every nine years on May Day, when a market comes to the meadow just past the wall.\n\nAt one of these May Day Markets Farmer Duncan Thorne had his moment of mad love with a witch's bondservant; Tristan, his son, turned up in a basket nine months later.  Years later when Tristan has grown up he foolishly promises to retrieve a fallen star for his sweetheart, Victoria and goes through the wall into the land of Faerie. \n\nFaerie, a world also featured in many of Gaiman's other works, such as The Sandman and The Books of Magic, is composed of &quot;each land that has been forced off the map by explorers and the brave going out and proving it wasn't there&quot;, and thus features many mythic creatures and objects. Most of Stardust takes place in Stormhold, a kingdom within Faerie named for the Stormhold, a fortress carved from Mount Huon.\n\nIn 2007, a film based on the book was released to generally positive reviews. Gaiman has also occasionally made references to writing a sequel, or at least another book concerning the village of Wall.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:9f85114d2e93fcc2ad1ce2c7a16659d0c6503c1b","amp;dn":"Stardust","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f85114d2e93fcc2ad1ce2c7a16659d0c6503c1b","infoHashBuffer":{"type":"Buffer","data":[159,133,17,77,46,147,252,194,173,28,226,199,161,102,89,208,198,80,60,27]},"announce":[],"urlList":[]}}