{"title":"[PS3] Rogue Warrior","uid":9527201,"size":2333007582,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:9fad965ad461659b55338526a0a1181c364c0997&amp;dn=%5BPS3%5D+Rogue+Warrior&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fuckface69","files":-1,"time":1390770270,"description":"Play as Richard &quot;Demo Dick&quot; Marcinko - a real-life American badass and founder of the elite SEAL Team 6. His defiant, crude, and sometimes ruthless behavior has earned him both glory and infamy in the history books. Now you take on his explosive nature as you engage in a blacker-than-black special ops mission behind the iron curtain. Go against the rules of conventional warfare to get the job done by any means necessary in this action-packed first-person shooter.\n\n* Brutal Kills: With more than 25 uniquely brutal kill moves, no trick is too dirty as you maintain the element of surprise whenever possible - find and kill the enemy before they find you.\n* Targets of Opportunity: Be an instrument of destruction as you create tactical advantages by eliminating any and all targets that would otherwise benefit the enemy.\n* Multiplayer Mode: Go head-to-head against others online and even perform brutal kill moves on your friends\n* Award-Winning Talent: Golden Globe winner and Oscar nominee Mickey Rourke voices Dick Marcinko's in-game character.\n* Source Material: Inspired by Richard Marcinko's New York Times bestselling autobiography of the same name, 'Rogue Warrior'.\n__________________________________________\n\nYOU CAN ONLY EXTRACT WITH LATEST WINRAR 5!","torrent":{"xt":"urn:btih:9fad965ad461659b55338526a0a1181c364c0997","amp;dn":"%5BPS3%5D+Rogue+Warrior","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fad965ad461659b55338526a0a1181c364c0997","infoHashBuffer":{"type":"Buffer","data":[159,173,150,90,212,97,101,155,85,51,133,38,160,161,24,28,54,76,9,151]},"announce":[],"urlList":[]}}