{"title":"Chomsky-Fateful Triangle-US,Israel&amp;Palestine(1999)","uid":4535695,"size":3261864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ff85758587f0475f53abc1e9210fe941259cb09&amp;dn=Chomsky-Fateful+Triangle-US%2CIsrael%26Palestine%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227727861,"description":"This is Noam Chomsky&amp;#039;s shocking book Fateful Triangle - The United States, Israel and the Palestine (1999) which is one of the most disturbing and compelling indictments of Israel&amp;#039;s apartheid policies and terror tactics not only against its captive overpowered palestinian victims in the occupied teritories but also against Lebanon its peaceful and once prosperous neighbour to the north - all fully supported by the US Government. First published in 1983 after Israel&amp;#039;s invasion of Lebanon, Fateful Triangle is a comprehensive indictment of what the author calls the &quot;disgraceful and extremely dangerous&quot; policy the United States has enacted towards Israel, particularly with regard to Israel&amp;#039;s actions concerning the Palestinians. Supporters of Israel must willfully overlook or deny that nation&amp;#039;s long history of human rights violations and military aggression and they will continue to do so as long as Israel is strategically useful towards &quot;the U.S. aim of eliminating possible threats, largely indigenous, to American domination of the Middle East region.&quot; In the course of elaborating his argument, Chomsky cuts through the myths and distortions that appear in mainstream media accounts; the damning facts that he so systematically assembles portray a government more brutally and overtly racist, perhaps, than even apartheid-era South Africa. Regretfully, most of this media is now owned/controlled by a few conglomerates and dominated/manipulated by the pro-israel, pro-war lobbies who will go to any length to distort history and facts hollywood style in favor of Israel&amp;#039;s version of events, i.e transforming the victim into the aggressor and vice versa! In this updated version, 3 new chapters are added, drawing upon material from Z magazine and other publications, incorporate such developments as the Palestinian uprising, Israel&amp;#039;s war on Lebanon, and the ongoing &quot;peace process.&quot; Thoroughly documented with evidence and facts particularly about Israel&amp;#039;s 1982 invasion and military occupation of Lebanon which caused the death of more than 20000 people mostly civilians and which lasted for 18 years. If you are comfortable with American foreign policy in the Middle East, this book offers a great opportunity to test your comfort. For some the most difficult part about reading something like this will be clearing their head of decades of US-Israeli bias in America&amp;#039;s press and popular culture. 930 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:9ff85758587f0475f53abc1e9210fe941259cb09","amp;dn":"Chomsky-Fateful+Triangle-US%2CIsrael%26Palestine%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ff85758587f0475f53abc1e9210fe941259cb09","infoHashBuffer":{"type":"Buffer","data":[159,248,87,88,88,127,4,117,245,58,188,30,146,16,254,148,18,89,203,9]},"announce":[],"urlList":[]}}