{"title":"JENNIFER@GOVERNMENT-Max Barry.mb4","uid":8714158,"size":243142509,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a03366935f19b1d432659f29a223914de92686b7&amp;dn=JENNIFER%40GOVERNMENT-Max+Barry.mb4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1374298212,"description":"Same size as original file,chapterized\n\nJennifer Government is Here to Help!\n\nIn Max Barry's twisted, hilarious vision of the near future, the world is run by giant American corporations (except for a few deluded holdouts like the French); taxes are illegal; employees take the last names of the companies they work for; The Police and The NRA are publicly-traded security firms; the U.S. government may only investigate crimes if they can bill a citizen directly. It's a free market paradise!\n\nHack Nike is a lowly Merchandising Officer who's not very good at negotiating his salary. So when John Nike and John Nike, executives from the promised land of Marketing, offer him a contract, he signs without reading it. Unfortunately, Hack's new contract involves shooting teenagers to build up street cred for Nike's new line of $2,500 sneakers. Scared, Hack goes to The Police, who assume he's asking for a subcontracting deal and lease the assassinations to the NRA.\n\nSoon Hack finds himself pursued by Jennifer Government, a tough-talking agent with a barcode tattoo under her eye and a rabid determination to nail John Nike (the boss of the other John Nike). In a world where your job title means everything, the most cherished possession is a platinum credit card, and advertising jingles give way to automatic weapons in the fight for market share, Jennifer Government is the consumer watchdog from hell.\n\nJennifer Government is the kind of novel that can become a byword--a Catch-22 for the New World Order, a satire both broad and pointed, deeply funny and disturbingly on-target.","torrent":{"xt":"urn:btih:a03366935f19b1d432659f29a223914de92686b7","amp;dn":"JENNIFER%40GOVERNMENT-Max+Barry.mb4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a03366935f19b1d432659f29a223914de92686b7","infoHashBuffer":{"type":"Buffer","data":[160,51,102,147,95,25,177,212,50,101,159,41,162,35,145,77,233,38,134,183]},"announce":[],"urlList":[]}}