{"title":"Oscar Peterson - Exclusively For My Friends - Boxed Set [FLAC]","uid":9625501,"size":1281564285,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a06e0f8804b660f4b2e7fe9c6c2db11d08fced1c&amp;dn=Oscar+Peterson+-+Exclusively+For+My+Friends+-+Boxed+Set+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jayb","files":-1,"time":1392584102,"description":"Oscar Peterson: Exclusively For My Friends [Boxed Set]\nRelease Date:\tOctober 20, 1992 [Boxed Set]\nLabel:\t\tVerve/Island #5138302\n\t\t4 Disc Set (36 tracks)\n\nAllMusic Review by Scott Yanow\nOscar Peterson has stated that he feels his MPS recordings are his finest. That is quite a statement considering the huge amount of records that the pianist has produced through the past 50 years. This four-CD set reissues the music from six of his MPS LPs: Action, Girl Talk, The Way I Really Play, My Favorite Instrument, Mellow Mood, and Travelin' On. While some of the performances feature the 1963 trio he had with bassist Ray Brown and drummer Ed Thigpen, most of the music dates from 1967-1968 and matches Peterson with bassist Sam Jones and either Louis Hayes or Bobby Durham on drums. A special treat is Peterson's first unaccompanied solo album, which fills up the final CD. Peterson's many fans know what to expect in this set, while other listeners need to discover him to realize what all of the fuss was about. Quite simply, Oscar Peterson has long been one of the greatest pianists the world has ever known; this reissue offers plenty of proof.\n______________________________________________________________\nNote:\nThese are the track lists for the original 6 LP/CD releases. \nThe boxed set combines them onto 4 CDs - the numbers in [brackets] to the right are their boxed set locations.\n______________________________________________________________\n\nOscar Peterson: Action (Exclusively For My Friends, Vol. 1)\n\nTrack Listing\t\t\t\t\t\t\t\n01 At Long Last Love\t\tCole Porter\t\t\t04:57\t[1-1]\n02 Easy Walker\t\t\tBilly Taylor\t\t\t09:42\t[1-2]\n03 Tin Tin Deo\t\t\tG Fuller/C Pozo\t\t\t05:36\t[1-3]\n04 I've Got A Crush On You\tG&amp;I Gershwin\t\t\t05:16\t[1-4]\n05 A Foggy Day\t\t\tG&amp;I Gershwin\t\t\t04:32\t[1-5]\n06 Like Someone In Love\t\tJ Burke/J Van Heusen\t\t11:18\t[1-6]\n\nAllMusic Review by Ken Dryden\nOscar Peterson developed a friendship with Hans Georg Brunner-Schwer, who proceeded to record the pianist in his first-rate studio beginning in the early '60s, even though Peterson was under an exclusive contract to Verve at the time. The solution to this problem was to wait until after it expired, and then a number of these sessions were released on various BASF or MPS LPs (and later on Pausa LP reissues). Action represents some of Peterson's earliest work for Brunner-Schwer; these sessions were recorded before an invited audience in the studio, with the pianist's working trio of Ray Brown and Ed Thigpen. The group seems extremely relaxed and inspired by the small group of loyal fans, with a brisk waltz treatment of &quot;At Long Last Love&quot; and an extended workout of fellow pianist Billy Taylor's ballad &quot;Easy Walker&quot; starting things off with a flourish. Their approach to &quot;Tin Tin Deo&quot; is remarkably subtle, while Peterson is at his most lyrical during a pair of Gershwin selections, &quot;I've Got a Crush on You&quot; and &quot;A Foggy Day.&quot; The influence of Art Tatum is apparent with Peterson's darting runs in &quot;Like Someone in Love.&quot;\n______________________________________________________________\n\nOscar Peterson: Girl Talk (Exclusively For My Friends, Vol. 2)\n\nTrack Listing\n01 On A Clear Day\t\t   Burton Lane/Alan Lerner\t04:26\t[1-7]\n02 I'm In The Mood For Love\t   Jimmy McHugh/Dorothy Fields\t17:22\t[1-8]\n03 Girl Talk\t\t\t   Neal Hefti/Bobby Troup\t05:40\t[1-9]\t\n04 I Concentrate On You/Moon River C Porter|H Mancini/J Mercer\t06:30\t[2-2]\n05 Robbin's Nest\t\t   I Jacquet/C Thompson\t\t06:22\t[2-1]\n\nAllMusic Review by Ken Dryden\nOne of a number of memorable albums recorded by Oscar Peterson for MPS during the mid-'60s, Girl Talk was compiled from several live studio sessions taped between 1964 and 1966, with bassist Sam Jones and either Bobby Durham or Louis Hayes on drums. Peterson's romping right hand helps this normally bland show tune. The pianist's imaginative unaccompanied introduction to &quot;I'm in the Mood for Love&quot; adds a new dimension to this old chestnut, with the rhythm section making a belated entrance; it is rather unusual to hear the trio play on just one song for 17 minutes. The title track, an overlooked gem jointly written by Bobby Troup and Neal Hefti, finds the leader in a bluesy mood. The relaxed but jaunty treatment of &quot;Robbin's Nest&quot; follows a powerful medley of &quot;I Concentrate on You&quot; and &quot;Moon River&quot; to wrap up this highly recommended session.\n______________________________________________________________\n\nOscar Peterson: The Way I Really Play (Exclusively For My Friends, Vol. 3)\n\nTrack Listing\n01 Waltzing Is Hip\tRay Brown\t\t\t\t06:07\t[2-3a]\n02 Satin Doll\t\tDuke Ellington\t\t\t\t10:02\t[2-3b]\n03 Love Is Here To Stay\tGeorge Gershwin\t\t\t\t04:51\t[2-4]\n04 Sandy's Blues\tOscar Peterson\t\t\t\t09:31\t[2-5]\n05 Alice In Wonderland\tSammy Fain\t\t\t\t04:45\t[2-6]\n06 Noreen's Nocturne\tOscar Peterson\t\t\t\t05:17\t[2-7]\n\nAllMusic Review by Ken Dryden\nThe third volume of Oscar Peterson's Exclusively for My Friends series, all recorded with an invited audience in the warm studio of producer Hans Georg Brunner-Schwer, features live trio sessions with bassist Sam Jones and drummer Bobby Durham. The program opens with an unusual medley of Ray Brown's &quot;Waltzing Is Hip&quot; (played with gusto) and a gently swinging &quot;Satin Doll.&quot; The influence of Art Tatum is apparent during his intricate runs within &quot;Love Is Here to Stay,&quot; while the multifaceted original &quot;Sandy's Blues&quot; (dedicated to his wife) combines a dark mood with a swinging setting. The lighthearted waltzing treatment of &quot;Alice in Wonderland&quot; is pure joy, while another original, &quot;Noreen's Nocturne,&quot; is simply a showstopper.\n______________________________________________________________\n\nOscar Peterson: My Favorite Instrument (Exclusively For My Friends, Vol. 4)\n\nTrack Listing\n01 Someone To Watch Over Me\tG&amp;I Gershwin\t\t\t04:18\t[4-1]\n02 Perdido\t\t\tE Drake/HJ Lengsfelder/J Tizol\t06:17\t[4-2]\n03 Body And Soul\t\tF Eyton/J Green/E Heyman/R Sour\t04:36\t[4-3]\n04 Who Can I Turn To\t\tLeslie Bricusse/Anthony Newley\t05:02\t[4-4]\n05 Bye Bye Blackbird\t\tMort Dixon / Ray Henderson\t04:56\t[4-5]\n06 I Should Care\t\tS Cahn/A Stordahl/P Weston\t04:48\t[4-6]\n07 Lulu's Back In Town\t\tA Dubin/H Warren\t\t02:10\t[4-7]\n08 Little Girl Blue\t\tTB Harms/L Hart/R Rodgers\t06:07\t[4-8]\n09 Take The &quot;A&quot; Train\t\tBilly Strayhorn\t\t\t02:39\t[4-9]\n\nAllMusic Review by Scott Yanow\nOscar Peterson recorded a remarkable amount of albums during his career but, surprisingly, this was his first full record of unaccompanied piano solos. Some observers consider his MPS recordings to be his best (quite a few are collected in the four-CD reissue Exclusively for My Friends, including this one). The solo album features Peterson (freed from the constraints of his trio) stretching out on nine familiar standards and really tearing into a few of them, including &quot;Perdido,&quot; &quot;Bye Bye Blackbird,&quot; &quot;Lulu's Back in Town,&quot; while giving &quot;Little Girl Blue&quot; a beautiful and lyrical treatment. A prelude to his outstanding Pablo recordings, My Favorite Instrument is one of Peterson's top albums of the 1960s.\n______________________________________________________________\n\nOscar Peterson: Mellow Mood (Exclusively For My Friends, Vol. 5)\n\nTrack Listing\n01 In a Mellow Tone\tD Ellington / M Gabler\t\t\t06:07\t[2-8]\n02 Nica's Dream\t\tH Silver\t\t\t\t07:56\t[2-9]\n03 Green Dolphin Street\tB Kaper/N Washington\t\t\t06:27\t[3-1]\n04 Summertime\t\tG&amp;I Gershwin/D Heyward\t\t\t05:30\t[3-2]\n05 Sometimes I'm Happy\tI Caesar/C Grey/V Youmans\t\t05:12\t[3-3]\n06 Who Can I Turn To\tL Bricusse/A Newley\t\t\t06:26\t[3-4]\n\nAllMusic Review by Ken Dryden\nThe fifth volume of Oscar Peterson's Exclusively for My Friends series is another lively trio affair with Sam Jones and Bobby Durham, though the album title Mellow Mood is a bit deceptive. &quot;In a Mellow Tone&quot; plunges in full force with a bluesy performance, with the audience responding to Peterson's opening solo as Durham switches from brushes to sticks. Peterson's amusing detour into Mercer Ellington's &quot;Things Ain't What They Used to Be&quot; and Jones' driving bass add to its appeal. His arrangement of Horace Silver's &quot;Nica's Dream&quot; begins quietly before he slowly turns on the turbochargers in an inspired performance. Gone is the overly dramatic introduction to &quot;On Green Dolphin Street&quot; heard during the earlier 1961 sessions at the London House; this interpretation is far more compelling as it doesn't seek to overwhelm the listener with the pianist's technique. The snappy take of &quot;Summertime&quot; is infused with a blues feeling in a brisk setting, while &quot;Who Can I Turn To&quot; evokes the memory of Art Tatum, though this composition was obviously never recorded by Oscar's good friend. Peterson fires up the tempo as Jones and Durham join him.\n______________________________________________________________\n\nOscar Peterson: Travelin' On (Exclusively For My Friends, Vol. 6)\n\nTrack Listing\n01 Travelin' On\t\t\tTraditional\t\t\t02:35\t[3-5]\n02 Emily\t\t\tJ Mandel/J Mercer\t\t10:27\t[3-6]\n03 Quiet Night Of Quiet Stars\tA Jobim/G Lees/V Moraes\t\t07:31\t[3-7]\n04 Sax No End\t\t\tFrancis Boland\t\t\t06:06\t[3-8]\n05 When Lights Are Low\t\tB Carter/S Williams\t\t11:02\t[3-9]\n\nAllMusic Review by Ken Dryden\nThis is yet another memorable concert by the Oscar Peterson Trio recorded in Hans Georg Brunner-Schwer's excellent studio. With bassist Sam Jones and drummer Bobby Durham, Peterson tears into the old gospel favorite &quot;Travelin' On&quot; with a passion second to none. Following it is a beautiful treatment of Johnny Mandel's timeless ballad &quot;Emily,&quot; which runs for over ten minutes but never loses its impact. Durham sets the pace with his soft percussion to set up Antonio Carlos Jobim's &quot;Corcovado&quot; (later known as &quot;Quiet Nights&quot;), though Peterson devours the song whole with a breathtaking display of his formidable technique. Francy Boland's &quot;Sax No End&quot; was a relatively new composition, having been recorded for the first time just the previous year by the Kenny Clarke-Francy Boland Big Band. But one can almost hear a larger ensemble by listening to Peterson's virtuoso interpretation in an uptempo setting, assisted by Jones' agile bass and Durham's steady percussion. Peterson cools off his audience with an extended exploration of Benny Carter's &quot;When Lights Are Low,&quot; though his fresh approach makes it seem like a brand new composition. Like other releases in Oscar Peterson's Exclusively for My Friends series, Travelin' On is warmly recommended.\n______________________________________________________________","torrent":{"xt":"urn:btih:a06e0f8804b660f4b2e7fe9c6c2db11d08fced1c","amp;dn":"Oscar+Peterson+-+Exclusively+For+My+Friends+-+Boxed+Set+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a06e0f8804b660f4b2e7fe9c6c2db11d08fced1c","infoHashBuffer":{"type":"Buffer","data":[160,110,15,136,4,182,96,244,178,231,254,156,108,45,177,29,8,252,237,28]},"announce":[],"urlList":[]}}