{"title":"Invitation to Discrete Mathematics 2nd ed","uid":6411685,"size":2704737,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1ff6d03d699f5571618b7e9fc8921f7ae1934f7&amp;dn=Invitation+to+Discrete+Mathematics+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1306008852,"description":"This book is a clear and self-contained introduction to discrete mathematics. Aimed mainly at undergraduate and early graduate students of mathematics and computer science. It is written with the goal of stimulating interest in mathematics and an active, problem-solving approach to the presented material. The reader is led to an understanding of the basic principles and methods of actually doing mathematics (and having fun at that). Being more narrowly focused than many discrete mathematics textbooks and treating selected topics in an unusual depth and from several points of view, the book reflects the conviction of the authors, active and internationally renowned mathematicians, that the most important gain from studying mathematics is the cultivation of clear and logical thinking and habits useful for attacking new problems. More than 400 enclosed exercises with a wide range of difficulty, many of them accompanied by hints for solution, support this approach to teaching. The readers will appreciate the lively and informal style of the text accompanied by more than 200 drawings and diagrams. Specialists in various parts of science with a basic mathematical education wishing to apply discrete mathematics in their field can use the book as a useful source, and even experts in combinatorics may occasionally learn from pointers to research literature or from presentations of recent results. Invitation to Discrete Mathematics should make a delightful reading both for beginners and for mathematical professionals.\n\nThe main topics include: elementary counting problems, asymptotic estimates, partially ordered sets, basic graph theory and graph algorithms, finite projective planes, elementary probability and the probabilistic method, generating functions, Ramsey's theorem, and combinatorial applications of linear algebra. General mathematical notions going beyond the high-school level are thoroughly explained in the introductory chapter. An appendix summarizes the undergraduate algebra needed in some of the more advanced sections of the book.\n\nPub. Date: July 2008\nPublisher: Oxford University Press, USA\n","torrent":{"xt":"urn:btih:a1ff6d03d699f5571618b7e9fc8921f7ae1934f7","amp;dn":"Invitation+to+Discrete+Mathematics+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1ff6d03d699f5571618b7e9fc8921f7ae1934f7","infoHashBuffer":{"type":"Buffer","data":[161,255,109,3,214,153,245,87,22,24,183,233,252,137,33,247,174,25,52,247]},"announce":[],"urlList":[]}}