{"title":"The Creeps (Samuel Johnson vs. the Devil - 3) By John Connolly","uid":9088146,"size":1604325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a21d02c30263c42333181d2e8d21bf987c049bd0&amp;dn=The+Creeps+%28Samuel+Johnson+vs.+the+Devil+-+3%29+By+John+Connolly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"maxdesolate","files":4,"time":1382535047,"description":"\nSamuel Johnson is not in a happy place.\n\nHe is dating the wrong girl, demons are occupying his spare room, and the town in which he lives appears to be cursed.\n\nBut there is some good news on the horizon. After years of neglect, the grand old building that once housed Wreckit &amp; Sons is about to reopen as the greatest toy shop that Biddlecombe has ever seen, and Samuel and his faithful dachshund Boswell are to be the guests of honour at the big event. A splendid time will be had by all, as long as they can ignore the sinister statue that keeps moving around the town, the Shadows that are slowly blocking out the stars, the murderous Christmas elves, and the fact that somewhere in Biddlecombe a rotten black heart is beating a rhythm of revenge.\n\nA trap has been set. The Earth is doomed. The last hope for humanity lies with one young boy and the girl who is secretly in love with him. Oh, and a dog, two demons, four dwarfs, and a very polite monster.\n\nWe Wish You a Merry Christmas, and a Happy End of the World.\n\nTHIS IS BOOK 3 IN THE SAMUEL JOHNSON VS THE DEVIL SERIES.\nEPUB AND MOBI. ","torrent":{"xt":"urn:btih:a21d02c30263c42333181d2e8d21bf987c049bd0","amp;dn":"The+Creeps+%28Samuel+Johnson+vs.+the+Devil+-+3%29+By+John+Connolly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a21d02c30263c42333181d2e8d21bf987c049bd0","infoHashBuffer":{"type":"Buffer","data":[162,29,2,195,2,99,196,35,51,24,29,46,141,33,191,152,124,4,155,208]},"announce":[],"urlList":[]}}