{"title":"Systems Programming: Designing and Developing Distributed Applic","uid":12877450,"size":37457155,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a24d9b5a1bbe8e70597f26294bbfba45a0a0b9eb&amp;dn=Systems+Programming%3A+Designing+and+Developing+Distributed+Applic&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"NoctDeath","files":2,"time":1448972975,"description":"Title: Systems Programming: Designing and Developing Distributed Applications \r\nAuthor: Richard Anthony \r\nFormat: PDF \r\nHardcover: 548 pages \r\nPublisher: Morgan Kaufmann; 1 edition (March 16, 2015) \r\nLanguage: English \r\nISBN: 9780128007297 \r\n\r\n\r\nSystems Programming: Designing and Developing Distributed Applications explains how the development of distributed applications depends on a foundational understanding of the relationship among operating systems, networking, distributed systems, and programming. Uniquely organized around four viewpoints (process, communication, resource, and architecture), the fundamental and essential characteristics of distributed systems are explored in ways which cut across the various traditional subject area boundaries. The structures, configurations and behaviours of distributed systems are all examined, allowing readers to explore concepts from different perspectives, and to understand systems in depth, both from the component level and holistically.\r\n\r\n- Explains key ideas from the ground up, in a self-contained style, with material carefully sequenced to make it easy to absorb and follow.\r\n- Features a detailed case study that is designed to serve as a common point of reference and to provide continuity across the different technical chapters.\r\n- Includes a ‘putting it all together’ chapter that looks at interesting distributed systems applications across their entire life-cycle from requirements analysis and design specifications to fully working applications with full source code.\r\n- Ancillary materials include problems and solutions, programming exercises, simulation experiments, and a wide range of fully working sample applications with complete source code developed in C++, C# and Java.\r\n- Special editions of the author’s established ‘workbenches’ teaching and learning tools suite are included. These tools have been specifically designed to facilitate practical experimentation and simulation of complex and dynamic aspects of systems","torrent":{"xt":"urn:btih:a24d9b5a1bbe8e70597f26294bbfba45a0a0b9eb","amp;dn":"Systems+Programming%3A+Designing+and+Developing+Distributed+Applic","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a24d9b5a1bbe8e70597f26294bbfba45a0a0b9eb","infoHashBuffer":{"type":"Buffer","data":[162,77,155,90,27,190,142,112,89,127,38,41,75,191,186,69,160,160,185,235]},"announce":[],"urlList":[]}}