{"title":"Omnia - Musick and Poetree","uid":6624670,"size":97313134,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a3595d018163e714ceb7448168d751c5a9394512&amp;dn=Omnia+-+Musick+and+Poetree&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OmniaForLife","files":-1,"time":1314113195,"description":"************** MUSICK &amp; POETREE **************\n\nIF YOU LIKE THE ALBUM, BUY IT\nWWW.WORLDOFOMNIA.COM\n\nAlready hailed as OMNIA's best work ever, &quot;Musick and Poetree&quot; has a very special, fresh new sound combined with a more &quot;old school&quot; attitude, true to the original roots and concepts that started OMNIA in the first place. Time is running out for this crazy world filled with human-monkey madness and OMNIA Musick and Poetree adresses this problem and offers solutions as well as comfort for the other monkeys...\nMusick and Poetree is a unique new concept, namely a &quot;2 disc-album&quot; (2 discs = 1 album).\n\nThe 1st disc (Musick) contains 5 up-beat OMNIA songs (playing time 21 minutes) recorded in Denmark together with the members of the OMNIA live-band: Philip, Maral and Daphyd. New songs like &quot;I don't speak Human&quot; and &quot;Free&quot; express the same OMNIA ideals of respect for nature and personal freedom that fans worldwide have come to know and love...only stronger!\n \nThe 2nd disc (Poetree) contains 7 gentler, more dreamy, Bardic pieces with a deep emotional meaning for Stenny themselves. Songs they have grown up with or that have inspired them to live like they do....\n\nRanging from European traditionals like the swedish &quot;Grone Lunden&quot; to interpretations of 20th century classics like the German &quot;Lili Marleen&quot;, the Dutch &quot;het Dorp&quot;, Tenacious D's &quot;Fuck her gently&quot; and Nick Cave's &quot;Mercy seat&quot;. These works have been played and recorded by Stenny in a very intimate and pure setting, completely solo and in one take! This disc also has a playing time of 21 minutes, making the total playing time of OMNIA Musick and PoÃƒÂ«tree 42 minutes.\n\nBoth discs are available together in a beautifully illustrated Digipac made by Steve Sic and OMNIA-art veteran Fieke/Orchus.nl. And after the beautiful illustrations of academy-award winner Alan Lee on &quot;OMNIA-Alive!&quot; it was now the turn of two of Stenny's other talented family members to enrich the booklet of Musick and Poetree. This time wildlife artists Renso Tamse and Marjolein Kruijt have added their considerable talents to this newest release!\n\nMusic and lyrics; S. &amp; J. Evans Harten, Omnia.","torrent":{"xt":"urn:btih:a3595d018163e714ceb7448168d751c5a9394512","amp;dn":"Omnia+-+Musick+and+Poetree","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3595d018163e714ceb7448168d751c5a9394512","infoHashBuffer":{"type":"Buffer","data":[163,89,93,1,129,99,231,20,206,183,68,129,104,215,81,197,169,57,69,18]},"announce":[],"urlList":[]}}