{"title":"Schubert - Die Winterreise - Mark Padmore &amp; Paul Lewis","uid":6283438,"size":291867311,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a3e8ef0b5feeeaac4ed4c721a3d90f14a7e254a7&amp;dn=Schubert+-+Die+Winterreise+-+Mark+Padmore+%26+Paul+Lewis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"neil1966hardy","files":34,"time":1301526517,"description":"Now, this disk received some excellent reviews both from Gramophone and classicstoday; so, something is really good here!\n\nGramophone (November 2009 issue):\n\n&quot;Ah, this journey! How many have made it, sincerely and imaginatively, two setting out as nearly as possible as one! So many on records too, following the elusive track as with torchlight concentrated upon it. Yet, of all, I cannot think of one (not even Fischer-Dieskau in his 1965 recording with Jorg Demus) that leads more faithfully to the cold comfort of its end. And when we get there in this performance, what an end it is!\nThe journey begins with ever such a slight whine high in the voice, as with a calm acceptance of pain. The piano abstains from jabbing .sforzandi to underline what the chords make plain enough, instead insisting calmly on its left-hand legato. The melting major-key modulation is all affection: no hint of bitterness in the sentiment that his passing footsteps should not disturb the faithless beloved's sleep. But outside in the open, stillness and turbulence alternate like the moods of the weather-vane. And so throughout much of the trek the selfconfiding of the loner holds in check the utterance of emotion as the icy surface of the river conceals the running water beneath. Even so the pain will out, as it does in the last phrase, &quot;ihr Bild dahin&quot;, of &quot;Erstarrung&quot;.\n\nOn we go, lulled and tormented by the magic music-box of &quot;Friihlingstraum&quot;, till the tragic chord before &quot;so elend nicht&quot; in &quot;Einsamkeit&quot; brings a dreadful reality into focus. The deceptive sweetness of &quot;Die Krahe&quot;, the giddy disorientation of &quot;Letzte Hoffnung&quot;, the subdued feverish excitements of &quot;Tauschung&quot; find an almost holy stability in &quot;Das Wirtshaus&quot;, but still the external world exists, felt as almost an intrusion in &quot;Mut&quot;. And soon we meet the organ-grinder. And his secrets must on no account be revealed by reviewer or arts-gossip. And the listener must wait, out of respect to this marvellous partnership of Mark Padmore and Paul Lewis, until time can be taken for it, alone and uninterrupted, to accompany them on the journey through to its unearthly end.&quot;\nJohn Steane\n\nclassicstoday:\n\n&quot;Schubert's Winterreise offers what likely is the darkest, most tormented, aesthetically and emotionally compelling journey in the repertoire of Romantic song-cycles. Any singer who takes it on (most often baritones, but frequently tenors and occasionally a female voice) must make the effort to immerse himself in Wilhelm MÃƒÂ¼ller's poetry and Schubert's magnificently moody, unreservedly honest representation of its darkly human sentiment.\n\nSome observers would say--and already have said--that tenor Mark Padmore's innately beautiful voice actually works against his interpretation of these songs, modifying his dramatic range, rendering the pain and regret something less than convincing, and leaving listeners swooning when they should be brooding. I don't agree, because that beauty lies outside of, while remaining totally complementary to, Padmore's sincerely felt and conveyed dramatic sensibility; over and over again he depicts the emotional contrasts between experiencing the world's glory (and love's promise) and the realities of life's cruel turns. His usual dead-on intonation is sacrificed for pitchless exclamations in the most agitated utterances of &quot;Der Lindenbaum&quot;, followed by a most impressively controlled mastery of the considerable expressive and technical challenges of &quot;Wasserflut&quot;. &quot;Auf dem Flusse&quot; and &quot;Irrlicht&quot; show Padmore's sensitivity and ability to capture the unique atmosphere of a song, of course in close collaboration with his piano partner Paul Lewis.\n\nIn addition to Padmore's lovely singing, Lewis' piano is a joy to hear; not only is it beautifully recorded with vibrant, demonstration-quality naturalness, but Lewis seems to articulate the keyboard's significant role with particular sensitivity to the singer's nuances and inflections, using the Steinway's timbre to complement and contrast--and occasionally even imitate--the voice.\n\nThe sense of resignation is appropriately firm in the next to last song, &quot;Die Nebensonnen&quot;, and in the final song, time seems to stop, the lonely, wearied interplay of dispirited singer and unloved, &quot;numb-fingered&quot; hurdy-gurdy player a sad, slow dance eventually drifting away, unfinished for now, but leaving no doubt as to the singer's unhappy fate. Bravo! to all concerned with this first-rate production (and did I mention that the sound is phenomenal?).&quot;\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:a3e8ef0b5feeeaac4ed4c721a3d90f14a7e254a7","amp;dn":"Schubert+-+Die+Winterreise+-+Mark+Padmore+%26+Paul+Lewis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3e8ef0b5feeeaac4ed4c721a3d90f14a7e254a7","infoHashBuffer":{"type":"Buffer","data":[163,232,239,11,95,238,234,172,78,212,199,33,163,217,15,20,167,226,84,167]},"announce":[],"urlList":[]}}