{"title":"The Twelve Complete","uid":7219604,"size":389919130,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a40a7126096d4939de75d7daa131ee0ae4c2792c&amp;dn=The+Twelve+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dadrkhomr","files":16,"time":1335487737,"description":"This pack includes the complete modern series &quot;the Twelve&quot; from 2007-present.\n\n\nPlot synopsis\n \nAs related by the Phantom Reporter: During the World War II Battle of Berlin in 1945, a dozen of the many superheroes and masked crimefighters of that era are ambushed by Nazis in the basement of an SS building, where the heroes are gassed and placed into cryogenic suspension for later experimentation, but the building is air bombed soon after and anyone aware of their situation is killed. In the present day, construction workers find this bunker, and the Twelve, as they become known, are revived. Put into the care of the U.S. military, they are housed together in a mansion where they receive counseling and support, are gradually made to understand that decades have passed, and are offered a role as heroes in the 21st century.\n \nThe Twelve adjust in various ways: The Blue Blade becomes a celebrity; the Phantom Reporter starts a column for the Daily Bugle, Dynamic Man allies himself with the FBI and other law-enforcement agencies and throws himself into heroics; the Black Widow reconnects as the &quot;instrument of vengeance&quot; of an unknown party and begins going on missions; and Rockman bemoans being cut off from an underground kingdom that may or may not exist. On ballistics evidence, police arrest the Laughing Mask for a 1940s murder. In addition, the daughter of the creator of the robot Electro reclaims possession of the robot.\n","torrent":{"xt":"urn:btih:a40a7126096d4939de75d7daa131ee0ae4c2792c","amp;dn":"The+Twelve+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a40a7126096d4939de75d7daa131ee0ae4c2792c","infoHashBuffer":{"type":"Buffer","data":[164,10,113,38,9,109,73,57,222,117,215,218,161,49,238,10,228,194,121,44]},"announce":[],"urlList":[]}}