{"title":"The Reawakening Saga series by D. W. Jackson (01-03)","uid":9685407,"size":2461959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a43f5c7616fc625c3eced772c75a9eb5924221fc&amp;dn=The+Reawakening+Saga+series+by+D.+W.+Jackson+%2801-03%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":6,"time":1393755902,"description":"\nD.W. Jackson was born in McAlester Oklahoma, Attended College at Oklahoma City University, and Northeastern State University. As soon as he graduated high school in 2001 he joined the Oklahoma National Guard. In 2003 he was Sent along with five others from his unit to Iraq where he spent slightly over a year in deployment. \n\nAfter returning home he worked as a pipeline surveyor traveling all across the U.S. in 2009 he took a job as a correctional officer for the state of Oklahoma where he worked at both a medium and minimal security level prison. In 2012 his heath declined and was unable to continue working. With time on his hands and out of books to read he decided to pursue his dream of being a writer.\n\nGenre: Fantasy\n\n\n1. Inexperienced Mage: Thousands of years after the Fae Wars, magic is now a thing of legend and the once great empire is reduced to hundreds of separate countries. Farlan a rich and powerful Queendom is one such country where men are treated as second class citizens, and often sold into slavery at an early age. Mark a young man has been trained since his childhood to be one of the most sought after slaves produced by the academy. At auction he is purchased by the queen, but on his way to the capital they are attacked allowing him to escape before he is permanently branded.\n\n2. Branded Mage: After thousands of years without magic, Thad a young man has reawakened the lost art. The only problem is that he is being held prisoner by the queen of Farlan a country where men are second class citizens. With rebellion and war knocking on the Queendom's door, Queen Serena must try and convince Thad to aid her or else her country will fall to the militant rule of the oppressive Ablaians.\n\n3. Broken Mage: Trapped in the vast underground networks of the subterranean Thad tries to find his way back to the surface. The trouble is Thad is not the only thing that lurks in the darkness. Creatures he had only heard about in tales appear around every bend. forced to fight for his life Thad is no longer living but merely surviving. He tries to keep his hopes up with his only link to the outside world, a small box that allows a small amount of food and news to be sent to him every few days.","torrent":{"xt":"urn:btih:a43f5c7616fc625c3eced772c75a9eb5924221fc","amp;dn":"The+Reawakening+Saga+series+by+D.+W.+Jackson+%2801-03%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43f5c7616fc625c3eced772c75a9eb5924221fc","infoHashBuffer":{"type":"Buffer","data":[164,63,92,118,22,252,98,92,62,206,215,114,199,90,158,181,146,66,33,252]},"announce":[],"urlList":[]}}