{"title":"Taylor Eigsti - Lucky  Me (2006)","uid":6011562,"size":343440789,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a44667021d0d834598ecbba459ecb8cc5e3b758e&amp;dn=Taylor+Eigsti+-+Lucky++Me+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mariorg","files":-1,"time":1291473196,"description":"Concord Jazz: CCD-2299-2 &lt;a href=&quot;\nhttp://www.concordmusicgroup.com/albums/Lucky-To-Be-Me/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.concordmusicgroup.com/albums/Lucky-To-Be-Me/&lt;/a&gt;\n\n* Taylor Eigsti: piano, rhodes\n* Julian Lage: guitar\n* Christian McBride: bass\n* Lewis Nash: drums\n* James Genus: bass\n* Billy Kilson: drums\n\nHomepage:\n- http://www.tayloreigsti.com/\n- http://www.tayjazz.com/\n\nReview\n~~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/album/lucky-to-be-me-r823273&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/lucky-to-be-me-r823273&lt;/a&gt;\nby Thom Jurek\n\nWhat can you say about a 21-year-old jazz pianist who begins with John\nColtrane's &quot;Giant Steps,&quot; turns the harmony inside out, twists the mode, and\npresents its mirror image and reflects the composer's lyricism and fire in fiery\npost-bop language, and still maintain the integrity of the tune? Only that it's\nTaylor Eigsti. Lucky to Be Me is Eigsti's third album, and his first for\nConcord. It reeks of self-confidence and a bad boy's sense of mischief, and with\ngood reason: Eigsti's got the chops, both technically and inspirationally, to\npull this -- and much more -- off. The instrumentation on this set is\nvaried. Musicians include bassist Christian McBride, drummer Lewis Nash (the\nrhythm section on the aforementioned and the gorgeous read of Cole Porter's\n&quot;Love for Sale&quot; just to name two), saxophonist Eric Marienthal, drummer Billy\nKilson, bassist James Genus, guitarist Julian Lage, trumpeter Greg Adams, and\nmore. The shifting instrumentation and arrangements are characterized by the\ntunes. McBride and Nash also appear on a jazz read of Mussorgsky's &quot;Promenade&quot;\nand Alabama 3's &quot;Woke Up This Morning,&quot; the theme from The Sopranos. That's not\nthe half of it, though: there are startling versions of Eddie Harris' &quot;Freedom\nJazz Dance,&quot; &quot;Darn That Dream,&quot; and BjÃƒÂ¶rk's &quot;I've Seen It All.&quot; Eigsti brings\nfreshness, sophistication, and a deep sense of maturity to these tunes. He\nreinvents them without ever tearing them apart; in other words, his sense of\n&quot;song&quot; is profound and foremost. The Harris tune is introduced by the a series\nof contrapuntal moves by Eigsti and then flipped over into some kind of\nbop/modal thing -- all the while keeping the rhythm intact and forceful. But it\nis, perhaps, on his own compositions, like the lovely &quot;Get Your Hopes Up,&quot; where\nhe shines most. Eigsti is not an academic player, though he is a flashy one. His\nsense of harmony and melody is not far removed from the euphoric dynamics of Pat\nMetheny's, and here, as in everything he writes on Lucky to Be Me, the sense of\ntime is fluid -- floating and yet anchored by his left hand. Eigsti engages Lage\non the head and then slips around him, playing behind the beat first,\ndouble-timing it next, and finally coming right through the middle of it to\nallow the lyric to reestablish itself as the prominent voice in the tune. His\nlarge, open-ringing chords are the signatures he imposes on his harmonics and\nhis changeups. This is a solid date throughout. Though the track listing may\nread like it's schizophrenic and manic, the disc is anything but. It flows from\ntop to bottom, and the listener will no doubt be moved and awed by some of\nEigsti's pyrotechnics -- though they always have soul -- and on the tunes that\nfeature Lage, listeners will be awed, too, by his command of the jazz guitar\nlanguage. Lucky to Be Me is a mature, fiery, and surprising set by a talent who\nis still getting started while arriving fully formed as an artist.","torrent":{"xt":"urn:btih:a44667021d0d834598ecbba459ecb8cc5e3b758e","amp;dn":"Taylor+Eigsti+-+Lucky++Me+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a44667021d0d834598ecbba459ecb8cc5e3b758e","infoHashBuffer":{"type":"Buffer","data":[164,70,103,2,29,13,131,69,152,236,187,164,89,236,184,204,94,59,117,142]},"announce":[],"urlList":[]}}