{"title":"The Best of the Wolfe Tones - Irish Rebel Songs","uid":4639133,"size":732529659,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a477e2774774a9f37fabb0d7bb925ffdb30e4792&amp;dn=The+Best+of+the+Wolfe+Tones+-+Irish+Rebel+Songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rambam1776","files":4,"time":1231659308,"description":"AVI File Details\n========================================\nName.........: The Best of the Wolfe Tones - Live.avi\nFilesize.....: 698 MB (or 715,104 KB or 732,266,496 bytes)\nRuntime......: 02:15:50 (244,247 fr)\nVideo Codec..: XviD\nVideo Bitrate: 597 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 113 kb/s (56/ch, stereo) VBR LAME3.97\nFrame Size...: 512x288 (1.78:1) [=16:9]\n\nNOTE - If you like this, you will LOVE this one - http://thepiratebay.se/torrent/4267977/Irish_History_In_Song\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Wolfe_Tones&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Wolfe_Tones&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.wolfetonesofficialsite.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wolfetonesofficialsite.com/&lt;/a&gt;\n\n\nThe Wolfe Tones are an Irish rebel music band deeply rooted in Irish traditional music. They are named after the Irish rebel and patriot Theobald Wolfe Tone, one of the leaders of the Irish Rebellion of 1798, with the double entendre that a wolf tone is a spurious sound that can affect instruments of the violin family.\n\nFormation and early years\n \nThe Wolfe Tones, &quot;Across the Broad Atlantic&quot;The origins of the group date back to 1963, where three neighbouring children from the Dublin suburb of Inchicore, brothers Brian and Derek Warfield and Noel Nagle, began to play together for their own amusement. This subsequently led to the three friends playing at the fleadhs and music festivals around Ireland.\n\nBrian Warfield recalls on the 2004 DVD that they have spent more than 14 years of their lives in America, when adding up weeks and months of tour dates over their career.\n\n\n&quot;The Split&quot;\n\nSometime around 1989, a contract was signed by Derek Warfield, signing rights to an American distributor. The contents of this contract were apparently misrepresented to the other members of the band, resulting in a clause that prevented them from recording. Unable to reverse this agreement, they continued to tour albeit without any new material.\n\nIn 1995, Derek Warfield released a studio album entitled &quot;Legacy&quot; as he was still eligible to record under his own name. With Derek on vocals and mandolin, the music on this album was performed by a new band, although he was still in fact touring with The Wolfe Tones. Derek's solo releases continued on bi-annually.\n\nThen in 2001, after a gig played in Limerick, Derek departed the band under circumstances that remain unknown to this day. Brian, Noel and Tommy would later go on to release &quot;You'll Never Beat the Irish&quot;, which received critical acclaim as well as going triple platinum within 6 months of release.\n\n\nToday\n\nThe Wolfe Tones continue to tour but as a 3-piece band comprising Brian Warfield, Noel Nagle &amp; Tommy Byrne their official site.\n\nThe Wolfe Tones celebrated their 45th Anniversary with a special event at the prestigious Waterfront Hall, Belfast, on Sunday 26th October, 2008, which was also filmed for their upcoming documentary.\n\n\nNotable works\n\nThe well known song, &quot;Celtic Symphony&quot; was written by Brian Warfield back in 1987 for the 100th birthday of Celtic Football Club. It has been covered by countless bands around the world. Other famous songs written by the group include Joe McDonnell, a song about the life and death of the IRA member who was the fifth person to die on the 1981 Hunger Strike, which is also said to be their most popular stage song.\n\nTheir rendition of &quot;A Nation Once Again&quot; by Thomas Osborne Davis was voted the number one song of all time in a BBC World Service vote, but other songs by well known artists such as Elvis, U2 and The Beatles were obviously a lot more popular at the time\n","torrent":{"xt":"urn:btih:a477e2774774a9f37fabb0d7bb925ffdb30e4792","amp;dn":"The+Best+of+the+Wolfe+Tones+-+Irish+Rebel+Songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a477e2774774a9f37fabb0d7bb925ffdb30e4792","infoHashBuffer":{"type":"Buffer","data":[164,119,226,119,71,116,169,243,127,171,176,215,187,146,95,253,179,14,71,146]},"announce":[],"urlList":[]}}