{"title":"The Shinjuku Incident (2011)(DVD5)(DD5.1)(NL Subs)ISO RETAIL TBS","uid":6356907,"size":4633764313,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a4a23f7e766e211ed12bdbc5966fe2d776ca02cb&amp;dn=The+Shinjuku+Incident+%282011%29%28DVD5%29%28DD5.1%29%28NL+Subs%29ISO+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Vlinder.","files":-1,"time":1304177772,"description":"The Shinjuku Incident (2011)(DVD5)(DD5.1)(NL Subs) Rental ISO RETAIL TBS\n\n*****RELEASE 3-5-2011****\n\n\nHongkong\nActie / Drama\n120 minuten\n\ngeregisseerd door Tung-Shing Yee\nmet Jackie Chan, Naoto Takenaka en Jinglei Xu\n\nNet als heel veel van zijn landgenoten ontvlucht boer Steelhead (Jackie Chan) het arme bestaan in China voor een betere toekomst in Japan. Steelhead heeft nog een tweede reden om naar Tokyo te gaan, want zijn jeugdliefde is daar jaren geleden naar toe gegaan en na een tijdje is het contact helemaal verbroken. In Tokyo aangekomen ontdekt hij hoe zwaar het leven van een immigrant kan zijn. Chinezen doen het vuile werk van de zich superieur voelende Japanners en de yakuza hebben het leven in een ijzeren greep. Steelhead ontdekt dat de enige manier om een goed leven op te bouwen, is door zelf ook voor de misdaad te kiezen. Hij begint met het verkopen van illegale telefoonkaarten, maar al snel geeft hij leiding aan een groep Chinezen die op allerlei illegale manieren geld probeert te verdienen. Tijdens zijn weg naar boven op de criminele ladder raakt hij bevriend met Eguchi, onderbaas van ÃƒÂ©ÃƒÂ©n van de yakuza-clans. Via hem weet Steelhead zijn positie te versterken, maar hoe groter en machtiger hij groeit, des te meer aandacht hij trekt van de gevestigde orde die onder geen beding de vorming van een sterke Chinese bende toe wil staan.\n\nThe Shinjuku Incident is een heel ander soort Jackie Chan film dan we de laatste jaren van hem gewend zijn. De humor en vechtkunsten van Chan hebben plaats gemaakt voor een veel hardere en rauwere inhoud die de fans van actie en misdaadfilms zeker aan zal spreken..\n\nStoryline\n\nIn China, the poor worker Tietou repairs tractors and misses his sweetheart Xiu Xiu, back in Japan, she having never sent any news to her family or him. While illegally emigrating to Japan, Tietou loses his Chinese documents and so cannot return to his country. He is welcomed by his countrymen who lodge and work in Shinjuku where they also help him to find illegal work. While running from a police raid through the sewage system where Chinese are illegally working, Tietou saves Inspector Kitano from drowning in the dirty water. Later, after an incident with his cousin, Joe, and a Taiwan gang, Tietou saves thepowerful Yakuza boss Toshinari Eguchi. He is the husband of Xiu Xiu, who is now called Yuko and are parents of a little daughter. The mobster offers a dirty job to Tietou; in retribution, he promises to deliver the quarter dominated by the Taiwan gang to him. Tietou becomes the boss of the Chinese illegal immigrants... \n\nScreen:\n &lt;a href=&quot;\nhttp://bayimg.com/BAhGHAAdn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/BAhGHAAdn&lt;/a&gt;\n\nPostinformatie\n\nCategory.............: Video\nFormaat..............: ISO \nFormat...............: DVD5 \nSource...............: Retail\nMenu.................: Yes\nExtras...............: Yess \nSubtitle.............: Dutch subs optional\nAudio................: Chinees Gesproken (DD5.1 Geluid)\nLanguage.............: Chinese DD5.1\nNederlandse..........: ondertiteling\nCover................: Yes meegepost \n\n*****FULL DVD***** \n  &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/52552&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/52552&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1075419&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1075419&lt;/a&gt;","torrent":{"xt":"urn:btih:a4a23f7e766e211ed12bdbc5966fe2d776ca02cb","amp;dn":"The+Shinjuku+Incident+%282011%29%28DVD5%29%28DD5.1%29%28NL+Subs%29ISO+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a23f7e766e211ed12bdbc5966fe2d776ca02cb","infoHashBuffer":{"type":"Buffer","data":[164,162,63,126,118,110,33,30,209,43,219,197,150,111,226,215,118,202,2,203]},"announce":[],"urlList":[]}}