{"title":"Amon Amarth (Discography) [V0]-Metal-LegionsRG","uid":4352175,"size":922665574,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a4cfe63d8872659b953263dbd64650b50b513476&amp;dn=Amon+Amarth+%28Discography%29+%5BV0%5D-Metal-LegionsRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"M-LRG","files":146,"time":1219216958,"description":"Amon Amarth\nDiscography\n\nA little About the band:\n Since their humble start in 1992 as an underground band from Tumba, a suburb in southern Stockholm, AMON AMARTH have managed to establish themselves as one of Europes top death metal acts through hard work, relentless touring, and consistently solid albums. What has set AMON AMARTH apart from the rest of the death metal scene since the very beginning, is their use of Viking mythology and imagery in lyrics and artwork, as well as a talent for writing epic, memorable melodies, which underline their solemn yet barbaric approach to heavy music.\n\n The band went through the usual demo recordings and line-up changes in the beginning stages, but soon made its first mark with the MCD (Sorrow Throughout The Nine Worlds). A one-off affair with (of all places) Singapores Pulverized Records, this MCD did not only plant AMON AMARTHs flag in the underground metal landscape, but also gained the band a multi-album deal with the renowned Metal Blade Records.\n\n (Once Sent From The Golden Hall), the groups Metal Blade debut, was released in 1998, and saw the band touring with such genre greats as Deicide, Six Feet Under, and Brutal Truth. The same year, drummer Martin Lopez left the band to pursue a career with Opeth, being replaced by Fredrik Andersson (previously in A Canorous Quintet). This would be the last line-up change in the bands career. With a steady formation and an admirable work ethic, AMON AMARTH went on to record and release the albums (The Avenger) (1999) and (The Crusher) (2001) within a time period of two years, touring the European continent extensively in support of these releases. Sharing the stage with the likes of Morbid Angel, Marduk, and Vader, and touring the US for the first time in 2002, the band developed their live act into an unstoppable force, which by now has become one of the pillars of their ever-growing popularity.\n\nAlbum Review:\n  This little demo is quite different from most of what Amon Amarth would put out, and actually doesnt fully fit the style they have consistently exhibited since. Although the traditional melodic approach of older metal styles is heavily present, the predominance of the blast beats, as well as the complexity of the guitar riffs hint at a combination of thrash and earlier technical death influences. Johan Heggs characteristic Viking growls are probably the only thing that really allows the listener to identify this as the same band heard on (Once sent from the Golden Hall) and so forth.\n\nThe production on here is fairly rough, even considering that these songs were probably tweaked during the remix to achieve the best sound on what was likely a poor original product. This is mostly noticeable in the drums, particularly the tinny sound that the snare exhibits and the somewhat flat sound of the bass drums. The guitars are dark and heavy, almost flirting with sounding sludgy at times, resulting with a set of tremolo picked melodies that sound a bit muddled.\n\nThe two best songs on here are the ones that would later be re-recorded and appear on later LPs. (Risen from the Sea) is the catchiest of the mix, and probably the least speedy and aggressive of the lot. It features a principle melodic opening riff that is easily remembered, and the general mid-tempo feel that dominates most of their material. By contrast, (Thor Arise) is the most aggressive and rapidly shifting beast in the fold, featuring the most brutal vocal performance Ive heard out of Hegg yet. The melodic leads that come in and out are nicely...\n\nSome Helpful links: &lt;a href=&quot;\nhttp://www.metal-archives.com/band.php?id=150&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.metal-archives.com/band.php?id=150&lt;/a&gt; &lt;a href=&quot;\nhttp://www.amonamarth.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amonamarth.com/&lt;/a&gt;\n\n(1993) Thor Arise (Demo) [V0]\n(1994) The Arrival of the Fimbul Winter (Demo) [V0]\n(1996) Sorrow Throughout the Nine Worlds [V0]\n(1998) Once Sent From the Golden Hall [V0]\n(1999) Avenger [V0]\n(2001) The Crusher [V0]\n(2002) Versus the World [V0]\n(2004) Fate Of Norns [V0]\n(2006) With Oden on Our Side [V0]\n\nEnjoy and Please SEED!!!","torrent":{"xt":"urn:btih:a4cfe63d8872659b953263dbd64650b50b513476","amp;dn":"Amon+Amarth+%28Discography%29+%5BV0%5D-Metal-LegionsRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4cfe63d8872659b953263dbd64650b50b513476","infoHashBuffer":{"type":"Buffer","data":[164,207,230,61,136,114,101,155,149,50,99,219,214,70,80,181,11,81,52,118]},"announce":[],"urlList":[]}}