{"title":"James Hogg - Confessions of a Justified Sinner (pdf)","uid":8607889,"size":2755762,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4e9114f1acc3ae8265fb555fc7d234cbacb8d04&amp;dn=James+Hogg+-+Confessions+of+a+Justified+Sinner+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372066285,"description":"James Hogg (John Carey, editor and introduction) - The Private Memoirs and Confessions of a Justified Sinner (Oxford University Press, 1969). 262 pages.\n\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nNo, this is not a Calvinist memoir of repentance and conversion as one might think from the title.\n\nWikipedia tells us what it is, and it's wonderful indeed:\n\nThe Private Memoirs and Confessions of a Justified Sinner, (Full title, The Private Memoirs and Confessions of a Justified Sinner: Written by Himself: With a detail of curious traditionary facts and other evidence by the editor) is a novel by the Scottish author James Hogg, published anonymously in 1824.\n\nConsidered by turns part-gothic novel, part-psychological mystery, part-metafiction, part-satire, part-case study of totalitarian thought, it can also be thought of as an early example of modern crime fiction in which the story is told, for the most part, from the point of view of its criminal anti-hero. The action of the novel is located in a historically definable Scotland with accurately observed settings, and simultaneously infers a pseudo-Christian world of angels, devils, and demonic possession.\n\nThe first edition sold very poorly and the novel suffered from a period of critical neglect, especially in the nineteenth century. However, since the latter part of the twentieth century it has won greater critical interest and attention. It was praised by Andre Gide in an introduction to the 1947 reissue and described by the critic Walter Allen as 'the most convincing representation of the power of evil in our literature'. It has also been seen as a study of religious fanaticism through its deeply critical portrait of the Calvinist concept of predestination. It is written in English, with some sections of Scots that appear in dialogue.\n\n\nanother description:\n\n'The Private Memoirs and Confessions of a Justified Sinner' defies classification; it has been variously described as a study in madness, a gothic novel, and a satire on religious fanaticism. It is, in fact, all of these - and more - a unique and deeply disturbing work.Indoctrinated by an extremist Calivinist sect, and urged on by Gil-Martin, an enigmatic and diabolic companion, Robert Wringhim comes to believe that he is one of God's elect, predestined for heaven no matter what vile crimes he commits on earth, murder included. Published almost 200 years ago, this book treats of strangely contemporary topics: the paranormal, madness, and the link between religious zealotry and extreme violence.","torrent":{"xt":"urn:btih:a4e9114f1acc3ae8265fb555fc7d234cbacb8d04","amp;dn":"James+Hogg+-+Confessions+of+a+Justified+Sinner+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4e9114f1acc3ae8265fb555fc7d234cbacb8d04","infoHashBuffer":{"type":"Buffer","data":[164,233,17,79,26,204,58,232,38,95,181,85,252,125,35,76,186,203,141,4]},"announce":[],"urlList":[]}}