{"title":"The Baptist Generals - No Silver / No Gold [2002][EAC,log,cue. F","uid":8770465,"size":297151942,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a50f4c950514c79899975c9c4a50d77f820c79ec&amp;dn=The+Baptist+Generals+-+No+Silver+%2F+No+Gold+%5B2002%5D%5BEAC%2Clog%2Ccue.+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":17,"time":1375442314,"description":"Artist:The Baptist Generals\nRelease:No Silver / No Gold\nReleased: 2002\nLabel: Munich Records\nCatalog#: MRCD 225\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:alternative, folk, indie, rock, lo.fi\n\n01. - Ay Distress\n02. - Alcohol (Turn &amp; Fall)\n03. - 500 League Reunion March (In A Plymouth)\n04. - Diminished\n05. - Going Back Song\n06. - Creeper\n07. - Preservatine\n08. - On A Wheel\n09. - Feds On The Highway\n10. - Burning\n11. - St. Christopher's Medal\n12. - Going Back Song (4-track solo)\n\nA deeply strange, personal album, the Baptist Generals' No Silver/No Gold is much more than the sum of its parts. The group plays the kind of spare, threadbare indie rock that flirts with folk and country without committing to either; Chris Flemmons' biting, nasal vocals are the audio equivalent of vinegar, cutting through the band's shambling racket of strummy acoustic guitars, cellos, organs, and bashed drums bringing No Silver/No Gold together as a remarkably fresh and vital album, despite -- or perhaps because of -- its ornery ways. On songs like &quot;Ay Distress,&quot; a heartfelt, acoustic ballad that's interrupted abruptly by violent studio commotion, the Baptist Generals come across as both sensitive and unhinged, a mix of Dylanesque insight and trippy ferocity that recalls Roky Erickson. This volatility, along with the gritty recording quality (which gives No Silver/No Gold so much character that it should be credited as a member of the band) makes each song teeter unpredictably between beauty and ugliness. The haltingly lovely &quot;Going Back Song,&quot; the scruffy &quot;Preservatine&quot; and the spacey &quot;Feds on the Highway,&quot; tend more toward the former; &quot;Alcohol (Turn &amp; Fall)&quot; and &quot;Burning&quot; tend toward the latter, their raw guitars and vocals sounding as though they're going to sear the speakers. Then there are the downright uncomfortable moments: On &quot;Creeper,&quot; Flemmons repeats &quot;Hey little girl, I had a swell old time tonight&quot; over and over backed by a banged acoustic guitar and uneasy tambourines; &quot;On a Wheel&quot; pairs heavily distorted guitars and drums with Flemmons' yelps, making him sound like a man who's half out of his mind with pain. Indeed, much of No Silver/No Gold was created in response to the ordeal he went through when his father died, and Flemmons' willingness to include the ugly and angry in this album makes it that much more brave and distinctive. Even fans of lo-fi and willful singer-songwriters may find No Silver/No Gold a little too rough to fully embrace, but it's still an oddly compelling and moving collection of songs.","torrent":{"xt":"urn:btih:a50f4c950514c79899975c9c4a50d77f820c79ec","amp;dn":"The+Baptist+Generals+-+No+Silver+%2F+No+Gold+%5B2002%5D%5BEAC%2Clog%2Ccue.+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a50f4c950514c79899975c9c4a50d77f820c79ec","infoHashBuffer":{"type":"Buffer","data":[165,15,76,149,5,20,199,152,153,151,92,156,74,80,215,127,130,12,121,236]},"announce":[],"urlList":[]}}