{"title":"Practical DV Filmmaking,2nd Ed {BBS}","uid":7452042,"size":4856238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a531dfbde732fb9e108013b76282cb9f4111e8e8&amp;dn=Practical+DV+Filmmaking%2C2nd+Ed+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1342543356,"description":"Written for the beginner, Practical DV Filmmaking guides you thorough the process of making a film with low-cost digital equipment: from development through to production, post-production and distribution. While the technical tools you need are fully explained, the book concentrates on filmmaking principles throughout, illustrating how these tools can be used to achieve stylistic approaches for innovative filmmaking.\n\nThe book assumes no background knowledge in either technology or filmmaking and is divided into four key areas:\n*DEVELOPMENT: turn your idea into a workable script, storyboard and schedule.\n*PRODUCTION: develop skills to shoot original short films and turn a zero-to-low budget to your advantage.\n*POST-PRODUCTION: learn basic editing techniques to enhance your original idea using iMovie, Premiere and other popular tools.\n*DISTRIBUTION: set up a website and use the internet to promote your film. Includes numerous links to useful websites. Plus, top tips for how to enter a film festival and a new chapter on developing a career.\n\nProjects enable you to master each step of the process taking you through different aspects of filmmaking today. Gradually you will find out where your strengths lie and how to make the most of them. The book also encourages stylistic development by intruding theoretical approaches to filmmaking. A glossary of terms plus an appendix of resources make this guide a one-stop essential handbook to DV filmmaking practice for beginners and student filmmakers.\n\n* Master low-budget filmmaking principles with easy step-by-step techniques and practical projects\n* Develop a real world perspective through case studies and interviews with successful filmmakers \n\n\n# Paperback: 407 pages\n# Publisher: Focal Press; 2nd edition (December 16, 2005)\n# Language: English\n# ISBN-10: 0240807383\n# ISBN-13: 978-0240807386","torrent":{"xt":"urn:btih:a531dfbde732fb9e108013b76282cb9f4111e8e8","amp;dn":"Practical+DV+Filmmaking%2C2nd+Ed+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a531dfbde732fb9e108013b76282cb9f4111e8e8","infoHashBuffer":{"type":"Buffer","data":[165,49,223,189,231,50,251,158,16,128,19,183,98,130,203,159,65,17,232,232]},"announce":[],"urlList":[]}}