{"title":"Gardner's Art through the Ages - The Western Perspective (13th E","uid":8027557,"size":42022407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a555f400a4789670ed9ad1498f5a1f982a3586b5&amp;dn=Gardner%27s+Art+through+the+Ages+-+The+Western+Perspective+%2813th+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1358297094,"description":"Gardner's Art Through the Ages: The Western Perspective, Backpack Edition, Book B (13th Ed)\nby Fred S. Kleiner, Helen Gardner\nWadsworth Publishing | May 2010 | 224 Pages | ISBN: 049579452X | PDF | 40 MB &lt;a href=&quot;\nhttp://www.amazon.com/Gardners-Art-Through-Ages-Backpack/dp/049579452X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Gardners-Art-Through-Ages-Backpack/dp/049579452X&lt;/a&gt;\n\nAs fascinating as a real visit to the world's famous museums and architectural sites, GARDNER'S ART THROUGH THE AGES: THE WESTERN PERSPECTIVE gives you a comprehensive, beautifully illustrated tour of the world's great artistic traditions--plus all the study tools you need to excel in your art history course! Easy to read and understand, this 13th Edition of the most widely read history of art book in the English language is the only textbook that includes a unique &quot;scale&quot; feature (accompanying the book's photographs of paintings and other artworks) that will help you better visualize the actual size of the artworks shown in the book. Three levels of review including extended image captions, &quot;The Big Picture&quot; overviews at the end of every chapter, and a special global timeline will help you study for your exams. You'll also find materials that will help you master the key topics quickly in the ArtStudy Online (a free interactive study guide that includes flash cards of images and quizzes).\n\nAbout the Author\nFred S. Kleiner (Ph.D., Columbia University) is the author or co-author of the 10th, 11th, 12th, 13th, and 14th editions of ART THROUGH THE AGES: A GLOBAL HISTORY, as well as the 1st, 2nd, and 3rd editions of ART THROUGH THE AGES: A CONCISE HISTORY, and more than a hundred publications on Greek and Roman art and architecture, including A HISTORY OF ROMAN ART, also published by Wadsworth. He has taught the art history survey course for more than three decades, first at the University of Virginia and, since 1978, at Boston University, where he is currently Professor of Art History and Archaeology and Chair of the Department of History of Art and Architecture. From 1985 to 1998, he was Editor-in-Chief of the American Journal of Archaeology. Long acclaimed for his inspiring lectures and dedication to students, Professor Kleiner won Boston University's Metcalf Award for Excellence in Teaching as well as the College Prize for Undergraduate Advising in the Humanities in 2002, and he is a two-time winner of the Distinguished Teaching Prize in the College of Arts and Sciences Honors Program. In 2007, he was elected Fellow of the Society of Antiquaries of London, and, in 2009, in recognition of lifetime achievement in publication and teaching, Fellow of the Text and Academic Authors Association.","torrent":{"xt":"urn:btih:a555f400a4789670ed9ad1498f5a1f982a3586b5","amp;dn":"Gardner%27s+Art+through+the+Ages+-+The+Western+Perspective+%2813th+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a555f400a4789670ed9ad1498f5a1f982a3586b5","infoHashBuffer":{"type":"Buffer","data":[165,85,244,0,164,120,150,112,237,154,209,73,143,90,31,152,42,53,134,181]},"announce":[],"urlList":[]}}