{"title":"A Quest for Global Peace: Rotblat and Ikeda on War, Ethics and t","uid":8749733,"size":5981140,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a583c79247e03b8f5328de081cda1be8efbd730c&amp;dn=A+Quest+for+Global+Peace%3A+Rotblat+and+Ikeda+on+War%2C+Ethics+and+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"blackatk","files":-1,"time":1375001839,"description":"Publication Date: October 9, 2006\n\n\nIn his autobiography, Bertrand Russell wrote of Joseph Rotblat that 'He can have few rivals in the courage and integrity and complete self-abnegation with which he has given up his own career (in which, however, he still remains eminent) to devote himself to combating the nuclear peril as well as other, allied evils'. One of the 'inventors' of the nuclear bomb, Rotblat very soon turned away from weapons research to make a prolonged and principled stand against the dangers of nuclear proliferation. A physicist of great brilliance, he metamorphosed into a campaigner of admired moral conviction and leadership. This series of dialogues between two leading ethical thinkers brings together the courage and humanity of Rotblat with the spiritual wisdom and global visionary outlook of Daisaku Ikeda, the leader of the world's largest and most influential lay Buddhist organisation. Together they reflect on fundamental issues of war and peace, the ethics of nuclear deterrence and the trajectory of Joseph Rotblat's career, from the Manhattan Project to the Pugwash Conference and his Nobel Prize. Rotblat's life-long mantra was that scientists have a moral responsibility to save lives, not destroy them. The integrity of both writers emerges powerfully and inspiringly from their wide-ranging discussions, which serve as a stark warning against the dangers of a resurgent atomic arms race.\n\nAbout the Author\nSir Joseph Rotblat, who died in August 2005, was one of the scientists recruited to build the atomic bombs which brought the Second World War to an end. Turning his back on the nuclear programme, he subsequently became a tireless campaigner for the abolition of nuclear weapons. Daisaku Ikeda is the President of Soka Gakkai International and the author of over 80 books on Buddhist themes.\n\n\nPrint Length: 176 pages\nPublisher: I.B.Tauris; 1 edition (October 9, 2006)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00D5RGP8G\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Quest-Global-Peace-ebook/dp/B00D5RGP8G/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Quest-Global-Peace-ebook/dp/B00D5RGP8G/&lt;/a&gt;\n\n\nTags: nuclear, strategy, war, hiroshima, nagasaki, ww2, world war, world war 2, japan, usa, united states, fat man, little boy, enola gay, FAS, Federation of American Scientists, physics, nuclear, nuclear physics, Ikeda, Rotblat, peace, game theory, zero sum, world peace, start, restart, salt, new start, salt II, salt 2, russia, china, france, uk, dprk, north korea, Iran, pakistan, India, Kashmir, South Africa, NATO, MAD, Mutually Assured Destruction, UK, United Kingdom, trident, ","torrent":{"xt":"urn:btih:a583c79247e03b8f5328de081cda1be8efbd730c","amp;dn":"A+Quest+for+Global+Peace%3A+Rotblat+and+Ikeda+on+War%2C+Ethics+and+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a583c79247e03b8f5328de081cda1be8efbd730c","infoHashBuffer":{"type":"Buffer","data":[165,131,199,146,71,224,59,143,83,40,222,8,28,218,27,232,239,189,115,12]},"announce":[],"urlList":[]}}