{"title":"Groove3 Cakewalk Sonar X2 Explained - VideoTutorial","uid":7865257,"size":1180943940,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a63f2415c213f83674739bd02424a9d28327d48c&amp;dn=Groove3+Cakewalk+Sonar+X2+Explained+-+VideoTutorial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"glaucoma2000","files":45,"time":1354041304,"description":"MAKE CAKEWALK'S SONAR X2 YOUR GO TO DAW\n\nCakewalk has done it again, this time taking their flagship DAW SONAR to the next level, adding tons of new features and functions. SONAR X2 is here and Eli Krantzberg is the man with the plan, showing you all of its ins and outs.\n\nEli begins with the basics such as basic audio and MIDI hardware setup and settings, interface overviews, bussing and auditioning loops, using the Synth Tab to browse and load soft synths and cool Time Ruler &amp; Transport tips. Next, Eli goes deeper and gets into recording MIDI and Audio, customizing your workflow, editing in Track View, using Markers, the Track Inspector and Clip Properties.\n\nEli then shows you how to work with Groove Clips, the Piano Roll View, Auto-Punch Recording, Loop Recording and working with Take Lanes. Mixing is next on the menu with lessons on customizing the Console View, Multi-Port Instruments and Track Folders, working with real-time effects and effect chains. He then wraps up the series with advanced mixing techniques such as using Sends and Busses, EQ and Compression, Automation Modes and Lanes, the ProChannel and final mix and fade out. \n\nIf you're going to make SONAR X2 your main DAW, this series will take you from slow to pro in no time... Get Sonar X2 Explained today. \n\n\nProduct Highlights:\n\n45 Tutorials / Over 5 Hours Total Runtime\nFor all beginner to intermediate SONAR X2 users\nTutorials written by DAW master Eli Krantzberg \n\n\n\nEnjoy it!!!","torrent":{"xt":"urn:btih:a63f2415c213f83674739bd02424a9d28327d48c","amp;dn":"Groove3+Cakewalk+Sonar+X2+Explained+-+VideoTutorial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a63f2415c213f83674739bd02424a9d28327d48c","infoHashBuffer":{"type":"Buffer","data":[166,63,36,21,194,19,248,54,116,115,155,208,36,36,169,210,131,39,212,140]},"announce":[],"urlList":[]}}