{"title":"Deus EX (GOTY )(WIN ENG PC)","uid":3635093,"size":547143646,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a65ef71bf19b10086a3889ea9a2b2479f901b0d1&amp;dn=Deus+EX+%28GOTY+%29%28WIN+ENG+PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deamon2000","files":9,"time":1173407838,"description":"What&amp;#039;s it about?\nDeus Ex is set in the near future. It&amp;#039;s a grim time to live, with a widening chasm between rich and poor, and a mysterious plague called the Gray Death sweeping across the world. There is a manufactured cure, called Ambrosia, but the tiny supply is controlled by government agencies (namely FEMA, the Federal Emergency Management Agency) and carefully doled out to the most important people, including government officials, celebrities, and the social elite. The average joe who contracts Gray Death is often left to wither away and die in the gutter because of the supply problems.\n\nAn underground group called the NSF is convinced that the Gray Death is part of a huge conspiracy to eliminate the underclass. They work against the government to hijack Ambrosia shipments and distribute them to the proletariat. In response, the government dispatches their anti terrorist agency, UNATCO, against the NSF and other groups who have banded together against the government. \n\nDeus EX files \n &lt;a href=&quot;\nhttp://www.fileplanet.com/31653/0/section/Deus-Ex&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fileplanet.com/31653/0/section/Deus-Ex&lt;/a&gt;\n\n\nthis is the GAME OF THE YEAR VERSION \n\nits comes working with multiplay and is  version 1.1.12f\n\nmount with daemon tools install crack if needed play! \n\nIF you own a USA MERC ZBOARD ive included a profile for it using the latest drivers just import the zfile after you UNRAR it ! some keys do have to be set manualy thought i think only like 3 of them","torrent":{"xt":"urn:btih:a65ef71bf19b10086a3889ea9a2b2479f901b0d1","amp;dn":"Deus+EX+%28GOTY+%29%28WIN+ENG+PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65ef71bf19b10086a3889ea9a2b2479f901b0d1","infoHashBuffer":{"type":"Buffer","data":[166,94,247,27,241,155,16,8,106,56,137,234,154,43,36,121,249,1,176,209]},"announce":[],"urlList":[]}}