{"title":"Amy Grant - A Christmas Album","uid":6861735,"size":246833505,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a684659b32a5b19b1e80aad2a94869ad4807902e&amp;dn=Amy+Grant+-+A+Christmas+Album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1322925802,"description":"\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/515O4fQH8wL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/515O4fQH8wL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: A Christmas Album\nArtist: Amy Grant\nAudio CD (August 10, 1993)\nOriginal Release Date: 1983\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Tennessee Christmas\n02. Hark! The Herald Angels Sing\n03. Preiset Dem KÃƒÂ¶nig! (Praise the King)\n04. Emmanuel\n05. Little Town\n06. Christmas Hymn\n07. Love Has Come\n08. Sleigh Ride (3:35)\n09. The Christmas Song (Chestnuts Roasting on an Open Fire)\n10. Heirlooms\n11. A Mighty Fortress/Angels We Have Heard On High\n\n\nAmazon Review:\nAmy Grant's first Christmas album is not only one of the best recordings of her career, it's easily one of the best contemporary Christmas collections available. Grant's Christian beliefs have been incorporated into her music for years, and maybe it's the artistic translation of the depth of her faith that makes these songs so inspiring. &quot;Emmanuel&quot; and &quot;Angels We Have Heard on High&quot; have Grant's vocals soaring, especially on the sustained chorus of the latter. Her country roots show nicely in &quot;Tennessee Christmas,&quot; while &quot;Sleigh Ride&quot; is as fun as it is romantic. &quot;Heirlooms&quot; is particularly poignant--maybe not to the point of &quot;hand me a tissue,&quot; but it's powerful all the same. A must for fans, and a good holiday addition for those looking for a Christmas record that comes without the cobwebs.\n\nAllmusic Review:\nAt the age of 22, Amy Grant took another step in her career by issuing her first Christmas album in 1983. It was a logical-enough release for a Christian performer, but also one that suggested she was an established headliner, an artist whose versions of standards like &quot;The Christmas Song&quot; and &quot;Little Town&quot; (aka &quot;O Little Town of Bethlehem&quot;) would be interesting to listeners because she was singing them. In her carefully planned march to mass popularity, the album represented at least one tentative outreach in a musical direction Grant would not pursue. The leadoff track, &quot;Tennessee Christmas,&quot; found her husband and co-writer, Gary Chapman, playing a pedal steel guitar on a song that seemed intended to probe the country market and that actually earned some country radio play. But despite being a scion of the Nashville aristocracy (i.e., the wealthy families that long predated the rise of country music in the city), Grant was never really a country artist, and the rest of the album, cut at James William Guercio's Caribou Ranch studio complex, reflected the increasing influence of West Coast pop on her sound, with Los Angeles studio aces like Lenny Castro, Bill Champlin, Victor Feldman, Richard Page, and Dean Parks among the credits. Also increasing his influence was songwriter/keyboardist Michael W. Smith, who contributed such songs as &quot;Emmanuel,&quot; a synthesizer-heavy pop/rock track that could have fit on one of Grant's regular albums. So could some of the other material, in fact. A Christmas Album was a record for the audience Grant had attracted with her 1982 breakthrough (and about to be gold) LP, Age to Age, an audience of Christian rock fans attracted by her personal approach to faith. It looked forward to her straddling of secular and CCM music, and as her star rose, it sold well perennially, eventually achieving multi-platinum status, helping associate Grant with the Christmas season as she went on to record more seasonal albums and tape holiday specials.","torrent":{"xt":"urn:btih:a684659b32a5b19b1e80aad2a94869ad4807902e","amp;dn":"Amy+Grant+-+A+Christmas+Album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a684659b32a5b19b1e80aad2a94869ad4807902e","infoHashBuffer":{"type":"Buffer","data":[166,132,101,155,50,165,177,155,30,128,170,210,169,72,105,173,72,7,144,46]},"announce":[],"urlList":[]}}