{"title":"CD Menu Pro v6.40.05 + serial [correct version] -TrT-","uid":5492881,"size":10409997,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a7a963e9c1ee1d378bbab49bd973040f475f09e7&amp;dn=CD+Menu+Pro+v6.40.05+%2B+serial+%5Bcorrect+version%5D+-TrT-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigwimpie","files":-1,"time":1271105212,"description":"CD Menu Pro v6.40.05 + serial -TrT\nFull Version with Serials\n\n\n\nCDMenuPro is an easy-to-use CD Menu Creator for making Autorun CD Menu applications. \nThe program comes complete with a large number of ready-to-use templates and project assistants, \nwhich make getting fast professional results child's play. CDMenuPro has been designed to create \nall the files necessary for autorun, to support a large number of trailers such as AVI, \nIntro, Sound, Splash Screen and to start your programs or documents reliably from your CD. Menu \naccess control You can now make accessing the menu dependent on a password and/or licensing agreement. \nArchiveSafe Restricting access to the menu, however, only makes sense when the data on the CD \nis also protected. And it is set against this background that we have developed a new program \nadd-on: &quot;ArchiveSafe&quot;. New viewer as an add-on program The CDMenuPro software package now comes \nwith two new Viewers: A RichText Viewer for presenting formatted text A Html Viewer for presenting \nHtml files Improved Image Viewer. Embedded Viewer CDMenuPro comes with two new embedded viewers: \nA RichText Viewer for presenting formatted text A Image Viewer Copyright and file information. \nIt is now possible to define the file information that is displayed in XP Windows Explorer's \nTooltip window (producer, copyright, date, version) PowerPoint Starter The PowerPoint Starter \nhas been completely re-developed. A separate PowerPoint viewer can be specified for each Windows \nVersion as an option Pdf Starter The Pdf Starter has been completely re-developed. \nA separate Pdf Reader can be specified for each Windows Version as an option Easier to use Menu \nobjects can be positioned using the cursor keys. The size of menu objects can be altered using \nthe cursor keys. Improved cursor position display. Multiple improvements An incredibly large \nnumber of small improvements have been integrated into this version, particularly with regard \nto making the program easier to use.\n\nHere are some key features of &quot;CDMenuPro Business Edition&quot;:\nÃ‚Â· Creates all the files necessary for the CD Autostart feature.\nÃ‚Â· Using graphics to create a background and buttons makes it possible to design the menu \nto suit your needs.\nÃ‚Â· Rectangular, oval or round menu windows with or without title bars.\nÃ‚Â· Buttons available in the following styles: Windows, Bitmap, Office, Outlook, Hyperlink, Image.\nÃ‚Â· Up to 25 sub-menu pages for each menu page and 4 hierarchical levels are possible.\nÃ‚Â· You can integrate your own intros\nÃ‚Â· Automatic start of an AVI Video Trailer\nÃ‚Â· Splash Screen\nÃ‚Â· Optional: Menu access control (Password, License Agreement)\nÃ‚Â· Optional: The ability to protect data on the CD against unauthorized access\nÃ‚Â· Open a document in the user's viewer.\nÃ‚Â· Start a application, with the option of passing a command line argument.\nÃ‚Â· Windows Explorer can be started in any folder.\nÃ‚Â· Start programs &amp; files using: action buttons, list boxes, pop-up menus, context menus\nÃ‚Â· Open and display local internet pages and intranet pages\nÃ‚Â· Open a pre-addressed email application.\nÃ‚Â· External Viewer (Royality Free)\nÃ‚Â· Text Viewer\nÃ‚Â· RichText Viewer\nÃ‚Â· Html Viewer\nÃ‚Â· Image Viewer\nÃ‚Â· Embedded Viewer\nÃ‚Â· Text Viewer\nÃ‚Â· RichText Viewer\nÃ‚Â· Image Viewer\nÃ‚Â· Integrated AVI player\nÃ‚Â· Integrated sound player\nÃ‚Â· Background sound and/or button sound\nÃ‚Â· Speaker control\nÃ‚Â· Tooltips\nÃ‚Â· Project wizards\nÃ‚Â· Drag &amp; Drop - interface\nÃ‚Â· Resource browser and templates\nÃ‚Â· Add-on software\nÃ‚Â· The viewers and the PowerPoint and Pdf Starters can be added to the CD (Royalty Free)\nÃ‚Â· Icon Converter (Bmp -&gt; Icon)\nÃ‚Â· Resource Compiler (adds the resource files belonging to your menu into the menu application file)\nÃ‚Â· Insert your copyright and file information into the menu application\nÃ‚Â· No programming knowledge required.\nÃ‚Â· Detailed documentation\nÃ‚Â· Full install and uninstall make getting started quick and easy.\nÃ‚Â· Support free of charge\nÃ‚Â· Complementary programs:\nÃ‚Â· Bitmap Icon Konverter.\nÃ‚Â· Button Creator.\nÃ‚Â· Text Viewer.\nÃ‚Â· Rich Text Viewer.\nÃ‚Â· Html Viewer.\nÃ‚Â· Image Viewer.\nÃ‚Â· ArchiveSafe (file protection)\nÃ‚Â· Only in the Business Edition:\nÃ‚Â· PowerPoint Starter\nÃ‚Â· Pdf Starter\nÃ‚Â· Resource Compiler\n\n\nInstall Notes:\n\n1) Run cdmenupe64005.exe\n2) Enter Username &amp; key when ask (see serial.TxT inside zip file)\n3) Done,\n\nEnjoy,\nTrT\n\n\n","torrent":{"xt":"urn:btih:a7a963e9c1ee1d378bbab49bd973040f475f09e7","amp;dn":"CD+Menu+Pro+v6.40.05+%2B+serial+%5Bcorrect+version%5D+-TrT-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7a963e9c1ee1d378bbab49bd973040f475f09e7","infoHashBuffer":{"type":"Buffer","data":[167,169,99,233,193,238,29,55,139,186,180,155,217,115,4,15,71,95,9,231]},"announce":[],"urlList":[]}}