{"title":"GIBO[HENTAI-GAME]","uid":3317152,"size":717580749,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a827c7b8d2285bc142328f373ed5c001850a554e&amp;dn=GIBO%5BHENTAI-GAME%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EasyTarget2","files":4,"time":1113570625,"description":"My father remarried...\n\nMy name is Yusuke Yagami. When I was a boy, I witnessed something which no one should ever see. My own mother, locked in the throes of passion with a man who wasn't my father. Her adultery caused our happy home to come crashing down, and my father divorced her. Since those dark days, I've been mistrustful of what the concept of &amp;quot;mother&amp;quot; really was.\n\nNow, after so many years, my father remarried, and suddenly, I had a new stepmother, or Gibo. \n\nThe woman my father married was not old, but young, and beautiful. When I looked at Misako-san for the first time, I felt something move inside me. \n\nAs the days went by, I found myself thinking of my new mother in ways that shocked myself.\n\nCould I accept this beautiful woman as my mother? After all, I found out what mothers are really like the day I saw their unfaithfulness. Punishment may be necessary...\n\nA high-quality Japanese bishoujo adventure full of drama and forbidden themes, Gibo causes you to question the very nature of love as you move through the overlappiing scenarios to one of the game's bizarre conclusions. With over a dozen potential endings for high replay value, and a bizarre cast of beautiful characters, Gibo is a bishoujo experience unlike any that have been brought to the English language.","torrent":{"xt":"urn:btih:a827c7b8d2285bc142328f373ed5c001850a554e","amp;dn":"GIBO%5BHENTAI-GAME%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a827c7b8d2285bc142328f373ed5c001850a554e","infoHashBuffer":{"type":"Buffer","data":[168,39,199,184,210,40,91,193,66,50,143,55,62,213,192,1,133,10,85,78]},"announce":[],"urlList":[]}}