{"title":"The Ramones - Teenage Lobotomy  (2nafish)","uid":5236117,"size":66824196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a876891214ff91bdffdd50b9fd0fd032580ac72d&amp;dn=The+Ramones+-+Teenage+Lobotomy++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":1,"time":1261542947,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Ramones - Teenage Lobotomy (Live-Beat Club) (2nafish)\n\n\nRocket to Russia is the third album by American punk group the Ramones, their last with original drummer Tommy Ramone. Released on November 4, 1977, the album incorporates surf rock and other influences. It includes some of the Ramones' best-known songs, including &quot;Sheena Is a Punk Rocker&quot; and &quot;Teenage Lobotomy&quot;. In 2003, the album was ranked number 105 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nThe album was recorded in late August 1977 at Media Sound studios in Midtown Manhattan. The cost of recording Rocket to Russia was roughly $25,000, which was significantly higher than that of the band's two previous records. At the request of guitarist Johnny Ramone, Punk Magazine editor and illustrator John Holmstrom produced the sleeve art, a cartoonish view of the world from a rocketship with a pinhead, emblematic of the band, grabbing onto it. In 1978, the album peaked at #49 on the Billboard pop albums chart, making it one of the band's most popular releases.\n\nOn June 19, 2001, Rhino Records re-released the album. In addition to remastering the tracks from the original album, it included alternate versions of album tracks as well as a B-side.\n\n&quot;Rockaway Beach&quot;, penned by bassist Dee Dee Ramone in the style of the Beach Boys and other early rock 'n' roll bands, was written about Rockaway Beach, Queens, where Dee Dee liked to spend time. Johnny Ramone claimed that Dee Dee was the only real beachgoer in the group.[citation needed] Released in 1977, it was the Ramones' highest charting single in their career, hitting #66 on the Billboard Hot 100. &quot;Rockaway Beach&quot; has been covered by punk rock cover band The 77's, Finnish punk rock band Ne LuumÃƒÂ¤et (in Finnish, &quot;Hiekkaa Hietarannan&quot;), Swedish rock band Sahara Hotnights, American punk rock band The Queers (who covered the entire Rocket to Russia album in 1994 on Rocket to Russia), Morrissey collaborator and former Polecat, Boz Boorer, Canadian rock band Deja Voodoo (also in Finnish), German punk band Die Toten Hosen on their &quot;Alles wird vorÃƒÂ¼bergehen&quot; single, and Spanish rock band Siniestro Total (in Spanish, under the title Rock en Samil, a popular beach near their hometown Vigo in Galicia). The Argentinian band Superuva did the same with their cover Rock en Tandil, a city in the middle of the Tandilia hills.\n\n&quot;Surfin' Bird&quot; is a cover of the original song by The Trashmen. &quot;Do You Wanna Dance?&quot; was written by Bobby Freeman in 1958, but is probably best known for a 1965 cover by the Beach Boys.\n\n&quot;I Don't Care&quot;, one of the first songs the group ever wrote, was originally recorded as a demo for their first album, Ramones.\n\n&quot;Cretin Hop&quot; was played in the onstage fight scene in the punk movie SLC Punk!.\n\n&quot;Rockaway Beach&quot; and &quot;Teenage Lobotomy&quot; are available for download in the music game Rock Band.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a876891214ff91bdffdd50b9fd0fd032580ac72d","amp;dn":"The+Ramones+-+Teenage+Lobotomy++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a876891214ff91bdffdd50b9fd0fd032580ac72d","infoHashBuffer":{"type":"Buffer","data":[168,118,137,18,20,255,145,189,255,221,80,185,253,15,208,50,88,10,199,45]},"announce":[],"urlList":[]}}