{"title":"Survivor.S26E10.HDTV.x264-2HD","uid":8385933,"size":387082132,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a958780cf666b9d24804bd72c1d1ecc1a20e68df&amp;dn=Survivor.S26E10.HDTV.x264-2HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"R0thschild","files":1,"time":1366245788,"description":"--------------------------------------------\n\nGenre: Adventure, Drama, Family, Travel\nYear: 2013\nCountry: USA\nRuntime: 42 min\nProducer: Tom Shelly, Mark Burnett, Doug McCallie\n\n.: Plot :.\n&quot;Survivor&quot; is one of the most popular reality TV shows of all-time. Each season for 39 days, 16-20 castaways will be marooned on a tropical island in various locations. They will be forced to band together and carve out a new existence, using their collective wits to make surviving, without any conveniences of the modern world, a little easier. Day by day the location and tropical sun will test the endurance of the castaways.\n\nEach three days of island life will result in a one-hour Survivor episode. The survivors must form their own cooperative island society, building shelter, gathering and catching food, and participating in contests for rewards. Those who succeed in the day-to-day challenges will be rewarded with things to make island life more bearable-simple comforts like pillows, food, cold beer and sodas, and clean clothing. Those who fail must do without. On the last day of each three-day cycle, the castaways must form a tribal council. At this meeting, each person places a secret ballot vote to send one fellow castaway home, eliminating him or her from eligibility for the one million dollars.\n\nWeek by week, one by one, the tribe shrinks until at the end of the final episode, only two survivors remain. At that point, the seven most recently eliminated castaways will return to form the final tribal council and decide who will be the final soul survivor and the winner of $1,000,000 dollars.\n\n--------------------------------------------\n\nMore at   &lt;a href=&quot;\nhttp://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://publichash.com/&lt;/a&gt;\n\n--------------------------------------------\t","torrent":{"xt":"urn:btih:a958780cf666b9d24804bd72c1d1ecc1a20e68df","amp;dn":"Survivor.S26E10.HDTV.x264-2HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a958780cf666b9d24804bd72c1d1ecc1a20e68df","infoHashBuffer":{"type":"Buffer","data":[169,88,120,12,246,102,185,210,72,4,189,114,193,209,236,193,162,14,104,223]},"announce":[],"urlList":[]}}