{"title":"A. Dirk Moses - Empire, Colony, Genocide [2008][A]","uid":9948325,"size":15045682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9817dc041e7c482718b16e11d86e8fde08bd35b&amp;dn=A.+Dirk+Moses+-+Empire%2C+Colony%2C+Genocide+%5B2008%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1397350438,"description":"Description\nProduct details\nBook Title: Empire, Colony, Genocide: Conquest, Occupation, and Subaltern Resistance in World History (War and Genocide)\nBook Author: A. Dirk Moses (Editor)\nHardcover: 480 pages\nPublisher: Berghahn Books (4 Jun 2008)\nLanguage: English\nISBN-10: 1845454529\nISBN-13: 978-1845454524\n\nBook Description\nPublication Date: 4 Jun 2008 | Series: War and Genocide (Book 12)\nIn 1944, Raphael Lemkin coined the term genocideA&quot; to describe a foreign occupation that destroyed or permanently crippled a subject population. In this tradition, Empire, Colony, Genocide embeds genocide in the epochal geopolitical transformations of the past 500 years: the European colonization of the globe, the rise and fall of the continental land empires, violent decolonization, and the formation of nation states. It thereby challenges the customary focus on twentieth-century mass crimes and shows that genocide and ethnic cleansingA&quot; have been intrinsic to imperial expansion. The complexity of the colonial encounter is reflected in the contrast between the insurgent identities and genocidal strategies that subaltern peoples sometimes developed to expel the occupiers, and those local elites and creole groups that the occupiers sought to co-opt. Presenting case studies on the Americas, Australia, Africa, Asia, the Ottoman Empire, Imperial Russia, and the Nazi Third Reich,A&quot; leading authorities examine the colonial dimension of the genocide concept as well as the imperial systems and discourses that enabled conquest. Empire, Colony, Genocide is a world history of genocide that highlights what Lemkin called the role of the human group and its tribulations.A&quot;\n\nReviews\n&quot;With its depth of theoretical insight and the wealth of empirical material this volume sets new standards for the history of colonialism and genocide&quot; The essential problem of the book - its recurrent question as well as its potential pitfall - is the position of the Holocaust in relation to other acts of extermination - This creates a tension throughout the book; it also makes it worth debating and certainly makes it a remarkably useful text to inform further research and for teaching purposes.A&quot; * Journal of Global History\n\n&quot;...the volume offers an unusually rich, deeply disturbing material.A&quot; * Peripherie\n\n&quot;Empire, Colony, Genocide represents an important contribution to genocide studies. Taken individually or collectively, the contributors should be applauded for some thoughtful, methodologically sophisticated, and intellectually rigorous work ... What this volume provides, therefore, is stimulus to further analyze the social, economic, and cultural threads that fostered this complexity, and rationalized genocidal violence.A&quot; * Journal of Genocide Research\n\n&quot;Crossing broad temporal ranges and geographies, the collection represents a significant advance in genocide scholarship in its fusion of ostensibly unconnected episodes of mass violence, mass migrations, and nation building projects. It also represents a critical attempt to revisit the impact of murderous impulses in Western modernity as a structural logic with definable processes and actively pursued outcomes of domination and erasure of the colonisedA&quot; * Australian Journal of Politics and History\n\n&quot;In summary, this is a book that proposes a daring thesis, namely that genocide since antiquity has its origins in imperialism and colonialism.A&quot; * Journal of World History\n\n&quot;The volume is disturbing and provocative reading. It raises fundamental methodological and conceptual notions related to genocide. It thereby positions genocide studies in their own right much independent of the hitherto largely dominant Holocaust studies, and situates the latter in a wider context. It is a context of a modern history of violence, which emerged in its still existing forms hand in hand with the industrial mode of production.A&quot; * New Routes, A Journal of Peace Research and Action\n\n&quot;An immensely stimulating volume ... [that] meets the challenge to make this kind of mass violence ... a subject ... of global historical importance. It brings together in an innovative way the 'crime without name' as it is sometimes called ... with settler colonialism. This approach thus provides a common framework for fields of research that until then were thought to be disparate. Without relativising the genocide of the European Jews, which was in the minds of Lemkin and the UN Convention, new cross references are nevertheless being trialled.&quot; * H-Soz-u-Kult\n\n&quot;This volume offers an important contribution to the discussion on methodological and conceptional foundations of the notion of genocide in that it identifies the latter more precisely and anchors it more firmly in historical epistemology than has been the case up to now in Genocide Studies - Second, this volume reflects new developments in Genocide Studies in its focus on 'Genocide from Below' - Third, some contributions stand out because of their daring and unconventional approaches [which should be] an encouragement for others to abandon scholarly blinkers.&quot; * Sehepunkte\n\n&quot; - a meticulously researched and deftly edited scholarly reference - strongly recommended to community library history collections and any non-specialist general reader with a strong interest in world history.&quot; * The Midwest Book Review\n\nAbout the Author\nA. Dirk Moses teaches history at the University of Sydney. He has published widely on modern Germany and Comparative Genocide Studies. His publications include Genocide and Settler Society (Berghahn Books 2004) and German Intellectuals and the Nazi Past (CUP 2007)\n","torrent":{"xt":"urn:btih:a9817dc041e7c482718b16e11d86e8fde08bd35b","amp;dn":"A.+Dirk+Moses+-+Empire%2C+Colony%2C+Genocide+%5B2008%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9817dc041e7c482718b16e11d86e8fde08bd35b","infoHashBuffer":{"type":"Buffer","data":[169,129,125,192,65,231,196,130,113,139,22,225,29,134,232,253,224,139,211,91]},"announce":[],"urlList":[]}}