{"title":"Tom Clancy's Ghost Recon Trilogy NTSC-U","uid":10597527,"size":23884634881,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:a9d641b85ef0af59678acccb05c479a854842b59&amp;dn=Tom+Clancy%27s+Ghost+Recon+Trilogy+NTSC-U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":7,"uploader":"zerodayz","files":-1,"time":1405874796,"description":"\nIncludes:\n\nGhost_Recon_Advanced_War_Fighter_NTSC_PROPER_XBOX360-ObP\nGhost_Recon_Advanced_Warfighter_2_NTSC_XBOX360-VORTEX\nTom.Clancys.Ghost.Recon.Future.Soldier.XBOX360-iMARS\n\nPlease Note\n\nThe DLC is not included, as the retail release for Tom Clancy's Ghost Recon Trilogy Edition has a redemption code inside the packaging and is not included on the discs.\n\n\n\nTom Clancy's Ghost Recon Advanced Warfighter\n\nAbout This Game\n\nIn 2013, the U.S. Army will implement the Integrated Warfighter System evolving what we know as the modern soldier. IWS combines advanced weapon systems, satellite communication devices and enhanced survivability into one fully integrated combat system. The IWS program has been developed to meet these new threats head on. Now, it can be tested on the battlefield.\n\nEmbody Captain Scott Mitchell as he commands the Ghosts and Special Forces allies equipped with the IWS in the quest to save the president of the United States, recover stolen nuclear codes and eliminate a vicious band of renegade soldiers hell-bent on unleashing catastrophe. Amongst the major features in Advanced Warfighter is the new Cross-Cam eye-piece communication device, utilizing the power of the Xbox 360 to deliver consistent and complete battlefield awareness.\n\nSupported Functions\nNumber Of Players: 1-16\nOnline\nMemory Card\nLocal - VS # of Players\nOnline - VS Number Of Players: 16\n16:9\n480p\n720p\nCustom Soundtrack\nOnline Leaderboards\n\n\nTom Clancy's Ghost Recon Advanced Warfighter 2\n\nAbout This Game\n\nTom Clancy's Ghost Recon Advanced Warfighter 2 builds off of the events in the first game and places gamers in control of the U.S. military's elite fighting unit, the Ghosts. In the year 2014, the rising conflict between Mexican loyalists and insurgent rebel forces has thrown Mexico into full-scale civil war. Under the command of Captain Scott Mitchell, the Ghosts are called upon to face an imminent threat to the United States. The fate of two countries now lies in the hands of the Ghosts as they fend off an attack on U.S. soil. Equipped with the most cutting-edge weaponry and technology, the Ghosts must battle on both sides of the border to neutralize the escalating rebel threat.\n\nSupported Functions\nNumber Of Players: 16\nOnline\nMemory Card\nLocal - VS # of Players\nLocal - Co-Op # of Players\nOnline - VS Number Of Players: 16\nOnline - Co-Op Number Of Players: 16\n720p\nCustom Soundtrack\nDolby Digital 5.1\nDownloadable Content\nSystem Link / LAN\n\n\nTom Clancy's Ghost Recon: Future Soldier\n\nAbout This Game\n\nPart of the Group for Specialized Tactics, a Special Mission Unit under the direct command of the Joint Special Operations Command, the elite of the modern US Special Forces is better known by their battlefield legend. They are the untraceable soldiers called the Ghosts. Only the best of the best, soldiers with a unique mix of skills on and off the battlefield, ever get to wear the coveted Ghost insignia. In the near future, four of these elite soldiers serve as the tip of the spear in a hidden war raging across the globe. But even as Ghost Lead, Pepper, 30K, and Kozak accomplish their objectives, they discover the threat they face is greater than they ever imagined -- one that could alter the international balance of power forever.\n\nProviding yet another new direction in the Ghost Recon series of military games, Ghost Recon: Future Soldier promises to go beyond the core Ghost Recon franchise and deliver a fresh gameplay experience. The game features cutting-edge technology, prototype high-tech weaponry, and state-of-the-art single-player and multiplayer modes.\n\nSupported Functions\nOnline\nOnline - Co-Op Number Of Players: 4\nKinect","torrent":{"xt":"urn:btih:a9d641b85ef0af59678acccb05c479a854842b59","amp;dn":"Tom+Clancy%27s+Ghost+Recon+Trilogy+NTSC-U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d641b85ef0af59678acccb05c479a854842b59","infoHashBuffer":{"type":"Buffer","data":[169,214,65,184,94,240,175,89,103,138,204,203,5,196,121,168,84,132,43,89]},"announce":[],"urlList":[]}}