{"title":"Packtpub.Ext.JS.4.First.Look.Jan.2012","uid":7023765,"size":11879941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa48240d91faa2e6844505861c6fd59572407412&amp;dn=Packtpub.Ext.JS.4.First.Look.Jan.2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":3,"time":1328937642,"description":"Book Description\nExt JS 4 is a JavaScript framework that provides resources to build Rich Internet Applications with great performance. Ext JS 4 has been packed with many new features and it is difficult to master, even for seasoned experts in Ext JS 3.\n\nExt JS 4 First Look teaches you the main functional areas of Ext JS 4 that have significant new features, explains the new features and how to use them, while highlighting the differences between Ext JS 4 and the previous versions.\n\nThis book will give you the knowledge to make the required changes to Ext JS 3 application to build a complete Ext JS 4 application.\n\nThis book provides examples of how to load Ext JS components by demand, charts, grid, tree, forms and panels, new data model, themes and mvc architecture.\n\nExt JS 4 First Look provides full examples and illustrations to help you easily learn the new features of Ext JS 4.\n\nWhat you will learn from this book\n\nLearn the major changes in Ext JS 4 and its compatibility with Ext JS 3, including how to load components by demand.\nUnderstand how to use the new Data package, including new features such as Model, Associations, Validations, new Proxies, etc.\nOrganize Ext JS 4 components into containers using upgraded and new Layout engines.\nCreate bar, pie, radar, scatter, gauge, line, and area charts without using Flash and customize them.\nLearn what has changed in Ext JS 4 components such as Grid, Tree, Form.\nChange and create new themes using Sass and Compass.\nBuild a complete application using the new Ext JS MVC architecture.\nCompare Ext JS 3 with Ext JS 4 class names.\nApproach\nThis book is a practical step-by-step tutorial which guides you to migrate from Ext JS 3 to Ext JS 4. There are examples backed with explanations and plenty of code and illustrations to look forward to.\n\nWho this book is for\nThis book is written for web developers who are familiar with Ext JS 3 and want to have detailed insights into the new features of Ext JS 4.\n\nBook Details\nPaperback: 340 pages\nPublisher: Packt Publishing (January 2012)\nLanguage: English\nISBN-10: 1849516669\nISBN-13: 978-1849516662","torrent":{"xt":"urn:btih:aa48240d91faa2e6844505861c6fd59572407412","amp;dn":"Packtpub.Ext.JS.4.First.Look.Jan.2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa48240d91faa2e6844505861c6fd59572407412","infoHashBuffer":{"type":"Buffer","data":[170,72,36,13,145,250,162,230,132,69,5,134,28,111,213,149,114,64,116,18]},"announce":[],"urlList":[]}}