{"title":"Matthew Shipp - Nu Bop (2002)","uid":6289296,"size":250169562,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:aa7c05b392d9cdc6a93165cab8aa2230138d24e5&amp;dn=Matthew+Shipp+-+Nu+Bop+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mariorg","files":-1,"time":1301740483,"description":"Thirsty Ear Recordings: THI 57114.2 &lt;a href=&quot;\nhttp://www.thirstyear.com/album_detail.php?artist=Matthew%20Shipp&amp;album=Nu%20Bop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thirstyear.com/album_detail.php?artist=Matthew%20Shipp&amp;album=Nu%20Bop&lt;/a&gt;\n\n* Matthew Shipp: Piano\n* William Parker: Bass\n* Daniel Carter: Saxophone &amp; Flute\n* Guillermo E. Brown: Drums\n* FLAM: Synths &amp; Programming\n\nHomepage:\n~~~~~~~~~ &lt;a href=&quot;\nhttp://www.matthewshipp.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.matthewshipp.com/&lt;/a&gt;\n\nTrack List\n~~~~~~~~~~\n1. Space Shipp\n2. Nu-Bop\n3. ZX-1\n4. D's Choice\n5. X-Ray\n6. Rocket Shipp\n7. Select Mode 1\n8. Nu Abstract\n9. Select Mode 2\n\nReview\n~~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/album/nu-bop-r559136&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/nu-bop-r559136&lt;/a&gt;\nby Thom Jurek\n\nHere's a twist that's full-on bent: Matthew Shipp making funky avant-garde\njazz. It's true that, like Sun Ra on his Lanquidity album in the late '70s,\nShipp has decided to add programming and synths to his mix for this disc, to at\nleast walk a tightrope between improvisational art and the music of the\nstreet. For any of you groaning as you read this, give it up -- this disc is one\nof Shipp's very best and one of the first really new things to come across on\nthe American jazz front in over a decade. The band is comprised of Shipp on\npiano, William Parker on contrabass, Daniel Carter replacing David S. Ware on\nsaxophone and flute, Guillermo Brown on drums, and FLAM on synths and\nprogramming. Shipp's methodology is one of shifting rhythmic hypnosis and modal\ninquiry along scaled intervals and striated harmonic pathways that lead through\nthe middle registers of both the saxophone and the piano. &quot;X-Ray&quot; is a keen\nexample of how Shipp employs an ostinato line that changes itself ever so\nslightly in each chorus, is treated by FLAM with tweaked programming moves that\nunderscore the rhythmic line, and allows Parker to roll around the changes\nbetween Carter and Shipp. In other places, such as on &quot;Space Shipp,&quot; which opens\nthe album, the funky line sets the pace for a six-chord thematic statement by\nShipp. Parker lays in the cut with Brown, allowing the funk and roll to slip\ndramatically into a hypnotic groove that flows into Shipp's solo. Rather than a\nflurry of middle- and upper-register notes and chords, Shipp concentrates on\nestablishing intervallic patterns that dig deeper into the thematic material and\n&quot;deepen the funk,&quot; if you will, by modalizing its context. The disc closes with\n&quot;Select Mode 2,&quot; an angular off-minor modal move with interplay and polyrhythmic\naccents by FLAM and Brown over a 5/8 samba figure as Shipp and Parker close\nranks with the extensions of line and syntax in repetitive phrases that revolve\naround the rhythmic construct and move beyond it without leaving the\ngroove. This is truly a new way of approaching jazz, a new way of hearing the\nintricacies of rhythmic counterpoint and textured harmonics that syncopate the\nentire methodology of composition and improvisation into a holistic view of the\nmusic as pulse and force. Shipp has clearly outdone himself this time, and the\nBlue Series that he coordinates on Thirsty Ear continues to be one of the\nbravest and most exciting series of recordings in jazz today.","torrent":{"xt":"urn:btih:aa7c05b392d9cdc6a93165cab8aa2230138d24e5","amp;dn":"Matthew+Shipp+-+Nu+Bop+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa7c05b392d9cdc6a93165cab8aa2230138d24e5","infoHashBuffer":{"type":"Buffer","data":[170,124,5,179,146,217,205,198,169,49,101,202,184,170,34,48,19,141,36,229]},"announce":[],"urlList":[]}}