{"title":"The American Black Chamber (2013) Herbert O Yardley (multi)","uid":9498523,"size":16079408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa90f96348b2a0eadc07d13197185c0b852fe8a0&amp;dn=The+American+Black+Chamber+%282013%29+Herbert+O+Yardley+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1390163984,"description":"The American Black Chamber: An Adventure in Espionage (2013) Herbert O Yardley multi\n\nThe American Black Chamber: An Adventure in Espionage by Herbert O. Yardley\n\n\nFormat: mobi/epub/azw3\nLength: 375 pages\nGenre: History\nDate: 11 May 2013 (Reprint, first published 1931)\n\nDuring the 1920s Herbert O. Yardley was chief of the first peacetime cryptanalytic organization in the United States, the ancestor of today's National Security Agency. Funded by the U.S. Army and the Department of State and working out of New York, his small and highly secret unit succeeded in breaking the diplomatic codes of several nations, including Japan.\n\nThe decrypts played a critical role in U.S. diplomacy. Despite its extraordinary successes, the Black Chamber, as it came to known, was disbanded in 1929. President Hoover's new Secretary of State Henry L. Stimson refused to continue its funding with the now-famous comment, &quot;Gentlemen do not read other people's mail.&quot;\n\nIn 1931 a disappointed Yardley caused a sensation when he published this book and revealed to the world exactly what his agency had done with the secret and illegal cooperation of nearly the entire American cable industry. These revelations and Yardley's right to publish them set into motion a conflict that continues to this day: the right to freedom of expression versus national security. In addition to offering an expose on post-World War I cryptology, the book is filled with exciting stories and personalities.\n\nAuthor:\n\nHerbert Osborne Yardley was an American cryptologist best known for his book The American Black Chamber. The title of the book refers to the Cipher Bureau, the cryptographic organization of which Yardley was the founder and head. Under Yardley, the cryptanalysts of The American Black Chamber broke Japanese diplomatic codes and were able to furnish American negotiators with significant information during the Washington Naval Conference of 1921-1922. He later helped the Nationalists in China (1938-1940) to break Japanese codes.\n","torrent":{"xt":"urn:btih:aa90f96348b2a0eadc07d13197185c0b852fe8a0","amp;dn":"The+American+Black+Chamber+%282013%29+Herbert+O+Yardley+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa90f96348b2a0eadc07d13197185c0b852fe8a0","infoHashBuffer":{"type":"Buffer","data":[170,144,249,99,72,178,160,234,220,7,209,49,151,24,92,11,133,47,232,160]},"announce":[],"urlList":[]}}