{"title":"Div, Grad, Curl And All That - An Informal Text on Vector Calcul","uid":7826590,"size":12478722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa9a6cb0e2b52df3fa6c5d7dd1684c584fdf690d&amp;dn=Div%2C+Grad%2C+Curl+And+All+That+-+An+Informal+Text+on+Vector+Calcul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artic-andy","files":1,"time":1352942124,"description":"If you are an undergraduate engineering or science major, then you need to get a copy of this old classic and become good friends with it. If you are a graduate student or a professional in some branch of engineering or science, and you have not already read this book, then sneak out and get a copy before anybody finds out. (You can pretend that you really knew this stuff all along.) Seriously, this book should be considered Math 101 for scientists and engineers. You simply cannot get by without knowing the basics of vector calculus, curvilinear coordinates, Gauss' law, Stokes' theorem, and of course, the protagonists Divergence, Gradient, and Curl, known to their friends as Div, Grad, and Curl.\nThis is about as tame a book on vector calculus as you could ever hope to meet, which is part of the reason it's been so popular for so long. It's very easy to read (as far as math texts go), it has many simple but effective illustrations, it has ample exercises (most of which have solutions in the back), and it avoids excessive formalism, instead focusing on the nuts-and-bolts of vector calculus as it most commonly arises in electrostatics, for example.\n\nMath majors will not be so enamored of this book, simply because of its heuristic approach (hence the word &quot;informal&quot; in the subtitle) and its close ties with applications, which it uses as motivation. Moreover, Schey does not develop differential forms or exterior calculus, which logically subsume and extend the material in this book (at the expense of far greater abstraction, which the majority of engineering and science students will prefer to avoid or at least delay). Instructors, if you teach electrostatics or fluid dynamics, you may wish to consider having this as a supplementary text for your students. It's such a clear and helpful little book your students will really appreciate it. (But, you already knew that.)","torrent":{"xt":"urn:btih:aa9a6cb0e2b52df3fa6c5d7dd1684c584fdf690d","amp;dn":"Div%2C+Grad%2C+Curl+And+All+That+-+An+Informal+Text+on+Vector+Calcul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9a6cb0e2b52df3fa6c5d7dd1684c584fdf690d","infoHashBuffer":{"type":"Buffer","data":[170,154,108,176,226,181,45,243,250,108,93,125,209,104,76,88,79,223,105,13]},"announce":[],"urlList":[]}}