{"title":"POtHS - SNR - UFOs Angels Spirits Witches and Demons Vol 64 - Th","uid":11213709,"size":7279066601,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aaba9b2b827a9391ac92fda3c715d1120f80caf7&amp;dn=POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+64+-+Th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"POtHS11","files":126,"time":1413300679,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SNR - UFOs Angels Spirits Witches and Demons Vol 64 - The Alien Human Project\n\n\n\nDescription\n\nThe Alien Human Project:\nHumanity's oldest question of whether man is alone in the universe, has been a topic that dates back as far as recorded history. Many people have pondered the question &amp; some have taken it a full step further, investigating our solar system, galaxy &amp; universe as a whole. Then SETI was formed by famed astronomer Carl Sagan. Billions of dollars have been spent scanning the skies looking for the 'answer' by listening for radio waves. Many people have even concluded that this is a waste of time &amp; money since we don't even know if other worldly creatures would even use the same radio telescopes as we do. Nonetheless, over 40 years later, SETI has gotten humanity no where while at the same time, 1 man has answered the question that billions have asked. Dr Roger Leir is a doctor of podiatric medicine that stumbled onto this phenomenon on accident. During one routine surgery to remove something supposedly placed into someone's foot spawned into a whole new era of science. Dr. Leir alone has been able to finally answer the question through true scientific analysis via these implants. The top laboratories in the world have all concluded the same thing: that these 16 objects removed from various people do NOT originate on earth &amp; have technologies that we can only dream of. Tune in now to watch this amazing story of how this one doctor's quest for truth has led him to uncover humanity's biggest discovery: that we are truly not alone. This IS the definitive proof that skeptics have been asking for &amp; the proverbial &quot;smoking gun&quot; is now shown in this feature length film. Enjoy &amp; spread the word; Dr. Leir invites the world to argue with the academics &amp; data obtained from devices that are truly extraterrest!\n------------------------------------------------------------------------------------------------------------------\n\nThe Alien Human Project II:\nThis is a shocking new UFO Documentary for 2014.  Incredible New Insight to The Phenomenon of Alien Abduction, and Implants Removed By Dr. Roger Lier.  Interview Conducted by Dr. J Andy Ilias In Thousand Oaks California.  \n------------------------------------------------------------------------------------------------------------------\n\nMore videos also in this download...\nPeople Vanishing Into Thin Air\nBiotech is now creating GMO Human Babies\nHuman-animal hybrids Disasters in the Making\nMICROSCOPIC ANALYSIS of US ARTIFICIAL SNOW - SEE WHAT the DoD is HIDING\nPeople Vanishing in Clusters what's happening\nThe Nephilim Hybridization Of The Human Race\nVarious SNR and UFO short video clips\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMore Torrents in this series at http://conspiracyhub.com/membershares.php?it=41 ALL TORRENTS are RELEASED here FIRST!!! The First down loaders of my torrents get the Main Hookups on my SERVER. This will get lightning fast downloads, FOR FREE. (The High Speed download wholesalers are going to hate me)I upload to OVER 13 Torrent sites and this site is uploaded 1st.\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n &lt;a href=&quot;\nhttp://conspiracyhub.com/membershares.php?it=41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/membershares.php?it=41&lt;/a&gt;  \n\nGet info on the Take Over by The New World Order Below\n &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great\n                                                                                Listen to Alex Jones   Secular Truth &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                               Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                         Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                       Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n                                              :thankyou:    :thankyou:   Thank You JESUS","torrent":{"xt":"urn:btih:aaba9b2b827a9391ac92fda3c715d1120f80caf7","amp;dn":"POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+64+-+Th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaba9b2b827a9391ac92fda3c715d1120f80caf7","infoHashBuffer":{"type":"Buffer","data":[170,186,155,43,130,122,147,145,172,146,253,163,199,21,209,18,15,128,202,247]},"announce":[],"urlList":[]}}