{"title":"Doctor Who - Season 07 - (1969-70) - 25 Episodes","uid":9079199,"size":2084310150,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ab0f7b7353813505d7f9b91364e0964330f56160&amp;dn=Doctor+Who+-+Season+07+-+%281969-70%29+-+25+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bnaron","files":25,"time":1382313989,"description":"The seventh season of British science fiction television series Doctor Who began on 3 January 1970 with Jon Pertwee's first story Spearhead from Space and ended with Inferno. Jon Pertwee makes his first appearance as the Third Doctor replacing Patrick Troughton in the role. Caroline John makes her first appearance as companion and assistant Liz Shaw in Spearhead from Space and last in Inferno. Nicholas Courtney returns as Brigadier Lethbridge-Stewart and he would continue to make regular appearances in Doctor Who until season 13. John Levene also makes his first appearance as Sergeant Benton since The Invasion in The Ambassadors of Death and would continue to make regular appearances until season 13.\n\n1.  Spearhead from Space - Four Episodes\n\n    Synopsis: The newly regenerated Doctor is exiled to Earth in the 20th\n    century. At the same time, a swarm of meteorites fall in Oxley Woods.\n    The Doctor has to devise a way to destroy the Autons before they\n    replace the people of the earth with a plastic population.  \n\n2.  Doctor Who and the Silurians - Seven Episodes\n\n    Synopsis: Creatures named as Silurians are lurking under a nuclear\n    power research center, driving people insane.  \n\n3.  The Ambassadors of Death - Seven Episodes\n\n    Synopsis: The British space program oversees the launch of the\n    Recovery Seven probe that has been sent to Mars to make contact\n    with the missing Mars Probe Seven and its two astronauts, who\n    lost contact with Earth eight months earlier. Van Lyden makes\n    contact with the Probe but is then silenced by a piercing\n    unearthly sound.\n\n4.  Inferno - Seven Episodes\n\n    Synopsis: Inferno is the nickname given to a project to\n    penetrate the Earth's crust. The project, however, has\n    its own problems and the Doctor is sent to an alternate\n    universe. \n","torrent":{"xt":"urn:btih:ab0f7b7353813505d7f9b91364e0964330f56160","amp;dn":"Doctor+Who+-+Season+07+-+%281969-70%29+-+25+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0f7b7353813505d7f9b91364e0964330f56160","infoHashBuffer":{"type":"Buffer","data":[171,15,123,115,83,129,53,5,215,249,185,19,100,224,150,67,48,245,97,96]},"announce":[],"urlList":[]}}