{"title":"Documentales de sexo - 01 Sexo del siglo XXI [dVDRIp][SPanish]","uid":6856595,"size":608167936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ab52490a27b9f44f82637dacc729a75c832195dc&amp;dn=Documentales+de+sexo+-+01+Sexo+del+siglo+XXI+%5BdVDRIp%5D%5BSPanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"virana","files":-1,"time":1322728490,"description":"Se estrena Sex mundi: La aventura del sexo\n\nUnos cuantos capitulos para saber mas del tema\n\n 65.000 actos sexuales por minuto se practican en el planeta Tierra. Cien millones al cabo del dÃƒÂ­a. Los brasileÃƒÂ±os son quienes mÃƒÂ¡s frecuentemente disfrutan del sexo; los japoneses, los que menos.\n\nLos juguetes erÃƒÂ³ticos en el mundo estÃƒÂ¡n en auge y su precio puede  alcanzar los 4.000 euros. Lo ÃƒÂºltimo en sexualidad: los furries, personas en Estados Unidos que se disfrazan de pies a cabeza como su animal favorito y practican sexo asÃƒÂ­ vestidos.\n\nEstos son solo algunos apuntes sobre el audiovisual que hoy presenta la OrganizaciÃƒÂ³n Mundialde la Salud.Eldocumental Sex mundi, la aventura del sexo, que busca mostrar la sexualidad, el erotismo y las relaciones humanas en diferentes lugares del mundo serÃƒÂ¡ estrenado hoy, y se mantendrÃƒÂ¡ en Plural Entertainment durante 15 capÃƒÂ­tulos semanales.\n\nLos productores recorrieron 23 paÃƒÂ­ses, encontrando las mÃƒÂ¡s fuertes resistencias a su trabajo en Israel y Marruecos, asÃƒÂ­ como la mayor apertura en China, donde los padres buscan en determinadas plazas y parques, a jÃƒÂ³venes que se ofrecen, para casarse con sus hij@s.\n\nDesde la revoluciÃƒÂ³n sexual de los sesenta ha llovido mucho, el planeta se ha hecho mÃƒÂ¡s pequeÃƒÂ±o, las formas de vida y las relaciones humanas han cambiado lo suficiente como para que haya llegado el momento de abordar el estado de salud de la sexualidad, el erotismo, y las relaciones humanas en el mundo.\n\nEn Sex Mundi, la aventura del sexo, hemos recorrido el planeta recogiendo tradiciones y ritos ancestrales que conviven en el tiempo y a veces incluso en el lugar, con formas y sistemas de relaciones impensables hace cincuenta aÃƒÂ±os, con avances tecnolÃƒÂ³gicos que parecen de ciencia ficciÃƒÂ³n, y que nos han permitido conocer nuevas profesiones, nuevas posibilidades, y a personajes sorprendentes. Es esa diversidad y ese contraste lo que te proponemos en Sex Mundi, un recorrido por el mundo de la mano de prestigiosos pensadores, antropÃƒÂ³logos, biÃƒÂ³logos, sexÃƒÂ³logos y conocidos personajes de la cultura que nos ayudarÃƒÂ¡n a entender mejor el mundo en que vivimos. Grabada en 23 paises y realizada en Alta DefiniciÃƒÂ³n, esta fascinante serie que Odisea les presenta pretende ser una actualizaciÃƒÂ³n documental del estado de la sexualidad y las relaciones humanas en este planeta globalizado que alberga una enorme y sugerente diversidad social.","torrent":{"xt":"urn:btih:ab52490a27b9f44f82637dacc729a75c832195dc","amp;dn":"Documentales+de+sexo+-+01+Sexo+del+siglo+XXI+%5BdVDRIp%5D%5BSPanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab52490a27b9f44f82637dacc729a75c832195dc","infoHashBuffer":{"type":"Buffer","data":[171,82,73,10,39,185,244,79,130,99,125,172,199,41,167,92,131,33,149,220]},"announce":[],"urlList":[]}}