{"title":"The 1950s Kitchen (gnv64)","uid":8181397,"size":17102071,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab526ee246707399d13214b7c583b0cd5d773477&amp;dn=The+1950s+Kitchen+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1361633715,"description":"The 1950s Kitchen (Shire Library) \nby Kathryn Ferry\nShire | May 2011 | ISBN-10: 0747808279 | ePUB/PDF | 6.7/9.5 mb\n\nThe 1950s was the first great age of the modern kitchen: labor-saving appliances, bright colors and the novelty of fitted units moved the kitchen from dankness into light, where it became the domain of the happy housewife and the heart of the home. Formica - a new space-age material - decorated with fashionable patterns topped sleek cupboards that contained new classic wares such as Pyrex and 'Homemaker' crockery, and the ingredients for 1950s British staples: semolina, coronation chicken and spotted dick.\nElectricity entered the kitchens of millions, and nowhere in the home was modern technology and modern design more evident. Bold color, clean lines and stainless steel were keynotes of the decade, and it is no surprise that 1950s kitchen style is now the height of fashion once again, with names like Cath Kidston picking up on the best of '50s kitchen kitsch, and manufacturers like Dualit, Kitchen Aid and Aga doing healthy business with retro appliances.\nThis book - a celebration of cooking, eating and living in the 1950s kitchen - is a feast of nostalgia, and a mine of inspiration for anyone wanting to recreate that '50s look in their own home.\n\nAbout the Author\nKathryn is a historian, writer and lecturer who has also worked as Senior Architectural Adviser to the Victorian Society. Besides architecture and design her other great interests are the seaside and the social history of the nineteenth and twentieth centuries. She is the author of four other books for Shire, including the bestselling Beach Huts and Bathing Machines.\n\nCONTENTS\nHEART OF THE HOME\nTHE FITIED KITCHEN\nCOLOUR AND MATERIALS\nLABOUR SAVING-APPLIANCES\nCOOKWARE AND GADGETS\nFIFTIES FOOD\nFURTHER READING","torrent":{"xt":"urn:btih:ab526ee246707399d13214b7c583b0cd5d773477","amp;dn":"The+1950s+Kitchen+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab526ee246707399d13214b7c583b0cd5d773477","infoHashBuffer":{"type":"Buffer","data":[171,82,110,226,70,112,115,153,209,50,20,183,197,131,176,205,93,119,52,119]},"announce":[],"urlList":[]}}