{"title":"Tim Kinsella + Cap'n Jazz + Joan of Arc + Owls [FLAC]","uid":9808810,"size":4806569289,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab76f41cf7625798ae37ef38ccbd130cf18d2044&amp;dn=Tim+Kinsella+%2B+Cap%27n+Jazz+%2B+Joan+of+Arc+%2B+Owls+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"politux","files":-1,"time":1395497440,"description":"\n  Tim Kinsella + Cap'n Jazz + Joan of Arc + Owls [FLAC]\n\n  Politux Presents: The Tim Kinsella Mega Pack \n\n  Genre: Pop/Rock\n  Styles: Indie, Experimental, Emo, Post-Rock\n  Source: CD, WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  American Football\n\n  1998 American Football EP\n  1999 American Football\n\n  Cap'n Jazz \n\n  1998 Analphabetapolothology\n\n  Joan of Arc \n\n  1997 A Portable Model of\n  1998 How Memory Works \n  1999 Live in Chicago, 1999\n  2000 The Gap\n  2003 In Rape Fantasy and Terror Sex We Trust\n  2003 So Much Staying Alive and Lovelessness\n  2004 Joan of Arc, Dick Cheney, Mark Twain\n  2006 Eventually, All at Once \n  2007 Orchard Vale\n  2008 Boo! Human\n\n  Make Believe \n\n  2004 Make Believe EP\n  2005 Shock of Being\n  2006 of Course\n\n  Owls \n\n  2001 Owls\n  2014 Two \n\n  Tim Kinsella \n\n  2005 Crucifix Swastika \n\n  Tim Kinsella burst onto the Chicago scene while still in his teens with his scream punk band Cap'n Jazz. The collective snottiness and rage of this band can be heard on Analphabetapolothology, a compilation of the band's entire recorded history featuring two cherished covers, one of a-ha's &quot;Take on Me&quot; and the second of &quot;90210.&quot; The band broke up in 1994 when Kinsella was only 20 years old and had recently earned his degree in English literature. Two bands formed of the split, the pop-punk Promise Ring and Kinsella's art-noise-emo band Joan of Arc. Integral to JoA is Kinsella's cranky, scratched-up voice and tendency for absurd lyrics, perverse song changes, and punk experimental sensibilities. A Portable Model Of (1997) and How Memory Works (1998) framed his obscurity in the overwrought intensity of emo, a movement whose nickname was an instant turn-off and which Joan of Arc came to symbolize as part of Jade Tree Records.\n\n  The strangely titled Live in Chicago 1999 was produced by Casey Rice and emphasizes emphasizes growing dissatisfaction with the trappings of rock &amp; roll. The tape-spliced bits that made Joan of Arc's first two albums interesting rock records now became the predominant melodic device of the music. The album art used illustrations based on Jean-Luc Godard's Weekend and featured such infamous lines as &quot;We all know monogamy's just a function of capitalism.&quot;\n\n  The Gap saw Kinsella's once-loyal audience moving away from his increasingly obtuse song structures and live performances. Band members dropped out of the recording process, leaving Kinsella to create the songs as more or less his own studio project. Although Kinsella never formally announced the breakup of Joan of Arc, the band ceased to play just after the release of How Can Anything So Little Be Any More?\n\n  Kinsella began work on a solo EP for Troubleman Records and decided that this project would coincide with his name change from Kinsella to Kinsellas. The move was seen by the press as another verbal annoyance the artist began early in the Gap tour when he refused to give interviews. Instead, he would interview the journalist. The EP's title, He Sang His Didn't He Danced His Did, is lifted from e.e. cummings and features brutally out-of-tune acoustic ballads, a Jacques Brel cover, and four songs reworked from Live in Chicago 1999, and How Memory Works.\n\n  Kinsella has also lent his strange stylings and unique voice to other projects, including various interchanges of members of an insular scene of Chicago musicians to make up acts like Owls, Make Believe, Friend/Enemy and Everyoned. As a solo artist, Kinsella followed his Troubleman EP with 2005's Crucifix/Swastika and 2009's Field Recordings of Dreams. The 2010's brought the release of Kinsella's first novel, 2011's The Karaoke Singer's Guide to Self-Defense. In 2013, Tim Kinsella sings the songs of Marvin Tate by LeRoy Bach featuring Angel Olsen arrived, a highly conceptual album featuring Kinsella as the narrator of Tate's dark poems in song form.","torrent":{"xt":"urn:btih:ab76f41cf7625798ae37ef38ccbd130cf18d2044","amp;dn":"Tim+Kinsella+%2B+Cap%27n+Jazz+%2B+Joan+of+Arc+%2B+Owls+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab76f41cf7625798ae37ef38ccbd130cf18d2044","infoHashBuffer":{"type":"Buffer","data":[171,118,244,28,247,98,87,152,174,55,239,56,204,189,19,12,241,141,32,68]},"announce":[],"urlList":[]}}