{"title":"Patrick Moore The Autobiography By Patrick Moore","uid":9418412,"size":8669160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac2d7dbd93e1ce0941f3ad43379762711c6b8ab5&amp;dn=Patrick+Moore+The+Autobiography+By+Patrick+Moore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":5,"time":1388505446,"description":"Throughout his distinguished career, Patrick Moore has, without a doubt, done more to raise the profile of astronomy among the British public than any other figure in the scientific world. As the presenter of The Sky at Night on BBC television for nearly 50 years he was honored with an OBE in 1968 and a CBE in 1988. In 2001 he was knighted 'for services to the popularisation of science and to broadcasting'. The BBC first aired The Sky at Night in April 1957 and it is now in the record books as the world's longest running TV series with the same presenter. He is also the author of over 60 books on astronomy, all of which, including his autobiography have been written on his 1908 typewriter. Partly thanks to his larger-than-life personality, Sir Patrick's own fame extends far behond astronomical circles. A self-taught musician and talented composer, he has displayed his xylophone-playing skills at the Royal Variety Performance and as a passionate supporter of cricket, he has played for the Lord's Taverners charity cricket team.","torrent":{"xt":"urn:btih:ac2d7dbd93e1ce0941f3ad43379762711c6b8ab5","amp;dn":"Patrick+Moore+The+Autobiography+By+Patrick+Moore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac2d7dbd93e1ce0941f3ad43379762711c6b8ab5","infoHashBuffer":{"type":"Buffer","data":[172,45,125,189,147,225,206,9,65,243,173,67,55,151,98,113,28,107,138,181]},"announce":[],"urlList":[]}}