{"title":"Rewiring Genesis - A Tribute to the Lamb Lies Down On Broadway","uid":4498331,"size":694965091,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ada5b7b9426b71647e67228cda2bfd9f6076203a&amp;dn=Rewiring+Genesis+-+A+Tribute+to+the+Lamb+Lies+Down+On+Broadway&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fugazi42","files":36,"time":1226290712,"description":"================================================================================\n&gt;&gt; ALBUM INFO\n================================================================================\n\n   Artist: Rewiring Genesis (Nick D'Virgilio)\n    Album: A Tribute to the Lamb Lies Down on Broadway\n    Genre: Progressive Rock\n   Source: CD (Lossless)\n     Year: 2008\n   Ripper: dBpoweramp Release 13.1 &amp; TSSTcorp - DVD-ROM TS-H352C\n    Codec: Free Lossless Audio Codec (FLAC)\n  Version: reference libFLAC 1.2.1 20070917R\n  Quality: Lossless, 34% Compressed\n Channels: Stereo / 44100 HZ / 16 Bit\n     Tags: VorbisComment\n\n   Ripped: 11/07/2008\n   Posted: 11/08/2008\n\n Included: NFO, M3U, LOG, MD5, ARTWORK (300dpi)\n\n================================================================================\n&gt;&gt; TRACK LISTING\n================================================================================\n\nDisc 1 [48:11]\n\n  01 [5:24] The Lamb Lies Down on Broadway\n  02 [2:49] Fly on a Windshield\n  03 [2:21] Broadway Melody of 1974\n  04 [2:18] Cuckoo Cocoon\n  05 [8:35] In the Cage\n  06 [2:42] The Grand Parade of Lifeless Packaging\n  07 [5:50] Back in NYC\n  08 [2:10] Hairless Heart\n  09 [3:50] Counting Out Time\n  10 [6:22] The Carpet Crawlers\n  11 [5:45] The Chamber of 32 Doors\n\nDisc 2 [49:51]\n\n  01 [2:37] Lilywhite Lilith\n  02 [5:36] The Waiting Room\n  03 [3:08] Anyway\n  04 [2:31] Here Comes the Supernatural Anaesthetist\n  05 [7:13] The Lamia\n  06 [2:55] Silent Sorrow in Empty Boats\n  07 [8:40] The Colony of Slippermen (Arrival - A Visit to the Doktor - Raven)\n  08 [1:55] Ravine\n  09 [4:11] The Light Dies Down on Broadway\n  10 [3:58] Riding the Scree\n  11 [2:33] In the Rapids\n  12 [4:29] It\n\nTotal Time: 1 Hour 38 Minutes\n\n================================================================================\n&gt;&gt; ARTIST INFO\n================================================================================\n\nRewiring Genesis\n\nMark Hornsby is a engineer/producer who has a truly diverse background in the \nmusic business. As a studio owner, Mark co-owned Ridenour Studios, one of the \nlargest recording and rehearsal studios in South Florida, who's clients \nincluded New Found Glory, Foreigner, Ricky Martin, Joey Kramer, Steve Winwood, \nand Johnny Depp, just to name a few. As a sound designer, he has developed and \nconsulted on plug-in development for a variety of high-profile audio \ntechnology companies including IK Multimedia and Sonic Reality and writes a \nregular column for Recording Magazine on music production. He is a certified \nPro Tools Expert by Digidesign and as an engineer, he has won two awards for \nengineering in the a cappella field. Mark is currently based out of Java Jive \nStudio in Nashville, where he continues to work with a number of highly-\nsuccessful artists in the rock and contemporary christian genres.\n\nNick D'Virgilio is an American drummer and singer, also known as &quot;NDV&quot;. Perhaps \nbest known as a member of the progressive rock band Spock's Beard, D'Virgilio \ntook over lead vocals in 2002 and has since recorded three studio CDs: \n&quot;Feel Euphoria&quot;, &quot;Octane&quot;, and the self titled &quot;Spock's Beard&quot;. In addition, \nthey have released the live CD &quot;Gluttons For Punishment&quot; and the newly released \nlive DVD &quot;Spock's Beard Live&quot;. He was also one of two drummers chosen to \nreplace Phil Collins in Genesis on the &quot;Calling All Stations&quot; album. While \nliving outside of LA, he continues to do sessions and tours with many artists \nincluding Tears for Fears, Kevin Gilbert, Jonatha Brooke, Eric Burdon, Mike \nKeneally, and Fates Warning.\n\n================================================================================\n&gt;&gt; PRESS RELEASE\n================================================================================\n\nNICK D'VIRGILIO RELEASES GENESIS &quot;LAMB&quot; TRIBUTE ON PROGROCK RECORDS\n\nRancho Santa Margarita, CA - 25 August 2008 - Nashville-based recording \nengineer/producer and a Los Angeles-based performer have teamed up to create a \nunique twist on a classic Genesis album. This fall, Nick D'Virgilio of Spock's \nBeard fame and engineer/producer Mark Hornsby are re-recording the Genesis \nclassic: The Lamb Lies Down On Broadway, in it's entirety. Produced at Java \nJive Studio in Nashville, the album features some of Music City's best \nmusicians, taking the songs in a whole new direction.\n\n&quot;We wanted to see what would happen if we exposed the songs to a different \nclimate of musicians,&quot; says D'Virgilio, &quot;The early Genesis recordings are so \nmusical and very bluesy when you get right down to it. They really lend \nthemselves to some different interpretations. When it came time to figure out \nwhat label to work with, I remembered working with Shawn on the Amaran's \nPlight release and had been really pleased with how that all worked out and I \nknew what a big Genesis fan he is, so I'm glad it worked out.&quot;.\n\nAlthough all of the original elements of the songs are still included such as \ndrums, bass, guitar and piano, the recordings now take on a more &quot;theatrical&quot; \nvibe. This, coupled with orchestra, rock guitars, and some fantastic horn \narrangements, the songs now enter an entirely different place.\n\n&quot;We had talked about doing something like this for awhile,&quot; says Hornsby, \n&quot;With the recent attention our version of The Colony of Slippermen received, \nand the re-release of the original album in 5.1, the time seemed right to see \nwhat we could come up with. After the first conference call with Shawn, I felt \nreally comfortable about working with him, and we all managed to make it work \nand realize the fruition of our vision.&quot;\n\n&quot;Genesis is one of my all time favorite bands and I spent many hours reading \nthe lyrics and liner notes for The Lamb. Nick is one of my favorite drummers, \nand to combine these two elements in what is an amazing re-imaging of The Lamb \nis a fantastic thing to be part of.&quot;, said Shawn Gordon, President of ProgRock \nRecords.\n\n&quot;A Tribute to The Lamb Lies Down on Broadway&quot; is the ProgRock Records debut \nrelease from Rewiring Genesis and can be found at [link removed]. The album will \nbe released in late September 2008 and is available for immediate pre-sale. The \nCD is discounted $2 during the pre-sale period. It will be available at your \nfavorite brick and mortar retailer on October 21, 2008.","torrent":{"xt":"urn:btih:ada5b7b9426b71647e67228cda2bfd9f6076203a","amp;dn":"Rewiring+Genesis+-+A+Tribute+to+the+Lamb+Lies+Down+On+Broadway","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ada5b7b9426b71647e67228cda2bfd9f6076203a","infoHashBuffer":{"type":"Buffer","data":[173,165,183,185,66,107,113,100,126,103,34,140,218,43,253,159,96,118,32,58]},"announce":[],"urlList":[]}}