{"title":"[HardTied] Brooke Bliss (Anchored)","uid":15677100,"size":1864575916,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:adad2a63c845091e32256ec4a89903728852f7f5&amp;dn=%5BHardTied%5D+Brooke+Bliss+%28Anchored%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1472280001,"description":"[HardTied] Brooke Bliss (Anchored)\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-57c119b2e7c9f.html\r\n \nhttp://imgsnaps.com/img2-57c119b2f2ac9.html\r\n\r\n\r\nToday is Brooke Bliss's first time modeling. She tells us she's seen some bondage porn and it looked interesting, that she liked the idea of not having any control over what was being done to her body. That's all O.T. needed to hear. He ties her neck and wrists in with massive ropes and sets to work giving Brooke a tour of the industry.\r\n\r\nBrooke's first mistake was not following the age old saying &quot;dress for the job you want.&quot; In other words, she's still wearing clothing. O.T. quickly cuts of the tight sexy dress she wore for us and pulls down her panties. Then he takes the flogger and starts beating her bare ass and pussy until they're nice and red. Up next is the cattle prod, the greatest fear of any girl who has set foot in our dungeons. You can tell Brooke has never had the pleasure of feeling one before, because if she knew what she was in for she would have started screaming and trying to get away as soon as she saw it. After a few shocks though, she's learned to respect its power. She'll know better next time.\r\n\r\nAfter that Brooke is introduced to the cane, so O.T. moves her onto her back with her legs spread open and the bottoms of her feet exposed. He decides to give her a little bit of control, so whenever she is in too much pain from him caning one of her feet, she is allowed to beg him to move on to the other. As soon as she is used to that he gives her an even worse decision to make, her left foot or her wet snatch. She never thought she would ask someone to hurt her poor pussy like that, but when the pain is too much to bear on the soles of her feet she has no choice but to beg him to cane her cunt. Once her pussy is nice and tender, O.T. sticks a metal hook in it and grabs a hitachi and starts getting sounds out of Brooke she didn't even know she could make. Now that she has had the tour, we're sure we'll see Brooke again soon","torrent":{"xt":"urn:btih:adad2a63c845091e32256ec4a89903728852f7f5","amp;dn":"%5BHardTied%5D+Brooke+Bliss+%28Anchored%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adad2a63c845091e32256ec4a89903728852f7f5","infoHashBuffer":{"type":"Buffer","data":[173,173,42,99,200,69,9,30,50,37,110,196,168,153,3,114,136,82,247,245]},"announce":[],"urlList":[]}}