{"title":"Graham Greene: A Life in Letters [Richard Greene, ed.] (2007)","uid":9416598,"size":3988508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af130975f2a6d5905895c5032525042edaaab527&amp;dn=Graham+Greene%3A+A+Life+in+Letters+%5BRichard+Greene%2C+ed.%5D+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1388460492,"description":"\nGraham Greene: A Life in Letters (Knopf, 2007).  Edited by Richard Greene.\n\nISBN: 9780393066425 | 480 pages | EPUB\n\n\nOne of the undisputed masters of twentieth-century English prose, GRAHAM GREENE (1904-1991) wrote tens of thousands of personal letters.  This exemplary volume presents a new and engrossing account of his life constructed out of his own words.  \n\nImpeccably edited by scholar Richard Greene (no relation), the letters -- including many unavailable even to his official biographer -- give a new perspective on a life that combined literary achievement, political action, espionage, travel, and romantic entanglement.  The letters describe his travels in such places as Mexico, Vietnam, and Cuba, where he observed the struggles of mankind with a compassionate and truthful eye.  Letters to friends such as Evelyn Waugh and Muriel Spark offer a glimpse into the literary culture in which he wrote, while others reveal the agonies of his heart.  The sheer range of experience contained in Greene's correspondence defies comparison.\n\n\nReviews\n\n&quot;The Best Book of the Year.&quot; -- David Lodge, The Guardian\n\n&quot;The chief audience for all compilations of correspondence is the cognoscenti of the field in which the letter writer existed, in this case, of course, the literary scene.  Because of his stature, and his wide range of interests and experiences,Â to say nothing of his pure writing style, Greene's epistles are an excellent way for the appreciators of his fiction and travel writing to gain additional familiarity with his life, talents, and ways of thinking.&quot; -- Brad Hooper, Booklist\n","torrent":{"xt":"urn:btih:af130975f2a6d5905895c5032525042edaaab527","amp;dn":"Graham+Greene%3A+A+Life+in+Letters+%5BRichard+Greene%2C+ed.%5D+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af130975f2a6d5905895c5032525042edaaab527","infoHashBuffer":{"type":"Buffer","data":[175,19,9,117,242,166,213,144,88,149,197,3,37,37,4,46,218,170,181,39]},"announce":[],"urlList":[]}}