{"title":"Beastie Boys - Hot Sauce Committee, Part 2  2011","uid":6534039,"size":314553311,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af57f28e476341425c28d802119a245019fe41ce&amp;dn=Beastie+Boys+-+Hot+Sauce+Committee%2C+Part+2++2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1310454931,"description":"Beastie Boys are an American hip hop trio from New York City. The group consists of Mike D (Michael Diamond), MCA (Adam Yauch), and Ad-Rock (Adam Horovitz).\n\nThe Beastie Boys began as hardcore punk band in 1979, first appearing on the compilation cassette New York Thrash before releasing their first EP, Polly Wog Stew, in 1982. After achieving moderate local success with the 1983 release of their experimental hip-hop 12 Cooky Puss, they made the transition to hip-hop in 1984 and a string of successful 12 singles followed by their debut album Licensed to Ill in 1986 which received international critical acclaim and commercial success. As of 2010, they have sold 22 million albums in the United States and 40 million albums worldwide.\n\nThey are one of the longest lived hip-hop acts worldwide and continue to enjoy commercial and critical success in 2011, nearly 25 years after the release of their debut album. On September 27, 2007, they were nominated for induction into the Rock and Roll Hall of Fame. In 2009, the group released digitally remastered deluxe editions of their albums Paul's Boutique, Check Your Head, Ill Communication and Hello Nasty. Their eighth studio album, Hot Sauce Committee Part Two, was released on May 3, 2011, and received positive reviews.\n\n- - -\n\nThe album was originally planned for release on September 15, 2009 under the title Hot Sauce Committee, Part.1, as the first installment of a two part set. However, the album was delayed after band member Adam MCA Yauch was diagnosed with cancer. After a two year delay, only one album has been released and it is not clear if the plan for a two part album has been abandoned.  (wikipedia)\n\n- - -\n\nBeastie Boys - Hot Sauce Committee Part Two 2011\n(Hollywood, Calif. Capitol Records)\n\n 1. Make Some Noise\n 2. Nonstop Disco Powerpack\n 3. OK\n 4. Too Many Rappers [new reactionaries version] (featuring NAS)\n 5. Say It\n 6. The Bill Harper Collection\n 7. Don't Play No Game That I Can't Win (featuring Santigold)\n 8. Long Burn The Fire\n 9. Funky Donkey\n10. The Larry Routine\n11. Tadlock's Glasses\n12. Lee Majors Come Again\n13. Multilateral Nuclear Disarmament\n14. Here's A Little Something For Ya\n15. Crazy Ass Shit\n16. The Lisa Lisa / Full Force Routine\n","torrent":{"xt":"urn:btih:af57f28e476341425c28d802119a245019fe41ce","amp;dn":"Beastie+Boys+-+Hot+Sauce+Committee%2C+Part+2++2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af57f28e476341425c28d802119a245019fe41ce","infoHashBuffer":{"type":"Buffer","data":[175,87,242,142,71,99,65,66,92,40,216,2,17,154,36,80,25,254,65,206]},"announce":[],"urlList":[]}}