{"title":"Creative Puzzles of the World (gnv64)","uid":14239885,"size":102622452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afa328f32bcbed149ddae08be4b3e02875983bd0&amp;dn=Creative+Puzzles+of+the+World+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"gnv65","files":6,"time":1460134248,"description":"Creative Puzzles of the World\r\nBy by Pieter van Delft and Jack Botermans\r\nHarry N. Abrams | 1978 | ISBN-10: 0810907658 | DJVU/PDF | 200 pages | 16.2/21.7 mb\r\n\r\nThis useful and entertaining book marks a first in the wide world of puzzles. Within this lavishly illustrated volume are hundreds of puzzles that the entire family can enjoy. All of them are presented in a pictorial-text relationship that makes them easy-to-grasp and yet challenging. Do-it-yourselfers will value the how-to-make sections accompanying those puzzles that are hard to find in stores. This treasury of some of the world's oldest and most mysterious puzzles is a must for every home library.\r\n\r\nCONTENTS\r\nIntroduction 9\r\nGeometrical Problems 11\r\nMoving-Piece Puzzles 11\r\nIn these puzzles flat pieces are assem-bled into specific shapes, both fanciful and geometric.\r\nTangram 12, Circular Tangram 17, Pythagoras 18, The Circle Puzzle 20, The Broken Heart 22, The Magic Egg 23, The Cross Breaker 24, The Nine Puzzle 27.\r\n\r\nDissection Puzzles 28\r\nCut up one shape and reassemble the pieces to make another in these puzzles.\r\nThe Patchwork Quilt 28, Greek Cross into Square 29, Five Problems 29, Greek Cross into Square 29, Star into Square 29, Greek Cross into Square 29, Hexa-gram into Hexagon 29, Decagon into Square 30, Greek Cross into Pentagon 30, Pentagon into Square\r\n30, Greek Cross into Hexagram 30, Triangle into Hexagram 30, Greek Cross into Hexagon 30, Latin Cross into Triangle 31, Square into Latin Cross 31, Latin Cross into Hexagon 31, Hexagon into Octagon\r\n31, Three More Squares 31, Hexagon into Pentagon 31, The Supernova 32, Octagram into Octagon 33, Hexagram into Triangle 33, Dodecagram into Latin Cross 33, Hexagram into Dodecagram 33, Decagram into Decagram 33, Dodecagram into Dodecagon 33, Self-Destruction of a Snake 34, A Change of Suit 34, The Broken Horseshoe 34, The Cross and Crescent 34, One Table from Two Stools 34, Merging the Hexagons 34, Getting Things Square 34, Dis-appearance Puzzles 35, Letter Dissections 36.\r\n\r\nPolyforms 40\r\nPieces made up from identical units joined together are used in the poly-form puzzles.\r\nPentominoes 41, Solid Pentominoes 44, The Soma Cube 46, The Balancing Soma Cube 48.\r\n\r\nMatchstick Puzzles 49\r\nMatchstick puzzles have long been a favorite pastime when friends get to-gether. The puzzler is challenged to change one matchstick pattern into an-other in a specific number of moves. Matchstick puzzles can be simple or complicated, and they can while away a minute or a half-hour. Here are over 50 new and unusual examples of these tantalizers. Also included are two elaborate matchstick structures that can be built. You can try these puzzles immediately — no equipment except an ordinary box of matches is necessary.\r\n\r\nNOTE - I have included 2 PDF versions here. One is dowmloaded from the net as it is. The second smaller version is converted by me from DJVU and OCRed.\r\n \nhttp://s23.postimg.org/cyumrhwzv/Creative_Puzzles_of_the_World.jpg","torrent":{"xt":"urn:btih:afa328f32bcbed149ddae08be4b3e02875983bd0","amp;dn":"Creative+Puzzles+of+the+World+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa328f32bcbed149ddae08be4b3e02875983bd0","infoHashBuffer":{"type":"Buffer","data":[175,163,40,243,43,203,237,20,157,218,224,139,228,179,224,40,117,152,59,208]},"announce":[],"urlList":[]}}