{"title":"My Mobile - July 2016 (gnv64)","uid":15238038,"size":19870596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b21aa06957b5a685329e34403e9f77d10efc1733&amp;dn=My+Mobile+-+July+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":4,"time":1467909647,"description":"My Mobile - July 2016\r\nEnglish | 150 Pages | True PDF | 18.9 mb\r\n\r\nStyle Notes\r\n14 LETTERS\r\n16 NEWS\r\n20 MOBILE DOCTOR\r\n22 RUMOR MILL\r\n123 MY GUIDE\r\n\r\n24 JUST IN We take a closer look at the Sony Xperia X, Xiaomi Mi Max, Lenovo Vibe K5 and HTC 10.\r\n32 LEAD STORY Smartphones are getting more powerful than ever before but are they good enough to replace the traditional gaming consoles? We try to find an answer to this question.\r\nSPOTLIGHT\r\n44 Net Neutrality is back in the news again. We take a closer look at what the issue is about this time.\r\n68 What is the Digital India initiative and why is it so important for the country? We understand the goals and challenges of the initiative.\r\n96 Gadgets from abroad: We look at some amazing gadgets you can buy when travelling abroad\r\n110 Does Tim Cook's India visit herald a new era in the Apple- India equation? We try to understand.\r\n47 CELL SPEAK What those who matter in the world of tech are saying.\r\n48 CHIEF SPEAK Rahul Sharma, Founder, Yu Televentures speaks to us about the company’s future plans and its latest smartphone, the YU Yunicorn.\r\n51 JARGON BUSTER Everything you need to know about 4K Display. In simple English.\r\nINFOCUS\r\n52 It is hot, but is it ready to go mainstream? We take a closer look at virtual reality.\r\n104 The battery blockbusters: we list out phones that are experts when it comes to battery life.\r\n55 TIPS AND TRICKS How to transfer apps from your native internal storage to external microSD card storage\r\nFACE TO FACE\r\n56 Kuldeep Malik, Country Head – Corporate Sales, international, MediaTek india talks about company’s latest processor, future plans and more\r\n64 amit Gujral, Marketing Head- Mobiles, lG india sheds some light on the company’s future plans and strategies\r\nEVENTS\r\n58 Electronic Entertainment Expo 2016: We look at key announcements made during the world’s biggest annual gaming conference.\r\n66 WWDC 2016: Key announcements made during apple’s annual developer conference.\r\nVERSUS\r\n62 The Battle for Best Budget smartphone features Xiaomi redmi Note 3 and YU Yunicorn\r\n102 Clash of the 6GB raM Titans featuring Oneplus 3 and leEco le Max 2\r\n\r\nBurn Tests\r\n71 ITEL SELFIE PRO\r\n72 PANASONIC ELUGA A2\r\n73 VIDEOCON KRYPTON 3\r\n74 HTC ONE X9\r\n76 ASUS ZENFONE MAX\r\n78 SAMSUNG GALAXY J7 (2016)\r\n80 YU YUNICORN\r\n82 LG G5\r\n84 COOLPAD MAX\r\n86 HONOR 5C\r\n88 GIONEE MARATHON M5 PLUS\r\n90 NEXTBIT ROBIN\r\n92 LEECO LE MAX 2\r\n\r\nSNAPSHOT\r\n94 Huawei p9: a quick look at the phone with leica inside\r\n108 leEco le 2: The successor to the popular le 1S is here\r\n98 PERSONALITY Ten things you might not know about Oneplus’ founder pete lau\r\nSPECIAL\r\n100 Oneplus 3: Everything you need to know about one of the most talked about devices in the market\r\n112 BOREDOM BUSTERS Do some intense parkour stunts in Vector 2, make your cat a superhero in Super phantom Cat, be a part of intense rpG battle in Nonstop Knight and more …\r\n117 SMART APPS Search news and bundle through Bundle News, create better live photos through Google’s Motion Stills, a new flavour of Twitter for android and more…\r\n143 ETCETERA iBall CompBook Excelance, Wacom Bamboo Spark, SanDisk iXpand, Xiaomi Mi in-Ear Head phones pro and more…\r\n150 VANTAGE POINT Sky li, Vp of OppO, MD of international Mobile Business and president of OppO india, on the evolution of the phone’s camera\r\n \nhttps://s31.postimg.org/cnqnc0tob/My_Mobile_July_2016.jpg","torrent":{"xt":"urn:btih:b21aa06957b5a685329e34403e9f77d10efc1733","amp;dn":"My+Mobile+-+July+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b21aa06957b5a685329e34403e9f77d10efc1733","infoHashBuffer":{"type":"Buffer","data":[178,26,160,105,87,181,166,133,50,158,52,64,62,159,119,209,14,252,23,51]},"announce":[],"urlList":[]}}