{"title":"Invasive Cardiology","uid":10165675,"size":8922011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2cc2f0372a619c026ab92e27f798fc7542e3c1f&amp;dn=Invasive+Cardiology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sapphyreopal5","files":1,"time":1400342334,"description":"Uploader's Comments: I found this book originally on some file sharing website I do not recall the name of right now. I had to go through a lot of trouble to actually obtain this particular PDF (wouldn't want my worst enemies to go through the same hassle). It is a pretty high quality PDF as far as readability of the text and such goes, so it was worth the time in order to save money for me ha ha. If you do not like this PDF, you are more than welcome to go buy this book online. Otherwise, please enjoy!\n\nBOOK DESCRIPTION (Amazon)\nInvasive Cardiology: A Manual for Cath Lab Personnel, Third Edition was recently honored with 4 Stars from Doody's Book Review! Completely revised and updated, the Third Edition of Invasive Cardiology: A Manual for Cath Lab Personnel, is written specifically for nurses, technologists, and allied health personnel working in the catheterization laboratory. Topics cover all aspects of the catheterization laboratory including cardiovascular anatomy, radiography, angiography, technical duties of the staff, right and left heart catheterization, PCI, invasive ultrasound, valvuloplasty, hemostasis, pediatric interventions, pharmacology, emergency procedures, and many others.\n\nTitle: Invasive Cardiology: A Manual for Cath Lab Personnel\nAuthor: Sandy Watson, Kenneth A. Gorski\nEdition: 3\nPages: 646 (total of 663 in PDF)\nPublisher: Jones &amp; Bartlett Learning\nPublication Date: May 6, 2010\nISBN-10: 076376468X\nISBN-13: 978-0763764685","torrent":{"xt":"urn:btih:b2cc2f0372a619c026ab92e27f798fc7542e3c1f","amp;dn":"Invasive+Cardiology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2cc2f0372a619c026ab92e27f798fc7542e3c1f","infoHashBuffer":{"type":"Buffer","data":[178,204,47,3,114,166,25,192,38,171,146,226,127,121,143,199,84,46,60,31]},"announce":[],"urlList":[]}}