{"title":"Headhunter Redemption [Ntsc], Ps2","uid":5598622,"size":2221007854,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b333b5a254cb10144a0c417c589ec6026333e7dc&amp;dn=Headhunter+Redemption+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1275165172,"description":"Headhunter Redemption for the Ps2                                  Rel. 09/21/2004\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. \n\nFree Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nIn the 21st century, a dreadful virus wiped out millions. The vaccine was found, but at the time the world was engulfed into chaos. A new world order emerged, splitting the world into two distinct yet dependent worlds: Above and Below.\n\nThe world Above reflects a chrome city, a high-rise, high-tech metropolis served by elevators and elevated freeways. A place for hard workers and law-abiding people. On the contrary to Above, the world Below, which is the product of earthquake damages, is a subterranean network of labor colonies. Those who are not wanted Above for one reason or another are sent Below.\n\nOne day, now veteran Headhunter, Jack Wade, took a call to investigate an intrusion to the upper levels. Facing the trespasser, Jack saw a potential in the girl and instead of turning her in, he gave her a second chance... to become his apprentice. Jack is back, but this time, he's not alone but accompanied by his sidekick Leeza X. Together, they will face whatever threat lurks from the world \nBelow.\n\nThe gameplay is set in 3rd-person view with ability to rotate camera or set it behind your back at the single click. Headhunter's main accessory is IRIS (Intelligent Real-Time Information Scanner). Once you get the IRIS, you'll be able to scan every item just by pointing the gun at it, or use the scanner in 1st-person view which will let you examine the surroundings in more detail. Also, IRIS will provide you with a full 3D map info even displaying the enemies so you can avoid them or use stealth if necessary. Enemies will hear you running and shooting, so if you decide to take an action, be aware that they will surround you and launch a team strike at you from all the sides. You only effective aid against them, beside your weapon, of course, is the ability to perform a roll or lean against the walls and fire from the corners, although aiming itself may not be easy as your hand will not be steady while on the move or panicking.\n\n\nFeatures:\n\n* 2 separate playable characters: Jack Wade &amp; Leeza X. \n\n* High quality storyline splits the modern world into &quot;Above&quot; and &quot;Below&quot; making\n  for unique mission structures and objectives \n\n* Shoot, Crouch, Walk, Roll, Hang, Climb, Sneak, Push, Pull, and Run to navigate\n  the environment \n\n* Orchestral score, created by industry award winning composer Richard Jacques. \n\n* Multiple Weapon Modes, e.g. one knee on ground improves accuracy, 180 degree \n  targeting while flat against a wall, First Person View for pinpoint fire and   \n  double handed fire. \n\n* Break codes, download files and maps, hack security systems, transfer data and \n  communicate using your computing device - IRIS \n\n* Thermal and Night Vision Goggles enable routing the darkest of areas. \n\n* Lightning-fast motorcycle thrills on futuristic highways. \n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:b333b5a254cb10144a0c417c589ec6026333e7dc","amp;dn":"Headhunter+Redemption+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b333b5a254cb10144a0c417c589ec6026333e7dc","infoHashBuffer":{"type":"Buffer","data":[179,51,181,162,84,203,16,20,74,12,65,124,88,158,198,2,99,51,231,220]},"announce":[],"urlList":[]}}