{"title":"Beastie Boys - Ill Communication [24 bit FLAC] vinyl","uid":8229293,"size":1304341221,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b371cffe20917e88e86b8fdcad4725804a8deb18&amp;dn=Beastie+Boys+-+Ill+Communication+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"24.96","files":-1,"time":1362686767,"description":"  Beastie Boys - Ill Communication (1994) [24 bit FLAC] vinyl\n\n  Released: 1994\n  Genre: Rap\n  Style: Alternative Rap\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Sure Shot [3:19] Written-By - DJ Hurricane\n  A2. Tough Guy [1:03] Drums - Amery Smith, Written-By - Smith\n  A3. B-Boys Makin' With The Freak Freak [3:31]\n  A4. Bobo On The Corner [1:14]\n  A5. Root Down [3:32]\n\n  B1. Sabotage [2:58]\n  B2. Get It Together [4:05] Featuring - Q-Tip, Written-By - J. Davis\n  B3. Sabrosa [3:30]\n  B4. The Update [3:16]\n  B5. Futterman's Rule [3:42]\n\n  C1. Alright Hear This [3:07]\n  C2. Eugene's Lament [2:12] Violin - Eugene Gore, Written-By - Gore\n  C3. Flute Loop [1:55]\n  C4. Do It [3:16] Rap [Featuring] - Biz Markie, Written-By - Hall\n  C5. Ricky's Theme [3:45]\n\n  D1. Heart Attack Man [2:15] Drums - Amery Smith, Written-By - Smith\n  D2. The Scoop [3:37]\n  D3. Shambala [3:40]\n  D4. Bodhisattva Vow [3:08]\n  D5. Transitions [2:31]\n\n  Ill Communication follows the blueprint of Check Your Head, accentuating it at some points, deepening it in others, but never expanding it beyond the boundaries of that record. As such, it's the first Beastie Boys album not to delve into new territory, but it's not fair to say that it finds the band coasting, since much of the album finds the group turning in muscular, vigorous music that fills out the black-and-white sketches that comprised Check Your Head. Much of the credit has to go to the group's renewed confidence in -- or at least renewed emphasis on -- their rhyming; there are still instrumentals (arguably, there are too many instrumentals), but the Beasties do push their words to the forefront, even on dense rockers like the album's signature tune, &quot;Sabotage.&quot; But even those rhymes illustrate that the group is in the process of a great settling, relying more on old-school-styled rhyme schemes and word battles than the narratives and surreal fantasies that marked the high points on their first two albums. With this record, the Beasties confirm that there is indeed a signature Beastie Boys aesthetic (it's too far-ranging and restless to be pegged as a signature sound), with the group sticking to a blend of old school rap, pop culture, lo-fi funk, soulful jazz instrumentals, Latin rhythms, and punk, often seamlessly integrated into a rolling, pan-cultural, multi-cultural groove. The best moments of Ill Communication rank with the best music the Beasties have ever made, as well as the best pop music of the '90s, but unfortunately, it's uneven and rather front-loaded. The first half overflows with brilliant, imaginative variations on their aesthetic: the assured groove of &quot;Sure Shot,&quot; the warped rap of &quot;B-Boys Makin' With the Freak Freak,&quot; the relentless dirty funk of &quot;Root Down,&quot; the monumental &quot;Sabotage,&quot; and the sly &quot;Get It Together,&quot; highlighted by a cameo from Q-Tip of A Tribe Called Quest. After that, the album seems to lose its sense of direction and momentum, even if individual moments are very good. Any record that can claim jams as funky and inventive as &quot;Flute Loop&quot; and &quot;Do It,&quot; or instrumentals as breezy as &quot;Ricky's Theme,&quot; is certainly better than its competition, but there are just enough moments that rank as obvious filler to slow its flow, and to keep it from standing proudly next to Check Your Head as a wholly successful record. Even if it is a little uneven, it still boasts more than its fair share of splendid, transcendent music, and it really only pales in comparison to the Beasties' trio of classic records. By any other measure, this is a near-masterpiece, and it is surely a highlight of '90s alternative pop/rock.","torrent":{"xt":"urn:btih:b371cffe20917e88e86b8fdcad4725804a8deb18","amp;dn":"Beastie+Boys+-+Ill+Communication+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b371cffe20917e88e86b8fdcad4725804a8deb18","infoHashBuffer":{"type":"Buffer","data":[179,113,207,254,32,145,126,136,232,107,143,220,173,71,37,128,74,141,235,24]},"announce":[],"urlList":[]}}