{"title":"The Case Against Christianity","uid":8493727,"size":10707438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3782ec09d0d0d1d669930de09baec1d09372e07&amp;dn=The+Case+Against+Christianity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kundalini666","files":1,"time":1369075693,"description":"The Case Against Christianity by Michael Martin- pdf.\n\n&quot;It is a wonder that nobody has done a book like Â·this before as well as this book\nis done. It is a thorough, logical examination of the major tenants of\nChristianity by a professional philosopher (not a theologian). Martin brings his\ncool, logical mind to each of the major doctrines of Christianity .... What\nresults is the best book for the intelligent reader that examines the case for and\nagainst Christianity .... The book is must reading for all who discuss (or\ndefend) Christianity from a critical point of view.&quot; -American Rationalist\n\n&quot;Martin offers an insightful and provocative rational analysis of the major doctrinal claims of Christianity . .. . Because of its clarity and general scholarship, as well as the position it presents, this book belongs in all libraries with holdings in religious studies and philosophy of religion.&quot; - Choice\n\n&quot;His book is nothing less than astoundingly insightful and carefully reasoned.\nEvery page is strewn with gems worth examining with infinite patience .. . .\nEvery serious student of Christian doctrine would do well to spend time on\nMartin's insightful chapters.&quot; - Free Inquiry\n\n&quot;This book is a joy to read. It brings together not only Martin's thoughts about\nChristianity, but important views, pro and con, from important writers in the\nfield from Russell to Aquinas, Kaufmann to Augustine, Robertson to\nKierkegaard .... &quot;- Peter A. Angeles, Santa Barbara City College\n\n&quot;Martin is one of the very few first-rate philosophers who have had the fortitude\nand patience to carefully read much of the truly staggering amount of nonphilosophical literature on Christian topics.&quot;\n-Peter H. Hare, SUNY -Buffalo\n\nMichael Martin, professor of philosophy at Boston University, is the author of .\ntwo other Temple University Press books, The Legal Philosophy of H .L.A. Hart\nand Atheism: A Philosophical justification.","torrent":{"xt":"urn:btih:b3782ec09d0d0d1d669930de09baec1d09372e07","amp;dn":"The+Case+Against+Christianity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3782ec09d0d0d1d669930de09baec1d09372e07","infoHashBuffer":{"type":"Buffer","data":[179,120,46,192,157,13,13,29,102,153,48,222,9,186,236,29,9,55,46,7]},"announce":[],"urlList":[]}}