{"title":"El.reino.de.la.seduccion.(ebook).","uid":6172562,"size":6367949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3c26cea1377fe37e408d56c35d5d76a456b288e&amp;dn=El.reino.de.la.seduccion.%28ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zurera","files":-1,"time":1297640800,"description":"Dentro de los fastuosos muros y exquisitos encajes de piedra del palacio real persa del siglo XIV, residen las 365 mujeres que componen el harÃƒÂ©n del Shah, mujeres que dedican la vida a un rÃƒÂ­gido protocolo destinado a complacer a ÃƒÂ©ste. Junto al harÃƒÂ©n, en un discreto lugar, los eunucos del palacio conspiran a fin de satisfacer sus malÃƒÂ©volos intereses.\n\nA travÃƒÂ©s de estos arcaicos velos de sensualidad, corrupciÃƒÂ³n y traiciÃƒÂ³n, tres generaciones de mujeres conectadas por lazos de sangre, con destacadas cualidades para el arte de la seducciÃƒÂ³n. DoblegarÃƒÂ¡n las pasiones y prejuicios del Shah y de las reinas, para cumplir su objetivo secreto de controlar un imperio.\n\n\n\nEn el exterior de la opulencia del palacio del Shah reina la extrema pobreza del Barrio JudÃƒÂ­o, donde para encontrar comida muchos rebuscan en la basura y las mujeres son meras propiedades de los maridos, y a las que se compra y vende como cualquier otra mercancÃƒÂ­a. Oculta en esa miserable juderÃƒÂ­a de la antigua Persia, la joven Rebeca es vendida como esposa a un brutal herrero que hace del maltrato el centro de su relaciÃƒÂ³n. Este simple hecho es el punto de partida de un apasionante relato que incluye misterio, poder y maquinaciones que configuran las vidas de Rebeca, su hija Polvo de Oro y la hija de ÃƒÂ©sta, Cuervo, tres mujeres conectadas por los lazos de la sangre que poseen, cada una a su manera, destacadas cualidades para el arte de la seducciÃƒÂ³n.\n\nEl reino de la seducciÃƒÂ³n, la primera y aclamada novela de Dora Levy Mossanen, combina historia y fantasÃƒÂ­a para crear un palpitante y exÃƒÂ³tico relato en el que se entretejen los inquebrantables lazos que unen madres e hijas con importantes acontecimientos histÃƒÂ³ricos y lujuriosas imÃƒÂ¡genes de desinhibida sensualidad. Rebeca, Polvo de Oro y Cuervo manipulan los deseos de la carne para facilitarse el trÃƒÂ¡nsito y el control de un mundo donde prosperan los secretos y la traiciÃƒÂ³n. Sus trayectorias las llevarÃƒÂ¡n por los callejones del Barrio JudÃƒÂ­o, a presenciar batallas con los ejÃƒÂ©rcitos mongoles y a valerse de privadas citas para encender el deseo del Shah. Cada una de ellas procurarÃƒÂ¡ culminar los propÃƒÂ³sitos de su madre, Ã‚Â¿LograrÃƒÂ¡n liberarse de las ataduras del pasado y hacerse con el control de un mundo fundado en el poder, el sexo y la conspiraciÃƒÂ³n?","torrent":{"xt":"urn:btih:b3c26cea1377fe37e408d56c35d5d76a456b288e","amp;dn":"El.reino.de.la.seduccion.%28ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c26cea1377fe37e408d56c35d5d76a456b288e","infoHashBuffer":{"type":"Buffer","data":[179,194,108,234,19,119,254,55,228,8,213,108,53,213,215,106,69,107,40,142]},"announce":[],"urlList":[]}}