{"title":"Red Cocaine: The Drugging of America and the West [blackatk]","uid":8650415,"size":1560005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3dbdfcc798d6d05a0f23121afd85e4133bb75c2&amp;dn=Red+Cocaine%3A+The+Drugging+of+America+and+the+West+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1373081645,"description":"Red Cocaine: The Drugging of America and the West \n\n\n\nAbout the Author\nDr Joseph Douglass is a national security analyst and author with expertise in defence policy, threat assessment, deception, intelligence and political warfare, nuclear strategy, terrorism, advanced chemical and biological warfare agents and applications, and international narcotics trafficking. Since the mid-1980s, his primary focus has been research into various dimensions of cultural warfare and notably into the illegal drugs plague, with emphasis on its origins, support structures, marketing - and the question: 'What can be done?' Dr Douglass received his PhD in electrical engineering from Cornell University in 1962 and has taught at Cornell, the Navy Postgraduate School at Monterey, and Johns Hopkins School of Advanced International Relations in Washington, D.C.. He has worked in and for the national laboratories (Sandia Corporation], the US Government, where he was Deputy and Acting Director, Tactical Technology Office, Advanced Research Projects Agency - and with various defence contractors, such as the Institute for Defense Analyses and System Planning Corporation. He is a former member of the Weapons Systems Evaluation Group, US Army Science Board, and a former consultant to the Arms Control and Disarmament Agency and Senate Foreign Relations Committee. He currently directs The Redwood Institute, which was formed to address the internal problems America faces - such as illegal drugs, crime and impoverished education - and to identify root causes, evaluate national policy and devise alternative policy options.\n\nThe Author is a pioneering analyst and is perhaps best known for his ground-breaking studies of nuclear weapons policy, the impact of precision-guided munitions, the nature of the Soviet nuclear threat, the risks arising from chemical and biological warfare agents, and intelligence aspects of international narcotics trafficking. His unclassified books include The Theater Nuclear Offensive [1976, reprinted ten times]; Soviet Strategy for War in Europe [Pergamon Press, 1980, also translated into and published in German]; Soviet Strategy for Nuclear War [Hoover Institute Press, 1979: numerous printings, translated into and published in Japanese]; CBW: The Poor man's Atomic Bomb [Institute for Foreign Policy Analysis, 1984]; Why the Soviet Union Violates Arms Control Treaties [Pergamon-Brassey's, 1988]; Conventional War and Escalation [The National Strategy Information Center, 1981]; The Superpowers and Strategic War Termination [co-editor, Pergamon-Brassey's, 1989]; and the present work, originally entitled: Red Cocaine: The Drugging of America [1990]. This new edition has been prepared with a view to meeting continuing demand for the work, in both the United States and elsewhere, following the strategic adjustment completed in 1991 when the Communist strategists switched to pursuing their manic World Revolutionary objectives through covert Communism and a 'new form' of reversible 'state-controlled capitalism' - working, as Lenin taught his 'illuminated' followers, 'by other means'. \n\n &lt;a href=&quot;\nhttp://www.amazon.com/Red-Cocaine-Drugging-America-West/dp/1899798048/ref=cm_cr_pr_product_top&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Red-Cocaine-Drugging-America-West/dp/1899798048/ref=cm_cr_pr_product_top&lt;/a&gt;\n\n\n\nTags: perestroika, cold war, russia, russian, soviet, soviet union, ussr, commie, communism, narcostate, narcotic, opium, kgb, cia, putin, gorbachev, colombia, south america, mexico, drug, cartel, drugs, insurgency, uw, 4gw, 3gw, dc, politics, power","torrent":{"xt":"urn:btih:b3dbdfcc798d6d05a0f23121afd85e4133bb75c2","amp;dn":"Red+Cocaine%3A+The+Drugging+of+America+and+the+West+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3dbdfcc798d6d05a0f23121afd85e4133bb75c2","infoHashBuffer":{"type":"Buffer","data":[179,219,223,204,121,141,109,5,160,242,49,33,175,216,94,65,51,187,117,194]},"announce":[],"urlList":[]}}