{"title":"The Billy Bob Tapes- A Cave Full of Ghosts by Billy Bob Thornton","uid":10971288,"size":39073804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3e620c18ec9a56e0c08d07f4897aeed1712b6c5&amp;dn=The+Billy+Bob+Tapes-+A+Cave+Full+of+Ghosts+by+Billy+Bob+Thornton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1409795649,"description":"Raised in small-town Arkansas, Billy Bob Thornton grew up amid a rich storytelling tradition. &quot;See, the South is just different than other places. . . . You can feel the ghosts there.&quot; As a kid, he would sit on the porch listening to his family or some old man down the road spinning yarns about colorful neighbors. &quot;These stories didn't have to be made up. The characters were already there, so the stories just came out of the characters we knew.&quot; Thus was borne his Oscar(R)-winning masterpiece &quot;Sling Blade&quot; and now &quot;The Billy Bob Tapes&quot;--a narrative based on late-night conversations with Kinky Friedman and other friends who gathered 'round to hear Billy mine a cave full of ghosts.\n\nBilly grew up shooting squirrels, playing drums in VFW clubs, and dreaming of rock 'n' roll stardom or pitching for the St. Louis Cardinals. Then at sixteen he took a drama class to meet chicks--and met Mrs. Treadway, who noticed the young man's talent and encouraged him as an actor and writer. &quot;You don't know what it's like to be a drama teacher in a small town in Arkansas where nobody really cares,&quot; she said, &quot;but let me tell you something. You can do this.&quot; &quot;These stories didn't have to be made up. The Everything I've accomplished since, I can trace back to this woman, Maudie Treadway.&quot;\n\nThe colorful characters, stories, and experiences of his youth would find their way into Billy's work, in his films and music, and in his perspective and attitude. &quot;It's like the old saying goes: you can take the boy out of the hills, but you can't take the hills out of the boy.&quot; That boy did leave the hills--for Hollywood Hills. A true fish out of water, he recalls stories of miserable jobs, the cheapest accommodations, and physical hunger--but also a devoted writing partner Tom Epperson, a life-changing acting teacher in L.A., and a compassionate nurse who snuck him milk shakes when he was near starvation. But there was always the dream of being an actor, and his fortunes turned when he served hors d'oeuvres as a catering waiter to legendary director Billy Wilder, who advised him, &quot;Write about your interesting life.&quot;\n\nBilly's long career in Hollywood yields stories of inspired collaborations and failed ones, true friendships with other actors and musicians, and good friends gone too soon. In &quot;The Billy Bob Tapes,&quot; he reflects on the critics, the culture around fame, and the challenges of conveying an artistic vision in film. Most striking is Billy's clear-eyed perspective about the magic of entertainment, and how we perceive it in a rapidly changing world. With passion, unvarnished honesty, wry humor, and a little help from friends Angelina Jolie, Robert Duvall, Dwight Yoakam, Tom Epperson, and Daniel Lanois, Billy Bob finally talks.","torrent":{"xt":"urn:btih:b3e620c18ec9a56e0c08d07f4897aeed1712b6c5","amp;dn":"The+Billy+Bob+Tapes-+A+Cave+Full+of+Ghosts+by+Billy+Bob+Thornton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3e620c18ec9a56e0c08d07f4897aeed1712b6c5","infoHashBuffer":{"type":"Buffer","data":[179,230,32,193,142,201,165,110,12,8,208,127,72,151,174,237,23,18,182,197]},"announce":[],"urlList":[]}}