{"title":"Ozric Tentacles almost full discography (23 albums) FLAC","uid":9197225,"size":9615718527,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b41368662a422fe34cd54b3903236ff00aef9854&amp;dn=Ozric+Tentacles+almost+full+discography+%2823+albums%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sidmal","files":-1,"time":1384512171,"description":"sourced fromIn high quality MPEG-4 format and converted into FLAC. hopefully the quality is good \nalbums categorized by name from a-z.\nenjoy.\n\nnote: this is a DIY, I didn't put to much effort into it since I'm a lazy sod.\n\n4om wiki:\n\nOzric Tentacles (also known as The Ozrics) are an instrumental rock band from Somerset, England, whose music can loosely be described as psychedelic or space rock. Formed in 1983, the band has released 28 albums as of 2011, and became a cottage industry selling over a million albums worldwide despite never having major label backing.[1] Throughout many line-up changes over the years, guitarist Ed Wynne has remained the only original member of the band\n\nThe original lineup met in Wimbleson where they lived and in fully formed 1983 at the Stonehenge Free Festival and its name arose from discussions of hypothetical cereal brands (Malcolm Segments, Desmond Whisps, and Gordon Lumps are among the names that were considered). In the 1980s the band built a fanbase on the festival circuit, becoming particularly associated with the Glastonbury Festival, and made a series of cassette releases, sold at gigs and via a fan club.\n\nIts first label release was Pungent Effulgent in 1989, which was also re-released in the early 2000s, packaged with Strangeitude (1991). This was followed by Erpland (1990), an album dedicated to the Pongmaster, a character which appears on many of the band's album artworks. 1991 saw the Strangeitude LP. By 1993 the band had grossed over three million dollars, and its Jurassic Shift album reached the Top 20 of the UK Albums Chart.[2]\n\n\n \n\n\nThe band have gone through myriad line-up changes, with Ed Wynne (guitar, keyboards) being the only constant presence since the beginning. Many members left to pursue more electronic music spin-off acts, such as Eat Static, Transglobal Underground, Nodens Ictus, Dubblehead and Moksha. Nick Van Gelder (aka Tig), drummer for Jamiroquai during the Emergency on Planet Earth era was once part of the Ozric Tentacles line up, contributing drums and songwriting on the original cassettes Tantric Obstacles and Erpsongs. Paul Hankin went on to be a session percussionist, playing at Princess Trust and Amnesty Giggs and Touring with many top Bands. Nevertheless, the band maintained its identity and continued with this prolific rate of albums throughout the 1990s, and into the new millennium. It also continued to tour extensively, releasing a live DVD in 2002 entitled &quot;Live at the Pongmaster's Ball&quot;.\n\nThe band are famous for their live performances, fronted for years by &quot;Jumping&quot; Jon Egan (a.k.a John Egan), who used to dance around the stage in a trance-like manner while playing a variety of flutes. Ozric Tentacles has long taken an audio-visual approach to live performance, with an integrated lighting and projections crew. The band has seen many rhythm section changes over the years. As of May 2012, the lineup featured Ed Wynne (guitar, synths), Ed's wife Brandi Wynne (bass, keyboards), Ed's son Silas Wynne (synths, keyboards) and Oliver Seagle (drums, percussion). (Vinny Shillito toured the UK as a bassist in 1990 as stand-in bass player, when Roly Wynne was ill and remained friends with the band after forming his own band Grooveweird with his brother Dominic.) Paul Hankin (Conga Paul), is back with the band and recording, after an 18 year gap.\n\nIn 2011, Ozric Tentacles released their latest studio album, Paper Monkeys, and toured the record in America in March 2012, moving into a six-week-long, laid back but extensive European tour in April-May 2012.\n\nIn June 2012 their home in Colorado was destroyed by wild fires, that had ravaged the area for over a week. The band was on tour at the time. Archived material was destroyed as was their studio and some instruments. After the fire, the band reached out to fans to help rebuild the archive.\n\nOzric music is a highly psychedelic mixture of thumping basslines, sound effects and keyboard and guitar work, with a sound influenced by Steve Hillage and Gong. Many of the Ozrics' songs are in unusual time signatures and/or unusual Eastern-influenced modes. Furthermore, the band often features complex arrangements, which change time signature, key signature and tempo frequently in the course of a track, a well-known element present in progressive rock. There are also moments of straightforward funk-influenced grooves and strong influences from jazz fusion, dub/reggae and ambient music styles.\n\nThese features are mixed with electronic elements, including densely layered psytrance- and techno-influenced arpeggiated synthesizers, pads, synth basslines, effects and programmed drumbeats. There is also a strong influence from dub and ambient music, with many quiet relaxed tracks, that balance the frenetic, intense material.\n\nThe Ozrics also use a wide range of instruments in their performances. Electric and acoustic guitars, flutes, recorders, xylophones and even sounds of digitally tweaked human voices appear throughout.\n\n","torrent":{"xt":"urn:btih:b41368662a422fe34cd54b3903236ff00aef9854","amp;dn":"Ozric+Tentacles+almost+full+discography+%2823+albums%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b41368662a422fe34cd54b3903236ff00aef9854","infoHashBuffer":{"type":"Buffer","data":[180,19,104,102,42,66,47,227,76,213,75,57,3,35,111,240,10,239,152,84]},"announce":[],"urlList":[]}}