{"title":"Sugar: The Bitter Truth 2009 07 27 UCTV","uid":5109927,"size":433829486,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b4558d2eba70d36c3563ceebd41d3ed50abbae97&amp;dn=Sugar%3A+The+Bitter+Truth+2009+07+27+UCTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"john1942","files":1,"time":1254677887,"description":" Sugar: The Bitter Truth 2009 07 27 UCTV\n\n413mb /89mns/XVID\n\nObese? A 'poisoned' food supply may be to blame, UCSF expert says\n\t\nFeeling fat? It might not be your fault.\n \nRobert H. Lustig, MD, UCSF Professor of Pediatrics in the Division of Endocrinology, explores the damage caused by sugary foods. He argues that fructose (too much) and fiber (not enough) appear to be cornerstones of the obesity epidemic through their effects on insulin\n\nThe obesity epidemic is caused by a &quot;poisoned&quot; food supply that is altering people's biochemistry and driving them to eat more and move less, according to a hypothesis proposed by a UCSF doctor who culled results from thousands of studies on obesity. \n\nLustig zeroes in on the heavy reliance on hight fructose corn syrup, especially concentrated in soft drinks and used in large quantities in many processed foods. HFCS was introduced in the American food supply in the late 1970s. \n\nHe calls fructose a food toxin but government agencies do not regulate food or food products that cause chronic, health damage. Lustig also deals with the nutritional affinity of alcohol and fructose and the      extensive, metabolic damage both do to the liver along with association with heart disease and high blood pressure. \n\nIt is unfair and unhelpful to blame personal behaviors, especially a lack of self-control, for the country's rising obesity rates, says Dr. Robert Lustig, a pediatrician and nationally renowned obesity expert.\n\nThe processed food that is most readily available to Americans -- from potato chips and cookies to yogurt and white bread -- is loaded with fructose that cause the body to believe that it is hungry, which makes people feel compelled to consume more calories and conserve energy, he said. \n\nFructose  makes the body produce more insulin, which blocks hormones that would normally tell the brain to stop eating, he said.\n\nBreaking the pattern of sugar consumption -- a pattern that Lustig compares to nicotine addiction -- is more than just a matter of willpower. It will take a grassroots effort of doctors, community leaders and consumers to force the government and the food industry to get those sugary foods out of mainstream American diets, he said.\n\n&quot;Everyone's assuming you have a choice, but when your brain is starving, you don't have a choice,&quot; Lustig said. &quot;When you look at it that way, all of a sudden Big Food looks like the perpetrator, and the patient becomes the victim. Congress says you can't sue McDonald's for obesity because it's your fault. Except the thing is, when you don't have a choice, it's not your fault.&quot;\n\n\n\nSource:http://www.uctv.tv/search-details.aspx?showID=16717     (Video Stream\nOther shunster posts/cap","torrent":{"xt":"urn:btih:b4558d2eba70d36c3563ceebd41d3ed50abbae97","amp;dn":"Sugar%3A+The+Bitter+Truth+2009+07+27+UCTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4558d2eba70d36c3563ceebd41d3ed50abbae97","infoHashBuffer":{"type":"Buffer","data":[180,85,141,46,186,112,211,108,53,99,206,235,212,29,62,213,10,187,174,151]},"announce":[],"urlList":[]}}