{"title":"Megiddo (Pack)","uid":5869450,"size":2040802374,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b50e678b6e6c7ea7cc2e6c338d90ca9a4a655c86&amp;dn=Megiddo+%28Pack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JustPirateBay2010","files":-1,"time":1286401834,"description":"\nMegiddo (Pack)\n\nMegiddo: The March to Armageddon (2004) (DivX)\n\n&quot;Megiddo: The March to Armageddon&quot; explores Bible prophecy concerning the last day kingdom of Antichrist, tracking the history of the New World Order from the pages of Scripture through the global revolution that is sweeping the world. Popular subjects in this film include the prophecies of Revelation and Daniel, as well as the history of the Illuminati and Freemasonry on the New World Order movement.\n\n2 Hours 17 Mins     352 x 240     29 Fps     800 Kbps\n\n\nMegiddo II The New Age: Part Two In The Megiddo Series\n\nThe Lie of the Serpent is the second part of the controversial Megiddo series, which next focuses on the highly influential New Age movement. But is the New Age really new? Or does it represent the ancient doctrine taught by the serpent to Eve in the Garden of Eden? The answer will startle and amaze you as you learn the influence of the serpent's teaching through the spiritual explosion of occult activity in the 19th and 20th centuries.\n\nSome of the greatest and most recognized people of the modern era (including Charles Darwin, Thomas Edison, Adolf Hitler and Hillary Clinton) have been influenced by the movement that has re-awakened mankind's communication with the spirit realm, and re-shaped the Western view of God and His relationship to mankind. What are the implications of this &quot;paradigm shift&quot; that seeks to introduce a new global consciousness? Will this new consciousness really bring mankind into the dawning of a golden era? Or the awakening of another dark age?\n\nFull of highly detailed research and exhaustive documentation, Megiddo II challenges even the most skeptical viewer to consider the consequence of the global awakening taking place before our very eyes.\n\nJoin speakers Dave Hunt, Caryl Matrisciana, Dr. Kent Hovind, Pastor Joe Schimmel, and Dr. Stan Monteith who expose the movement that seeks to unite mankind in a one-world religion through the United Nations.\n\nGlobal adherents claim to await a &quot;universal Christ&quot; to lead the world. What happens to those who will not follow this world leader? And are there sinister warnings against those who refuse to be &quot;initiated&quot; into the New Age? \n\n3 Hours     352 x 240     29 Fps ","torrent":{"xt":"urn:btih:b50e678b6e6c7ea7cc2e6c338d90ca9a4a655c86","amp;dn":"Megiddo+%28Pack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b50e678b6e6c7ea7cc2e6c338d90ca9a4a655c86","infoHashBuffer":{"type":"Buffer","data":[181,14,103,139,110,108,126,167,204,46,108,51,141,144,202,154,74,101,92,134]},"announce":[],"urlList":[]}}