{"title":"Pro Evolution Soccer 2010 (CIDER) [MAC]","uid":5292428,"size":4284296633,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:b52d889174fd66b914c571a781c92a3cfa8ec641&amp;dn=Pro+Evolution+Soccer+2010+%28CIDER%29+%5BMAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"thenoobish","files":4,"time":1263939078,"description":"Mac Platform: Intel-Cider\nIncludes: K\n\nOS version: Mac OS X v10.5 or higher\nProcessor type(s) &amp; speed: Intel Core Duo Processor 2.4 GHz or faster\nRAM minimum: 1 GB RAM minimum\n\nLink for more information: http://www.konami.com/games/pes/pro-evolution-soccer-2010.php\n\n\nGame Info\nPro Evolution Soccer is a video game built on pride, the pride that comes from making the most realistic soccer experience one can have within the world of gaming. Pro Evolution Soccer 2010 does not disappoint and this year, the voices of fans world-wide have been heard. Based in Japan, Winning Eleven Productions has instituted a host of anticipated changes that make PES 2010 the best yet. In PES 2010 you'll find yourself on the largest stage in digital soccer: The Champions League. Imagine you're in a 1-1 tie in stoppage time against Manchester United. You've broken their defense and are sprinting full throttle into a man to man match of wits and reflexes with Edwin van der Sar... Do you have what it takes to punch it in for the win?\n\nFeatures\nIntroducing Transcendent Visuals - PES will offer drastic improvements in license content, stadium atmospheres, player likenesses all the way down to the specific moves of the real life players. When you play as Messi, it will be like Messi is playing.\n\nEvolution of Intelligence - PES will draw upon the real life excitement of soccer which relies heavily on intelligent defenses and offensive schemes. The AI is redone and will feature Teamvision 2.0 for a more formidable opponent. It will also help your offense to build attacks or to close down your opponents attacks. Gamers will be able to execute orchestrated attacks and defenses which involve multiple players at the same time.\n\nThe Power of Choice - In addition to the UEFA Champions League mode, players will have more choices than ever. They can choose any of the modes including an enhanced Master League mode enabling players to create and manage their team for a longer period of time. In addition there will be multiple cups to play for and an edit mode to further personify your team.  \n\nHow To Install:\n\n1.) unzip and Copy the  KONAMI Folder into your MACÃ‚Â´s Documents  folder\n(There are two different KONANI Foders in my ul -&gt; Choose the one which works fine for you)\n2.) UnRAR Pro Evolution Soccer 2010 with BetterZip and drag the game to any directory of your choice.","torrent":{"xt":"urn:btih:b52d889174fd66b914c571a781c92a3cfa8ec641","amp;dn":"Pro+Evolution+Soccer+2010+%28CIDER%29+%5BMAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b52d889174fd66b914c571a781c92a3cfa8ec641","infoHashBuffer":{"type":"Buffer","data":[181,45,136,145,116,253,102,185,20,197,113,167,129,201,42,60,250,142,198,65]},"announce":[],"urlList":[]}}