{"title":"The Very Best - Warm Heart of Africa [FLAC] TQMP","uid":5662883,"size":340961745,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b556fed8fbb6c91e9803f6bfbbf744ee12f04dd3&amp;dn=The+Very+Best+-+Warm+Heart+of+Africa+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pastafari","files":-1,"time":1278033346,"description":"The Very Best - Warm Heart of Africa\n2009\n\nBrought to you by TQMP\nThe Quality Music Project\n\nThere was a David and Goliath quality to the simultaneous performances that closed out the 2009 Pitchfork Music Festival. Against the Flaming Lips' grid-draining light show and extravagant confetti budget, the Very Best pitted a grinning guy in a rakishly cocked plaid hat, a stocky Euro-hipster with a console-laden table, and a couple of head-wrapped backup singers. The crowd seemed thin and politely engaged during the first song. By the last, the audience had swelled considerably, and everyone was bouncing up and down-- a sea of genuinely happy faces. That's the simplest and most important thing about the Very Best. Their enthusiasm is contagious.\n\nThe group debuted last year with the superlative mixtape Esau Mwamwaya and Radioclit Are the Very Best. The Malawi-born singer ran a secondhand shop in London, where he met Etienne Tron of Radioclit (Tron is French; his partner Johan Karlberg is Swedish). Radioclit's prior work had leaned heavily on grime, Miami bass, crunk, and other aggressive genres; they dubbed their style &quot;ghetto-pop.&quot; But with the Very Best mixtape, they turned from dark, druggy hedonism to effervescent productions that blended Afropop-laced originals with mixes of M.I.A. and Vampire Weekend. It was feel-good music that felt fresh and healthful, just like Mwamwaya's voice. He sang ebulliently in Chichewa, English, and other languages, and the foreignness of the words only cleared the way for the life-affirming feeling that shined through them.\n\nWarm Heart of Africa, the group's official debut, rises to the high standard set by the mixtape, from which only two tracks are held over: &quot;Kamphopo&quot;, where Mwamwaya swaggers through sun-streaked Architecture in Helsinki samples, and a dance mix of &quot;Kada Manja&quot;, with added drums and some of its strings gathered up into a loping rhythm. A couple of guest stars also return. Ezra Koenig of Vampire Weekend duets with Mwamwaya on the title track, which will probably be the first song on the album that knocks out most listeners. &quot;The boys move fast/ You should take it slow,&quot; they advise coquettishly, in an irresistible hopscotch cadence, over splashes of sampled guitar and hand percussion. And M.I.A. appears on &quot;Rain Dance&quot;, panting and purring over a taut drumline, in one of the album's few respites from blaring melody. This sense of continuity with the mixtape is bolstered by the fact that some of these songs are so immediate you'll swear you've heard them before, like &quot;Julia&quot;, which sounds like some kind of sublimely cheerful G-funk.\n\nRadioclit deserve a lot of credit for keeping the vibe upbeat but diverse: Whether they're cooking up a snap track with pizzicato accents on &quot;Yalira&quot;, pinging 1980s synth-pop on &quot;Chalo&quot;, tropical dreams on &quot;Angonde&quot;, or kwaito-inspired pulses on &quot;Ntdende Uli&quot;, they stay out of Mwamwaya's way, using small and tactile rhythmic embellishments to give him extra kick-- always lively, never cluttered. Which is smart, because Mwamwaya is a scene-stealer, for the uncomplicated reason that he sings like an angel and takes evident pleasure in doing so. On &quot;Zam'dziko&quot;, his voice weaves in and out of itself, adorned only with sporadic drum claps. For Mwamwaya, a hot beat is always nice, but pretty much optional. The album's biggest asset has to do with his presence, and it's hard to put a name to-- &quot;spiritual generosity&quot; sounds too grand, but that's what it feels like.\n\nSome people tend to get up in arms whenever African music gets mixed up with Western genres-- as if they haven't always been in a dialogue, like how marabi is related to American jazz. The Very Best inspired me to learn more about some of the genres they employ, and if you do the same, that's great-- but an Afropop primer isn't what Mwamwaya's about here. In drawing lines between older African genres, like highlife, and newer ones, like kwaito, and then linking those to international pop styles of various eras, Warm Heart of Africa pictures a glittering web of connectivity where national and cultural boundaries dissolve. People care about socio-cultural chin-stroking; music does not. This record simply wants to be heard, by whomever will listen and enjoy. There's no cynical play for authenticity, no implication that Afropop is somehow piously cordoned off from Western music. It's a true global-pop album, and a hopeful template for things to come.\n-- Pitchfork (8.6)\n\nTracks\n01- Yalira\n02- Chalo\n03- Warm Heart Of Africa\n04- Mwazi\n05- Nsokoto\n06- Angonde\n07- Julia\n08- Mfamu\n09- Ntende Uli\n10- Rain Dance\n11- Kamphopo\n12- Kada Manja\n13- Zam'dziko\n\nEAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b556fed8fbb6c91e9803f6bfbbf744ee12f04dd3","amp;dn":"The+Very+Best+-+Warm+Heart+of+Africa+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b556fed8fbb6c91e9803f6bfbbf744ee12f04dd3","infoHashBuffer":{"type":"Buffer","data":[181,86,254,216,251,182,201,30,152,3,246,191,187,247,68,238,18,240,77,211]},"announce":[],"urlList":[]}}