{"title":"The Breast Of SCORELAND 2 [DVDRip]","uid":8835242,"size":3591958679,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b56e13fc0454721439bc2881eb80ac789fbe77e2&amp;dn=The+Breast+Of+SCORELAND+2+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":8,"time":1377097804,"description":"The Breast Of SCORELAND 2 [DVDRip]\n\nCovers: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=ejndvqdrrtpnnaacs5x5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=ejndvqdrrtpnnaacs5x5.jpg&lt;/a&gt;\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2l4no2cnevodhn1ounhz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2l4no2cnevodhn1ounhz.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=flfx3g7lcq55shdf6il6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=flfx3g7lcq55shdf6il6.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9ke84gknjy301v0hvdya.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9ke84gknjy301v0hvdya.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=q8m3j96eskhrgow60miz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=q8m3j96eskhrgow60miz.jpg&lt;/a&gt;\n\nCast:\nPersia Monir, Rita Daniels, Demi La Rue, Joanna Storm, Shana DuPlae, Sunny Ray\n\n\nThe Breast of SCORELAND was one of our best-selling DVDs ever, so we knew we had to outdo ourselves with The Breast of SCORELAND 2... and we did! Twice as big with SCORELAND's 36 biggest stars on four DVDs, packed with 18 scenes of solo boob play and pussy-plugging action plus 18 scenes of busty hardcore, this is the marathon, big-tit jack pack of every boob lover's dreams!\n\n18 SOLO SCENES, 18 XXX SCENES, THE GIRLS YOU WANT TO SEE!\n\nDisc 1\nJapanese sensation Hitomi self-sucks her J-cup tits and ices her nipples.\nVenera pours out of a white bikini, plays with her tits and fingers her pussy to orgasm.\nStacked n' packed, fuck-talking Karina Hart oils her tits and dildos her pussy.\nValory Irene's perfect naturals look amazing in a fishnet bodystocking, and her pussy looks fine, too.\nBrickhouse brunette Terri Jane squeezes and kneads her K-cup naturals.\nBlonde Sophie Mae strips out of a halter top and Daisy Dukes for a tits and ass show.\nIt's shower time with brunette Taylor Steele, who soaps her tits and fingers her pussy.\nMichelle Bond looks super sexy in (and out of) a white bra and tight, pencil skirt. She uses a big toy on her pussy.\nVoluptuous brunette Victoria Lane oils up her tits, then lets us view her tits and pink pussy up-close through a glass table.\n\nDisc 2\nBlonde girl-next-door Maggie Green goes for a dip in the pool, then dildos her pussy.\nBrunette Ivy Darmon uses a hand-held shower head to get her body wet, then fucks her shaved pussy with a dildo.\nMega-stacked, XXX-cup Beshine puts on a bra show. But no bra can contain her!\nSlim n' stacked, blonde MILF Morgan Leigh takes dirty and uses a pink dildo on her cunt.\nRedhead Jenna Valentine is washing a car, then decides to soap up her tits and rub her pussy.\nA tiny bikini barely covers Micky Bells' gigantic naturals. She super-saturates her tits with oil and fingers her pussy.\nBritish blonde Dolly Delight is a dirty-taking slut who shoves her nipples into the camera and slams three fingers inside her pussy.\nMerilyn Sakova, wearing a tiny bikini top, invites you to watch her exercise routine. She jogs, stretches and fucks her pussy with a dildo.\nBlack n' stacked Janet Jade soaps up her tits and fucks her boobs and pussy with a dildo.\n\nDisc 3\nShort n' stacked Stephanie Stalls is a housecleaner who uses her mouth, pussy and asshole to clean her client's cock.\nLatina Daylene Rio is a sloppy-sucking, hard-fucking MILF.\nBeautiful, blonde, bombshell Kelly Christiansen proves that even girls-next-door love to suck and fuck.\nMature, blonde, super-stacked Brittany O'Neil enjoys her first interracial fuck ever with a giant black cock!\nHawaiian MILF Claudia Kealoha is a bitchy boss who fucks her deadbeat employee and gets a creampied cunt.\nAsian beauty Kiko Lee goes deep on dick and takes a hard pussy pounding.\nKaren Fisher is a bombshell blonde in sexy lingerie who enjoys a mouth and face bang.\nBlonde, German beauty Sandra Star smiles even when she's getting her pussy and asshole filled with dick.\n\nDisc 4\nLana Ivans, wearing a tiny bikini, devours cock and takes it for a ride by the pool.\nSuper-stacked, big-assed Latina Angelina Castro gets drilled in her tight celebrity pussy.\nNaturally stacked redhead Desiree goes for a physical and gets a creampie.\nDark-haired Shione Cooper, bursting out of a bustier, uses her mouth and pussy to make a stud's balls explode.\nBlonde girl-next-door Kali West takes a big, black cock up her ass.\nNatural Shyla Shy, bustier than ever, fucks the biggest dick she can handle.\nBlack n' stacked Maserati gets her tits oiled up before she uses her mouth to get a stud's dick wet for her pussy.\nBeverly Paige is a Goth chick who gets picked up by a horny guy and ends up servicing him with her mouth and pussy.\nNatural Arianna Sinn is your fantasy bride, sucking and fucking to make you happy.\n","torrent":{"xt":"urn:btih:b56e13fc0454721439bc2881eb80ac789fbe77e2","amp;dn":"The+Breast+Of+SCORELAND+2+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b56e13fc0454721439bc2881eb80ac789fbe77e2","infoHashBuffer":{"type":"Buffer","data":[181,110,19,252,4,84,114,20,57,188,40,129,235,128,172,120,159,190,119,226]},"announce":[],"urlList":[]}}