{"title":"Some Sunny Day (World War II, #2) - Annie Groves","uid":9972910,"size":517192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5f609a7a0dc3352c835f4303f9332d3f43359ba&amp;dn=Some+Sunny+Day+%28World+War+II%2C+%232%29+-+Annie+Groves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1397608659,"description":"On the eve of World War II in Liverpool, life is about to change forever for one girl. As war breaks out so too does Molly Dearden! Molly is used to living in the shadow of her older sister, June. When their mother died Molly was just seven years old, and June helped their grief-stricken father look after her in their tiny home in the tight-knit Edge Hill district of Liverpool. But as her 17th birthday passes, Molly doesn't realize how much she is going to have to grow up. As the threat of a second world war looms, she must learn to protect herself, her family, and her heart. When hostilities finally break out, Molly finds the courage to enlist in the Women's Voluntary Service. There, she can help the war effort and finally stand on her own two feet. It's a terrifying time, but also some of the best days of her life, especially when she meets and falls for Eddie. The pair live for the precious hours when Eddie is on leave from the Navy and excitedly plan their future together. But then tragedy strikes. Devastated, Molly can take no more. But then the terrible reality of war hits her home town and Molly must find the strength to protect those closest to her heart.","torrent":{"xt":"urn:btih:b5f609a7a0dc3352c835f4303f9332d3f43359ba","amp;dn":"Some+Sunny+Day+%28World+War+II%2C+%232%29+-+Annie+Groves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f609a7a0dc3352c835f4303f9332d3f43359ba","infoHashBuffer":{"type":"Buffer","data":[181,246,9,167,160,220,51,82,200,53,244,48,63,147,50,211,244,51,89,186]},"announce":[],"urlList":[]}}