{"title":"Neural Nets WIRN09 - (Malestrom)","uid":6002336,"size":9684534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b63884bf24ca5fd754a885d5182c50731768f3f5&amp;dn=Neural+Nets+WIRN09+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1291213113,"description":"Neural Nets WIRN09: Proceedings of the 19th Italian Workshop on Neural Nets, Vietri Sul Mare, Salerno, Italy May 28-30 2009\nPublisher: IOS | ISBN: 1607500728 | edition 2009 | PDF | 360 pages\n\nThis book reports the proceedings of WIRN09, the 19th Italian Workshop of the Italian Society for Neural Networks (SIREN). Neural networks explore thought mechanisms that efficient computational tools and a representative physics of our brain share together and that ultimately produce the loops of our thoughts. The general approach is to see how these loops run and which tracks they leave. The book comprises different presentations that promote the understanding and real use of artificial neural networks, collecting papers that involve a truly interdisciplinary discussion forum on their algorithms, architectures and applications. This volume highlights recent developments and discusses future research directions in neural networks and learning systems, computational intelligence and real world applications. It is divided in five different chapters according to the following topics presented in the conference: modeling, signal processing, economy and complexity, biological aspects and applications. The workshop touched upon lots of hot scientific areas such as computational intelligence, computational neuroscience, fuzzy logic systems and neural networks in finance and economics. This volume is of interest to anyone following the latest on artificial intelligence, computational neuroscience and all the multiple applications of neural networks.","torrent":{"xt":"urn:btih:b63884bf24ca5fd754a885d5182c50731768f3f5","amp;dn":"Neural+Nets+WIRN09+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b63884bf24ca5fd754a885d5182c50731768f3f5","infoHashBuffer":{"type":"Buffer","data":[182,56,132,191,36,202,95,215,84,168,133,213,24,44,80,115,23,104,243,245]},"announce":[],"urlList":[]}}