{"title":"Greg Lynn: How calculus is changing architecture","uid":4638371,"size":65469306,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b6d5799f35c5fcb9ccd82f978ab5caf83c0fed9d&amp;dn=Greg+Lynn%3A+How+calculus+is+changing+architecture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1231630096,"description":"Greg Lynn talks about the mathematical roots of architecture -- and how calculus and digital tools allow modern designers to move beyond the traditional building forms. A glorious church in Queens (and a titanium tea set) illustrate his theory.\n\nWho says great architecture must be proportional and symmetrical? Not Greg Lynn. He and his firm, Greg Lynn FORM, have been pushing the edges of building design, by stripping away the traditional dictates of line and proportion and looking into the heart of what a building needs to be.\n\nA series of revelations about building practice -- &quot;Vertical structure is overrated&quot;; &quot;Symmetry is bankrupt&quot; -- helped Lynn and his studio conceptualize a new approach, which uses calculus, sophisticated modeling tools, and an embrace of new manufacturing techniques to make buildings that, at their core, enclose space in the best possible way. The New York Presbyterian church that Lynn designed with Douglas Garofalo and Michael McInturf, collaborating remotely, is a glorious example of this -- as a quiet industrial building is transformed into a space for worship and contemplation with soaring, uniquely shaped and tuned elements.\n\nIn a sort of midcareer retrospective, the book Greg Lynn Form (watch the video) was released in October 2008; recently, Lynn has collaborated with the video team Imaginary Forces on the New City installation as part of the MOMA exhibit &quot;Design and the Elastic Mind.&quot; In November 2008, FORM won a Golden Lion at the Venice Bienniale for its exhibition Recycled Toy Furniture.\n\n    &quot;There are architects who love the Parthenon. Greg Lynn has a thing for the blob.&quot;\n\nTime.com's Time 100 2005\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:b6d5799f35c5fcb9ccd82f978ab5caf83c0fed9d","amp;dn":"Greg+Lynn%3A+How+calculus+is+changing+architecture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6d5799f35c5fcb9ccd82f978ab5caf83c0fed9d","infoHashBuffer":{"type":"Buffer","data":[182,213,121,159,53,197,252,185,204,216,47,151,138,181,202,248,60,15,237,157]},"announce":[],"urlList":[]}}