{"title":"Plant Chemical Genomics - Methods and Protocols [PDF]","uid":9880473,"size":4668446,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b735aea411c1f332261649a83d6261393f587c67&amp;dn=Plant+Chemical+Genomics+-+Methods+and+Protocols+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1396539821,"description":"Hardcover: 230 pages\nPublisher: Humana Press; 2014 edition (December 19, 2013)\nLanguage: English\nISBN-10: 1627035915\nISBN-13: 978-1627035910\n\n\n\nPlant Chemical Genomics: Methods and Protocols , expert researchers in the field detail many of the techniques used for identification of bioactive compounds from a large selection of fields in plant biology including plant pathogenesis, immune responses, small RNA processing, endomembrane trafficking, lipids, plant hormone signaling and cell wall. The presentation of these and other examples as well as synthetic chemistry, computation and target identification provides a comprehensive overview of the practical aspects of chemical biology that are possible in plant systems. Small molecules and natural products that produce a phenotype in plants have been known for decades. The agrichemical industry has utilized small molecules based on known natural molecules such as auxins, cytokinins, abscissic acid and other growth regulators. In recent years, the screening and characterization of novel small molecules has enhanced our understanding of protein function, metabolic, signaling and endomembrane pathways, and their interactions in basic plant research.\n\nWritten in the highly successful Methods in Molecular Biology series format, chapters include introductions to their respective topics, lists of the necessary materials and reagents, step-by-step, readily reproducible laboratory protocols, and key tips on troubleshooting and avoiding known pitfalls.","torrent":{"xt":"urn:btih:b735aea411c1f332261649a83d6261393f587c67","amp;dn":"Plant+Chemical+Genomics+-+Methods+and+Protocols+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b735aea411c1f332261649a83d6261393f587c67","infoHashBuffer":{"type":"Buffer","data":[183,53,174,164,17,193,243,50,38,22,73,168,61,98,97,57,63,88,124,103]},"announce":[],"urlList":[]}}