{"title":"ROCKY [1976] DVDRip","uid":5227439,"size":559878441,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b7b23e648e563fd20db02496f4d995a78d56b943&amp;dn=ROCKY+%5B1976%5D+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Raymond-ryche","files":-1,"time":1261180793,"description":"ROCKY [1976] DVDRip\n\nIn November 1975, Rocky Balboa is introduced as a small-time boxer and collector for Anthony Gazzo (Joe Spinell), a loan shark, living in Philadelphia. The World Heavyweight Championship bout is scheduled for New Year's Day 1976, the year of the United States Bicentennial. When the opponent of undefeated heavyweight champion Apollo Creed (Carl Weathers) is injured, Creed comes up with the idea of fighting a local underdog and, because he likes Rocky's nickname, &quot;The Italian Stallion&quot;, he selects the unknown fighter. He puts it in light by proclaiming &quot;Apollo Creed meets 'The Italian Stallion'&quot;.\n\nTo prepare for the fight, Rocky trains with a 1920s-era ex-bantamweight fighter and gym owner, Mickey Goldmill (Burgess Meredith), while Rocky's good friend, Paulie (Burt Young), a meat-packing plant worker, lets him practice his punches on the carcasses hanging in the freezers. During training, Rocky dates Paulie's shy, quiet sister, Adrian (Talia Shire) who works as a clerk in a local pet store. The night before the fight, Rocky confides in Adrian that he does not expect to beat Creed, and that all he wants is to go the distance with Creed (which no fighter has ever done), meaning that lasting 15 rounds (the typical scheduled length of championship fights at the time) against him would mean he &quot;... wasn't just another bum from the neighborhood&quot;.\n\nOn New Years Day, the climatic boxing match begins. Creed does not initially take the fight seriously, but Rocky unexpectedly knocks him down in the first round and the match turns intense. The fight indeed lasts 15 rounds with each fighter suffering many injuries; as the final round bell sounds with both fighters locked in each other's arms, an exhausted Creed vows &quot;Ain't gonna be no re-match&quot;, to which an equally spent Rocky replies &quot;Don't want one&quot;. After the fight, Rocky calls out for Adrian, who runs down to the ring. As the ring announcer declares the fight for Apollo Creed by virtue of a split decision, Adrian and Rocky embrace while they profess their love to one another, not caring about the results of the fight.\n\nPLEASE SEED, Thanks.","torrent":{"xt":"urn:btih:b7b23e648e563fd20db02496f4d995a78d56b943","amp;dn":"ROCKY+%5B1976%5D+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7b23e648e563fd20db02496f4d995a78d56b943","infoHashBuffer":{"type":"Buffer","data":[183,178,62,100,142,86,63,210,13,176,36,150,244,217,149,167,141,86,185,67]},"announce":[],"urlList":[]}}