{"title":"The land that time forgot 1975 hdtv 720p mp4 h264","uid":11248047,"size":1803458560,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b80d5d63a91459d9ea8fbb71c599791210e6e99e&amp;dn=The+land+that+time+forgot+1975+hdtv+720p+mp4+h264+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"audiomaximus","files":1,"time":1413771820,"description":"The Land That Time Forgot is a 1975 fantasy/adventure film based upon the 1924 novel The Land That Time Forgot by Edgar Rice Burroughs. The screenplay was written by Michael Moorcock. The film was produced by Britain's Amicus Productions and directed by Kevin Connor. The cast included Doug McClure, John McEnery, Keith Barron, Susan Penhaligon, Anthony Ainley and Declan Mulholland.\n\nThe movie begins with Doug McClure as Bowen Tyler narrating the events, much as we see in many Edgar Rice Burroughs novels. A sailor throws a bottle with a written manuscript inside it into the sea, hoping for it to be discovered later.\n\nThe story is set during World War I and involves the survivors of the sinking of a British merchant ship who are taken on board a German U-boat\n\nBowen Tyler and Lisa Clayton (Susan Penhaligon) are passengers on the ship torpedoed by Captain von Schoenvorts (John McEnery). Along with a few surviving British officers, Tyler convinces the other men to take over the surfacing submarine, this being their only chance for survival. After confronting the Germans on the deck, a fight ensues and they seize the German U-boat. Tyler takes command hoping to sail to a British port. Von Schoenvorts has his crew steer toward a safe sea port. But German officer Dietz (Anthony Ainley) gets loose and smashes the sub's radio.\n\nOff course and running out of fuel in the South Atlantic, the U-boat and its crew happen across an uncharted sub-continent called Caprona, a fantastical land of lush vegetation where dinosaurs still roam, co-existing with primitive man. There are also reserves of oil which, if the Germans and British can work together, can be refined and enable their escape from the island.\n\nTyler discovers the secret of Caprona: individuals evolve not through natural selection, but by migrating northward across the island. With the submarine working again, and a sudden outbreak of volcanic eruptions across the island, Deitz abandons Tyler and Clayton in Caprona and attempts to escape, but the U-Boat cannot function in the boiling waters and sinks. Tyler and Clayton are stranded, and forced to move northwards. The movie ends with Tyler throwing the bottle, with the manuscript inside it, as seen in the beginning of the movie.\n\nThis is an hdtv rip with the logo MGMHD in the lower right corner.  The logo is very small and is hardly noticed.  This is the only HD copy being shared at this time.  Help seed and enjoy this classic dinosaur movie.\n\n\nVideo\n\n1112 x 604  H264   MP4  2500kbps  25 fps  runtime  1:31:18\n\nAudio\n\nmp3 lame  118kbps  48khz  stereo","torrent":{"xt":"urn:btih:b80d5d63a91459d9ea8fbb71c599791210e6e99e","amp;dn":"The+land+that+time+forgot+1975+hdtv+720p+mp4+h264+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b80d5d63a91459d9ea8fbb71c599791210e6e99e","infoHashBuffer":{"type":"Buffer","data":[184,13,93,99,169,20,89,217,234,143,187,113,197,153,121,18,16,230,233,158]},"announce":[],"urlList":[]}}