{"title":"ShadowSlaves - Prison Camp Part 1-3","uid":9635495,"size":2311131736,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:b83c7f7aa32e1a3895c512ea0381aa3d5469958b&amp;dn=ShadowSlaves+-+Prison+Camp+Part+1-3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1392843404,"description":"REQUESTED By nexus.mohad\n\nShadowSlaves - Prison Camp Part 1-3\n\n\nPrison Camp Part1\n\n \n\nwith Slavegirl Andrea and Beauvoir\n\n \n\n \n\nIn the first part of this feature length special, beauvoir is brought to the prison charged with prostitution. The warden (Magick) introduces her to her cell mates (nimue and andrea), and her cunt is shaved ready for her ordeal.\n\n \n\nLeft alone with andrea in her cell, the girls start to make out and have sex, until nimue catches them in the act. Shoving their heads into her dirty mop bucket, and threatening to report them to the warden, she forces them into accepting punishment on the spot.\n\n \n\nShe begins with an over the knee spanking, while the unfortunate girls are forced to lick and kiss her feet, then moves on to the serious punishment, using stress positions, candle wax and canes. Beauvoir is made to stand against the wall with sharp pins beneath her heels to keep her on tiptoe, while she is viciously beaten, every move resulting in an increase in the punishment of her cell mate. Andrea is bound and burned with wax, then made to stand for her severe caning, while her friend looks on as her cunt is crushed on a wooden horse. The girls are joined by clamps on their nipples and whipped, until nimue is finally satisfied, and allows them to lick her cunt in gratitude.\n\n \n\n \n\nPrison Camp 2\n\n \n\nwith Slavegirl Beauvoir, Andrea and Nimue\n\n \n\n \n\nIn the second chapter of this epic feature length release, the new inmates are caged and forced to masturbate, while nimue is beaten to tears, with canes and whips, in front of them, for her presumption in punishing them without the warder's permission.\n\n \n\nBeauvoir is then tied and electroshocked, while the other girls lick and caress her until she is desperate for orgasm, but continually denied, to teach her restraint. Next comes a lesson in teamwork, as each girl must take beatings with increasingly harsh implements, from canes to heavy paddles until they can bear it no more and beg for the next girl to take their place. The stakes are raised when the cattleprod is introduced into the game, and a heavy rubber whip tests their friendship to the limits.\n\n \n\nOnce again, the girls are forced to bring Beauvoir repeatedly to the edge of orgasm, until their resolve is finally broken when the warder introduces hot habenero chilli peppers, which they must endure in their cunts and assholes until they are screaming for mercy. \n\n \n\n \n\n \n\nPrison Camp 3\n\n \n\nwith Slavegirl Beauvoir, Nimue Allen and Andrea\n\n \n\n \n\nThe last episode of the Prison Camp saga sees beauvoir pushed to the limits of frustration, as she is repeatedly brought to the very edge of orgasm, with powerful vibrators, dildos, hands, the tongues of the other slavegirls, and even mixed fruit and vegetables, only to be denied release and laughed at by the others, as they come time and time again in her face. Her legs are bound open so she cannot resist the torment, and she is labelled as the loser trash whore that she is. Finally she is locked in a chastity belt, vibrating egg in her desperate cunt, with the key frozen in a block of ice allowing no chance of immediate escape or relief.\n\n \n\nThe warder has not forgotten that all three girls deserve punishement, however, and needles are used to pierce nimue's arms and beauvoir's nipples. The worst punishment is reserved for andrea, as she is held responsible for leading the new girl astray, and has to be held down by the other girls while the warder sewns her cunt closed to avoid further misbehavior. Even this is not enough for nimue, who cannot forgive her for starting all of this trouble, and drags her outside for a final humiliation in the freezing yard.\n\n\n\nScreens\n        &lt;a href=&quot;\nhttp://image.bayimg.com/473e12bf38907ab184a0b12a611f8a051a84a0f1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/473e12bf38907ab184a0b12a611f8a051a84a0f1.jpg&lt;/a&gt;\n\n\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n             &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-) ","torrent":{"xt":"urn:btih:b83c7f7aa32e1a3895c512ea0381aa3d5469958b","amp;dn":"ShadowSlaves+-+Prison+Camp+Part+1-3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b83c7f7aa32e1a3895c512ea0381aa3d5469958b","infoHashBuffer":{"type":"Buffer","data":[184,60,127,122,163,46,26,56,149,197,18,234,3,129,170,61,84,105,149,139]},"announce":[],"urlList":[]}}