{"title":"Beau Geste-1939-William A Wellman","uid":4993433,"size":1468882796,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8ebc09f4babe4eb927abbb7db1e8835e4d2235e&amp;dn=Beau+Geste-1939-William+A+Wellman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mfccorrea","files":8,"time":1247160039,"description":"This second of three movie versions of P.C. Wren's adventure novel Beau Geste is a virtual scene-for-scene remake of the 1927 silent version. We open on the now-famous scenes of a remote, burning desert fort, manned by the dead Foreign Legionnaires, then flash back to the early lives of the Geste brothers. As children, the Gestes swear eternal loyalty to one another and to their family. One of the boys, young Beau (played as a youth by Donald O'Connor), witnesses his beloved aunt (Heather Thatcher) apparently stealing a valuable family jewel in order to finance the Geste home; Beau chooses to remain silent rather than disgrace his aunt. Years later, the grown Beau (Gary Cooper) again protects his aunt by confessing to the theft and running off to join the Foreign Legion. He is joined in uniform by faithful brothers John (Ray Milland) and Digby (Robert Preston), who in turn are pursued by a slimy thief (J. Carroll Naish). The crook is in cahoots with sadistic Legion Sgt. Markov (Brian Donlevy, in one of the most hateful portrayals ever captured on celluloid), who is later put in charge of Fort Zinderneuf, where Beau and John are stationed. When the Arabs attack, Markov proves himself a valiant soldier; it is he who hits upon the idea of convincing the Arabs that the fort is still fully manned by propping up the corpses of the casualties at the guard posts. Beau is seriously wounded, and while the greedy Markov searches for the jewel supposedly hidden on Beau's person, he is held at bay by loyal John. The suddenly enervated Beau kills Markov, then dies himself--but not before entrusting two notes to John, one of which requests that John give Beau the &quot;Viking funeral&quot; he'd always wanted (this is why the fort is in flames at the beginning of the film). After the battle, Digby Geste, a bugler with the relief troops, comes upon Beau's dead body, and appropriates the notes. As it turns out, John Geste is the only one who survives to return to England. He gives his aunt Beau's letter, which explains why Beau had confessed and run off--&quot;a 'beau geste', indeed&quot; comments his tearful aunt. No one missed nominal leading lady Susan Hayward in this essentially all-male entertainment. For years available only in muddily processed or truncated versions, Beau Geste was restored to its pristine glory by the American Film Institute in the late 1980s. \n\nFile Name: Beau Geste-1939-William A Wellman 1.avi\nFile Size (in bytes): 734,521,344 bytes\nRuntime (# of frames): 57:41.347 (82990 frames)\n\nVideo Codec: XviD 1.2 SMP\nFrame Size: 512x384 [=1.333]\nFPS: 23.976\nVideo Bitrate: 1499 kb/s\nBits per Pixel: 0.318 bpp\n\nAudio Codec: 0x2000 (Dolby AC3) AC3\nSample Rate: 48000 Hz\nAudio bitrate: 192 kb/s [2 channel(s)] CBR audio\nInterleave: 96 ms\nNo. of audio streams: 1\n\nFile Name: Beau Geste-1939-William A Wellman 2.avi\nFile Size (in bytes): 734,111,744 bytes\nRuntime (# of frames): 55:45.107 (80203 frames)\n\nVideo Codec: XviD 1.2 SMP\nFrame Size: 512x384 [=1.333]\nFPS: 23.976\nVideo Bitrate: 1557 kb/s\nBits per Pixel: 0.330 bpp\n\nAudio Codec: 0x2000 (Dolby AC3) AC3\nSample Rate: 48000 Hz\nAudio bitrate: 192 kb/s [2 channel(s)] CBR audio\nInterleave: 96 ms\nNo. of audio streams: 1\n\nIMDB: tt0031088\n\nEnglish audio, French, Spanish and Portuguese subtitles\n\nPosted at Secret-Cinema by MusclyBarbarian, who deserves all credits.","torrent":{"xt":"urn:btih:b8ebc09f4babe4eb927abbb7db1e8835e4d2235e","amp;dn":"Beau+Geste-1939-William+A+Wellman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8ebc09f4babe4eb927abbb7db1e8835e4d2235e","infoHashBuffer":{"type":"Buffer","data":[184,235,192,159,75,171,228,235,146,122,187,183,219,30,136,53,228,210,35,94]},"announce":[],"urlList":[]}}