{"title":"Bones of the Lost","uid":8832160,"size":4519419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b903091be9590d6c0f288694280ec67f0a94feb2&amp;dn=Bones+of+the+Lost&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"420weedman","files":4,"time":1377014884,"description":"#1 New York Times bestselling author Kathy Reichs returns with her sixteenth riveting novel featuring forensic anthropologist Tempe Brennan, whose examination of a young girl killed in a hit and run in North Carolina triggers an investigation into international human trafficking.When Charlotte police discover the body of a teenage girl along a desolate stretch of two-lane highway, Temperance Brennan fears the worst. The girl's body shows signs of foul play. Inside her purse police find the ID card of a prominent local businessman, John-Henry Story, who died in a horrific flea market fire months earlier. Was the girl an illegal immigrant turning tricks? Was she murdered? The medical examiner has also asked Tempe to examine a bundle of Peruvian dog mummies confiscated by U.S. Customs. A Desert Storm veteran named Dominick Rockett stands accused of smuggling the objects into the country. Could there be some connection between the trafficking of antiquitiesand the trafficking of humans? As the case deepens, Tempe must also grapple with personal turmoil. Her daughter Katy, grieving the death of her boyfriend in Afghanistan, impulsively enlists in the Army. Meanwhile, Katy's father Pete is frustrated by Tempe's reluctance to finalize their divorce. As pressure mounts from all corners, Tempe soon finds herself at the center of a conspiracy that extends all the way from South America, to Afghanistan, and right to the center of Charlotte.","torrent":{"xt":"urn:btih:b903091be9590d6c0f288694280ec67f0a94feb2","amp;dn":"Bones+of+the+Lost","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b903091be9590d6c0f288694280ec67f0a94feb2","infoHashBuffer":{"type":"Buffer","data":[185,3,9,27,233,89,13,108,15,40,134,148,40,14,198,127,10,148,254,178]},"announce":[],"urlList":[]}}