{"title":"WAR HEROES 01-03 Mark Millar Tony Harris (2008-2009) Unfinished","uid":8254370,"size":52493302,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b933e86d92741dc719574e37095a83f9898d741d&amp;dn=WAR+HEROES+01-03+Mark+Millar+Tony+Harris+%282008-2009%29+Unfinished&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1363226710,"description":"This fills a request for Shark011. Please seed and share with our friends here on TPB!  --STFmaryville\n\n------\n\nFrom Wikipedia:\n\nWar Heroes is a six-issue limited series from Image Comics, written by Mark Millar, with art by Tony Harris.\n\nMillar has said &quot;War Heroes is everything I've been leading up to with Civil War, Ultimates, The Authority, Kick-Ass and Wanted&quot; and &quot;This is what my Ultimates 3 would have been if Bryan and I had stuck around.&quot;\n\nThe 6-issue limited series started August 2008 but as of March 2013 only three issues have been published.\n\nSet in an alternate timeline during the coalition wars in Afghanistan and Iraq, the detonation of a nuclear bomb in Washington D.C. prompts the United States administration to expand the coalition War on Terror to include Iran, as well as institute martial law in the United States. As American casualties increase, morale and public support declines with the economy, reducing America's standing in the world. Lacking the necessary recruits, the US Military boosts enlistment by distributing pills to its soldiers which confer upon them various superpowers, tipping the scale in the war.\n\nThe story focus on a group of disenchanted American con artists, who enlist in the military to steal the pills and sell them to foreign investors at $10 million before planning to desert. Initially, however, the con artists had no knowledge of the identity of their clients that they were to sell to until it was revealed to be the terrorist organization, Al-Qaeda. When one of the con artists' brother (a war hero) is taken prisoner in an attack by a super-powered member of Al-Qaeda, the con artists set about rescuing him from a public execution.","torrent":{"xt":"urn:btih:b933e86d92741dc719574e37095a83f9898d741d","amp;dn":"WAR+HEROES+01-03+Mark+Millar+Tony+Harris+%282008-2009%29+Unfinished","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b933e86d92741dc719574e37095a83f9898d741d","infoHashBuffer":{"type":"Buffer","data":[185,51,232,109,146,116,29,199,25,87,78,55,9,90,131,249,137,141,116,29]},"announce":[],"urlList":[]}}