{"title":"Xenosaga Episode 3 [Ntsc] [2-Disc], Ps2","uid":5114011,"size":6585228369,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ba33bdc0294b3df7e31d26cce0b4e49206d6504b&amp;dn=Xenosaga+Episode+3+%5BNtsc%5D+%5B2-Disc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1254961146,"description":"Xenosaga Episode 3 for the Ps2                                   Rel. 08/29/2006\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         MDS/ISO\nGenre.:        RPG\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, both game discs were tested and work. \nTry 7zip its free google it, if you don't have WinRar.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nRelease Notes - Ripped from the Original 2-Disc DVD5 Ps2 Game, burn tested on a\n                chipped Ps2 and working fine.\n\n                \n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n         &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n         &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nThe concluding chapter of the Xenosaga science fiction RPG series begins one year after the events described in the previous game. The main heroine Shion Uzuki is shocked by the discovery that implies a connection between Vector Corporation, the organization she is working for, and the Gnosis event, which set the whole story in motion. She leaves her post and tries to solve the mystery on her own. Meanwhile, the KOS-MOS project is halted, and a mysterious new android, T-elos, emerges to replace it. Shion and her friends are about to fight the ultimate battle that will determine the destiny of mankind...\n\nThe third episode retains the combat basics of the two previous games. Once again, there are two kinds of combat, in human form and piloting giant robots. The usage of ether attacks, boost gauge, and other typical Xenosaga gameplay elements are also present in this game. Robot combat is handled somewhat differently, the giant gears having a wider variety of attacks at their disposal. Both your and the enemy's parties have now a special bar that will render them immobile when filled. Exploiting this feature is yet another strategic addition to the combat.\n\nThere is an in-game database listing all events, people, items, monsters and locations. Next to the main storyline, there are 60 puzzle mini-games. The game includes an editor to create these custom puzzles and share them with friends.\n\nFeatures:\n\n* Over 8 Hours of Movies Including Voiced Cut Scenes - Pre-rendered cut scenes and \n  real-time cut scenes with dramatically enhanced models, as well as in-game  \n  voiced cut scenes with anime-style 2D portraits unveil an epic story.\n\n\n* The Exciting Conclusion to an Epic Trilogy - Building on the deeply \n  philosophical and existential storyline of the first two titles, the concluding \n  chapter in the series brings closure to the remaining mysteries in the highly \n  acclaimed story.\n\n* Updated Battle System - Battles are intuitive and fun, combining the best \n  aspects of the first two games' battles, while introducing the new Break system.\n\n* Customize Your Characters - A branching skill set promotes character \n  specialization and diversification. Strategic party management is more highly \n  rewarded, adding another level of depth to game strategy.\n\n* Money/Shops Are Back!- Buy, barter, and sell any items or equipment, allowing \n  you to upgrade your characters and E.S.s frequently.\n\n* An In-Game Database is Your Veritable &quot;Xeno Bible&quot;- An easily accessible \n  database of every detail: important events, people, items, keywords, locations, \n  weapons, back-story, phenomenon, townspeople, associations and companies.\n\n* Challenge Yourself and Friends with new Mini-games - With 60 pre-made levels to \n  complete, the Xenosaga puzzle mini-games add a new type of challenge for the \n  player, and rewards his performance. The mini-game map editor also lets players \n  create, play and share their own custom maps with friends.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x speed.\n\nUse Verbatim or Tayio Yuden DVD Media for best quality, or if other media\nisn't working.\n\n\nIf using DVD+R then booktype to DVD-ROM \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:ba33bdc0294b3df7e31d26cce0b4e49206d6504b","amp;dn":"Xenosaga+Episode+3+%5BNtsc%5D+%5B2-Disc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba33bdc0294b3df7e31d26cce0b4e49206d6504b","infoHashBuffer":{"type":"Buffer","data":[186,51,189,192,41,75,61,247,227,29,38,204,224,180,228,146,6,214,80,75]},"announce":[],"urlList":[]}}