{"title":"PNGOUTWin v1.5.0 Build 100","uid":9481646,"size":1781373,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bacefeb786b094bd0706a8a6b8bd7e2fb3fee603&amp;dn=PNGOUTWin+v1.5.0+Build+100&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NokTham","files":1,"time":1389809047,"description":"Compress images and save.\n\nOverview\n\n You can use PNGOUTWin, an easy-to-use PNG optimizer, to create smaller image files and speed up your website, reach more potential customers, and decrease your bandwidth costs. You can convert and compress to PNG from TIFF, GIF, BMP, and other formats, or optimize your existing PNG files. You may download a free trial, take a tour and view screenshots, or buy PNGOUTWin. \n \nClick for a tour! \n By making your image files smaller, PNGOUTWIN can give you \n Faster Page Loading \n Faster Downloads \n Lower Bandwidth Bills\n\n In the time it takes to rip a song from a CD--and often even less time--you can start saving time and money today! \nBest-in-class Image Compression\n\nPNGOUTWin uses proprietary algorithms that you won't find in any other software to compress images more than any other PNG optimizer. Read more about PNGOUTWin's best-in-class image compression. \nEasy and Familiar\n Now you can optimize multiple image files with the click of a button. Browse to a folder and select multiple files to convert to PNG format, or browse to a folder and compress all the images in that folder. You can drag and drop folders and files as well. Converting to png file format has never been easier. \n\nSmart Background Processing\n Manage thread priorities to for true multitasking when optimizing files. Send e-mail or read documents while compressing your files without losing the responsiveness of your PC. If you have a dedicated machine for processing a large number of image files, then you can raise the priority of the worker threads. The multithreaded architecture of PNGOUTWin is ready to exploit new processor technologies--like hyperthreading and dual core--to do more in less time. \n\nSmaller. Faster. Cheaper.\n Many businesses are already saving time and money optimizing their images with PNGOUTWin.  Purchase PNGOUTWin today, or download the free thirty-day trial of our image compression software risk free with our satisfaction guarantee.\n &lt;a href=&quot;\nhttp://s19.postimg.org/44r3bj7tv/PNGOUTwin.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/44r3bj7tv/PNGOUTwin.png&lt;/a&gt;\n","torrent":{"xt":"urn:btih:bacefeb786b094bd0706a8a6b8bd7e2fb3fee603","amp;dn":"PNGOUTWin+v1.5.0+Build+100","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bacefeb786b094bd0706a8a6b8bd7e2fb3fee603","infoHashBuffer":{"type":"Buffer","data":[186,206,254,183,134,176,148,189,7,6,168,166,184,189,126,47,179,254,230,3]},"announce":[],"urlList":[]}}