{"title":"Atom And His Package - Hair: Debatable","uid":6567310,"size":104073216,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bb61c994e170944a1d88c802d17c234c82240ced&amp;dn=Atom+And+His+Package+-+Hair%3A+Debatable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lolwutsdis","files":27,"time":1311748438,"description":"Other Torrent had no seeders, and a small handful of rum drinking, pillaging, and all around awesome pirates of the super high seas. Glad to see such enthusiasm towards Atom! If you download this torrent please seed, but also acknowledge you smell bad, are broke, have no problem cleaning blood and guts off the ship on a daily basis, and won't get laid for at least a year and a half! \nThese symptoms will fade over the course of one week after you purchase the album you are about to listen to, or three weeks after you decide you do not enjoy this album and delete it from your hard drive. The latter choice also results in herpes, leprosy, and a sharp pain in the chest area as your heart and soul attempt to find a more deserving host body. \n\nIf you plan on just stealing this album, listen to Anarchy Means I Litter, and realize your half-baked-pseudo-boycott on compensating where compensation is due makes you a pretty shitty person.\n\nThat's right bitches, guilt trip. Buy it, or I will send you post cards every Thursday afternoon with a piece of either my ear, my nose, or my pinky (Left or Right, but I do not take requests.) WILD CARD.\n\nNow would you consider my pain not worth ending for a measly $12.50 +S/H? \n\nWould you? I would, but hopefully I have made you feel guilty enough to purchase a copy, instead of giving lesser known/small/cult bands the shaft. Not cool, not cool at all. \n\nI'm on MDPV and writing all of this out helped me avoid thinking about Spider Bro, and LucyNation. Excellent.","torrent":{"xt":"urn:btih:bb61c994e170944a1d88c802d17c234c82240ced","amp;dn":"Atom+And+His+Package+-+Hair%3A+Debatable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb61c994e170944a1d88c802d17c234c82240ced","infoHashBuffer":{"type":"Buffer","data":[187,97,201,148,225,112,148,74,29,136,200,2,209,124,35,76,130,36,12,237]},"announce":[],"urlList":[]}}