{"title":"Desmond Morris - 1977 - Intimate Behavior - A Zoologist's Classi","uid":11271844,"size":2957765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb7c5c7e1492fd9099bbe4a7f5ca67891be97a89&amp;dn=Desmond+Morris+-+1977+-+Intimate+Behavior+-+A+Zoologist%27s+Classi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1414090024,"description":"Twenty-five years after it first caused a splash in the scientific and literary worlds, Intimate Behavior is still one of the best chronicles of human intimacy. With a masterful and entertaining eye, Desmond Morris, bestselling author of The Naked Ape and The Human Zoo, analyzes the roots of human intimacy, from the handshake through the twelve stages that people pass through on their way to the total sexual embrace. \n\nMorris contends that the months just before and after birth are when the seeds of intimacy are planted and are critical to development. From the loving attention of the mother, the child learns and responds with intimate gestures of his or her own. He argues that human adults follow certain patterns of intimate behaviour that are based on these infant experiences for their entire lives. \n\nIn addition to sexual intimacy, Morris discussed social intimacy, intimacy substitutes, object intimacy, and self-intimacy. Complete with a new preface by the author, Intimate Behavior is a provocative view of humans need to touch and to be touched, to love and to be loved. At a crucial moment, a gentle embrace can still do more good than a thousand earnest discussions. Despite all our social and technological advances, the primeval body language of love still remains the most potent force we have for the expression of feelings of comfort and caring. Desmond Morris, from his new Preface","torrent":{"xt":"urn:btih:bb7c5c7e1492fd9099bbe4a7f5ca67891be97a89","amp;dn":"Desmond+Morris+-+1977+-+Intimate+Behavior+-+A+Zoologist%27s+Classi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb7c5c7e1492fd9099bbe4a7f5ca67891be97a89","infoHashBuffer":{"type":"Buffer","data":[187,124,92,126,20,146,253,144,153,187,228,167,245,202,103,137,27,233,122,137]},"announce":[],"urlList":[]}}