{"title":"Forge of the Elders by L. Neil Smith","uid":9121708,"size":877258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc2c419fae8d50f6c03bf138305754eafa739008&amp;dn=Forge+of+the+Elders+by+L.+Neil+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1383147443,"description":"Just when the 21st century thought it was safe to throw Marxism on the ash heap of history once and for all, a worldwide economic collapse suddenly made freedom seem less desirable than security, and the Total State turned out to be the comeback kid. In the US, where the power elite had long shown heartfelt affection for collectivism and making the trains (nationalized, of course) run on time, communism had a second coming. Which meant that Earth was now the Red Planet. The few holdouts and counterrevolutionaries would be dealt with in good time.\nOf course, collectivization only made the worldwide depression worse. But then the People's Astronomers noticed an asteroid with unusual spectrographic properties, seemingly a treasure trove of valuable minerals that might rejuvenate the Earth's economy. So three aged NASA shuttles were pulled out of mothballs. crewed by a team of handpicked misfits whom no one would miss, and sent to the asteroid.\nHowever, someone else was there first, under an airtight canopy made by genetically engineered trees. And they weren't human, even if they were from Earth. The Elders were &quot;nautiloids,&quot; like intelligent giant squids in Volkswagen-sized shells, from a parallel universe where they were Earth's dominant species. Worst of all, they were CAPITALISTS!\nGenre: Science Fiction\n","torrent":{"xt":"urn:btih:bc2c419fae8d50f6c03bf138305754eafa739008","amp;dn":"Forge+of+the+Elders+by+L.+Neil+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc2c419fae8d50f6c03bf138305754eafa739008","infoHashBuffer":{"type":"Buffer","data":[188,44,65,159,174,141,80,246,192,59,241,56,48,87,84,234,250,115,144,8]},"announce":[],"urlList":[]}}