{"title":"Geoffrey Jones - The Oxford Handbook of Business History [2008][","uid":10091403,"size":31967131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bcc96176ad1f055ef6fe2da32d3074d82f3b88c3&amp;dn=Geoffrey+Jones+-+The+Oxford+Handbook+of+Business+History+%5B2008%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1399161848,"description":"Description\nProduct Details\nBook Title: The Oxford Handbook of Business History (Oxford Handbooks in Business &amp; Management)\t\nBook Author: Geoffrey Jones , Jonathan Zeitlin\nSeries: Oxford Handbooks in Business &amp; Management\nHardcover: 736 pages\nPublisher: Oxford University Press (March 20, 2008)\nLanguage: English\nISBN-10: 019926368X\nISBN-13: 978-0199263684\n\n===================================================================================\nBook Description\nPublication Date: March 20, 2008 | ISBN-10: 019926368X | ISBN-13: 978-0199263684\nThis Handbook provides a state-of-the-art survey of research in business history. Business historians study the historical evolution of business systems, entrepreneurs and firms, as well as their interaction with their political, economic, and social environment. They address issues of central concern to researchers in management studies and business administration, as well as economics, sociology and political science, and to historians. They employ a range of qualitative and quantitative methodologies, but all share a belief in the importance of understanding change over time.\nThe Oxford Handbook of Business History has brought together leading scholars to provide a comprehensive, critical, and interdisciplinary examination of business history, organized into four parts: Approaches and Debates; Forms of Business Organization; Functions of Enterprise; and Enterprise and Society.\nThe Handbook shows that business history is a wide-ranging and dynamic area of study, generating compelling empirical data, which has sometimes confirmed and sometimes contested widely-held views in management and the social sciences. The Oxford Handbook of Business History is a key reference work for scholars and advanced students of Business History, and a fascinating resource for social scientists in general.\n\n===================================================================================\nAbout the Series\nOxford Handbooks in Business &amp; Management bring together the world's leading scholars on the subject to discuss current research and the latest thinking in a range of interrelated topics including Strategy, Organizational Behavior, Public Management, International Business, and many others. Containing completely new essays with extensive referencing to further reading and key ideas, the volumes, in hardback or paperback, serve as both a thorough introduction to a topic and a useful desk reference for scholars and advanced students alike.\n\n===================================================================================\nReview\n&quot;The Handbook's 25 chapters (and its 88-page index) are an admirable demonstration that scholarship in business history is energetic and fruitful, and that research in the field is pushing ahead in new directions. In particular they demonstrate the growing, post-Chandlerian links between business history and adjacent disciplines such as history, economics, economic development, cultural studies and management science.&quot;--Business History News--This text refers to the Paperback edition.\n\n===================================================================================\nAbout the Author\nGeoffrey Jones is Isidor Straus Professor of Business History, Harvard Business School. He previously taught at the universities of Cambridge and Reading, and at the London School of Economics and Political Science, in Great Britain. He is the author and editor of many books and articles on the history of international business, including British Multinational Banking 1830-1990 (OUP, 1993), Merchants to Multinationals (OUP, 2000), Multinationals and Global Capitalism (OUP, 2005) and Renewing Unilever (OUP, 2005). He is a former President of both the European Business History Association and the Business History Conference of the Untied States, is co-editor of the journal Business History Review.\nJonathan Zeitlin is Professor of Sociology, Public Affairs, Political Science, and History at the University of Wisconsin-Madison in the United States where he is also Director of the Center for World Affairs and the Global Economy (WAGE) and the European Union Center of Excellence. He was previously Lecturer in Social and Economic History at Birkbeck College, London, and Research Fellow at King's College, Cambridge, in Great Britain. He is the author and editor of numerous books and articles on the comparative and historical analysis of business organization, employment relations, and socio-economic governance, most recently Local Players in Global Games: The Strategic Constitution of a Multinational Corporation (OUP, 2005). He is co-editor of the journal Socio-Economic Review, a member of the editorial board of Enterprise &amp; Society, and a former Trustee of the Business History Conference.\n===================================================================================","torrent":{"xt":"urn:btih:bcc96176ad1f055ef6fe2da32d3074d82f3b88c3","amp;dn":"Geoffrey+Jones+-+The+Oxford+Handbook+of+Business+History+%5B2008%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcc96176ad1f055ef6fe2da32d3074d82f3b88c3","infoHashBuffer":{"type":"Buffer","data":[188,201,97,118,173,31,5,94,246,254,45,163,45,48,116,216,47,59,136,195]},"announce":[],"urlList":[]}}