{"title":"DOMU - A CHILD'S DREAM (Dark Horse)","uid":9052054,"size":49460264,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bda16742f25c1ea86c863487085671aa7e73f391&amp;dn=DOMU+-+A+CHILD%27S+DREAM+%28Dark+Horse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1381879481,"description":"This one's dedicated to new pink pirate panther pancreas RobbieDee, whose Mother Sarah torrent got me all nostalgic over reading a few manga titles back before manga was cool...\n\nI'm not actually sure this is the Dark Horse version, but it's a nice quality English version so it probably is. Even so, this scan is hellaciously old. Is that a word? Hellaciously? Meh. Seed plz.  --STF\n\n---\n\nFrom Wikipedia:\n\nDOMU is a graphic novel created by Katsuhiro Otomo. Similar to his work Akira, the story centers on children possessing telekinetic powers. The manga was serialized between 1980 and 1981 and was later republished as a graphic novel in 1983. It has sold over 500,000 copies in Japan and was the first manga to win Japan's Science Fiction Grand Prix Award. It was released in English in individual volumes in 1995, compiled altogether in 1996 (reissued 2001), and was one of USA publisher Dark Horse Comics' top sellers for that year.\n\nThe main inspiration for Domu came partly from an apartment complex Otomo lived in when he first moved to Tokyo and partly from a news report he heard about a rash of suicides that occurred at a different apartment complex.\n\nIn the late 1990s, Guillermo Del Toro expressed interest in directing a film adaptation of Domu, and in 1999, Variety ran a story stating that Del Toro was preparing to direct the film for Touchstone Pictures, but the project has yet to materialize. Though Del Toro had once stated that complicated rights issues have prevented the film from being made, Otomo said in a 2006 interview that he gave Del Toro the rights to make the film. The American English translation of the graphic novel is out of print. Dark Horse Comics no longer holds the English-language rights.","torrent":{"xt":"urn:btih:bda16742f25c1ea86c863487085671aa7e73f391","amp;dn":"DOMU+-+A+CHILD%27S+DREAM+%28Dark+Horse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda16742f25c1ea86c863487085671aa7e73f391","infoHashBuffer":{"type":"Buffer","data":[189,161,103,66,242,92,30,168,108,134,52,135,8,86,113,170,126,115,243,145]},"announce":[],"urlList":[]}}