{"title":"Richard Thompson - Rumor &amp; Sigh (320kbps)","uid":6540186,"size":147552610,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bef509283c18002f7efd2a22de18289cc9d772f7&amp;dn=Richard+Thompson+-+Rumor+%26+Sigh+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mjabba","files":-1,"time":1310666660,"description":"I was surprised not to see this classic already on PB, so here's a CD Rip @320kbps. Features the hilarious Psycho Street.\n\nRumor and Sigh is an album by Richard Thompson released in 1991.\n\nThis album is one of the artistic high-points of Richard Thompsons career, and is his most commercially successful album to date. On its release it garnered the usual critical superlatives given to Thompson but sales were also healthy - helped by Capitol's commitment to promoting an artist they regarded as a prestigious signing and by Rumor And Sighs nomination for a Grammy Award in the Alternative Rock category (an award eventually won by REM).\n\nThe album represents the third collaboration between Thompson and producer Mitchell Froom. It shows Thompsons broad stylistic range to good effect, and includes what has become his best-loved song - 1952 Vincent Black Lightning. This is a tale of star-crossed lovers and the motor bike that brings them together set in a traditional English melody and structure and played in a style reminiscent of early 20th century American folk music. It is a perennial favourite with his fans and is regularly played by Thompson in concert. The song was subsequently a big hit on the bluegrass charts for Del McCoury, and has become a modern bluegrass standard, well known by musicians otherwise unfamiliar with Richard Thompson.\n\nBacklash Love Affair weds medieval horns to a piece of cod heavy-metal, Why Must I Plead combines soul with a country fiddle, and Keep Your Distance has a hurdy gurdy solo by Thompson. Thompson also takes a wry dig at himself and simultaneously pays a tribute to one of his influences in Don't Sit On My Jimmy Shands.\n\nIn a 2005 interview on South African radio station SAFM Thompson explained that the albums that he considered successful were those where the finished product most closely matched his initial concept. Rumor And Sigh, he said, was one of his most successful records by this yardstick.\n\n\nRead About Love\nI Feel So Good\nI Misunderstood\nGrey Walls\nYou Dream Too Much\nWhy Must I Plead\n1952 Vincent Black Lightning\nBacklash Love Affair\nMystery Wind\nDon't Sit On My Jimmy Shands\nKeep Your Distance\nMother Knows Best\nGod Loves A Drunk\nPsycho Street\n","torrent":{"xt":"urn:btih:bef509283c18002f7efd2a22de18289cc9d772f7","amp;dn":"Richard+Thompson+-+Rumor+%26+Sigh+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef509283c18002f7efd2a22de18289cc9d772f7","infoHashBuffer":{"type":"Buffer","data":[190,245,9,40,60,24,0,47,126,253,42,34,222,24,40,156,201,215,114,247]},"announce":[],"urlList":[]}}