{"title":"Sexually Broken--Lean Latina Lyla Storm  destroyed by cock! Epic","uid":10676891,"size":850163949,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c0132df3e49c56a9ad2932370e2594314be5ec41&amp;dn=Sexually+Broken--Lean+Latina+Lyla+Storm++destroyed+by+cock%21+Epic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1406968778,"description":"\n\n\nLean Latina Lyla Storm completely destroyed by cock! Epic brutal deepthroat, massive orgasms on BBC! | Lyla Storm | Matt Williams | Jack Hammer \n\nAugust 1, 2014\n\n\nHigh MP4 only.\n\n\nWe love Lyla. This thin brunette spitfire is a sexual animal that delivers her A game every single time. She loves the dick and holds nothing best. Not only can she fuck like a champ, she is in the top 1 percent of deepthroaters. Her drooling dedication to the dick is impressive. Today we test her ability to multi task.\n\nLyla is bound in a classic fuck me position with a twist. A custom made spreader bar is inserted between her skinny legs, preventing her from closing them. Shackled down on her back with her legs forced open wide, both ends of Lyla are completely exposed and wide open. Her always accommodating throat invites the dick and her small heart shaped pussy makes a tempting target. We simply walk right up and make full use of this slut. The drool flows out of her mouth immediately. The dick destroys her carefully made up face on the spot.\n\nThe cocks turn Lyla into a sex sandwich. We take both ends and use them hard. She cums over and over in her restrictive bondage. A giant puddle of throat lube forms under her head as we take advantage of that face pussy. The rougher we are, the more her pussy responds. Lyla was made for this sort of treatment. Her tight pussy is reshaped by massive BBC as she surrenders to her fate.\n\nBy the time we are done with this lean fucking machine, she is a fucked out bag of holes. Covered in drool, cum and sweat, hair and makeup destroyed, overloaded with multiple orgasms, this fucktoy in no way resembles the pretty porn starlet that first stepped onto the stage. We have revealed her true nature. The slut is always lurking underneath, and Sexuallybroken brings it to the surface. You are very welcome Lyla. Until next time... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/08_01lstorm6/SexuallyBroken--Lean-Latina-Lyla-Storm-completely-destroyed-by-cock-Epic-brutal-deepthroat-massive-orgasms-on-BBC.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/08_01lstorm6/SexuallyBroken--Lean-Latina-Lyla-Storm-completely-destroyed-by-cock-Epic-brutal-deepthroat-massive-orgasms-on-BBC.php&lt;/a&gt;\n\n15 000 Femdom/BDSM/Fetish torrentuploads in the box, no reason to stop now is there ? :)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)\n\n\n\n\n\n","torrent":{"xt":"urn:btih:c0132df3e49c56a9ad2932370e2594314be5ec41","amp;dn":"Sexually+Broken--Lean+Latina+Lyla+Storm++destroyed+by+cock%21+Epic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0132df3e49c56a9ad2932370e2594314be5ec41","infoHashBuffer":{"type":"Buffer","data":[192,19,45,243,228,156,86,169,173,41,50,55,14,37,148,49,75,229,236,65]},"announce":[],"urlList":[]}}