{"title":"A Girl for Satan - Satans Baby Doll","uid":4602281,"size":4302433701,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c0ae7c3192f60983b6354cb5068343e6af3dedf8&amp;dn=A+Girl+for+Satan+-+Satans+Baby+Doll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"circlensess","files":18,"time":1230286716,"description":"Country: Italy\nYear: 1982\nGenre: Horror \nFormat: DVD5\nVideo: PAL, Fullscreen 4:3\nSize: 4.00 GB\nRuntime: 82 min\nAlso Known As: A Girl for Satan (USA) (dubbed version) \nSatan's Baby Doll \nPlot Keywords: Naked Woman | Voyeur | Lesbianism | Female Nudity | Possession \n\nDirector: Mario Bianchi\nWriters: Gabriele Crisanti\nCast: Jacqueline Dupre, Mariangela Giordano, Aldo Sambrell, Marina Hedman &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0080438/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0080438/&lt;/a&gt;\n\nSummary: A woman is murdered by her drug addict husband, and (while still an attractive nude corpse lying on the slab) she manages to possess her nubile young daughter and uses her to get revenge on her husband, her husband's bent doctor (who was also her lover), her husband's crippled brother (who was ALSO a former lover), and the local priest because. . .well, he's a Catholic priest. She doesn't really NEED to possess her daughter though since she also seems to have incredible psychic abilities that among other things allow her to reanimate the dead.\n\n*******************************************************************************\n                          Satans Baby Doll     \n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: Movie\nVideo Format.........: MPEG2\nSource...............: DVD 4x3\nOriginal Format......: PAL\nGenre................: Horror\n\n-------------------------------------------------------------------------------\n                               Post Information\n-------------------------------------------------------------------------------\nPosted on............: 1982\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\n[ Release iNFO ]\n: :\nTYPE\n[x]DVD 5\n\nSOURSE\n[EU Release]\n  \nAspect ratio:\n[x] Fullscreen 4:3\n\nStandard:\n[x] PAL\n\nAudio:\n[x] Dolby Digital 2.0\n\nAudio language:\n[ ] English  [x] Italiano\n[x] German   [ ] Danish\n\nSubtitles:\n[ ] Spanish   [ ] Hebrew    [x] Bulgarian [ ] Danish\n\nVideo:\n[x] Untouched\n\nMenu:\n[x] Untouched\n\nExtras:\n[x] None\n\nRegion:\n[x]RF \n\n\nThe plot is deceptively simple: A wealthy dirtbag with a taste for smack throttles his philandering wife in a fit of rage after discovering her illicit lesbian affair with the sexy, shapely nun employed to care for the man's invalid brother. During her funeral she possesses the body of her sexy teenage daughter and over the course of the film compels the girl to bring about the deaths of everyone in the household that the woman had slept wit. Which was all of them, at one point or another, including a sinister looking butler who was apparently dabbling in the black arts down in his private little satanic shrine in the catacombs near the family crypt and somehow enabled the woman's allegiance to Lucifer.\n\nOr, something like that. Legends abound that this was originally a full-blown hardcore sex film though the only surviving prints amount to a roughly 72 minute (PAL 25fps: all known versions are PAL transfers) celebration of moods and deviancy that is deceptively tame looking. Lesbianism, necrophilia, voyeurism, incest, drug abuse, and cold-blooded murder from beyond the grave prevail as director Bianchi sets a deliberate, meditative pace that wallows in the film's ornate, Gothic trappings, all of it set to a decidedly melancholy and evocative keyboard/vocal musical score by Nico Catanese that gives it all an air of sadness that is distinctively at odds with the rather high sleaze quotient.\n\nThe cement that holds it all together is another standout method performance by Spaghetti Western veteran Aldo Sanbrell as the heroin-shooting, domineering, loyalty obsessed aristocrat who is a living portrait of rage barely controlled. One of Sanbrell's gifts as a genre actor has been to embody the sort of contained violence that is always threatening to spill over and literally murder someone ... Rumors of his tenuous grip on sanity in the real world only heighten the pleasure of watching him with veins popping at his temples &amp; sweat beading on his brow as he shakes with rage. He simply looks like a man who is capable of anything no matter how despicable, and the film's most harrowing segment turns out to be the sequence of ingeniously staged shots of him wheeling his invalid brother into the family crypt to be abandoned to sit there and rot, unable to move or even call out for help. What a guy.\n\nBetween weird, bizarrely staged killings there is sex galore, typical of the Italian &quot;male gaze&quot; oriented fantasies typified by interludes of female masturbation that are actually rather erotic for a change without being necessarily graphic. This is one of those Italian horror movies where women walk around completely naked or more modestly clothed in designer lingerie made to display the female body. Even the nun wears thigh high sheer white stockings with platform shoes more fitting for a go-go dancer than a sister of the cloth. And the bulk of the story is either set in the dank, crumbling catacombs or a marvelously ornate castle that for once is spotlessly clean, well lit, and gleaming with wealth &amp; opulence. No cluttered cobwebby Dracula hovel this time.\n\nThe one drawback that Americanized viewers may find in the film is it's deliberate and meditative pacing, which to me makes it even more soap opera like, with the widescreen camera angles filled with the trappings of an Italian film producer's idea of the good life. All the while the haunting, melancholy musical score wails on in the background making this a more advanced form of a ghost story than even something like SUSPIRIA. I wish it was even more sad and contemplative, but to each his own.","torrent":{"xt":"urn:btih:c0ae7c3192f60983b6354cb5068343e6af3dedf8","amp;dn":"A+Girl+for+Satan+-+Satans+Baby+Doll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0ae7c3192f60983b6354cb5068343e6af3dedf8","infoHashBuffer":{"type":"Buffer","data":[192,174,124,49,146,246,9,131,182,53,76,181,6,131,67,230,175,61,237,248]},"announce":[],"urlList":[]}}