{"title":"The Smurfs (2011) The Smurfs 2 (2013) BRRIP 1080P NO CINAVIA","uid":10307230,"size":5159094129,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:c0b0842ae767029b8aed03ced296fd6510573c87&amp;dn=The+Smurfs+%282011%29+The+Smurfs+2+%282013%29+BRRIP+1080P+NO+CINAVIA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jmanwf","files":15,"time":1402147050,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0472181/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0472181/&lt;/a&gt;\n\n\n\nStoryline\n\nWhen the evil wizard Gargamel chases the tiny blue Smurfs out of their village, they tumble from their magical world and into ours -- in fact, smack dab in the middle of Central Park. Just three apples high and stuck in the Big Apple, the Smurfs must find a way to get back to their village before Gargamel tracks them down. \n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2017020/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2017020/&lt;/a&gt;\n\n\n\nStoryline\n\nThe evil wizard Gargamel creates a couple of mischievous Smurf-like creatures called the Naughties that he hopes will let him harness the all-powerful, magical Smurf-essence. But when he discovers that only a real Smurf can give him what he wants, and only a secret spell that Smurfette knows can turn the Naughties into real Smurfs, Gargamel kidnaps Smurfette and brings her to Paris, where he has been winning the adoration of millions as the worldÂ¹s greatest sorcerer. It's up to Papa, Clumsy, Grouchy, and Vanity to return to our world, reunite with their human friends Patrick and Grace Winslow, and rescue her! Will Smurfette, who has always felt different from the other Smurfs, find a new connection with the Naughties Vexy and Hackus or will the Smurfs convince her that their love for her is True Blue?\n\n\n\nAlso Includes:\n\n\nThe Smurfs: A Christmas Carol (2011) \n\n\nStoryline\n\nAt Christmas, Grouchy Smurf behaves badly to everyone and it takes the Ghosts of Christmas Past, Present and Future to teach him to appreciate Christmas.\n\n\nThe Smurfs: The Legend of Smurfy Hollow (2013) \n\n\nStoryline\n\nWhen Brainy Smurf is favored to win the annual Smurfberry Hunt for the ninth year in a row, Gutsy Smurf sets out to discover how Brainy wins every year. Gutsy?s investigation takes him into spooky Smurfy Hollow?and right into Gargamel?s trap! Can Brainy and Gutsy, with the help of Smurfette, put aside their rivalry before Gargamel captures them?or worse, they come face-to-face with the legenda.\n\n","torrent":{"xt":"urn:btih:c0b0842ae767029b8aed03ced296fd6510573c87","amp;dn":"The+Smurfs+%282011%29+The+Smurfs+2+%282013%29+BRRIP+1080P+NO+CINAVIA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b0842ae767029b8aed03ced296fd6510573c87","infoHashBuffer":{"type":"Buffer","data":[192,176,132,42,231,103,2,155,138,237,3,206,210,150,253,101,16,87,60,135]},"announce":[],"urlList":[]}}