{"title":"BUTT Nurse 3","uid":4999338,"size":340092803,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c1459a103b48c8e586b80eb7b2e6647b8dcf22df&amp;dn=BUTT+Nurse+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kezzy7","files":-1,"time":1247438296,"description":"This time it is a house call. Once again this fellow is sick with tummy aches and the Dr. sent the nurses to help him out. It begins with a regular exam but when it is time for a rectal temperature taking he decides to give the nurse a hard time. She warned him before about a good spanking if he gave them a hard time. Without a word he is turned over the nurses knee and given a hard bare bottom spanking until his bottom is bright red. Then his temperature is taken rectally he is also given a rectal exam with one and 2 finger insertions. They fine he is constipated so first he is given a castor oil enema. Once again he gives the nurses a hard time. He is paddled this time with a large round wooden paddle after his bottom is stretched and reamed open with inflatable butt plugs and dildos. When one nurse leaves the room the other decides she is going to teach this guy a lesson. She tells him he needs more anal lubricating and reaming so she takes out a large strap on dildo and gives him a reaming, fucking, lubrication he will never forget. His ass is taken while on his back, with his ass in the air she pile drives this dildo deep in his ass, teaching him a lesson and at the same time helping his tummy ache.","torrent":{"xt":"urn:btih:c1459a103b48c8e586b80eb7b2e6647b8dcf22df","amp;dn":"BUTT+Nurse+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1459a103b48c8e586b80eb7b2e6647b8dcf22df","infoHashBuffer":{"type":"Buffer","data":[193,69,154,16,59,72,200,229,134,184,14,183,178,230,100,123,141,207,34,223]},"announce":[],"urlList":[]}}