{"title":"The African American Encounter with Japan and China","uid":6518160,"size":1495165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1d5a7aef91d4bfb2a011e9484b0102d591bc3be&amp;dn=The+African+American+Encounter+with+Japan+and+China&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1309900755,"description":"Marc Gallicchio, &quot;The African American Encounter with Japan and China: Black Internationalism in Asia, 1895-1945&quot;\n Publisher: The University of North Carolina Press | 2000 | ISBN: 0807848670 | PDF | 280 pages | 2 MB\n\n In the first book to focus on African American attitudes toward Japan and China, Marc Gallicchio examines the rise and fall of black internationalism in the first half of the twentieth century. This daring new approach to world politics failed in its effort to seek solidarity with the two Asian countries, but it succeeded in rallying black Americans in the struggle for civil rights.\n Black internationalism emphasized the role of race or color in world politics and linked the domestic struggle of African Americans with the freedom struggle of emerging nations &quot;of color,&quot; such as India and much of Africa. In the early twentieth century, black internationalists, including W. E. B. Du Bois and Marcus Garvey, embraced Japan as a potential champion of the darker races, despite Japan's imperialism in China. After Pearl Harbor, black internationalists reversed their position and identified Nationalist China as an ally in the war against racism.\n In the end, black internationalism was unsuccessful as an interpretation of international affairs. The failed quest for alliances with Japan and China, Gallicchio argues, foreshadowed the difficulty black Americans would encounter in seeking redress for American racism in the international arena.","torrent":{"xt":"urn:btih:c1d5a7aef91d4bfb2a011e9484b0102d591bc3be","amp;dn":"The+African+American+Encounter+with+Japan+and+China","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1d5a7aef91d4bfb2a011e9484b0102d591bc3be","infoHashBuffer":{"type":"Buffer","data":[193,213,167,174,249,29,75,251,42,1,30,148,132,176,16,45,89,27,195,190]},"announce":[],"urlList":[]}}