{"title":"Tears For Fears - Songs From The Big Chair (MFSL) [FLAC]","uid":5241996,"size":416783309,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c475ae44aedc6a6b2556ce3f261aa5f996ce1c1e&amp;dn=Tears+For+Fears+-+Songs+From+The+Big+Chair+%28MFSL%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WhoAreU2","files":20,"time":1261812442,"description":"Tears For Fears - Songs From The Big Chair (MFSL UDCD730) [FLAC]\n\n\n1. Shout\n2. Working Hour\n3. Everybody Wants to Rule the World\n4. Mothers Talk\n5. I Believe\n6. Broken\n7. Head over Heels/Broken [Live]\n8. Listen\n9. Shout [Extended Mix][*]\n10. Everybody Wants to Rule the World [Extended Mix][*]\n11. Head over Heels *Not MFSL \n\n&quot;Songs From the Big Chair&quot; is the album that catapulted Curt and Roland into the international consciousness and captured them a place in music history.\n\nBig Chair gave TFF two #1 hits, one for the primal &quot;Shout&quot; and the second for the pop perfection of &quot;Everybody Wants to Rule the World&quot;. My personal favorite on the album is the dark and thrashing combo of &quot;Broken&quot; and &quot;Head Over Heels/Broken (Live)&quot;, which is every bit as good as the chart topping singles. Other standout tracks include &quot;The Working Hour&quot;, &quot;Mother's Talk&quot; (which also placed on the charts) and &quot;I Believe&quot;. All of the eight original songs are of exceptional quality, and highlight the songwriting and vocal talents of these two young artists. The remastered version also offers an additional seven bonus tracks, which aren't strictly necessary, but add a great glimpse into their creative process. Even if they're not up to the level of the original cuts, the bonuses are definitely enjoyable to listen to, and I'm not one to complain about getting extra TFF music.\n\nOverall Big Chair is a phenomenal release from a pair of artists whose angst and raw energy permeates their work. It's unfortunate that this is the only Tears for Fears album that receives significant attention, as their entire catalogue is of exceptional quality. This is one of those rare albums that is able to transcend its origins ('80's pop), and it belongs on any list of all time classic albums. ","torrent":{"xt":"urn:btih:c475ae44aedc6a6b2556ce3f261aa5f996ce1c1e","amp;dn":"Tears+For+Fears+-+Songs+From+The+Big+Chair+%28MFSL%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c475ae44aedc6a6b2556ce3f261aa5f996ce1c1e","infoHashBuffer":{"type":"Buffer","data":[196,117,174,68,174,220,106,107,37,86,206,63,38,26,165,249,150,206,28,30]},"announce":[],"urlList":[]}}