{"title":"Anne of the Thousand Days  (1969 - Henry VIII)","uid":6847384,"size":734099502,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c47cfcf312f2a467f14042f458dfa7de03dab053&amp;dn=Anne+of+the+Thousand+Days++%281969+-+Henry+VIII%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rosie1966","files":2,"time":1322399685,"description":"\n&quot;Anne of the Thousand Days&quot; is a sympathetic account of the rise and fall of the beautiful and ambitious Anne Boleyn (Genevieve Bujold) who becomes the second wife of the tyrannical King Henry VIII (Richard Burton.) Engaged to another man, Anne attempts to avoid to the king's attention and refuses to become his mistress, but her betrothal is broken-off by Henry's corrupt but brilliant chief minister (Anthony Quayle.) Vowing vengeance, Anne returns to Court, where Henry eventually proposes marriage and promises to divorce his aging Spanish wife (Irene Papas.) Anne accepts and soon becomes the most powerful and wealthiest woman in the country, rewarding her allies and punishing her enemies. After some years, she and Henry finally marry, but her world slowly begins to collapse when she fails to give birth to the son her husband so desperately wants and he openly flaunts his mistresses in her face. Anne's enemies move against her, concocting a sensational set of lies to destroy her and they triumph in a brutally unfair show-trial which ends Anne's thousand day reign as queen of England. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c47cfcf312f2a467f14042f458dfa7de03dab053","amp;dn":"Anne+of+the+Thousand+Days++%281969+-+Henry+VIII%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c47cfcf312f2a467f14042f458dfa7de03dab053","infoHashBuffer":{"type":"Buffer","data":[196,124,252,243,18,242,164,103,241,64,66,244,88,223,167,222,3,218,176,83]},"announce":[],"urlList":[]}}