{"title":"Multicriteria Analysis and LCA Techniques","uid":6534808,"size":1706752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c47febd1cf313336f0bbe40cdd33d8d3674e419c&amp;dn=Multicriteria+Analysis+and+LCA+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1310431186,"description":"Lucia Recchia, Paolo Boncinelli, Enrico Cini, Marco Vieri, Francesco Garbati Pegna, Daniele Sarri, &quot;Multicriteria Analysis and LCA Techniques: With Applications to Agro-Engineering Problems&quot; \n Sp ng er | 2011 | ISBN: 0857297031 | 352 pages | PDF | 1.62 MB \n\n Multicriteria Analysis and LCA Techniques introduces the reader to the basic principles of multicriteria analysis (MCA) and life cycle assessment (LCA) techniques. The use of these tools is rapidly becoming essential in any feasibility study for comparing different solutions, selecting the most suitable ones, and for analyzing the interface of economy and environment.\n\n The main feature of Multicriteria Analysis and LCA Techniques is the application of a new approach to the analysis of energy balance and environmental impact of agro-industrial production chains. It gives detailed descriptions of a number of food and non-food agro-industrial applications of MCA and LCA, thereby providing the reader with practical examples of the implementation of these tools in the field of agro-industry.\n\n Multicriteria Analysis and LCA Techniques represents a subsidiary reference book for both undergraduate and graduate students, and can also be used for basic or applied academic research.","torrent":{"xt":"urn:btih:c47febd1cf313336f0bbe40cdd33d8d3674e419c","amp;dn":"Multicriteria+Analysis+and+LCA+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c47febd1cf313336f0bbe40cdd33d8d3674e419c","infoHashBuffer":{"type":"Buffer","data":[196,127,235,209,207,49,51,54,240,187,228,12,221,51,216,211,103,78,65,156]},"announce":[],"urlList":[]}}