{"title":"Singles 1992 (Soundtrack) [FLAC] - Kitlope","uid":6016933,"size":440760728,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c48ef7541336b437e3d4c5aa70297fcb2dd8fb26&amp;dn=Singles+1992+%28Soundtrack%29+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Kitlope","files":16,"time":1291663280,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V0.99 prebeta 5\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: C48EF7541336B437E3D4C5AA70297FCB2DD8FB26\nFile Size: 420.34 MB\nYear: 1992\nLabel: Epic Soundtrax\nCatalog #: EK 52476\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nSingles is a 1992 American romantic comedy film written, co-produced, and directed by Cameron Crowe. The film stars Bridget Fonda, Campbell Scott, Kyra Sedgwick, and Matt Dillon.\n\nSingles centers on the lives of a group of young people, mostly in their 20s, living in an apartment block in Seattle, Washington, and is divided into chapters. It focuses on the course of two couples' rocky romances, as well as the love lives of their friends and associates. The film stars Bridget Fonda as a coffee-bar waitress fawning over an aspiring musician (Matt Dillon) and Kyra Sedgwick and Campbell Scott as a couple wavering on whether to commit to each other. The events of the film are set against the backdrop of the early 1990s grunge movement in Seattle. \n\n\n\n\n\n\n\nSingles - Original Motion Picture Soundtrack 1992\n\n\nThe Singles soundtrack was released on June 30, 1992 through Epic Records and became a best seller three months before the release of the film. The soundtrack included music from key bands from the Seattle music scene of the time, such as Alice in Chains, Pearl Jam, and Soundgarden. Pearl Jam released two songs on the soundtrack: &quot;Breath&quot; and &quot;State of Love and Trust&quot;. The Soundgarden song &quot;Birth Ritual&quot; and Chris Cornell's solo song &quot;Seasons&quot; appear on the soundtrack. Paul Westerberg of The Replacements contributed two songs to the soundtrack and provided the score for the film. The Smashing Pumpkins also contributed to the soundtrack with the song &quot;Drown&quot;.\n\nNirvana (who had gained major success a year earlier with the multiplatinum record Nevermind) was the only major grunge band of the time to not appear on the soundtrack. During production, Nirvana were not yet national stars, but by the time the soundtrack was released, the band's song &quot;Smells Like Teen Spirit&quot; had to be cut because it was too costly to buy the rights.\n\nThe soundtrack is considered to have helped open the door to the explosive popularity of Seattle grunge in the early 1990s. According to Steve Huey of Allmusic, &quot;Singles helped crystallize the idea of the 'Seattle scene' in the mainstream public's mind, and it was also one of the first big-selling '90s movie soundtracks (it went platinum and reached the Top Ten) to feature largely new work from contemporary artists...it's a milestone in the breakthrough of alternative rock into mainstream popular culture, neatly and effectively packaging the Seattle phenomenon for the wider national consciousness.&quot;\n\n\nTracks: \n\n\n\n1.\t&quot;Would?&quot;  Alice in Chains\n2.\t&quot;Breath&quot;  Pearl Jam\n3.\t&quot;Seasons&quot;  Chris Cornell\n4.\t&quot;Dyslexic Heart&quot;  Paul Westerberg\n5.\t&quot;The Battle of Evermore&quot;  The Lovemongers\n6.\t&quot;Chloe Dancer/Crown of Thorns&quot;  Mother Love Bone\n7.\t&quot;Birth Ritual&quot;  Soundgarden\n8.\t&quot;State of Love and Trust&quot;  Pearl Jam\n9.\t&quot;Overblown&quot;  \tMudhoney\n10.\t&quot;Waiting for Somebody&quot;  Paul Westerberg\n11.\t&quot;May This Be Love&quot;  \tJimi Hendrix\n12.\t&quot;Nearly Lost You&quot;  Screaming Trees\n13.\t&quot;Drown&quot;  Smashing Pumpkins\n\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:c48ef7541336b437e3d4c5aa70297fcb2dd8fb26","amp;dn":"Singles+1992+%28Soundtrack%29+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c48ef7541336b437e3d4c5aa70297fcb2dd8fb26","infoHashBuffer":{"type":"Buffer","data":[196,142,247,84,19,54,180,55,227,212,197,170,112,41,127,203,45,216,251,38]},"announce":[],"urlList":[]}}