{"title":"Prince - The Gold Experience (1995).flac by JuleBox","uid":4202403,"size":535437801,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c53ee1ed676a3c2b9a18f2e6f7aa57a3d5d6988d&amp;dn=Prince+-+The+Gold+Experience+%281995%29.flac+by+JuleBox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SergioPlayboy","files":34,"time":1211574704,"description":"Prince changed his name to an unpronounceable symbol in 1993, but it wasn\\\\\\&amp;#039;t until 1995 that he actually released a record credited to that symbol. During those two years, he released a greatest-hits collection, an official version of his much-bootlegged Black Album, and a final Prince album, the lackluster Come. Throughout 1994, he pressured Warner to release another album, The Gold Experience, but the company refused and he staged a public protest in the media, calling himself a slave to the label. By the summer of 1995, the artist and the company had made amends and the record was released in the fall. In a way, The Gold Experience lives up to the manufactured hype created while it languished on the shelf. More of a creative rebirth than a change in direction, the record finds Prince and the New Power Generation running through a typically dazzling array of musical styles, subtly twisting new sounds out of familiar forms. Much like The Love Symbol Album, it follows a loose concept, interweaving a variety of pop, funk, rock, soul, and jazz styles into a vague story. Song for song, The Gold Experience is slightly stronger than its predecessor, as Prince\\\\\\&amp;#039;s melodies are more immediate, especially on the Philly soul tribute \\\\\\&quot;The Most Beautiful Girl in the World\\\\\\&quot; and the pure pop of \\\\\\&quot;Dolphin.\\\\\\&quot; Also, the band\\\\\\&amp;#039;s performance is lively and confident, bringing an effortless virtuosity to funk workouts (\\\\\\&quot;P Control\\\\\\&quot;), and fuzzed-out rockers (\\\\\\&quot;Endorphinmachine\\\\\\&quot;), as well as ballads like \\\\\\&quot;Eye Hate U.\\\\\\&quot; The Gold Experience is somewhat weighed down by interludes that attempt to further the story but wind up interrupting the flow of the music, yet that doesn\\\\\\&amp;#039;t stop the album from being Prince\\\\\\&amp;#039;s most satisfying effort since Sign O\\\\\\&amp;#039; the Times.\n\nStephen Thomas Erlewine, AMG\n\n\n\nEAC Log, Cue &amp; Complete Artwork Included.\n\nEnjoy! ","torrent":{"xt":"urn:btih:c53ee1ed676a3c2b9a18f2e6f7aa57a3d5d6988d","amp;dn":"Prince+-+The+Gold+Experience+%281995%29.flac+by+JuleBox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c53ee1ed676a3c2b9a18f2e6f7aa57a3d5d6988d","infoHashBuffer":{"type":"Buffer","data":[197,62,225,237,103,106,60,43,154,24,242,230,247,170,87,163,213,214,152,141]},"announce":[],"urlList":[]}}