{"title":"The Taste of War by Lizzie Collingham.epub","uid":8864151,"size":3944691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c549a2194885835f55954286b699fb5c81965c1b&amp;dn=The+Taste+of+War+by+Lizzie+Collingham.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":1,"time":1377855673,"description":"The Taste of War: World War II and the Battle for Food\n\nBy Lizzie Collingham\nPublished by Penguin Group in 2012\nTags: nonfiction, food &amp; drink, war, world war 2\nEPUB, Retail, 656 pages, English (1594203296)\n\nA New York Times Notable Book of 2012\n\nFood, and in particular the lack of it, was central to the experience of World War II. In this richly detailed and engaging history, Lizzie Collingham establishes how control of food and its production is crucial to total war. How were the imperial ambitions of Germany and Japan - ambitions which sowed the seeds of war - informed by a desire for self-sufficiency in food production? How was the outcome of the war affected by the decisions that the Allies and the Axis took over how to feed their troops? And how did the distinctive ideologies of the different combatant countries determine their attitudes towards those they had to feed?\n\nTracing the interaction between food and strategy, on both the military and home fronts, this gripping, original account demonstrates how the issue of access to food was a driving force within Nazi policy and contributed to the decision to murder hundreds of thousands of 'useless eaters' in Europe. Focusing on both the winners and losers in the battle for food, The Taste of War brings to light the striking fact that war-related hunger and famine was not only caused by Nazi Germany and Imperial Japan, but was also the result of Allied mismanagement and neglect, particularly in India, Africa and China.\n\nAmerican dominance both during and after the war was not only a result of the United States' immense industrial production but also of its abundance of food. This book traces the establishment of a global pattern of food production and distribution and shows how the war subsequently promoted the pervasive influence of American food habits and tastes in the post-war world. A work of great scope, The Taste of War connects the broad sweep of history to its intimate impact upon the lives of individuals. ","torrent":{"xt":"urn:btih:c549a2194885835f55954286b699fb5c81965c1b","amp;dn":"The+Taste+of+War+by+Lizzie+Collingham.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c549a2194885835f55954286b699fb5c81965c1b","infoHashBuffer":{"type":"Buffer","data":[197,73,162,25,72,133,131,95,85,149,66,134,182,153,251,92,129,150,92,27]},"announce":[],"urlList":[]}}