{"title":"Lynn Hunt (ed.) - The Invention of Pornography, 1500-1800","uid":10238381,"size":24187499,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5dcbb1f42b7cbdbed4b6f06203cd7ca83f9dfce&amp;dn=Lynn+Hunt+%28ed.%29+-+The+Invention+of+Pornography%2C+1500-1800&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1401215087,"description":"\nLynn Hunt, ed. - THE INVENTION OF PORNOGRAPHY, 1500-1800: Obscenity and the Origins of Modernity (Zone Books, 1996).\n\nISBN: 9780942299694 | 412 pages | PDF\n\n\nIn this groundbreaking collection of nine essays, historians and literary theorists examine how, between 1500 and 1800, pornography emerged as a literary practice and a category of knowledge intimately linked to the formative moments of Western modernity and the democratization of culture.  \n\nThe first modern writers and engravers of pornography were part of the demimonde of heretics, freethinkers, and libertines who constituted the dark underside of the Renaissance, the Scientific Revolution, the Enlightenment, and the French Revolution.  From the start, early modern European pornography used the shock of sex to test the boundaries and regulation of obscene behavior and expression in the public and private sphere.  As such, pornography criticized and even subverted political authorities as well as social and sexual relations.\n\nThe book is replete with drawings representing the originals found in the press of the period under discussion, and contains an extensive bibliography and notes.\n\n\nReviews\n\n&quot;These absorbing and beautifully researched essays, together with Lynn Hunt's masterful introduction, give a new history to erotic writing and the representation of sexual action.&quot; -- Natalie Zemon Davis\n\n&quot;A fiercely intelligent and provocative collection that provides new insights into both the origins of modern pornography and the dynamics of cultural modernity.&quot; -- The New York Times\n\n\n* * For other works on the history of pornography, please see\n\nJulie Peakman - Mighty Lewd Books: Development of Pornography in 18-Century England &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8212984/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8212984/&lt;/a&gt;\n\nLisa Z. Sigel, ed. - International Exposure: Perspectives on Modern European Pornography &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8360561/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8360561/&lt;/a&gt;\n\nDeana Heath - Purifying Empire: Obscenity and the Politics of Moral Regulation &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8375900/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8375900/&lt;/a&gt;\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                           &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:c5dcbb1f42b7cbdbed4b6f06203cd7ca83f9dfce","amp;dn":"Lynn+Hunt+%28ed.%29+-+The+Invention+of+Pornography%2C+1500-1800","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5dcbb1f42b7cbdbed4b6f06203cd7ca83f9dfce","infoHashBuffer":{"type":"Buffer","data":[197,220,187,31,66,183,203,219,237,75,111,6,32,60,215,202,131,249,223,206]},"announce":[],"urlList":[]}}