{"title":"Classic Popeye #1-4 (2012) [IDW] (GreenGiant-DCP)","uid":7839911,"size":200531489,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c5e3bfdba0cf2b3987562cab98eb5238cd920b9d&amp;dn=Classic+Popeye+%231-4+%282012%29+%5BIDW%5D+%28GreenGiant-DCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackcanary","files":-1,"time":1353315345,"description":"English | CBR | 4 Issues\n\nClassic Popeye #1-4 (2012)\nPublisher:  IDW Publishing\nPublication Date:  August 15, 2012 - November 14, 2012\n\nClassic Popeye #1\nRepresenting the classic Popeye #1 from 1948 by Bud Sagendorf! This collector's item begins a reprinting of the complete Sagendorf's Popeye comic book series, nearly 100 issues long! Carefully reproduced from the original comic books and lovingly restored. Eat your spinach!\n\nPopeye Classics #2\nClassic Popeye stories by Bud Sagendorf, the long-time assistant to Popeye's creator E.C. Segar, are back! A meticulously faithful reprint of Popeye #2 from May-June 1948 includes a long rousing action-packed story &quot;That's What I Yam&quot; starring Popeye and Swee'pea and a howler comic &quot;Easy Money&quot; Starring Popeye and his Pappy. Plus you'll find those glorious Sagendorf one-pagers in the cartoonist's gloriously funny writing and drawing style! Sagendorf comics are great comics!\n\nPopeye Classics #3\nIs this a horror comic or a humor comic? Chills or chuckles?! You'll have to decide when you read what its great cartoonist Bud Sagendorf described as &quot;a mysterious mystery entitled 'Ghost Island!' An amphibious tale of phantoms and monsters of the darkness-starring POPEYE!&quot; But wait, there's more! Bud introduces a second story by penning these words: &quot;Thimble Theater presents a heart-warming homespun tale of pugilistic love entitled SMASH!&quot; This arf-filled issue of vintage One-Eyed Sailor, Olive Oyl and Swee'pee comics also includes the usual wonderful Sagendorf one-pagers and a very special way-cool map of Popeye's adventures.\n\nPopeye Classics #4\nIs that a cool cover or WHAT?!? And the insides of this comical comic comic are every bit as awesome! The first story, &quot;Dead Valley,&quot; has plenty of Popeye's twister-sock punches Old West Style. And the second story, &quot;Gift from Uncle Ben,&quot; features a fantastical and funny creature called a Zoop that will delight fans of the Jeep and the Wiffle Bird! Plus, three boffo one-eyed sailor one pagers--all by The World's Greatest Popeye Cartoonist, Bud Sagendorf!","torrent":{"xt":"urn:btih:c5e3bfdba0cf2b3987562cab98eb5238cd920b9d","amp;dn":"Classic+Popeye+%231-4+%282012%29+%5BIDW%5D+%28GreenGiant-DCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5e3bfdba0cf2b3987562cab98eb5238cd920b9d","infoHashBuffer":{"type":"Buffer","data":[197,227,191,219,160,207,43,57,135,86,44,171,152,235,82,56,205,146,11,157]},"announce":[],"urlList":[]}}