{"title":"What is the name of this book? (gnv64)","uid":7122582,"size":9144734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7f8780b1396fb5e0c0469b04922505aa3a3e8d0&amp;dn=What+is+the+name+of+this+book%3F+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1332412714,"description":"What Is the Name of This Book? - The Riddle of Dracula and Other Logical Puzzles\nBy Raymond M. Smullyan\nPrentice-Hall | 1978 | ISBN 0-13-955088-7 | 241 pages | DJVU/PDF | 1.32/7.39 mb\nPDF conversion is mine\n\nThis is an entertaining menagerie of over 200 mind-bending logical puzzlers, paradoxes, and diversions!\nPresented in a lively conversational style with anecdotes and whimsical illustrations interspersed throughout, this fascinating group of riddles challenges your reasoning powers and common sense.\nBeginning with fun-filled monkey tricks and classic brain teasers with devilish new twists, Raymond Smullyanhighly respected Professor of Mathematical Logic and professional magician guides you through a logical labyrinth to more complex, challenging problems that delve into some of the deepest paradoxes of logic and set theory, including Godel's revolutionary theorem of undecidability.\nA host of engaging characters-ranging from Wonderland's Alice, the Jabberwocky, Tweedledee and Tweedledum, to Inspector Craig of Scotland Yard, Dracula, werewolves, and even zombies-present the problems in a lively, captivating manner. Detailed solutions to these puzzlers are given at the end of each chapter or, for the most challenging problems, the explanations follow immediately. A highly entertaining, but important contribution to modern logical thought, WHAT IS THE NAME OF THIS BOOK? is guaranteed to delight, intrigue, and sometimes perplex individuals who just plain love to stretch their minds!\n\nAbout the Author\nBorn in New York City, Raymond Smullyan received his M.S. at the University of Chicago and his Ph.D. at Princeton University. He has taught at Dartmouth, Princeton, and is currently on the faculty of l.ehman College, New York, N. Y. In addition to being a Professor of Mathematical Logic, he has performed as a professional magician. The author of books of his own including THE TAO IS SILENT, he has also contributed to collective works on mathematics and is a contributor to Scientific American and other magazines.\n\nCONTENTS\nPart One. LOGICAL RECREATIONS\n1. Fooled?\n2. Puzzles and Monkey Tricks\n3. Knights and Knaves\n4. Alice in the Forest o f Forgetfulness 3\nPart Two. PORTIA'S CASKETS AND OTHER MYSTERIES\n5. The Mystery of Portia's Caskets\n6. From the Files of lnspector Craig\n7. How to Avoid Werewolves And Other Practical Bits of Advice\n8. Logic Puzzles 99\n9. Bellini or Cellini?\nPart Three - WEIRD TALES\n10. The Island of Baal\n11. The Island of Zombies\n12. Is Dracula Still Alive?\nPart Four. LOGIC IS A MANY-SPLENDORED THING\n13. Logic and Life\n14. How to Prove Anything\n15. From Paradox to Truth\n16. Godel's Discovery","torrent":{"xt":"urn:btih:c7f8780b1396fb5e0c0469b04922505aa3a3e8d0","amp;dn":"What+is+the+name+of+this+book%3F+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f8780b1396fb5e0c0469b04922505aa3a3e8d0","infoHashBuffer":{"type":"Buffer","data":[199,248,120,11,19,150,251,94,12,4,105,176,73,34,80,90,163,163,232,208]},"announce":[],"urlList":[]}}