{"title":"Simon &amp; Garfunkel - Sounds of Silence (Remastered) [RePoPo]","uid":4455051,"size":441728207,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c7fba120de757689f25ca555b939c5f8e35b93a6&amp;dn=Simon+%26+Garfunkel+-+Sounds+of+Silence+%28Remastered%29+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"repopo","files":-1,"time":1224439794,"description":"*******************************************************************************\n           Simon &amp; Garfunkel - Sounds of Silence (Rematered) (1964)\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\n\nSimon &amp; Garfunkel - Sounds Of Silence\n\n01.- The Sound Of Silence  [03:09]\n02.- Leaves that Are Green  [02:24]\n03.- Blessed  [03:17]\n04.- Kathy's Song  [03:21]\n05.- Somewhere They Can't Find Me  [02:38]\n06.- Angie  [02:18]\n07.- Richard Cory  [02:59]\n08.- A Most Peculiar Man  [02:33]\n09.- April Come She Will  [01:52]\n10.- We've Got a Groovy Thing Goin'  [02:00]\n11.- I Am a Rock  [02:59]\n12.- Blues Run the Game  [02:55]\n13.- Barbriallen (Demo)  [04:06]  **\n14.- Rose of Aberdeen (Demo)  [02:02]  **\n15.- Roving Gambler (Demo)  [03:03]  **\n\n** = BONUS TRACKS, exclusive to this release\n\n\nOriginally Released on 1966.  This remastered version, which includes three \nbonus tracks was Released on August 21st, 2001.\n\nRipped with EAC, creating a .cue/.wav audio file, preserving the CD structure,\ngaps and volume levels as in the original CD.\n\n\n-------------------------------------------------------------------------------\nAlbum Review by Bruce Eder\n\nSimon &amp; Garfunkel's second album was a radical departure from their first, owing \nto its being recorded in the wake of &quot;The Sound of Silence,&quot; with its overdubbed \nelectric instrument backing, topping the charts. Paul Simon arrived with a large \nsong-bag, enhanced by his stay in England over the previous year and his \nexposure to English folk music, and the duo rushed into the studio to come up \nwith ten more songs that would fit into the folk-rock context of the single. The \nresult was this, their most hurried and uncharacteristic album -- Simon and Art \nGarfunkel had to sound like something they weren't, surrounded on many cuts by \namplified folk-rock-style guitar, electric piano, and even horns. Much of the \nmaterial came from The Paul Simon Songbook, an album that Simon had recorded for \nBritish CBS during his stay in England, some parts of it more radically altered \nthan others. The record was a rushed job overall, and apart from the title \ntrack, the most important songs here were also, oddly enough, among the least \nenduring, &quot;I Am a Rock&quot; and &quot;Richard Cory&quot; -- the former for establishing the \nduo (and Simon as a songwriter) as confessional pop-poets, sensitive and \nalienated post-adolescents that endeared them to millions of college students \ngoing through what later came to be called an &quot;identity crisis&quot;; and the latter \nfor endearing them to thousands of high-school English teachers with its \nadaptation of Edward Arlington Robinson's poem.\n\n-------------------------------------------------------------------------------\n                      AllMusicGuide Track-by-track Review\n-------------------------------------------------------------------------------\n\nTHE SOUND OF SILENCE\n\nPaul Simon was a Brill Building demo singer as a teenager and, like the Beatles, \nwas heavily under the spell of the famous harmonies of the Everly Brothers. \nSimon and his high school buddy, the classically trained musician Art Garfunkel, \neven formed a teenage duo, Tom and Jerry, that was modeled after the Everlys. \nBut like a lot of other ambitious songwriters in the '60s, Simon soon fell sway \nto the remarkable abilities of Bob Dylan. And again, like the Beatles, Simon \nsought to merge his Brill-trained classic rock &amp; roll and pop tendencies to the \nnewly wide-open lyrical scope of Dylan. And Dylan himself met the popsters \nhalfway, famously going electric soon after seeing the Fab Four and watching the \nByrds score even bigger hits than he did with electrified versions of his songs. \nIt was a heady era for pop music; soon anything and everything was fair game for \nsubject matter and rock &amp; roll songwriters were starting to be taken seriously \nas artists.\n\nWhile we all would agree that this was mostly a good thing, the charts soon \nbecame littered with overly ambitious and ill-informed protest songs and \nself-consciously &quot;literate&quot; clunkers that fell short of the mark. While &quot;Sound \nof Silence&quot; is ultimately saved from being among the latter, Simon does seem to \nbe reaching like a college freshman English major with &quot;hey, look at me!&quot; lines \nlike, &quot;the words of the prophets were written on the subway walls,&quot; and &quot;but my \nwords, like silent raindrops fell.&quot; Simon seems to desire the same prophetic \nvoice of authority that Dylan confidently exhibited in songs like &quot;A Hard Rain's \nA-Gonna Fall.&quot; But as a great song should, &quot;Sound of Silence&quot; starts with the \nmicrocosmic world of a relationship and the inability for two to communicate, \nand in the larger context of the tumultuous '60s takes on a greater \nsignificance. The lyric, while a bit sophomoric at times, showed the promise of \na writer with talent that would develop over time. And certainly the narrator as \nthe lone voice of reason and understanding and the alienated cry in the urban \nwilderness are themes that Simon would later refine with more subtlety and \ngreater depth on songs like &quot;The Boxer.&quot;\n\nThe original recording was from the pair's debut, Wednesday, 3 AM (1964), an \nalbum they recorded for Columbia after they first felt the influence of the \nburgeoning folk revival movement. The two were aware of what they had, Garfunkel \nnoting in the album's liner notes that the song &quot;...is a major work. We were \nlooking for a song on a larger scale, but this was more than either of us \nexpected.&quot; They recorded it with just the voices and a lone acoustic guitar, \nand, after little interest was shown in the record, disbanded while Garfunkel \nattended Columbia University and Simon went off to live in London, where he \nrecorded and released a solo record and toured European coffeehouses and pubs. \nMeanwhile, the song started to find a modest amount of radio play. Columbia \nRecords, experiencing success with Dylan's electric-acoustic forays, employed \nDylan's producer, Tom Wilson, to give &quot;Sound of Silence&quot; a similarly electrified \ntreatment -- employing the same band from the Dylan sessions -- never bothering \nto consult Simon and/or Garfunkel. According to Patrick Humphries' biography of \nSimon, The Boy in the Bubble (1988), the singer/songwriter was on tour in \nDenmark when he happened upon a copy of Billboard and saw that the song was \ncharting. Humphries notes that Columbia mailed Simon a copy of the electrified \nversion and that Simon was &quot;horrified when he first heard it. In fact, if you \nlisten to that original version, you can hear the rhythm section slow down at \none point so that Paul and Artie's voices can catch up.&quot; But it went to number \none in 1966. The duo agreed that it was time to regroup. They quickly went into \nthe studio with a few more songs, some from Simon's solo record, to record a \nfull album ( Sounds of Silence, 1966) to capitalize. As Simon recounted -- \nquoted on the Simon &amp; Garfunkel website ( /http://www. medialab. chalmers. \nse/guitar/index. tml#S&amp;G): &quot;I had just come back from England, and Art was still \nliving at home, he was still at college and we were sitting in my car...smoking, \nand &quot;Sound of Silence&quot; came on and they said: 'Number one record, &quot;Sound of \nSilence&quot; by Simon &amp; Garfunkel,' we were just sitting there at night, we hadn't \nanything to do, and Artie turned to me and he said: 'those guys must be having \nso much fun!'.&quot;\n\nThe duo harmonizes sweetly on the incredibly haunting melody, over a driving, \nminor-key acoustic guitar rhythm, also indebted to the Everly Brothers, singing \nimages of urban apathy and desensitization. Even the acoustic original starts \nwith the soft, dark introduction and grows more intense and harder, with the \nwispy voices gaining an edge and wavering with emotion while Simon abandons the \nfingerpicking style and goes for the Everlys' strum. In an interview in Playboy, \nSimon recounted the germination of the song: &quot;The main thing about playing the \nguitar, though, was that I was able to sit by myself and play and dream. And I \nwas always happy doing that. I used to go off in the bathroom, because the \nbathroom had tiles, so it was a slight echo chamber. I'd turn on the faucet so \nthat water would run -- I like that sound, it's very soothing to me -- and I'd \nplay. In the dark. 'Hello darkness, my old friend/I've come to talk with you \nagain'. I've always believed that you need a truthful first line to kick you off \ninto a song. You have to say something emotionally true before you can let your \nimagination wander.&quot;\n\nThe electrified version is the one most are familiar with, from the hit single \nand its crucial and influential role on the soundtrack to the 1967 film The \nGraduate. The added musicians don't pound as hard as they often do on those \nDylan records, instead opting for a more jangling West Coast folk-rock \ntreatment. The soundtrack makes great use of the song's plaintive opening \narpeggios and first line. The song gives voice to the film's frustrated, Holden \nCaulfield-esque hero, Benjamin Braddock.\n\nLEAVES THAT ARE GREEN\n\nA sprightly folk-pop tempo and feel highlight this song, which is one of the \nearliest tunes in the Simon &amp; Garfunkel canon that shows the duo embracing the \nthen-current folk-rock style. Buttressed by some inventive percussion and \nharpsichord, the shiny quality of the melody is highlighted throughout this fine \npop confection. Lyrically, it's a sad, almost melancholy song of lost love that \nutilized the changing seasons to convey the feelings at the disintegration of a \nromance. This is indeed something that Paul Simon would utilize again in the \nvery near future. \n\nBLESSED\n\nWritten by Paul Simon while he was in the Soho district of London in early 1965, \n&quot;Blessed&quot;'s inspiration came to him when he went into a church during a downpour \nand was impressed by the sermon about the meek inheriting the earth. Simon \nrealized that the meek didn't have anything, so, therefore, what would they \ninherit? It's a powerful document, and musically it shows him to be quite \ncapable of writing in the rock style of the day. A droning, waltz-time tempo is \na great example of what was soon to be called raga rock in the hands of the \nByrds in early 1966. \n\nSOMEWHERE THEY CAN'T FIND ME\n\nUtilizing the opening guitar lick to &quot;Anji,&quot; which would appear later in the \nSounds of Silence album, &quot;Somewhere They Can't Find Me&quot; finds Paul Simon \nstretching his songwriting chops to great degrees. Almost jazz-based in nature, \nthis minor pop masterpiece was one of the standouts on the album. A complex \nlittle take on isolation and loneliness, the sense of escapism is paramount \nhere. Paul Simon was soon to be known for his psychological meditations on the \nsubjects mentioned above, and this is one of the first examples of this style. \nSome excellent string and horn arrangements highlight the recording; this was \none of the duo's most ambitious to date.\n\nRICHARD CORY\n\nWritten by Paul Simon in early 1965, &quot;Richard Cory&quot; is based on a poem written \nin the 19th century; the original poem (by Edwin Arlington Robinson) concluded: \n&quot;And &quot;Richard Cory,&quot; one calm summer night/Went home and put a bullet through \nhis head.&quot; A classic, dark murder ballad, it is loaded with all of the drama and \nsuspense of a mid-'60s art film. Buttressed by a simple but engaging minor-key \nfolk melody, this song was not only one of the most popular album cuts on the \nSounds of Silence album but was also covered masterfully by Denny Lane during \nhis stint in Paul McCartney &amp; Wings. It eventually appeared on the Wings Over \nAmerica live album. \n\nA MOST PECULIAR MAN\n\nWritten in mid-1964, this song was written by Paul Simon and inspired by a \nnewspaper story about a man who committed suicide. This incident may also have \ninspired Sounds of Silence's other suicide song, &quot;Richard Cory.&quot; A different \nsolo version on the song appeared on the Songbook album, a Simon solo demos \nalbum. A strong Broadway feel is juxtaposed by the folk-based melody, and the \nlyrics are in a literate, narrative tone, which would soon become a Paul Simon \ntrademark. \n\nAPRIL COME SHE WILL\n\nUtilizing the changing seasons as a metaphor for the capriciousness of a girl, \n&quot;April Come She Will&quot; was used very effectively in the film The Graduate and its \nsoundtrack. Written in England in 1964 following a brief affair that Paul Simon \nhad during his stay there, the lyrics were inspired by a nursery rhyme that the \ngirl in question recited. The sense of yearning in this song would later be \nbeautifully echoed in one of the Parsley, Sage, Rosemary &amp; Thyme masterpieces, \n&quot;For Emily, Wherever I May Find Her.&quot; Like that song, it is very brief, yet the \nshortness of the song adds to the effectiveness and economy of both the lyric \nand melody.\n\nI AM A ROCK\n\nContinuing the alienated-young-man theme that seemed to preoccupy Paul Simon in \nhis early songwriting career, &quot;I Am a Rock&quot; also follows the successful \nacoustic-electric, pop-folk formula that Simon &amp; Garfunkel happened upon almost \naccidentally with their 1964 breakthrough hit single &quot;Sound of Silence.&quot; The \nlatter song was originally recorded with only acoustic guitar accompanying the \nduo's pristine harmonies. It was turned into an electrified pop recording \nwithout the pair's knowledge by producer Tom Wilson -- who was having success \nwith similar arrangements for Bob Dylan -- on order of Columbia Records. When \n&quot;Sound of Silence&quot; resulted in a number one record, Simon &amp; Garfunkel recorded a \nnumber of other songs with electric bass, guitar, organ, and drums to round out \nthe album Sound of Silence (1966), capitalizing on the success of the title \ntrack. Like &quot;I Am a Rock&quot; from the album, the sound was usually closer to the \njangly West Coast folk sound of the Byrds and the Mamas and the Papas than to \nDylan's often raucous and hard-driving blues treatments. Simon &amp; Garfunkel's \nsweet harmonies always take off a bit of edge, even when turning it up a notch \nwith harder, Louvin Brothers-via- the Everly Brothers singing. &quot;I Am a Rock&quot; was \nalso a hit for the duo.\n\nAs with &quot;Sound of Silence,&quot; &quot;I Am a Rock&quot; starts softly, with a lilting, triplet \nfolk-guitar lick and Simon's gentle, almost whispered voice setting the scene: \n&quot;A winter's day/In a deep and dark December,&quot; the band kicking in for, &quot;I am \nalone/Gazing from my window to the streets below/On a freshly fallen silent \nshroud of snow/I am a rock/I am an island.&quot; His lyrics tread the same \nintrospective teenage/young adult ground as Brian Wilson's 1963 classic &quot;In My \nRoom,&quot; though Simon has not quite yet developed the subtlety demonstrated by \nWilson and his co-writer, Gary Usher. But Simon does strive for greater depth: \n&quot;I've built walls/A fortress deep and mighty/That none may penetrate/I have no \nneed of friendship/Friendship causes pain.&quot; His lyrics sound a bit labored and \nself-conscious as he finishes the verse with the plodding, &quot;It's laughter and \nit's loving I disdain.&quot; What Simon does exhibit, however, is a well-developed \nsense of irony: With the final verse, he seems to be either deflating his sense \nof self-important misanthropy or poking fun at a distrustful, emotionally \nfrustrated narrator, as if it was not Paul Simon singing the song confessionally \nafter all, but a singer giving voice to a character: &quot;I have my books/And my \npoetry to protect me/I am shielded in my armor/Hiding in my room, safe within my \nwomb/I touch no one and no one touches me/I am a rock/I am an island,&quot; capping \nit with the sad-sack lament, again singing in a quiet voice, &quot;And a rock feels \nno pain/And an island never cries.&quot; The narrator, after trying to disprove John \nDonne's Meditation 17, &quot;No man is an island,&quot; finally succumbs and seems to \nultimately agree. And the reprised folk-guitar riff finishes the frame.\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:c7fba120de757689f25ca555b939c5f8e35b93a6","amp;dn":"Simon+%26+Garfunkel+-+Sounds+of+Silence+%28Remastered%29+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7fba120de757689f25ca555b939c5f8e35b93a6","infoHashBuffer":{"type":"Buffer","data":[199,251,161,32,222,117,118,137,242,92,165,85,185,57,197,248,227,91,147,166]},"announce":[],"urlList":[]}}