{"title":"Rhys Ford - Cole McGinnis Mysteries 1-3 and Sinners 1-2","uid":10583458,"size":1690144034,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c8bc8bd208a3e31d8b8b851ed23844d6393226f1&amp;dn=Rhys+Ford+-+Cole+McGinnis+Mysteries+1-3+and+Sinners+1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"katelynor","files":6,"time":1405716843,"description":"Cole McGinnis Mysteries\n\nDirty Kiss, Book 1\n\nCole Kenjiro McGinnis, ex-cop and PI, is trying to get over the shooting death of his lover when a supposedly routine investigation lands in his lap. Investigating the apparent suicide of a prominent Korean businessman's son proves to be anything but ordinary, especially when it introduces Cole to the dead man's handsome cousin, Kim Jae-Min.\n\nJae-Min's cousin had a dirty little secret, the kind that Cole has been familiar with all his life and that Jae-Min is still hiding from his family. The investigation leads Cole from tasteful mansions to seedy lover's trysts to Dirty Kiss, the place where the rich and discreet go to indulge in desires their traditional-minded families would rather know nothing about.\n\nIt also leads Cole McGinnis into Jae-Min's arms, and that could be a problem. Jae-Min's cousin's death is looking less and less like a suicide, and Jae-Min is looking more and more like a target. Cole has already lost one lover to violence-he's not about to lose Jae-Min too.\n\nDirty Secret: Cole Mcginnis Mystery\n\nLoving Kim Jae-Min isn't always easy: Jae is gun-shy about being openly homosexual. Ex-cop turned private investigator Cole McGinnis doesn't know any other way to be. Still, he understands where Jae is coming from. Traditional Korean men aren't gay-at least not usually where people can see them. When a singer named Scarlet asks him to help find Park Dae-Hoon, a gay Korean man who disappeared nearly two decades ago, Cole finds himself submerged in the tangled world of rich Korean families, where obligation and politics mean sacrificing happiness to preserve corporate empires.\n\nDirty Laundry\n\nFor ex-cop turned private investigator Cole McGinnis, each day brings a new challenge. Too bad most of them involve pain and death. Claudia, his office manager and surrogate mother, is still recovering from a gunshot, and Cole's closeted boyfriend, Kim Jae-Min, suddenly finds his teenaged sister dumped in his lap. Meanwhile, Cole has his own sibling problems-most notably, a mysterious half brother from Japan whom his older brother, Mike, is determined they welcome with open arms.\n\nSinner's Gin - Sinners Book 1\n\nThere's a dead man in Miki St. John's vintage Pontiac GTO, and he has no idea how it got there.\n\nAfter Miki survives the tragic accident that killed his best friend and the other members of their band, Sinner's Gin, all he wants is to hide from the world in the refurbished warehouse he bought before their last tour. But when the man who sexually abused him as a boy is killed and his remains are dumped in Miki's car, Miki fears death isn't done with him yet.\n\nKane Morgan, the SFPD inspector renting space in the art co-op next door, initially suspects Miki had a hand in the man's murder, but Kane soon realizes Miki is as much a victim as the man splattered inside the GTO. As the murderer's body count rises, the attraction between Miki and Kane heats up. Neither man knows if they can make a relationship work, but despite Miki's emotional damage, Kane is determined to teach him how to love and be loved - provided, of course, Kane can catch the killer before Miki becomes the murderer's final victim.\n\nWhiskey and Wry: Sinners, Book 2\n\nHe was dead. And it was murder most foul. If erasing a man's existence could even be called murder. When Damien Mitchell wakes, he finds himself without a life or a name. The Montana asylum's doctors tell him he's delusional and his memories are all lies: he's really Stephen Thompson, and he'd gone over the edge, obsessing about a rock star who died in a fiery crash. His chance to escape back to his own life comes when his prison burns, but a gunman is waiting for him, determined that neither Stephen Thompson nor Damien Mitchell will escape. ","torrent":{"xt":"urn:btih:c8bc8bd208a3e31d8b8b851ed23844d6393226f1","amp;dn":"Rhys+Ford+-+Cole+McGinnis+Mysteries+1-3+and+Sinners+1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8bc8bd208a3e31d8b8b851ed23844d6393226f1","infoHashBuffer":{"type":"Buffer","data":[200,188,139,210,8,163,227,29,139,139,133,30,210,56,68,214,57,50,38,241]},"announce":[],"urlList":[]}}