{"title":"Sandy Bull - Fantasias for Guitar and Banjo [1963] [ vinyl/FLAC]","uid":10563231,"size":262129302,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c8ee129aa6726a2da6c56fa0ca47c47ac8267e82&amp;dn=Sandy+Bull+-+Fantasias+for+Guitar+and+Banjo+%5B1963%5D+%5B+vinyl%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"dickspic","files":-1,"time":1405482858,"description":"FLAC / Lossless \nLabel/Cat#: 2009 -Sutro Park #SP 1000LP 180 gram / Vinyl\nCountry: USA\nYear: June 9, 2009\nGenre: folk\nFormat:vinyl,Album\n\n\n\n\n\nA1 - Blend\nB1 - Carmina Burana Fantasy\nB2 - Non nabis Domine\nB3 - Little Maggie\nB4 - Gospel Tune\n\n\n\nIt is appropriate that the album begins with a song called Blend, which takes up a full side of the LP. He was a pioneer at blending different styles from different culutres. Some of the types of music represented here include American folk, jazz, Arabic, and Indian music. Great stuff.\n\nHis mastery of the instruments is complete. He is able to play with the instruments and genres, and create something fluid. The music never fails to engage because there is so much variety to be had. It's amazing that this was recorded in 1962. I mean, he was recording 20+ minute jams/ragas in no known genre, when the rage was 3 minute Mersey beat silliness. He really deserves more recognition for his originality and adventurousness, like his British counterpart Davy Graham (who is also worth checking out).\n\nThe rhythm section consists solely of Billy Higgins, who worked with Ornette Coleman. His contribution is fantastic, complimenting Bull with great verve. Note: he doesn't appear on every track.\n\nI have the 2009 vinyl release. It is a 180 gm slab, but it is not an audiophile release despite what the marketing dept might claim. My brand new copy had excessive scuffing, and was very dirty. It looked like a used record. After a good cleaning, I was worried that I was going to be in for a disappointment. But I was surprised that the sound quality was quite decent. The surface noise isn't bad, and the quality of the vinyl does not detract from the music.\n\nI don't know who mastered this album for vinyl release, but they did an excellent job. It is very warm, with no clipping or distortion. The compression that exists is all analog, and it is not excessive--just enough to make the music sound full and not jarring. A very nice job indeed.\n\nSo overall, if you have any interest in instrumental banjo or guitar or world music, this is an essential album. I am so glad that Vanguard released it on vinyl.","torrent":{"xt":"urn:btih:c8ee129aa6726a2da6c56fa0ca47c47ac8267e82","amp;dn":"Sandy+Bull+-+Fantasias+for+Guitar+and+Banjo+%5B1963%5D+%5B+vinyl%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8ee129aa6726a2da6c56fa0ca47c47ac8267e82","infoHashBuffer":{"type":"Buffer","data":[200,238,18,154,166,114,106,45,166,197,111,160,202,71,196,122,200,38,126,130]},"announce":[],"urlList":[]}}