{"title":"Railworks TS2016 Just Trains German BR44 Class Locomotive","uid":13170320,"size":228384601,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9390b297aea5af8f7bb77118f0a3df41571629f&amp;dn=Railworks+TS2016+Just+Trains+German+BR44+Class+Locomotive+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TS2015","files":1,"time":1452240002,"description":"Romantic Railroads presents the German Railways DB Class BR44 along with two snowploughs.\r\n\r\nSix different engines:\r\n\r\n44 1536-0 Deutsche Reichsbahn coal-fired, clean\r\n44 2225-9 Deutsche Reichsbahn coal-fired, weathered\r\n44 0093-3 Deutsche Reichsbahn oil-fired\r\n44 9481-1 Deutsche Reichsbahn coal-dust-fired\r\n044 113-9 Deutsche Bundesbahn coal-fired\r\n043 469-6 Deutsche Bundesbahn oil-fired\r\nAlso included are two different snowploughs, both with buffer beam mounted in summer, and without buffer beam in winter:\r\n\r\n'Deutsche Bundesbahn' snowplough\r\n'Deutsche Reichsbahn' snowplough\r\nAll engines and snowploughs have their own specific tenders. You can couple the snowplough to any engine of your choice (steam, diesel or electric) and use it via the signal box in the snowplough’s cab.\r\n\r\nIn addition to the locomotives, suitable freight wagons that use dynamic numbering are included:\r\n\r\nWheat/Corn wagons of the DB (Tdgs) in four variations\r\nWagon - dark brown with and without inscription 'Getreide' (wheat/corn)\r\nWagon - light brown with and without inscription 'Getreide' (wheat/corn)\r\nThese wagons are equipped to be loaded and unloaded when using the assets included in this pack, and have an opening top cover when using the BR44 or any other Romantic Railroads locomotive.\r\n\r\nAlso included are ‘Ucx’ coal dust transport wagons of the Deutsche Reichsbahn (DR) and the Czech Railway (CSD). These use dynamic numbering.\r\n\r\nAll the locomotives and wagons are Quick Drive enabled.\r\n\r\nThree standard scenarios are included - please note that these all require the Hamburg to Hanover Route Add-on (available to purchase via Steam)\r\n\r\nSeveral buildings are included which help bring the scenarios to life; these include a functional coal dust bunker used as transfer point to fill the tenders of the coal-dust-fired engines. It is placed very close to the original bunker from Bw Arnstadt, which was unfortunately torn down in the early 1970s.\r\n\r\nAdditional functional assets are the 'Nordkorn' wheat/corn loading facility and the 'Kornbrennerei Bockshorn' unloading facility. The Tdgs wagons can use these assets to load and unload their wheat/corn.\r\n\r\nAll the scenarios have additional sound announcements to assist you, and some of the scenarios include snowdrifts which can be removed with the snowploughs and will remain cleared afterwards.\r\n\r\nAn English and German Language PDF manual and snowplough supplement manual are included with the software.\r\n\r\n\r\nTHIS ADDON WILL WORK ON LEGIT AND PIRATED VERSION OF TRAIN SIMULATOR 2016!!!","torrent":{"xt":"urn:btih:c9390b297aea5af8f7bb77118f0a3df41571629f","amp;dn":"Railworks+TS2016+Just+Trains+German+BR44+Class+Locomotive+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9390b297aea5af8f7bb77118f0a3df41571629f","infoHashBuffer":{"type":"Buffer","data":[201,57,11,41,122,234,90,248,247,187,119,17,143,10,61,244,21,113,98,159]},"announce":[],"urlList":[]}}