{"title":"Trapt [Ntsc], Ps2","uid":5411738,"size":714681844,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c9475b917efbe32b4f624bc85008c75bf3273638&amp;dn=Trapt+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1267776436,"description":"Trapt for the Ps2                                                 Rel. 11/01/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action, Strategy\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have \n\nto use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nIn Trapt, the player takes on the role of Princess Allura, horrified by the sudden murder of her father the King of Fronenburg and worse, being framed for his murder by step mother - Queen Catalina, later forced unwillingly to flee the castle with her maid Rachel. \n\nFleeing her pursuers, she takes refuge in a forbidden castle, known through rumors as the place where an evil being only known as &quot;the Fiend&quot; was imprisoned. It was not by coincidence she was led here, as it turns out she was chosen by the Fiend to become her servant and wielder of the evil power the Fiend possesses. This power transforms the once innocent princess into a brutal &quot;Trapmaster&quot; capable of \nsummoning and activating traps at will to the unwary enemy. \n\nThe game starts in this castle and the unfolding of this new-found power as well as the attempts of Princess Allura and her allies in thwarting the plans of Queen Catalina.\n\nTrapt set is in medieval Europe of which, most of the game play is located in and around castle rooms, though not specifically limited to the aforementioned castle. Gameplay of Trapt consists the following: \n\nTraps/Info Screen\n\nIn this section the player has access to various important information to prepare for the upcoming mission/story, such as traps and items that may be bought (providing you have enough money), upcoming enemies and their stats in the next mission, and room information of areas available for access in addition to what traps are already located there. \n\nReal-Time Combat\n\nThis is where the real game play occurs, 3rd person perspective view of the character and her surroundings. Most of the game play consists killing off enemies by placing traps to the unwary pursuer. The Princess cannot fight personally (only run) so the player has to rely on the traps to survive.\n\nUnlike other similar games with a trap system, in Trapt the traps are not automatically set. The player have to activate them manually by pressing the appropriate triggers (via buttons) to activate the traps. The 3 different button/triggers represent 3 different traps: Floor traps, Ceiling traps, and\nWall traps. These are the only traps the player has direct access to.\n\nOther traps or devices are also located in the many rooms. The player can &quot;link/connect&quot; them with other traps to create combos at the displeasure of the enemy. The more combo's, the more money the player acquires, of which means the more traps the player can purchase for future planning. \n\nPlacing traps can be done at any point during this real-time setting, which is basically the uniqueness of your powers. This means you can move and place traps around, even when the enemy is chasing you. However, traps have to recharge: after it is placed and after it is sprung, so timing is also crucial here.\n\n\nFeatures:\n\n* Think of the most evil and manipulative ways to get Allura just where they want\n  her.\n\n* Place traps and then lure your enemies to them with your wicked charms.\n\n* Set up your traps via a full-view map of the castle.\n\n* Play in Story Mode or Survival Mode, plus enjoy an even deeper story when you\n  play in the Bones Story Mode.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:c9475b917efbe32b4f624bc85008c75bf3273638","amp;dn":"Trapt+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9475b917efbe32b4f624bc85008c75bf3273638","infoHashBuffer":{"type":"Buffer","data":[201,71,91,145,126,251,227,43,79,98,75,200,80,8,199,91,243,39,54,56]},"announce":[],"urlList":[]}}