{"title":"Bela Fleck, Hussain, Meyer - The Melody of Rhythm [FLAC] TQMP","uid":6573200,"size":309957385,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c99dbd1bc38ee2557a53f19a1f8dbd4bc1054e62&amp;dn=Bela+Fleck%2C+Hussain%2C+Meyer+-+The+Melody+of+Rhythm+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pastafari","files":-1,"time":1312063320,"description":"Bela Fleck, Zakir Hussain, Edgar Meyer - The Melody of Rhythm\n2009\n\nBÃƒÂ©la Fleck and Edgar Meyer do it again. If you liked their previous work Perpetual Motion, a masterpiece if you ask me, you know you're in for a special treat. And for this fantastic unique project they invited Zakir Hussain. Hussain is a tabla genius who has worked with John McLaughlin (Shakti) and Mickey Hart among many others. This music defies the usual boundaries. Or to put it my way - cannabinoids are running high ;) Hope you enjoy it\n\n* * * * * * * * * * * * * * * * * * *\n\nThe story so far: \nEdgar and Bela have been playing together since 1983, when they first jammed in front of the Haagen Dazs store in Aspen, Colorado.\n\nAs a result of all this playing, they were approached by the Nashville Symphony to compose their double concerto for banjo and bass in 2004.\n\nThis went nicely, and a couple of years later they were asked to create a triple concerto for the Grand Opening of Nashville Symphony's new home, the Schermerhorn Symphony Center.\n\nEdgar and Bela agreed that their dream collaborator for the triple would be Zakir Hussain. And Zakir agreed to participate. They cowrote the piece together in various locations during the year preceding the concert.\n\nOn September 9, 2006, they premiered &quot;The Melody of Rhythm; Concerto&quot; with Leonard Slatkin conducting the Nashville Symphony.\n\nThey enjoyed working together, and decided to record the piece. and create additional trio music to go with it, some of it derived from the original concerto composition.\n\nThe Orchestra recording transpired in the first week of January, 2009, with the participation of the Detroit Symphony and Leonard Slatkin conducting.\n\nThe trio recordings happened during several periods in late 2008 and early 2009.\n\nBela, Zakir and Edgar look forward to performing together with orchestras and as a trio in the days, months and years to come. To be continued ... \n-- CD notes\n\n* * * * * * * * * * * * * * * * * * *\n\nFleck, Meyer, Hussain: Border Crossing\n\nThe world of music seems to have fewer and fewer borders these days. Bela Fleck, Edgar Meyer and Zakir Hussain are three players who regularly cross the frontier.\n\nBanjoist Fleck has explored connections with African music, Hussain famously played his tabla with guitarist John McLaughlin in the group Shakti and Meyer can hang with both bluegrass players and Philharmonic orchestras. Now, all three have collaborated on a new album.\n\nThe Melody of Rhythm is a somewhat oxymoronic title. Does rhythm have a melody?\n\n&quot;Yes, absolutely,&quot; Hussain says. &quot;In the case of the tabla, it's a very percussive instrument, so when I'm thinking of a particular rhythm pattern, I'm also thinking story and visual content. Therefore, a melodic element emerges, as well.&quot;\n\nWith so much talent in one place, naturally there's some stellar playing. Jacki Lyden wants to know: Who's faster, Hussain or Fleck?\n\n&quot;Zakir is the fastest,&quot; Fleck says. &quot;He's very kind to slow down and simplify to play with us.&quot;\n\n&quot;I've always marveled at the way that banjo players with the right hand can play all these rhythmic ideas and have the melodic content come on the left hand,&quot; Hussain responds. &quot;The rhythmic element of the banjo, I have to say, is some of the fastest.&quot;\n\n'Lord And Commander'\n\nZakir and Hussain jokingly call bassist Edgar Meyer &quot;lord and commander.&quot; He stands between a fast-picker and a high-pitched tabla player.\n\n&quot;Somebody's got to keep the ship going in the right direction,&quot; Meyer says.\n\nHussain is the son of the legendary tabla player Ustad Alla Rakha. When Hussain first started performing with McLaughlin, his father, like any traditionalist, was upset with his son for crossing over. Hussain continued to play in both worlds and his father eventually came around. But Hussain had to remind him once or twice that Ustad Alla Rakha had once recorded with jazz drummer Buddy Rich.\n\nThe centerpiece of the album is &quot;The Melody of Rhythm,&quot; a triple concerto backed by the Detroit Symphony Orchestra.\n\n&quot;The heart of the collaboration is the incredible weave of making this into an orchestral piece,&quot; Fleck says. &quot;Edgar [Meyer] is an incredible composer. He was able to lead the way and kept us involved with every step.&quot;\n\n&quot;It's an ambition of ours to showcase our individual voices, but also really have a voice of its own,&quot; Meyer says.\n\n&quot;In a true collaboration, each person is changed somewhat,&quot; Fleck adds.\n\n-- NPR &lt;a href=&quot;\nhttp://www.npr.org/templates/story/story.php?storyId=113441094&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.npr.org/templates/story/story.php?storyId=113441094&lt;/a&gt;\n\n* * * * * * * * * * * * * * * * * * * \n\nBela Fleck, Edgar Meyer, Zakir Hussain: Tiny Desk Concert &lt;a href=&quot;\nhttp://www.npr.org/templates/story/story.php?storyId=128652297&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.npr.org/templates/story/story.php?storyId=128652297&lt;/a&gt;\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n\n01 - Bahar\n02 - Out of the Blue\n03 - Bubbles\n04 - The Melody of Rhythm, Movement 1\n05 - The Melody of Rhythm, Movement 2\n06 - The Melody of Rhythm, Movement 3\n07 - Cadence\n08 - In Conclusion\n09 - Then Again\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:c99dbd1bc38ee2557a53f19a1f8dbd4bc1054e62","amp;dn":"Bela+Fleck%2C+Hussain%2C+Meyer+-+The+Melody+of+Rhythm+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c99dbd1bc38ee2557a53f19a1f8dbd4bc1054e62","infoHashBuffer":{"type":"Buffer","data":[201,157,189,27,195,142,226,85,122,83,241,154,31,141,189,75,193,5,78,98]},"announce":[],"urlList":[]}}