{"title":"Simon &amp; Garfunkel - Live From New York City 1967 (EAC-CUE-FLAC)","uid":4502160,"size":343310089,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c99fa92554817bb9175360b6451f79d5445c970f&amp;dn=Simon+%26+Garfunkel+-+Live+From+New+York+City+1967+%28EAC-CUE-FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"repopo","files":-1,"time":1226439106,"description":"*******************************************************************************\n               Simon &amp; Garfunkel - Live From New York City 1967\n*******************************************************************************\n\nTracklist:\n\n01.- He Was My Brother    [03:21]\n02.- Leaves That Are Green    [02:57]\n03.- Sparrow    [03:06]\n04.- Homeward Bound    [02:39]\n05.- You Don't Know Where Your Interest Lies    [02:06]\n06.- A Most Peculiar Man    [02:59]\n07.- The 59th Street Bridge Song (Feelin' Groovy)    [01:49]\n08.- The Dangling Conversation    [03:01]\n09.- Richard Cory    [03:23]\n10.- A Hazy Shade of Winter    [02:37]\n11.- Benedictus    [02:55]\n12.- Blessed    [03:45]\n13.- A Poem on the Underground Wall    [04:45]\n14.- Anji    [02:28]\n15.- I Am a Rock    [02:57]\n16.- The Sound of Silence    [03:25]\n17.- For Emily, Whenever I May Find Her    [02:40]\n18.- A Church Is Burning    [03:43]\n19.- Wednesday Morning, 3 A.M.    [03:35]\n\nBonus:\n\n01.- Red Rubber Ball (included in the Old Friends Boxset)  [02:28]\n\nRipped with EAC, creating a single .cue/.wav audio file, preserving the CD structure, gaps and volume levels as in the original CD.\n\nTHIS CD COMES ONLY IN ONE LONG AUDIO TRACK.  If you want to split it, use Medieval Cue Splitter.\n\n\n-------------------------------------------------------------------------------\nAlbum Review by Richie Unterberger and Wikipedia\n\nRecorded on January 22, 1967, at Lincoln Center in New York, four of these 19 songs were on the 1997 Old Friends box set, but the rest were unissued until the 2002 appearance of this release. However, one track from that set, &quot;Red Rubber Ball&quot;, was not included in this release, thus leaving it somewhat incomplete.\n\nThe duo performs acoustically, without accompanists (as was usually the case in their concerts, and unlike in their other official live albums, The Concert in Central Park and Old Friends: Live On Stage), on a fine-sounding and well-delivered set that doesn't contain any revelations, but is nonetheless an excellent document of their live work as they reached their prime. \n\nCertainly a Simon &amp; Garfunkel fan could have hardly wished for a better song selection, as it features all the major hits and most of the best album tracks that the pair had recorded prior to 1967: &quot;The Sound of Silence,&quot; &quot;I Am a Rock,&quot; &quot;Homeward Bound,&quot; &quot;The 59th Street Bridge Song (Feelin' Groovy),&quot; &quot;Richard Cory,&quot; &quot;A Hazy Shade of Winter,&quot; &quot;The Dangling Conversation,&quot; &quot;Anji,&quot; and &quot;For Emily, Whenever I May Find Her.&quot; Some of the more offbeat moments, however, lie in less-celebrated songs like &quot;Leaves That Are Green,&quot; &quot;Benedictus,&quot; and &quot;He Was My Brother.&quot; Only two of the cuts, though, would qualify as relatively seldom-heard tunes: &quot;A Church Is Burning,&quot; which Paul Simon put on his 1965 U.K.-only solo album but was not recorded for release by Simon &amp; Garfunkel, and the uncommonly tough-minded &quot;You Don't Know Where Your Interest Lies,&quot; which would be a 1967 non-LP B-side (of &quot;Fakin' It&quot;). Numerous live Simon &amp; Garfunkel bootlegs had circulated before this release, so the pair's concert sound will not come as a shock to hardcore fans, but it's great to have a classy, above-board document of their live presence.\n\nIt should also be of note that this tape is not the same show as the bootleg, &quot;Live From New York City, 1966&quot;, despite similar material and packaging.\n\n-------------------------------------------------------------------------------\nTrack notes from Allmusic, Wikipedia and SongFacts\n-------------------------------------------------------------------------------\n\nHE WAS MY BROTHER\n\nWritten by Paul Simon in June of 1963 under the pseudonym P. Kane. A song of loss, it was later rewritten to make reference to an ex-classmate of Simon's, Andrew Goodman, who was one of the students murdered in Mississippi during a civil rights demonstration in 1964. Like the classic &quot;He Was a Friend of Mine&quot; (cut by both Bob Dylan and the Byrds), the feeling of loss is captured in a beautiful atmosphere of subtle, poetic style, avoiding overstatement. One of Simon's finest early lyrics, it's backed by a minor-key folk progression with a vaguely country rhythm. The song was released two other times (other than Simon &amp; Garfunkel's version), once as a solo single by Simon under the name &quot;Jerry Landis.&quot; \n\nThis was written as a memorial to Michael &quot;Mickey&quot; Schwerner. It was actually written before the incident (the murder of Andrew Goodman, Mickey Schwerner and James Chaney, the night of June 21, 1964), when Paul Simon was in England. It was after Andrew was sadly killed that Paul Simon released the song.  As a college student, Schwerner had been a member of Alpha Epsilon Pi fraternity. Both Simon and Garfunkel were also members of AEPi. Of course, in the larger sense, the song is a tribute to the memories of all three of the slain civil rights workers. \n\n\nLEAVES THAT ARE GREEN\n\nA sprightly folk-pop tempo and feel highlight this song, which is one of the earliest tunes in the Simon &amp; Garfunkel canon that shows the duo embracing the then-current folk-rock style. Buttressed by some inventive percussion and harpsichord, the shiny quality of the melody is highlighted throughout this fine pop confection. Lyrically, it's a sad, almost melancholy song of lost love that utilized the changing seasons to convey the feelings at the disintegration of a romance. This is indeed something that Paul Simon would utilize again in the very near future. \n\n\nSPARROW\n\nWritten by Paul Simon in the summer of 1963, &quot;Sparrow&quot; was written after an amusing incident where Simon found himself walking down a street in a fit of self-doubt, which was followed by an unfortunate accident when a sparrow defecated on him from atop a building. Although the incident is not recounted in the song, the feeling of being lost is certainly at the core of the fine lyrics, which also draw on biblical imagery. Musically, the song is a neo-classical exercise in minor-key folk balladry and features some excellent fingerpicking guitar and subtle acoustic bass. According to Art Garfunkel, this was the first song of Simon's that he arranged, and following, at a New York city folk club, the two re-ignited their musical partnership. \n\n\nHOMEWARD BOUND\n\nFew songs in pop music have captured the melancholy ache of homesickness as well as Paul Simon's poignant &quot;Homeward Bound.&quot; The song also goes a long way to dispel the glamour myth of a musician on tour. Simon even turns the lyric on himself, taking the romantic troubadour-poet image down a notch, capturing the self-doubt and insecurity that accompanies such intense loneliness: &quot;Tonight I'll sing my songs again/I'll play the game and pretend/But all my words come back to me in shades of mediocrity/Like emptiness in harmony/I need someone to comfort me/Homeward bound/I wish I was/Homeward bound/Home, where my thought's escaping/Home, where my music's playing/Home, where my love lies waiting/Silently for me.&quot;\n\nThe myth has it that the song was written by Simon in a train station in Widnes in Northern England; in fact, there is apparently a plaque at the station commemorating this. But it is true that Simon wrote it sometime during a 1965 solo tour of England, while he had been based in London. He told writer Paul Zollo that the song &quot;was written in Liverpool when I was traveling. What I like about that is that it has a very clear memory of Liverpool station and the streets of Liverpool and the club I played at and me at the age of 22.&quot; He has also told other interviewers that it reflects the whole feeling of being on that tour, one that he certainly felt sitting in the station at Widnes, as well as telling Hit Parader magazine, &quot;I missed my girl and my friends. It was kind of depressing. I was living out of suitcases, getting on trains every day and going to the next place...I got very homesick for London.&quot;\n\nWhen traveling back from Wigan, where he was playing, he got stuck on the station and wrote this. The song has a double meaning: literally, wanting for a ticket home to Brentwood, but on the other hand, yearning to go to his home in the US.\n\nThe arrangement builds each line: the first verse lines beginning softly on descending half-step chords; the melodies and chord progressions on the second lines rise, growing more powerful and tense as they ascend into the almost bouncy, country-ish chorus. The original studio version, from their third LP, Parsley, Sage, Rosemary, &amp; Thyme (1967), is still based around the acoustic guitar that was the staple of their Dylan-influenced folk sound prior to their first acoustic/electric hybrid, Sounds of Silence (1965). But like Dylan, the duo was also under the spell of the Beatles, and they flesh out their arrangements with a full pop-band instrumentation, with the aid of Dylan producer Bob Johnston. The bass was played by the legendary Carol Kaye.\n\nAnd, as usual, the harmonies are the thing on &quot;Homeward Bound&quot;; the two longtime Everly Brothers fans blend their voices seemingly effortlessly, with Simon's soft voice layered and intertwined with the even more angelic-voiced Art Garfunkel's high harmony. The live, non-band versions of the song offer an even more sensitive reading of the song, the voices remaining quiet for the chorus. Even the quiet instrumentation on Concert in Central Park treats the song a little more gently than the original. \n\n\nA MOST PECULIAR MAN\n\nWritten in mid-1964, this song was written by Paul Simon and inspired by a newspaper story about a man who committed suicide. This incident may also have inspired Sounds of Silence's other suicide song, &quot;Richard Cory.&quot; A different solo version on the song appeared on the Songbook album, a Simon solo demos album. A strong Broadway feel is juxtaposed by the folk-based melody, and the lyrics are in a literate, narrative tone, which would soon become a Paul Simon trademark. \n\n\nTHE 59TH STREET SONG (FEELIN' GROOVY)\n\nIs one of the ultimate 1960s feel-good songs, from a decade that wasn't exactly short of them. Paul Simon sometimes has the image of being a detached, intellectual pessimist, but few popular songs are more optimistic. Set to a jaunty acoustic guitar riff, the tune skips along like a rock tossed over a lake, conjuring the image of a carefree summer day when the sun is shining, there are no deadlines or obligations to meet, nothing on your schedule at all really, and everything's going your way. Melodically, the most memorable part is the end of the verses, when the vocals land on the title and sustain that note for a while, sometimes leaving the path free for the pair to lah-lah their way around the tune wordlessly. The track is so unrelentingly sunny, indeed, that sometimes it's made fun of by those who came of age or sobered up in the punk/ new wave era, as a symbol of all that was wimpy about hippiedom (particularly the line in which they say hello to a lamppost and ask how it's doing). Still, dark does need to be balanced by light, and &quot;The 59th Street Bridge Song (Feelin' Groovy)&quot; -- usually just known as &quot;Feelin' Groovy&quot; -- remains a beloved song, as apt to be heard played by amateur musicians at parties or busking on sidewalks as much as it is by Simon &amp; Garfunkel on the radio. The 59th Street bridge referred to in the title is one of the main bridges running over the waterways of New York, the pair's home town. Simon &amp; Garfunkel's performance of this song is so familiar that it might come as a surprise to those not around at the time of its release to learn that it wasn't a single. It did make the Top 20 in 1967, but only in a much more pop-oriented version by Harpers Bizarre, who gave it much slicker mini-symphonic style production, as well as helium-high vocals. It's the Simon &amp; Garfunkel version that's now primarily remembered, though, and rightly so as it was considerably superior to the hit cover. \n\nThe 59th Street bridge (officially the Queensboro Bridge), goes over the East River in New York City, connecting Queens to Manhattan. Simon &amp; Garfunkel are from New York, which has a very hectic pace. In this song they remind us to slow down and appreciate the simple pleasures in life, like cobblestones and flowers.\n\nWhen he performed at Tufts University in 1966, Simon said of this song: &quot;I spent most of the year 1965 living in England, and at the end of that year in December, I came back to the United States, 'The Sound Of Silence' had become a big hit, and I had to make this adjustment from being relatively unknown in England to being semi-famous here, and I didn't really swing with it. It was a very difficult scene to make, and I was writing very depressed-type songs until around June of last year. I started to swing out of it, I was getting into a good mood, and I remember coming home in the morning about 6 o'clock over the 59th Street Bridge in New York, and it was such a groovy day really, a good one, and it was one of those times when you know you won't be tired for about an hour, a sort of a good hanging time, so I started to write a song that later became the 59th Street Bridge Song or Feelin' Groovy.&quot;\n\nThe Queensboro Bridge is notoriously noisy and mechanical. You walk on metal graters that vibrate as the traffic zooms by, creating a dangerous and exciting sensation. This could be the background for &quot;Slow down, you move too fast...&quot;\n\nDespite being one of Simon &amp; Garfunkel's best known songs this was never a hit for them. However in 1967 a more Pop-oriented version by Harpers Bizarre with higher vocals peaked at #13 in the US &amp; #34 in the UK. (thanks, Edward Pearce - Ashford, Kent, England)\n\nThis is one of the first uses of the word &quot;Groovy&quot; in a popular song. It gave the songwriters Carole Bayer Sager and Toni Wine inspiration for the first &quot;Groovy&quot; hit: &quot;A Groovy Kind Of Love.&quot;\n\n\nTHE DANGLING CONVERSATION\n\n&quot;Dangling Conversation&quot; is a classic example of a good song and a better arrangement that tried to do too much within the context of popular music. The theme is failed communication between lovers. The song starts in a room washed by shadows from the sun slanting through the lace curtains and ends with the room &quot;softly faded.&quot; They are as different as the poems they read: Emily Dickinson and Robert Frost. The first of Paul Simon's major songs after &quot;The Sounds of Silence&quot; that did not capture the imagination of the public. In that sense, it's usually regarded as a failure for not making the Top Ten. In fact, it was the last of Simon's attempts at &quot; literary rock&quot; -- as a follow-up to &quot;Richard Cory&quot; and &quot;I Am a Rock,&quot; it was also the most subtle of them, a single acoustic guitar backed by a string section and a single drum that may have been too sophisticated for the AM radio of its period. The song's references to &quot;Emily Dickinson&quot; and &quot;Robert Frost&quot; were not only non sequiturs when juxtaposed, to anyone who was familiar with the two literary figures, but also alienated teenagers and adults who might not have paid attention in their high school or college English classes. In the end, sophisticated listeners tolerated it without embracing the song, and casual audiences kept it at arm's length, where its literary conceits seemed to be keeping them. The song was part of Simon &amp; Garfunkel's concert sets in late 1966 and 1967, but was quickly dropped once they had more new repertory established. \n\n\nRICHARD CORY\n\nIn the poem, Richard Cory was the envy of all who encountered him. Everyone thought he had it all. They saw his money, felt his power, knew his intelligence, and never once did they doubt his happiness. They looked upon him as more than mere man, and they desired to be looked upon in that way, too. They assumed that living like Richard Cory would bring elusive happiness. The poem indicates that everyone kept their distance. Richard Cory lead an unbearably lonely life. His money did not buy happiness nor did it bring him friends.\n\nBoth the song and the poem tell of Richard Cory's ultimate suicide (the original poem concluded: &quot;And Richard Cory, one calm summer night/Went home and put a bullet through his head.&quot;); however, the song ends slightly differently, declaring in the final chorus that even after his death, the people wanted to be like Richard Cory.\n\nThe song tells the tale of a Richard Cory from the perspective of one of the men that works in his factory. The factory worker is envious of the advantages and enjoyments available to Cory, believing him (Cory) to be a satisfied man. The last verse of the song ends similarly to the Robinson poem: Richard Cory went home last night and put a bullet through his head. The chorus repeats again after this verse, reinforcing the irony of the factory worker's admiration.\n\nA classic, dark murder ballad, it is loaded with all of the drama and suspense of a mid-'60s art film. Buttressed by a simple but engaging minor-key folk melody, this song was not only one of the most popular album cuts on the Sounds of Silence album but was also covered masterfully by Denny Lane during his stint in Paul McCartney &amp; Wings. It eventually appeared on the Wings Over America live album. \n\n\nA HAZY SHADE OF WINTER\n\n&quot;Hazy Shade of Winter&quot; was a sizable hit for Simon &amp; Garfunkel in late 1966, reaching number 13, although it's not quite as frequently played or famous as their biggest smashes. That's unfortunate, as &quot;Hazy Shade of Winter&quot; was one of their best songs, and certainly one of the toughest and more rock-oriented by a duo more noted for being relatively mild and dignified. A brusque, stiff drum rhythm sets the pace on the opening instrumental section, built around an edgy, up and down guitar riff; the melody and arrangement of the instrumental section are duplicated on the track's subsequent vocal choruses. \n\nThe lyrics evoke the passage of the seasons, but (as the title suggests) focusing on the gloominess of winter. The chorus of the song repeats:\n\n    But look around,\n    leaves are brown now\n    And the sky\n    is a hazy shade of winter\n\n    Look around,\n    leaves are brown\n    There's a patch of snow on the ground. \n\nThe lyric is one of Simon's more downbeat early ones, seems to be lamenting how he was looking for something (or someone) perfect, but never found it, and now time is running out on his dreams, particularly on the chorus, with its images of leaves turning brown (perhaps subconsciously influenced by the brown leaves in John Phillips' slightly earlier &quot;California Dreamin'&quot;?) and the sky looking like a hazy shade of winter, using seasons as a metaphor for the cycle of life. Though the verse is less melodically memorable than the chorus, it's commendably urgent and well-arranged, particularly in the lonely bleats of trumpet after some of the lines, and the part at the ending where the bass and a bassoon busily bring the verse to a climax. There's only a brief bridge here -- and we're not talking about the 59th Street bridge! -- which, though not as vital a part of the song as the main courses, does serve the purpose of adding a little bit more of a dark clouds gathering feel. It's also nifty how the song comes to an unexpected dead, final stop on the last chorus, after the line about a patch of snow on the ground. In the 1980s the song was revived from an unexpected quarter, when the Bangles put it on the soundtrack of Less Than Zero. \n\nOn The Bangles website, Susanna Hoffs talks about meeting Paul Simon after watching Simon &amp; Garfunkel in concert: &quot;We had loved Simon &amp; Garfunkel, and naturally we also loved Paul as a solo artist, and we were really happy to see them perform and then go backstage for a meet-and-greet. This was after our version of 'Hazy Shade of Winter' had come out, and although I don't think we talked about it very much, I remember he was very sweet, and I'm sure he was happy the song had done so well. I think it's always good to have your song covered, but it was a little uncomfortable talking to him about it, because when Simon &amp; Garfunkel did the song, it had gone to #17 (sic), and the Bangles version went to #2. You're proud, of course, but you never want to come off as full of yourself or arrogant you know?&quot;\n\n\nBENEDICTUS\n\n&quot;Benedicts&quot; dates back to spring of 1964, when Arthur Garfunkel was a college student. One of the courses he took was on 16th century music, and following some library research he came up with the idea of updating this classic Latin hymn (It was arranged and adapted from an Orlande de Lassus setting of the Song of Zechariah, one of the three great canticles in the opening chapters of the book of Luke). Almost a cappella in style (is set for two voices with cello and sparse guitar accompaniment), it's a wonderfully intricate two-part harmony reading. The syncopated style achieved on this arrangement would later be revisited by the duo, specifically on &quot;Scarborough Fair.&quot;\n\n\nBLESSED\n\nWritten by Paul Simon while he was in the Soho district of London in early 1965, &quot;Blessed&quot;'s inspiration came to him when he went into a church during a downpour and was impressed by the sermon about the meek inheriting the earth. Simon realized that the meek didn't have anything, so, therefore, what would they inherit? It's a powerful document, and musically it shows him to be quite capable of writing in the rock style of the day. A droning, waltz-time tempo is a great example of what was soon to be called raga rock in the hands of the Byrds in early 1966. \nThe original version of &quot;I Am a Rock&quot; was first released on The Paul Simon Songbook, and became, in the summer of 1965, the A-side to Simon's only single released from the album, backed with &quot;Leaves That Are Green&quot; on CBS 201797. Like the album, the single was not a commercial success. It is an extremely rare single to locate. Meanwhile, The Paul Simon Songbook, which for a long time Simon himself had disdained as an album, remained available only in the United Kingdom until 1981.\nThe Paul Simon Songbook (1965), the first album on which &quot;I Am a Rock&quot; was released. This was Paul Simon's first solo album, recorded after Simon &amp; Garfunkel had effectively broken up after finishing the recording of their debut album, Wednesday Morning, 3 A.M. For sixteen years (1965-81), the recording of &quot;I Am a Rock&quot; from this album was not released in the United States.\nThe Paul Simon Songbook (1965), the first album on which &quot;I Am a Rock&quot; was released. This was Paul Simon's first solo album, recorded after Simon &amp; Garfunkel had effectively broken up after finishing the recording of their debut album, Wednesday Morning, 3 A.M. For sixteen years (1965-81), the recording of &quot;I Am a Rock&quot; from this album was not released in the United States.\n\nWhile Paul Simon was in Europe during the summer of 1965, Tom Wilson, the producer of Wednesday Morning, 3 A.M., responded to requests for &quot;The Sound of Silence&quot; from American radio stations and dubbed an electric guitar and drums onto the original track. He then released the song as a single, whereupon it entered the United States pop charts. When Simon heard about the success of this song, he was still touring in Europe as a poor solo folk singer. He immediately returned to the United States, and in December 1965 he and Garfunkel began a series of hasty recording sessions to match the electric &quot;mold&quot; created by Wilson with many of the other songs that Simon had recorded on the Song Book, including &quot;I Am a Rock,&quot; which was re-recorded during these sessions on 14 December 1965. The result was the album Sounds of Silence, which the duo released the following January. &quot;I Am a Rock&quot; was the fifth and closing track on Side 2 of the record. With &quot;The Sound of Silence&quot; (the opening track), it bookends the rest of the material. This album quickly capitalized on the success of the new album's title track as a #1 single, and itself rose to #21 on the Billboard charts.\n\nThe duo cashed in quickly on their new-found success. They released &quot;I Am a Rock&quot; as a single in the late spring of 1966, and the song reached #3 on the Billboard Hot 100 charts, the third single (chronologically) by Simon &amp; Garfunkel to reach the top 5 (after &quot;The Sound of Silence&quot; and &quot;Homeward Bound&quot;).\n\nThis single had two incarnations. First, as a promotion, it was released on red vinyl to radio stations, with a mono mix on one side and a stereo version on the other. These copies are somewhat difficult to locate for collectors. The standard version sold in stores, however, was the black vinyl 45 rpm record with the red Columbia Records label. The B-side was a version of &quot;Flowers Never Bend With The Rainfall,&quot; which was later released on Simon &amp; Garfunkel's even-more-successful (and critically acclaimed) album Parsley, Sage, Rosemary and Thyme.\n\nUntil 1981, the initial official recording of &quot;I Am a Rock&quot; on The Paul Simon Song Book remained unavailable in North America. This was partly because Simon himself disdained the album, saying on the album's liner notes,\n\n    This L.P. contains twelve of the songs that I have written over the past two years. There are some here that I would not write today. I don't believe in them as I once did. I have included them because they played an important role in the transition. It is discomforting, almost painful, to look back over something someone else created and realize that someone else was you. I am not ashamed of where I've been and what I've thought. It's just not me anymore. It is perfectly clear to me that the songs I write today will not be mine tomorrow. I don't regret the loss.\n\nAs a result, the album was only made available in North America when it was released as part of the box set of albums Paul Simon: Collected Works. The album was not released on CD until March 23, 2004. When it was, Columbia Legacy included two bonus tracks, one of which was an alternate take of &quot;I Am a Rock,&quot; during which one can plainly hear Simon stamping his foot for a beat.\n\nA POEM ON THE UNDERGOUND WALL\n\nOne of the most effective songs from the Parsley, Sage, Rosemary &amp; Thyme album, &quot;Poem on an Underground Wall&quot; is, quite simply, Paul Simon's finest piece of musical cinema from this period. A simple, very brief, and colorful narrative of a subterranean graffiti artist, the sense of drama in Simon's lyric is positively devastating. Musically, the song rises and falls with a powerful sense of flow, again, like a great film. The duo's unison vocals also get top marks here, being one of their finest performances on the album, which in itself is wholly striking.\n\nThe Simon and Garfunkel boxed set Old Friends includes a live version of the song, prefaced by an anecdote from Garfunkel about its origin: he explains that a photo shoot for the cover of the album Wednesday Morning, 3 A.M. was ruined because the subway wall they had intended to use as a backdrop had obscenities written on it.\n\n\nANJI\n\n&quot;Anji&quot; (or &quot;Angie&quot;) is an acoustic fingerstyle guitar piece composed and recorded by noted folk guitarist Davey Graham. The piece is one of the most well-known acoustic blues-folk guitar pieces ever composed, with many notable artists covering it, including Bert Jansch and Paul Simon. Anji is in the key of A minor (often used with a capo) is notable for its trademark descending bassline.\n\n\nI AM A ROCK\n\nContinuing the alienated-young-man theme that seemed to preoccupy Paul Simon in his early songwriting career, &quot;I Am a Rock&quot; also follows the successful acoustic-electric, pop-folk formula that Simon &amp; Garfunkel happened upon almost accidentally with their 1964 breakthrough hit single &quot;Sound of Silence.&quot; The latter song was originally recorded with only acoustic guitar accompanying the duo's pristine harmonies. It was turned into an electrified pop recording without the pair's knowledge by producer Tom Wilson -- who was having success with similar arrangements for Bob Dylan -- on order of Columbia Records. When &quot;Sound of Silence&quot; resulted in a number one record, Simon &amp; Garfunkel recorded a number of other songs with electric bass, guitar, organ, and drums to round out the album Sound of Silence (1966), capitalizing on the success of the title track. Like &quot;I Am a Rock&quot; from the album, the sound was usually closer to the jangly West Coast folk sound of the Byrds and the Mamas and the Papas than to Dylan's often raucous and hard-driving blues treatments. Simon &amp; Garfunkel's sweet harmonies always take off a bit of edge, even when turning it up a notch with harder, Louvin Brothers-via- the Everly Brothers singing. &quot;I Am a Rock&quot; was also a hit for the duo.\n\nThe lyrics of the first verse reference &quot;a deep and dark December&quot; during which the speaker is gazing out from his window to the snow below in the street. The song was not included on Simon &amp; Garfunkel's first album, Wednesday Morning, 3 A.M., which they released on October 19, 1964. The folk-rock nature of the music makes it unlikely that Simon would have written it much earlier than 1963, when he first began experimenting with the folk genre. Some sources say that it was performed by Simon on January 27, 1965, on a promo show for the BBC. In any case, Simon seems to have written the song before the end of January 1965, and certainly had it down before May, when he recorded it\n\nAs with &quot;Sound of Silence,&quot; &quot;I Am a Rock&quot; starts softly, with a lilting, triplet folk-guitar lick and Simon's gentle, almost whispered voice setting the scene: &quot;A winter's day/In a deep and dark December,&quot; the band kicking in for, &quot;I am alone/Gazing from my window to the streets below/On a freshly fallen silent shroud of snow/I am a rock/I am an island.&quot; His lyrics tread the same introspective teenage/young adult ground as Brian Wilson's 1963 classic &quot;In My Room,&quot; though Simon has not quite yet developed the subtlety demonstrated by Wilson and his co-writer, Gary Usher. But Simon does strive for greater depth: &quot;I've built walls/A fortress deep and mighty/That none may penetrate/I have no need of friendship/Friendship causes pain.&quot; His lyrics sound a bit labored and self-conscious as he finishes the verse with the plodding, &quot;It's laughter and it's loving I disdain.&quot; What Simon does exhibit, however, is a well-developed sense of irony: With the final verse, he seems to be either deflating his sense of self-important misanthropy or poking fun at a distrustful, emotionally frustrated narrator, as if it was not Paul Simon singing the song confessionally after all, but a singer giving voice to a character: &quot;I have my books/And my poetry to protect me/I am shielded in my armor/Hiding in my room, safe within my womb/I touch no one and no one touches me/I am a rock/I am an island,&quot; capping it with the sad-sack lament, again singing in a quiet voice, &quot;And a rock feels no pain/And an island never cries.&quot; The narrator, after trying to disprove John Donne's Meditation 17, &quot;No man is an island,&quot; finally succumbs and seems to ultimately agree. And the reprised folk-guitar riff finishes the frame.\n\nThe original version of &quot;I Am a Rock&quot; was first released on The Paul Simon Songbook, and became, in the summer of 1965, the A-side to Simon's only single released from the album, backed with &quot;Leaves That Are Green&quot; on CBS 201797. Like the album, the single was not a commercial success. It is an extremely rare single to locate. Meanwhile, The Paul Simon Songbook, which for a long time Simon himself had disdained as an album, remained available only in the United Kingdom until 1981.\nThe Paul Simon Songbook (1965), the first album on which &quot;I Am a Rock&quot; was released. This was Paul Simon's first solo album, recorded after Simon &amp; Garfunkel had effectively broken up after finishing the recording of their debut album, Wednesday Morning, 3 A.M. For sixteen years (1965-81), the recording of &quot;I Am a Rock&quot; from this album was not released in the United States.\nThe Paul Simon Songbook (1965), the first album on which &quot;I Am a Rock&quot; was released. This was Paul Simon's first solo album, recorded after Simon &amp; Garfunkel had effectively broken up after finishing the recording of their debut album, Wednesday Morning, 3 A.M. For sixteen years (1965-81), the recording of &quot;I Am a Rock&quot; from this album was not released in the United States.\n\nWhile Paul Simon was in Europe during the summer of 1965, Tom Wilson, the producer of Wednesday Morning, 3 A.M., responded to requests for &quot;The Sound of Silence&quot; from American radio stations and dubbed an electric guitar and drums onto the original track. He then released the song as a single, whereupon it entered the United States pop charts. When Simon heard about the success of this song, he was still touring in Europe as a poor solo folk singer. He immediately returned to the United States, and in December 1965 he and Garfunkel began a series of hasty recording sessions to match the electric &quot;mold&quot; created by Wilson with many of the other songs that Simon had recorded on the Song Book, including &quot;I Am a Rock,&quot; which was re-recorded during these sessions on 14 December 1965. The result was the album Sounds of Silence, which the duo released the following January. &quot;I Am a Rock&quot; was the fifth and closing track on Side 2 of the record. With &quot;The Sound of Silence&quot; (the opening track), it bookends the rest of the material. This album quickly capitalized on the success of the new album's title track as a #1 single, and itself rose to #21 on the Billboard charts.\n\nThe duo cashed in quickly on their new-found success. They released &quot;I Am a Rock&quot; as a single in the late spring of 1966, and the song reached #3 on the Billboard Hot 100 charts, the third single (chronologically) by Simon &amp; Garfunkel to reach the top 5 (after &quot;The Sound of Silence&quot; and &quot;Homeward Bound&quot;).\n\nThis single had two incarnations. First, as a promotion, it was released on red vinyl to radio stations, with a mono mix on one side and a stereo version on the other. These copies are somewhat difficult to locate for collectors. The standard version sold in stores, however, was the black vinyl 45 rpm record with the red Columbia Records label. The B-side was a version of &quot;Flowers Never Bend With The Rainfall,&quot; which was later released on Simon &amp; Garfunkel's even-more-successful (and critically acclaimed) album Parsley, Sage, Rosemary and Thyme.\n\nUntil 1981, the initial official recording of &quot;I Am a Rock&quot; on The Paul Simon Song Book remained unavailable in North America. This was partly because Simon himself disdained the album, saying on the album's liner notes,\n\n    This L.P. contains twelve of the songs that I have written over the past two years. There are some here that I would not write today. I don't believe in them as I once did. I have included them because they played an important role in the transition. It is discomforting, almost painful, to look back over something someone else created and realize that someone else was you. I am not ashamed of where I've been and what I've thought. It's just not me anymore. It is perfectly clear to me that the songs I write today will not be mine tomorrow. I don't regret the loss.\n\nAs a result, the album was only made available in North America when it was released as part of the box set of albums Paul Simon: Collected Works. The album was not released on CD until March 23, 2004. When it was, Columbia Legacy included two bonus tracks, one of which was an alternate take of &quot;I Am a Rock,&quot; during which one can plainly hear Simon stamping his foot for a beat.\n\n\nTHE SOUND OF SILENCE\n\nIn an interview with Terry Gross of National Public Radio (NPR), Paul Simon explained how he wrote the song while working at his first job in music: &quot;It was just when I was coming out of college. My job was to take the songs that this huge publishing company owned and go around to record companies and see if any of their artists wanted to record the songs. I worked for them for about 6 months and never got a song placed, but I did give them a couple of my songs because I felt so guilty about taking their money. Then I got into an argument with them and said, 'Look, I quit, and I'm not giving you my new song.' And the song that I had just written was 'The Sound Of Silence.' I thought, 'I'll just publish it myself,' and from that point on I owned my own songs, so that was a lucky argument.\n\nI think about songs that it's not just what the words say but what the melody says and what the sound says. My thinking is that if you don't have the right melody, it really doesn't matter what you have to say, people don't hear it. They only are available to hear when the sound entrances and makes people open to the thought. Really the key to 'The Sound Of Silence' is the simplicity of the melody and the words, which are youthful alienation. It's a young lyric, but not bad for a 21-year-old. It's not a sophisticated thought, but a thought that I gathered from some college reading material or something. It wasn't something that I was experiencing at some deep, profound level - nobody's listening to me, nobody's listening to anyone - it was a post-adolescent angst, but it had some level of truth to it and it resonated with millions of people. Largely because it had a simple and singable melody.&quot;\n\nSimon began working on the song sometime after the Kennedy assassination. He had made progress on the music, but had yet to get down the lyrics. On February 15, 1964, the lyrics apparently coalesced, and Simon showed the new composition to Garfunkel the same day. Shortly afterwards, the duo began to perform it at folk clubs in New York, and included it on their debut album, Wednesday Morning, 3 A.M., released that October. The album flopped upon its release, and the duo split up, with Simon going to England for much of 1965. There he often performed the song solo in folk clubs, and recorded it for a second time on his solo LP in May 1965, The Paul Simon Songbook.\n\nIn the meantime, Simon and Garfunkel's producer at Columbia Records in New York, Tom Wilson, had learned that the song had begun to receive airplay on radio stations in Boston, Massachusetts and around Gainesville and Cocoa Beach, Florida.\n\nOn June 15, 1965, immediately after the recording session of Bob Dylan's &quot;Like a Rolling Stone,&quot; Wilson took the original track of Simon &amp; Garfunkel, and overdubbed the recording with electric guitar (played by Al Gorgoni), electric bass (Bob Bushnell), and drums (Bobby Gregg), and released it as a single without even consulting Simon or Garfunkel. The song entered the U.S. pop charts in September 1965 and slowly began its ascent.\n\nSimon learned that it had entered the charts minutes before he went on stage to perform at a club in Copenhagen, Denmark, and in the later fall of 1965 he returned to the United States. By the end of 1965 and the first few weeks of 1966, the song reached number one on the U.S. charts. Simon and Garfunkel then reunited as a musical group, and included the song as the title track of their next album, Sounds of Silence, hastily recorded in December 1965 and released in January 1966 to capitalize on their success. The song propelled them to stardom and, together with two other top-five (in the U.S.) hits in the summer of 1966, &quot;I Am a Rock&quot; and &quot;Homeward Bound,&quot; ensured the duo's fame. In 1999, BMI named &quot;The Sounds of Silence&quot; as the 18th-most performed song of the 20th century. In 2004 it was ranked #156 on Rolling Stone's list of the 500 Greatest Songs of All Time, one of the duo's three songs on the list.\n\nPaul Simon was a Brill Building demo singer as a teenager and, like the Beatles, was heavily under the spell of the famous harmonies of the Everly Brothers. Simon and his high school buddy, the classically trained musician Art Garfunkel, even formed a teenage duo, Tom and Jerry, that was modeled after the Everlys. But like a lot of other ambitious songwriters in the '60s, Simon soon fell sway to the remarkable abilities of Bob Dylan. And again, like the Beatles, Simon sought to merge his Brill-trained classic rock &amp; roll and pop tendencies to the newly wide-open lyrical scope of Dylan. And Dylan himself met the popsters halfway, famously going electric soon after seeing the Fab Four and watching the Byrds score even bigger hits than he did with electrified versions of his songs. It was a heady era for pop music; soon anything and everything was fair game for subject matter and rock &amp; roll songwriters were starting to be taken seriously as artists.\n\nWhile we all would agree that this was mostly a good thing, the charts soon became littered with overly ambitious and ill-informed protest songs and self-consciously &quot;literate&quot; clunkers that fell short of the mark. While &quot;Sound of Silence&quot; is ultimately saved from being among the latter, Simon does seem to be reaching like a college freshman English major with &quot;hey, look at me!&quot; lines like, &quot;the words of the prophets were written on the subway walls,&quot; and &quot;but my words, like silent raindrops fell.&quot; Simon seems to desire the same prophetic voice of authority that Dylan confidently exhibited in songs like &quot;A Hard Rain's A-Gonna Fall.&quot; But as a great song should, &quot;Sound of Silence&quot; starts with the microcosmic world of a relationship and the inability for two to communicate, and in the larger context of the tumultuous '60s takes on a greater significance. The lyric, while a bit sophomoric at times, showed the promise of a writer with talent that would develop over time. And certainly the narrator as the lone voice of reason and understanding and the alienated cry in the urban wilderness are themes that Simon would later refine with more subtlety and greater depth on songs like &quot;The Boxer.&quot;\n\nThe original recording was from the pair's debut, Wednesday, 3 AM (1964), an album they recorded for Columbia after they first felt the influence of the burgeoning folk revival movement. The two were aware of what they had, Garfunkel noting in the album's liner notes that the song &quot;...is a major work. We were looking for a song on a larger scale, but this was more than either of us expected.&quot; They recorded it with just the voices and a lone acoustic guitar, and, after little interest was shown in the record, disbanded while Garfunkel attended Columbia University and Simon went off to live in London, where he recorded and released a solo record and toured European coffeehouses and pubs. Meanwhile, the song started to find a modest amount of radio play. Columbia Records, experiencing success with Dylan's electric-acoustic forays, employed Dylan's producer, Tom Wilson, to give &quot;Sound of Silence&quot; a similarly electrified treatment -- employing the same band from the Dylan sessions -- never bothering to consult Simon and/or Garfunkel. According to Patrick Humphries' biography of Simon, The Boy in the Bubble (1988), the singer/songwriter was on tour in Denmark when he happened upon a copy of Billboard and saw that the song was charting. Humphries notes that Columbia mailed Simon a copy of the electrified version and that Simon was &quot;horrified when he first heard it. In fact, if you listen to that original version, you can hear the rhythm section slow down at one point so that Paul and Artie's voices can catch up.&quot; But it went to number one in 1966. The duo agreed that it was time to regroup. They quickly went into the studio with a few more songs, some from Simon's solo record, to record a full album ( Sounds of Silence, 1966) to capitalize. As Simon recounted -- quoted on the Simon &amp; Garfunkel website ( /http://www. medialab. chalmers. se/guitar/index. tml#S&amp;G): &quot;I had just come back from England, and Art was still living at home, he was still at college and we were sitting in my car...smoking, and &quot;Sound of Silence&quot; came on and they said: 'Number one record, &quot;Sound of Silence&quot; by Simon &amp; Garfunkel,' we were just sitting there at night, we hadn't anything to do, and Artie turned to me and he said: 'those guys must be having so much fun!'.&quot;\n\nThe duo harmonizes sweetly on the incredibly haunting melody, over a driving, minor-key acoustic guitar rhythm, also indebted to the Everly Brothers, singing images of urban apathy and desensitization. Even the acoustic original starts with the soft, dark introduction and grows more intense and harder, with the wispy voices gaining an edge and wavering with emotion while Simon abandons the fingerpicking style and goes for the Everlys' strum. In an interview in Playboy, Simon recounted the germination of the song: &quot;The main thing about playing the guitar, though, was that I was able to sit by myself and play and dream. And I was always happy doing that. I used to go off in the bathroom, because the bathroom had tiles, so it was a slight echo chamber. I'd turn on the faucet so that water would run -- I like that sound, it's very soothing to me -- and I'd play. In the dark. 'Hello darkness, my old friend/I've come to talk with you again'. I've always believed that you need a truthful first line to kick you off into a song. You have to say something emotionally true before you can let your imagination wander.&quot;\n\nThe electrified version is the one most are familiar with, from the hit single and its crucial and influential role on the soundtrack to the 1967 film The Graduate. The added musicians don't pound as hard as they often do on those Dylan records, instead opting for a more jangling West Coast folk-rock treatment. The soundtrack makes great use of the song's plaintive opening arpeggios and first line. The song gives voice to the film's frustrated, Holden Caulfield-esque hero, Benjamin Braddock.\n\nThis was one of the songs Simon &amp; Garfunkel performed in 1964 when they were starting out and playing the folk clubs in Greenwich Village. This was their first hit.\n\nSimon was in England when he found out this had been remixed and was a #1 hit in The States.\n\nThis was used in the movie The Graduate. The film's director Mick Nichols put it on as a work track and was going to replace it, but as the film came together it became clear that the song was perfect for the film. Nichols didn't just use this song, but felt Simon &amp; Garfunkel had a sound that fit the tone of the movie very well. They commissioned them to write &quot;Mrs. Robinson&quot; specifically for the movie, and also added &quot;Scarborough Fair&quot; and &quot;April Come She Will&quot; to the film.\n\nThis has a lot of meaning in the movie The Graduate. The lyrics refer to silence as a cancer, and if people in the movie had just been honest and not afraid to talk, all the messy things would not have happened. Problems can be solved only by honesty. (thanks, Stefan - winona, MS)\n\nSimon &amp; Garfunkel did not write this about the Vietnam War, but by the time it became popular, the war was on and many people felt it made a powerful statement as an anti-war song.\n\nIn the US, this hit #1 on New Year's Day, 1966.\n\nSimon &amp; Garfunkel performed this at Neil Young's Bridge School Benefit in 1993 with Eddie Van Halen backing them on guitar.\n\nOn February 23, 2003, Simon and Garfunkel reunited for the first time in 10 years to accept a lifetime achievement award and perform this at the opening of The Grammys. At the time, the US was preparing to invade Iraq, and while this could be heard as a political statement, Simon said it wasn't. He explained that they wanted to play this because it was their first hit.\n\nAt the Grammys, they were introduced by Dustin Hoffman, who made a name for himself when he starred in The Graduate. There was no host at The Grammys that year, so Hoffman was the first person seen when the show opened.\n\nDespite its great popularity, Blender magazine voted this the 42nd worst song ever, remarking sardonically that &quot;If Frasier Crane were a song, he would sound like this.&quot; The magazine's editor, Craig Marks, defended Blender's decision to include this much-loved song on their list, stating: &quot;It's the freshman-poetry meaningfulness that got our goat, with self-important lyrics like 'hear my words that I might teach you', it's almost a parody of pretentious '60s folk-rock.&quot; The brief article on the song corresponding with this called the &quot;hear my words&quot; line &quot;the most self-important... in rock history,&quot; and elaborated on Mark's remarks with: &quot;Simon and Garfunkel thunder away in voices that suggest they're scowling and wagging their fingers as they sing. The overall experience is like being lectured on the meaning of life by a jumped-up freshman.&quot;\n\n\nFOR EMILY, WHENEVER I MAY FIND HER\n\nThis short song is one of the duo's most romantic ballads. A man looks for the love of his life, wondering what it will be like when they meet again. It's very simple and brief, but very heartfelt.\n\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:c99fa92554817bb9175360b6451f79d5445c970f","amp;dn":"Simon+%26+Garfunkel+-+Live+From+New+York+City+1967+%28EAC-CUE-FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c99fa92554817bb9175360b6451f79d5445c970f","infoHashBuffer":{"type":"Buffer","data":[201,159,169,37,84,129,123,185,23,83,96,182,69,31,121,213,68,92,151,15]},"announce":[],"urlList":[]}}