{"title":"The Good Book:  A Humanist Bible  -  A. C. Grayling","uid":6775207,"size":913009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9a03db376573a1780b4e85533b9ac52d64c6784&amp;dn=The+Good+Book%3A++A+Humanist+Bible++-++A.+C.+Grayling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"neil1966hardy","files":2,"time":1319716222,"description":"Few, if any, thinkers and writers today would have the imagination, the breadth of knowledge, the literary skill, and-yes-the audacity to conceive of a powerful, secular alternative to the Bible. But that is exactly what A.C. Grayling has done by creating a non-religious Bible, drawn from the wealth of secular literature and philosophy in both Western and Eastern traditions, using the same techniques of editing, redaction, and adaptation that produced the holy books of the Judaeo-Christian and Islamic religions.\n\nThe Good Book consciously takes its design and presentation from the Bible, in its beauty of language and arrangement into short chapters and verses for ease of reading and quotability, offering to the non-religious seeker all the wisdom, insight, solace, inspiration, and perspective of secular humanist traditions that are older, far richer and more various than Christianity.\n\nOrganized in 12 main sections----Genesis, Histories, Widsom, The Sages, Parables, Consolations, Lamentations, Proverbs, Songs, Epistles, Acts, and the Good----The Good Book opens with meditations on the origin and progress of the world and human life in it, then devotes attention to the question of how life should be lived, how we relate to one another, and how vicissitudes are to be faced and joys appreciated.\n\nIncorporating the writing of Herodotus and Lucretius, Confucius and Mencius, Seneca and Cicero, Montaigne, Bacon, and so many others, The Good Book will fulfill its audacious purpose in every way.\n\n608 pages\nPublisher: Walker &amp; Company; 2011\nLanguage: English \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c9a03db376573a1780b4e85533b9ac52d64c6784","amp;dn":"The+Good+Book%3A++A+Humanist+Bible++-++A.+C.+Grayling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9a03db376573a1780b4e85533b9ac52d64c6784","infoHashBuffer":{"type":"Buffer","data":[201,160,61,179,118,87,58,23,128,180,232,85,51,185,172,82,214,76,103,132]},"announce":[],"urlList":[]}}