{"title":"Rod Stewart - Never A Dull Moment [1972][320 KBPS]","uid":7750043,"size":81165044,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cac52a26b6134cacad5cac0afac0cfc70178fef8&amp;dn=Rod+Stewart+-+Never+A+Dull+Moment+%5B1972%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LameDuck69","files":13,"time":1350876582,"description":"Rod Stewart - Never A Dull Moment [1972]\n\n\n\n\n\n01. True Blue   \n02. Lost Paraguayos    \n03. Mama You Been On My Mind   \n04. Italian Girls   \n05. Angel    \n06. Interludings   \n07. You Wear It Well   \n08. I'd Rather Go Blind    \n09. Twistin' The Night Away \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nRoderick David &quot;Rod&quot; Stewart, CBE (born 10 January 1945) is a British singer-songwriter, born and raised in North London, England, and currently residing in Epping. He is of Scottish and English ancestry.\n\nWith his distinctive raspy singing voice, Stewart came to prominence in the late 1960s and early 1970s with The Jeff Beck Group and then Faces. He launched his solo career in 1969 with his debut album An Old Raincoat Won't Ever Let You Down (US: The Rod Stewart Album). His work with The Jeff Beck Group and Faces influenced heavy metal genres.\n\nWith his career in its fifth decade, Stewart has sold over 100 million records worldwide, making him one of the best selling artists of all time. In the UK, he has had six consecutive number one albums, and his tally of 62 hit singles include 31 that reached the top 10, six of which gained the number one position. He has had 16 top ten singles in the U.S, with four of these reaching number one on the Billboard Hot 100. In 2008, Billboard magazine ranked him the 17th most successful artist on the &quot;The Billboard Hot 100 Top All-Time Artists&quot;. A Grammy and Brit Award recipient, he was voted at No. 33 in Q Magazine's list of the top 100 Greatest Singers of all time, and No. 59 on Rolling Stone 100 Greatest Singers of all time. As a solo artist, Stewart was inducted into the US Rock and Roll Hall of Fame in 1994, the UK Music Hall of Fame in 2006, and was inducted a second time into the US Hall of Fame, as a member of Faces, in April 2012.\n\n-----------------------------------------------------------------------------------\n\n\nNever a Dull Moment is a 1972 album by rock musician Rod Stewart. It became a UK number-one album (for two weeks) and reached number two on the US Album chart the same year. The track, &quot;You Wear It Well&quot;, co-written by Stewart and classical guitarist Martin Quittenton, was a smash hit (another UK No. 1; in US No. 13), as well as &quot;Twistin' the Night Away&quot;, a song originally recorded (and written) by Sam Cooke.\n\nOther guest musicians included Ray Jackson of the band Lindisfarne on mandolin, Spike Heatley on upright bass, Gordon Huntley on steel guitar, Dick Powell on violin, Pete Sears on piano and bass.\n\n&quot;Mama You Been on My Mind&quot; is a cover version of a Bob Dylan song. Stewart's version is one of the songs featured in Nick Hornby's book 31 Songs.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:cac52a26b6134cacad5cac0afac0cfc70178fef8","amp;dn":"Rod+Stewart+-+Never+A+Dull+Moment+%5B1972%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac52a26b6134cacad5cac0afac0cfc70178fef8","infoHashBuffer":{"type":"Buffer","data":[202,197,42,38,182,19,76,172,173,92,172,10,250,192,207,199,1,120,254,248]},"announce":[],"urlList":[]}}