{"title":"Hello, I Must Be Going: Groucho and His Friends by Charlotte ","uid":9760672,"size":2162084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cac64f4bbad427902fb4310534e12a999048e29f&amp;dn=Hello%2C+I+Must+Be+Going%3A+Groucho+and+His+Friends+by+Charlotte+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1394807254,"description":"When Charlotte Chandler called Groucho Marx for an interview, he answered the phone himself. Declining to be interviewed, he invited her over to his house so he could tell her no in person. After talking with her for hours, Groucho asked, &quot;Why aren't you writing?&quot; \n\nHello, I Must Be Going is the story of Groucho and the Marx Brothers, told through Groucho's everyday conversations with Charlotte Chandler and his friends. And what a group of friends they were! Woody Allen, Jack Nicholson, Elliott Gould, Bill Cosby, Marvin Hamlisch, Betty Comden, Adolph Green, Sidney Sheldon, and dozens of others walk through the pages of this fascinating book. Anyone interested in Groucho or the Marx Brothers, or who wants to spend a few hours in fabulous company, will find this book irresistible.\n\nReview\n&quot;Reading Hello, I Must Be Going is like really being there. And I should know. I love the book.&quot;\n-- Zeppo Marx\n\n&quot;Hello, I Must Be Going is as funny, even funnier than Groucho has ever been.&quot;\n-- Otto Preminger\n\n&quot;Charlotte Chandler's book is the real thing. Absolutely authentic, beautifully researched, a joy to read.&quot;\n-- Billy Wilder\n\n&quot;Knowing Groucho was fascinating, but this book knows Groucho better than I did.&quot;\n-- Mike Nichols\n\n&quot;The definitive book on Groucho Marx.&quot;\n-- Irv Kupcinet, Chicago Sun-Times\n\n&quot;I wish I could have met Groucho, and now I have. In Hello, I Must Be Going, Groucho never disappoints.&quot;\n-- Tennessee Williams\n\n&quot;I'd like to have a book like this written about me. Absolutely!&quot;\n-- Bette Davis\n\n&quot;Charlotte Chandler's Hello, I Must Be Going contains such a wealth of Groucho Marxisms that she qualifies as the late comedian's Boswell.&quot;\n-- Richard R. Lingeman, The New York Times Book Review\n\n&quot;Hello, I Must Be Going is fabulous. The best book of its kind.&quot;\n-- Elliott Gould\n\n&quot;Under those curls, Charlotte Chandler has a tape recorder in her head.&quot;\n-- Jack Nicholson","torrent":{"xt":"urn:btih:cac64f4bbad427902fb4310534e12a999048e29f","amp;dn":"Hello%2C+I+Must+Be+Going%3A+Groucho+and+His+Friends+by+Charlotte+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac64f4bbad427902fb4310534e12a999048e29f","infoHashBuffer":{"type":"Buffer","data":[202,198,79,75,186,212,39,144,47,180,49,5,52,225,42,153,144,72,226,159]},"announce":[],"urlList":[]}}