{"title":"Evie Tornquist","uid":5330586,"size":492235963,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb0277feb29a90009c2607191575b87db5267dde&amp;dn=Evie+Tornquist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"freedomp","files":122,"time":1265157401,"description":"Evie Tornquist-Karlsson (born 1957 in Rahway, New Jersey[1]), professionally known as Evie, is a Contemporary Christian music singer who was known in the late 1970s and early 1980s for songs such as Step Into The Sunshine and Four Feet Eleven.\n\nBorn in the United States to Norwegian immigrants, Evie began her singing career as a young teenager while visiting her parents' homeland. She released her English language debut album at the age of 16 in 1974, and went on to release more than 30 albums, including several in various Scandinavian languages. Evie was recognized as the Dove Award recipient of Female Vocalist of the Year for 1977 and 1978. She married Swedish pastor and musician Pelle Karlsson in 1979 and retired from performing music in 1981 to pursue other avenues of ministry, such as Sky Angel. Evie later became a mentor to Christian musician Rebecca St. James, joining her for an event series geared toward helping girls and women apply biblical principles in the 21st century.\n\nEvie was officially inducted into the Gospel Music Hall of Fame on February 22, 2005, and was one of the inaugural inductees to the Christian Music Hall of Fame.","torrent":{"xt":"urn:btih:cb0277feb29a90009c2607191575b87db5267dde","amp;dn":"Evie+Tornquist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb0277feb29a90009c2607191575b87db5267dde","infoHashBuffer":{"type":"Buffer","data":[203,2,119,254,178,154,144,0,156,38,7,25,21,117,184,125,181,38,125,222]},"announce":[],"urlList":[]}}