{"title":"JUDGMENT DAY (2003) (Awesome) ALAN MOORE - Trade Paperback - TPB","uid":8012974,"size":216394106,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cb39aad0123f2600d3d256142476aa4e9acc5328&amp;dn=JUDGMENT+DAY+%282003%29+%28Awesome%29+ALAN+MOORE+-+Trade+Paperback+-+TPB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1358034818,"description":"A companion to my earlier torrent collecting the Alan Moore run of Supreme (alongside last year's Erik Larsen revival). Please seed and share with our friends here on TPB!\n\n------\n\nJudgment Day was a 1997 limited series from Awesome Comics, conceived and written by Alan Moore. It was intended to create a backstory for the superhero universe of Rob Liefeld's comics including Youngblood, Supreme and Glory.\n\nThe issues were called Judgment Day Alpha (#1), Judgment Day Omega (#2) and Final Judgment (#3). A 4th comic -- Judgment Day Aftermath -- was released in 1998 and was intended to lead directly into relaunches of Youngblood, Brigade and Glory. (Brigade and Glory lasted 1 issue each, Youngblood went 2.) There was also a 6-page prelude and some script pages in Judgment Day Sourcebook, a comic sold exclusively by retailer American Entertainment.\n\n^If you read that paragraph, I hope you know that's the kind of bullshit that made it impossible to collect Awesome comics.\n\n^^ And yes, that's right, they published two issues of a miniseries after the &quot;Omega&quot; issue.  --STFmaryville\n\n------\n\n(MINOR SPOILERS BELOW)\n\n------\n\nPlot from Wikipedia:\n\nThe story deals with one member of the superpowered team Youngblood found murdered and the trial of a teammate for the crime. However, the accused has been framed by the real killer, another teammate whose motives stem from a mysterious book capable of warping reality itself.\n\nThe series deals with a metacommentary of the notion of retcons to super-hero histories as Alan Moore himself creates a new backstory for the characters of Awesome Comics, to replace the shared universe they left when Rob Liefeld left Image several years earlier.\n\nThe limited series was later collected as a trade paperback by Checker Book Publishing Group in 2003.\n\n------\n\nGordon Flagg Review from Booklist:\n\nAfter the ambitious graphic novel From Hell (2000) and before recommitting to superhero comics in the America's Best Comics line, Moore, the most popular and innovative contemporary comic-book author, tested the waters by revamping a number of costumed adventurers.\n\nIn this collection of some of those stories, one member of the superpowered team Youngblood is murdered, and, in a wry commentary on the darker tone superhero comics adopted in the 1980s, one of her comrades stands trial. The investigation uncovers a magical book containing the stories of every person who ever existed; tracing the book's history over the centuries gives Moore the chance to visit various other genres, including the western, the war story, and the jungle tale. \n\nThe collaborating artists' styles range from Rob Liefield's overblown excessiveness to the comics classicism of Gil Kane in some of his final work before his death.\n\nIf not nearly as clever or satisfying as Moore's concurrent Supreme stories, better than most everything else in the field.","torrent":{"xt":"urn:btih:cb39aad0123f2600d3d256142476aa4e9acc5328","amp;dn":"JUDGMENT+DAY+%282003%29+%28Awesome%29+ALAN+MOORE+-+Trade+Paperback+-+TPB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb39aad0123f2600d3d256142476aa4e9acc5328","infoHashBuffer":{"type":"Buffer","data":[203,57,170,208,18,63,38,0,211,210,86,20,36,118,170,78,154,204,83,40]},"announce":[],"urlList":[]}}