{"title":"Rage and Time - A Psychopolitical Investigation (2010) [PDF]","uid":10667162,"size":6579135,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb7be869e7cee3b167b24f0464648fe6db49ceae&amp;dn=Rage+and+Time+-+A+Psychopolitical+Investigation+%282010%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1406819719,"description":"Title: Rage and Time - A Psychopolitical Investigation\nAuthor: Peter Sloterdjik\nCategory: Academic/Psychology/Politics\nSeries: Insurrections: Critical Studies in Religion, Politics, and Culture\nPublisher: Columbia University Press (April 2010)\nLanguage: English\nISBN-10: 0231145233 (paperback)\nISBN-13: 9780231145220\n\nPromotional infp/Publisher's summary - &quot;While ancient civilizations worshipped strong, active emotions, modern societies have favored more peaceful attitudes, especially within the democratic process. We have largely forgotten the struggle to make use of thymos, the part of the soul that, following Plato, contains spirit, pride, and indignation. Rather, Christianity and psychoanalysis have promoted mutual understanding to overcome conflict. Through unique examples, Peter Sloterdijk, the preeminent posthumanist, argues exactly the opposite, showing how the history of Western civilization can be read as a suppression and return of rage.\n\nBy way of reinterpreting the Iliad, Alexandre Dumas's Count of Monte Cristo, and recent Islamic political riots in Paris, Sloterdijk proves the fallacy that rage is an emotion capable of control. Global terrorism and economic frustrations have rendered strong emotions visibly resurgent, and the consequences of violent outbursts will determine international relations for decades to come. To better respond to rage and its complexity, Sloterdijk daringly breaks with entrenched dogma and contructs a new theory for confronting conflict. His approach acknowledges and respects the proper place of rage and channels it into productive political struggle.&quot;\n\nReviews:\n&quot;A brilliant and conceptually rich analysis of the influence of rage on the development of Western Culture.&quot; -Publishers Weekly\n\n&quot;An impressive, wide-ranging examination of rage in Western civilization.... Highly recommended.&quot; -Choice\n\nThis torrent contains a scanned copy of the book in PDF form. The front cover image is also included. Please seed and enjoy.\n","torrent":{"xt":"urn:btih:cb7be869e7cee3b167b24f0464648fe6db49ceae","amp;dn":"Rage+and+Time+-+A+Psychopolitical+Investigation+%282010%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb7be869e7cee3b167b24f0464648fe6db49ceae","infoHashBuffer":{"type":"Buffer","data":[203,123,232,105,231,206,227,177,103,178,79,4,100,100,143,230,219,73,206,174]},"announce":[],"urlList":[]}}