{"title":"Alan Moore - From Hell [CBR ITA] TNT Village","uid":6874522,"size":276789330,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cbe17c6727465102cae89a2417d38ca4248952ea&amp;dn=Alan+Moore+-+From+Hell+%5BCBR+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"l.diliberto","files":19,"time":1323365654,"description":"Alan Moore - From Hell [CBR ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=79673&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=79673&lt;/a&gt;\n\n.: Trama :.\n\nChi non conosce la figura di Jack lo Squartatore? O, per meglio dire, chi non conosce l'immagine che di questo serial killer ci ÃƒÂ¨ stata trasmessa, trasformando &quot;lo Squartatore&quot; nell'archetipo dei maniaci che infestano le cronache di ogni tempo con i loro delitti, di solito a sfondo sessuale? Questa osservazione, unita alla miriade di documenti di ogni tipo che sono fioccati negli anni a proposito di questa figura, potrebbe indurre ad un facile e comprensibilissimo errore: considerare From Hell solo l'ennesima rivisitazione degli omicidi perpetrati nel 1888 a Whitechapel, e quindi un'opera superflua e poco originale.\nNiente di piÃƒÂ¹ sbagliato.\nE vero, tante, troppe ipotesi si sono succedute sulla figura dell'assassino delle prostitute di Whitechapel, e questo giÃƒÂ  all'epoca delle indagini, inquinate da fenomeni di sciacallaggio e, sostiene l'autore, depistaggi; ed ancora di piÃƒÂ¹ in seguito, quando col passare degli anni i fatti sono diventati sempre piÃƒÂ¹ indistinti e sono fiorite le ipotesi piÃƒÂ¹ disparate sul nome dell'assassino (dal comodo - per quell'epoca - ebreo di turno al maniaco sessuale al gruppo di malviventi ricattatori).\n\nMa gli omicidi, purtroppo, spesso non si risolvono grazie alla mente di qualche investigatore di animo nobile ed intelletto geniale. Qui non siamo nei libri di Agatha Christie, e neppure nei telefilm del Tenente Colombo. Qui si parla di vita reale (e parlando di un fumetto questo puÃƒÂ² sembrare un paradosso, ma avrÃƒÂ² modo piÃƒÂ¹ avanti di spiegare questa affermazione) e con grande correttezza Alan Moore confessa fin dalla introduzione all'opera di aver rinunciato all'idea (se mai l'ha avuta) di presentare la &quot;soluzione finale&quot; al caso di Jack the Ripper: &quot;abbiamo avuto il buon senso e l'onestÃƒÂ  di considerare From Hell un'opera di pura finzione&quot;.\n\nLa vicenda, al di lÃƒÂ  delle centinaia di pagine in cui viene narrata dalla coppia Moore/Campbell, puÃƒÂ² essere riassunta in poche righe: un nipote della Regina Vittoria ha un bambino da una donna amica di una prostituta Londinese (Marie Kelly). \n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img502.imageshack.us/img502/5459/thumbnailphp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img502.imageshack.us/img502/5459/thumbnailphp.jpg&lt;/a&gt;\n\n.: Crediti :.\n\nAutore: Alan Moore\nTitolo: From Hell\nTipologia: Volume\nPagine: 576\nAnno1993\nNazionalitÃƒÂ : UK\nGenere: Melodramma (dalle parole dello stesso Moore)\nDimensione del file: 263 MB\nFormato del file: CBR (contenente immagini JPEG)\n","torrent":{"xt":"urn:btih:cbe17c6727465102cae89a2417d38ca4248952ea","amp;dn":"Alan+Moore+-+From+Hell+%5BCBR+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbe17c6727465102cae89a2417d38ca4248952ea","infoHashBuffer":{"type":"Buffer","data":[203,225,124,103,39,70,81,2,202,232,154,36,23,211,140,164,36,137,82,234]},"announce":[],"urlList":[]}}