{"title":"Mass Transfer and Absorbers - T. Hobler","uid":15549070,"size":62369501,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd3c301d6162c2b084f22f48cdb3a6cac0b1132a&amp;dn=Mass+Transfer+and+Absorbers+-+T.+Hobler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1471004738,"description":"Mass Transfer and Absorbers - T. Hobler (Pergamon, 1966).pdf\r\n\r\nMass Transfer and Absorbers deals with absorption and mass transfer processes and the factors to consider in designing absorbers. Calculations are supported by a uniform, generalized process driving force, complying with Maxwell's equation, and the coefficients are made as independent as possible in terms of the kind of diffusion and of the values of the concentrations. \r\nThis volume is comprised of seven chapters and begins with an overview of the general principles of diffusional mass transfer, absorption and stripping, and equilibrium between gas and liquid phases. Steady-state mass transfer by diffusion is then discussed, along with mass transfer in a single phase (forced flow and unforced flow). Subsequent chapters explore design considerations for mass transfer equipment and related problems; adsorption accompanied by a chemical reaction; and problems relating to hydrodynamics. The final chapter is devoted to some practical issues, including economic flow velocity and mechanical features of packed, plate, and spray tower designs. \r\nThis book is intended for practicing designers and engineers","torrent":{"xt":"urn:btih:cd3c301d6162c2b084f22f48cdb3a6cac0b1132a","amp;dn":"Mass+Transfer+and+Absorbers+-+T.+Hobler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3c301d6162c2b084f22f48cdb3a6cac0b1132a","infoHashBuffer":{"type":"Buffer","data":[205,60,48,29,97,98,194,176,132,242,47,72,205,179,166,202,192,177,19,42]},"announce":[],"urlList":[]}}