{"title":"Statistical Field Theory","uid":6575499,"size":3883359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd5c701484c4073a8cb3daa3cf80366630da35b5&amp;dn=Statistical+Field+Theory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1312186467,"description":"Giuseppe Mussardo, &quot;Statistical Field Theory: An Introduction to Exactly Solved Models in Statistical Physics&quot; \n O..rd U--ty Press, USA | 2009 | ISBN: 0199547580 | 778 pages | PDF | 3.7 MB \n\n This book provides a thorough introduction to the fascinating world of phase transitions as well as many related topics, including random walks, combinatorial problems, quantum field theory and S-matrix. Fundamental concepts of phase transitions, such as order parameters, spontaneous symmetry breaking, scaling transformations, conformal symmetry, and anomalous dimensions, have deeply changed the modern vision of many areas of physics, leading to remarkable developments in statistical mechanics, elementary particle theory, condensed matter physics and string theory. This self-contained book provides an excellent introduction to frontier topics of exactly solved models in statistical mechanics and quantum field theory, renormalization group, conformal models, quantum integrable systems, duality, elastic S-matrix, thermodynamics Bethe ansatz and form factor theory. The clear discussion of physical principles is accompanied by a detailed analysis of several branches of mathematics, distinguished for their elegance and beauty, such as infinite dimensional algebras, conformal mappings, integral equations or modular functions. Besides advanced research themes, the book also covers many basic topics in statistical mechanics, quantum field theory and theoretical physics. Each argument is discussed in great detail, paying attention to an overall coherent understanding of physical phenomena. Mathematical background is provided in supplements at the end of each chapter, when appropriate. The chapters are also followed by problems of different levels of difficulty. Advanced undergraduate and graduate students will find a rich and challenging source for improving their skills and for accomplishing a comprehensive learning of the many facets of the subject.","torrent":{"xt":"urn:btih:cd5c701484c4073a8cb3daa3cf80366630da35b5","amp;dn":"Statistical+Field+Theory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd5c701484c4073a8cb3daa3cf80366630da35b5","infoHashBuffer":{"type":"Buffer","data":[205,92,112,20,132,196,7,58,140,179,218,163,207,128,54,102,48,218,53,181]},"announce":[],"urlList":[]}}