{"title":"Catalysts For Fine Chemical Synthesis Vol 4","uid":12074923,"size":2031363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd94091ade70d4154c6d2bf6f322c3ebd525f769&amp;dn=Catalysts+For+Fine+Chemical+Synthesis+Vol+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1435614041,"description":"Catalysts For Fine Chemical Synthesis Vol 4 - Microporous and Mesoporous Solid Catalysts - Eric G. Derouane (Wiley, 2006).pdf\n\nISBN: 0471490547\n\nThis series offers practical help for advanced undergraduate, graduate and postgraduate students, as well as experienced chemists in industry and academia working with catalysts in organic and organometallic synthesis. It features tested and validated procedures, authoritative reviews on classes of catalysts, and assessments of all types of catalysts. &quot;Micro- and Mesoporous Solid Catalysts&quot; describes the use of zeolites and mesoporous solids as catalysts for the production of fine and specialty chemicals. Specific tips and hints are provided and some typical procedures are described in detailIn addition to discussing the pros and cons, several major organic transformations are examined including aromatic substitutions, heterocyclic ring formation, amines synthesis, oligomerisation, oxidation and hydroxylation, and other regioselective and stereoselective reactionsFeatures tutorial introductory chapters, including tips and hints for achieving successful organic transformationsImportant reactions are featured together with recommendations to resolve potential problems","torrent":{"xt":"urn:btih:cd94091ade70d4154c6d2bf6f322c3ebd525f769","amp;dn":"Catalysts+For+Fine+Chemical+Synthesis+Vol+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd94091ade70d4154c6d2bf6f322c3ebd525f769","infoHashBuffer":{"type":"Buffer","data":[205,148,9,26,222,112,212,21,76,109,43,246,243,34,195,235,213,37,247,105]},"announce":[],"urlList":[]}}