{"title":"Christian Weston Chandler... Yep, I'm On T.V.  :) DVD","uid":4433832,"size":3587342336,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:ce12a469ef17dbb7a85f0ca6eecfae6c143559ef&amp;dn=Christian+Weston+Chandler...+Yep%2C+I%5C%27m+On+T.V.++%3A%29+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vivig","files":1,"time":1223426761,"description":"I, Christopher Christian Weston Chandler, have composed a DVD of basically, me and my life.  The title is Christian Weston Chandler... Yep, I&amp;#039;m On T.V.  :)  On this Digital Video Disc, I am featured throughout in a series of events televised on NBC or privately at home.  The list goes as follows:\n\n    * C.W.C Being a big (one of TWO) Winner of the 1990s &quot;Sonic the Hedgehog Watch &amp; Win Sweepstakes.  At Age 12, February 26, 1994.\n    * Me reciting and describing my Poem, Song Of Christian for a Manchester High School English Project.  At Age 16, May 15, 1998\n    * My Custom Game Boy Camera Animation of the Mario Kart 64 Cwcville Lego Raceway GP in the Original 30-second Prototype, the Quarter-Hour Full Set of Four Races, and the Unfinished Tour of Lego Cwcville.  All Done on ?, June 4, 1998 and July 12, 2001 (respectively).\n    * C.W.C. Having a shot playing the Pok&amp;#039;emon Trading Card Game during the NBC Pok&amp;#039;eNews Story.  At Age 17, on October 16, 1999 at the Chesterfield County Books-A-Million Store.\n    * Christian&amp;#039;s Nintendo Power-Worthy Animal Crossing Documentry, followed by the later-made Family 24th Anniversary Special, featuring a lovely Cake drawn on Mario Paint.  Done At Age 21, November 22, 2003, and at Age 22, June 7, 2004 (respectively).\n    * C.W.C.&amp;#039;s So Need A Cute Girl Home Music Video  At Age 22, December 20, 2004\n    * C.W.C.&amp;#039;s Submitted-to-Adult Swim(tm) Harvey Birdman Commercial  At Age 23, February 24, 2005\n    * C.W.C.&amp;#039;s Submitted-to-Adult Swim(tm) Pixelated Playstation 3 Sketch for Robot Chicken  At Age 24, November 28, 2006 (Yes, I did have a Change Of Heart over due time from a Twist Of Faith with a PS1).\n    * A Group of Slideshows featuring Photographs and Pics (from Baby to February 24, 2007), What is Inside and Outside of C.W.C.&amp;#039;s Sonichu Book, the Collection of the Sonichu Comic Books from issues 0 to 6, and the set of 15 CWC Custom My Little Ponies;All Projected from His PlayStation Portable.  Featuring for the Background Audio, C.W.C.&amp;#039;s First Day at Station KCWC, at Age 15, Late August, 1997; The Set of Eight CWC Songs from the Christian &amp; The Hedgehog Boys Debut Album, at Age 21, August, 2003; and other Random Favorite Songs.\n    * And Finally, Christopher Christian Weston Chandler Shares a Bunch of Wise Words in his Message for the Present And the Future.  Done Excatly at Age 25, February 24, 2007!\n","torrent":{"xt":"urn:btih:ce12a469ef17dbb7a85f0ca6eecfae6c143559ef","amp;dn":"Christian+Weston+Chandler...+Yep%2C+I%5C%27m+On+T.V.++%3A%29+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce12a469ef17dbb7a85f0ca6eecfae6c143559ef","infoHashBuffer":{"type":"Buffer","data":[206,18,164,105,239,23,219,183,168,95,12,166,238,207,174,108,20,53,89,239]},"announce":[],"urlList":[]}}