{"title":"Studio One Story.avi","uid":4730766,"size":733967850,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ce963402bc334897bdd309d4ab60658d5909f2bd&amp;dn=Studio+One+Story.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jack.ss","files":-1,"time":1235005796,"description":"Studio One Story.avi\n\nOne and a half years in the making has resulted in the Studio One Story, which happens to be almost the definitive guide to Jamaica's greatest ever record label and its founder Clement 'Coxsone' Dodd. Studio One is the foundation label of Jamaican Reggae. Often described as the Motown of Jamaica, Studio One is where the career of literally hundreds of Reggae artists began Bob Marley and The Wailers, Alton Ellis, The Heptones, Ken Boothe, The Skatalites, Burning Spear and Sugar Minott, to name but a few ! \nStudio One story is filmed in Kingston and London and featuring interviews with Horace Andy, Alton Ellis, Ken Boothe, Sugar Minott, Dennis Alcapone, The Ethiopian aka Leonard Dillon, Sylvan Morris, Johnny 'Dizzy' Moore, Ernest Wilson, Eric 'Rickenbacker' Frater, Earl 'Bagga' Walker, Lone Ranger and the awesome King Stitt. The DVD also includes rare footage of The Skatalites, Jackie Mittoo, Count Ossie, Marcia Griffiths, Ernest Ranglin and others.\nThe DVD makes clear that Studio used to be a genuine hit factory, where artists gathered to voice over compelling riddims which were recorded by the cream of the crop of Jamaica's musicians. Until the late seventies Coxsone recorded his artists using rather primitive equipment, but the result of his work changed and formed the shape of reggae music. The DVD makes you realise that the Jamaican music scene from the fifties up to the seventies -with sound systems, clashes, exclusive records and rivalry- provide a blueprint for all that is happening nowadays in the hip hop, dance, trance and house scene. \nCoxsone Dodd tells most of the story, but the stories of Alton Ellis, Ken Boothe, Leonard Dillon and Dennis Alcapone provide a fascinating view of the the customary routine at Studio One and the development of the music we love so much, while engineer Sylvan Morris tells about the recording techniques they used during the late sixties and early seventies. There are delicious scenes in which Coxsone and friends return to the Kingston dancehalls (Success Club, P.O.R.A. and Forrester Halls) where they used to hold the dances in the early sixties. You can also have a look at Sugar Minott's 'Youth Promotion' centre, where he 'big ups' Studio One and Coxsone Dodd. \n \nHere's a selective listing of the music featured on the DVD : \nSound Dimension-Real Rock, Dawn Penn-No No No, Don Drummond-Man In The Street, Lennie Hibbert-Village Soul, Marcia Griffiths-Feel Like Jumping, Ernest Ranglin-Surfin, Johnny osbourne-Truths And Rights, Jackie Mittoo-Wall Street, The Heptones-Baby, Cedric Brooks-Mundungo and Dun Drummond-Heavenless.\n\nDVDRip\n\nLenght:02:37:27\nSize:  699MB (733967850 bytes)\n\nVideo: XVID 720x448 25.00fps [Stream 00]\nAudio: MPEG Audio Layer 3 48000Hz stereo 192Kbps [Stream 01]\n\n\nEnjoy\n","torrent":{"xt":"urn:btih:ce963402bc334897bdd309d4ab60658d5909f2bd","amp;dn":"Studio+One+Story.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce963402bc334897bdd309d4ab60658d5909f2bd","infoHashBuffer":{"type":"Buffer","data":[206,150,52,2,188,51,72,151,189,211,9,212,171,96,101,141,89,9,242,189]},"announce":[],"urlList":[]}}