{"title":"Halo Legends (2010), DVDR(xvid), NL Subs, DMT","uid":6399886,"size":1111820280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ceaf8db58e454997319d07248f72f72c40960f59&amp;dn=Halo+Legends+%282010%29%2C+DVDR%28xvid%29%2C+NL+Subs%2C+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"MeMar","files":-1,"time":1305590668,"description":"Halo Legends (2010), DVDR(xvid), NL Subs, DMT\nAlternatieve titel: HeirÃƒÂ´ Rejenzu \nJapan / Verenigde Staten\nAnimatie / Science-Fiction\n120 minuten\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1480660/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1480660/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/66439&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/66439&lt;/a&gt;\n\ngeregisseerd door Shinji Aramaki, Hideki Futamura, Toshiyuki Kanno, Tomoki KyÃƒÂ´da, KÃƒÂ´ichi Mashimo,\n Yasushi Muraki, Daisuke Nishio, Frank O'Connor (II), Mamoru Oshii, Koji Sawai, Keiichi Sugiyama, \nTakahiro Tanaka en Hiroshi Yamazaki\nmet de stemmen van Tessho Genda, Yumi Touma en Hiroaki Hirata\n\nEen collectie van zeven verhalen uit het Halo universum gecreÃƒÂ«erd door de meest creatieve geesten \nvan Japan. &quot;Origins&quot; behandelt de geschiedenis van het expansieve Halo universum door de ogen van \nCortana. &quot;The Duel&quot; vindt plaats lang voor de mens-Convenant oorlog, en vertelt het verhaal van \narbiter Fal 'Chavamee', die weigert de Convenant-religie te aanvaarden. &quot;Homecoming&quot; richt zich op \nde tragedies van de Spartan-II aanwervingen in 2517. Los van het Halo-concept is er de parodie &quot;Odd \nOne Out&quot;, waarin een Spartan op een planeet belandt bewoond door dinosaurussen en gestrande \nkinderen. &quot;Prototype&quot; vertelt het verhaal van een Marine die ingaat tegen de orders om een \ngeavanceerd harnas te vernietigen. Hij maakt gebruik van het pak om burgers te evacueren van de \nplaneet. &quot;The Babysitter&quot; volgt een vierkoppige squad Orbital Drop Shock Troopers naar een \nConvenant zone om een Prophet te elimineren. En tenslotte &quot;The Package&quot;, een twee-delige CGI film, \nvolgt Master Chief en een elite squad van de Spartan-II soldaten terwijl ze een top-geheime missie \nuitvoeren om een zeer waardevol pakketje te halen op een Convenant schip.\n\nA collection of seven stories from the Halo Universe created by Japan's most creative minds. First up \nis &quot;Origins&quot; a two part episode showing the expansive history of the Halo Universe and the history of \nthe 100,000 year long franchise timeline, told through the eyes of Cortana. Second comes &quot;The Duel&quot; \nTaking place long before the Human-Covenant War, it tells the story of an Arbiter, Fal 'Chavamee, \nwho refuses to accept the Covenant Religion. Taking a turn to the Spartan side of the story \n&quot;Homecoming&quot; focuses on the tragedies involving the Spartan-II recruitment in 2517, and the \nSpartans coming to terms with their origins. Taking a turn in tone comes &quot;Odd One Out&quot; a non-\ncannon parody of the Halo storyline. &quot;Prototype&quot; tells the story of a Marine who goes against his \norders to destroy an advanced prototype armor and uses the suit to buy time for civilians evacuating \nfrom the planet. &quot;The Babysitter&quot; tales of the the rivalry between the Spartan-II Commandos and the \nOrbital Drop Shock Troopers as they're sent to Covenant-controlled world to assassinate a Covenant \nProphet. And finally &quot;The Package&quot; a two-part all CGI film follows Master Chief and an elite squad of \nSpartan-II super soldiers as they execute a top-secret mission to retrieve a highly valuable UNSC asset \non a Covenant Assault Carrier.\n\nSource: Retail\nSize: 1.04 GB\nForm: AVI\nVideo Codec:  XVID\nBitrate:  1344 Kbit/s\nWidth &amp; Heights: 720 x 480 \nFrames/s: 25.000  Fps\nAudio:  English\nAudio Code: AC3\nBitrate:  128 kbps \nChannels:  2\nSampling: 48.0 kHz \nSubtitles: NL (hardcoded)\n\nCategorie: Beeld\nFormaat: DivX\nTaal: Nederlands ondertiteld (ingebakken)\nGenre:  Animatie / Science-Fiction\n\nDeze film wordt u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:ceaf8db58e454997319d07248f72f72c40960f59","amp;dn":"Halo+Legends+%282010%29%2C+DVDR%28xvid%29%2C+NL+Subs%2C+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceaf8db58e454997319d07248f72f72c40960f59","infoHashBuffer":{"type":"Buffer","data":[206,175,141,181,142,69,73,151,49,157,7,36,143,114,247,44,64,150,15,89]},"announce":[],"urlList":[]}}