{"title":"KeeperRL (Alpha16 hotfix 5)","uid":12633504,"size":158407829,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ceb7366fe1fe1dc9984e03f2c025c735b684b9b9&amp;dn=KeeperRL+%28Alpha16+hotfix+5%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1445886729,"description":"About This Game\r\nKeeperRL is an ambitious dungeon simulator with roguelike and RPG elements. Take the role of an evil wizard and study the methods of black magic. Equip your minions and explore the world, murder innocent villagers and burn their homes. Build your dungeon, lay traps and prepare for an assault of angry heroes.\r\n\r\nWhen you control your minions the game changes into a classic roguelike, with turn-based and very tactical combat. You can also play as an adventurer and assault dungeons made by you or other players.\r\nDungeon management\r\nYou will dig deep into the mountain and build dozens of rooms, corridors and traps. Your minions will train and produce weapons and armor. Prisoners will be tortured. You will research new technologies like alchemy, beast mutation and sorcery.\r\nRoguelike mechanics\r\nThe world is simulated on a very detailed level. Creatures use equipment and consumable items. There are dozens of special items, spells, attributes and special attacks. You can cut off heads and limbs and blind or poison your enemies. If you're not careful with fire, you can burn an entire forest or even your own dungeon.\r\nLarge, procedurally generated maps\r\nIn your neighborhood you'll find castles, villages, other dungeons and special locations. Slay heroes, dragons and witches for their loot. Every game you play will be different.\r\nOnline map sharing\r\nDownload dungeons made by other players and explore them as an adventurer","torrent":{"xt":"urn:btih:ceb7366fe1fe1dc9984e03f2c025c735b684b9b9","amp;dn":"KeeperRL+%28Alpha16+hotfix+5%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb7366fe1fe1dc9984e03f2c025c735b684b9b9","infoHashBuffer":{"type":"Buffer","data":[206,183,54,111,225,254,29,201,152,78,3,242,192,37,199,53,182,132,185,185]},"announce":[],"urlList":[]}}