{"title":"Algoriddim djay Pro 1.1.1 OS X [TNT][dada]","uid":11937421,"size":259460081,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:cec09c5d30bd26bf3a0eed8b0933ad25b9306120&amp;dn=Algoriddim+djay+Pro+1.1.1+OS+X+%5BTNT%5D%5Bdada%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"future-dada","files":2,"time":1431916629,"description":"Algoriddim djay Pro 1.1.1 OS X [TNT][dada]\n259.5 MB\n-------------------------------------------------------------------------------------\nCracker ........: TNT\nProtection .....: Other\nCrack Type .....: Cracked\nRelease Date ...: 16.05.2015\nRelease Type ...: Application\nOperating Sys ..: Mac OS X\n-------------------------------------------------------------------------------------  &lt;a href=&quot;\nhttps://www.algoriddim.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.algoriddim.com&lt;/a&gt;\n-------------------------------------------------------------------------------------\ndjay Pro provides a complete toolkit for performing DJs. Its unique modern interface is built around a sophisticated integration with iTunes and Spotify, giving you instant access to millions of tracks. Pristine sound quality and a powerful set of features including high-definition waveforms, four decks, audio effects, and hardware integration give you endless creative flexibility to take your sets to new heights.\n\nMinimum system Version OS X 10.9\n\n\nWHAT NEW IN THIS VERSION (v.1.1.1)\n\nAll-new VIDEO mode with video mixer, visual effects, audio visualizers, text and image overlays, A/V recording, and extensive pre-bundled video content.\nAdded native support for Pioneer CDJ-2000nexus, CDJ-900nexus, and XDJ-1000 with guided plug &amp; play setup and full library navigation (incl. Spotify), song information, waveform, and cue point display on the device via HID.\nAdded native support for Numark Mixtrack Quad and Mixtrack Edge, and Denon MC6000, MC6000MK2, MC2000.\nNew improved media library with sources for iTunes, Spotify, Videos, My Mac (files), and history.\nNew redesigned Match feature now available for both Spotify andnd iTunes.\nNew media library collection view layout with album artwork display.\nNew &quot;My Mac&quot; library source to access music and videos in any folder, hard disk, USB sticks, etc.\nAdded ability to search within playlists in addition to library-wide searching.\nAdded ability to export history sessions as CSV, iTunes, or Spotify playlist.\nAdded support for up to 8 cue points.\nAdded support for high-quality bit rate (320 kb/s) when using Spotify.\nAdded external mixer mode (can be used with both external USB mixers like DJM-900 and multiple separate output devices like CDJs).\nAdded media list columns for bit rate, sample rate, kind, and date modified.\nImproved Spotify library integration to grey out unavailable tracks.\nImproved media library to honor font size setting in Queue, Match, and search panes.\nImproved deck tools to remember last selected state.\nImproved almost-instant audio configuration, allows staged takeover from previous DJ (e.g. connect first CDJ device and start playing, then connect remaining devices once previous DJ finished).\nImproved pitch-bending using controller jog wheels.\nImproved slip mode when using MIDI controllers: now also working when looping, using cue points, or with reverse playback.\nImproved MIDI Learn with support for custom MIDI out values (e.g. for colored button LEDs).\nAdded support for sharing current track info with Nicecast by Rogue Amoeba.\nAdded various new MIDI mapping actions: beat jump (skipping), master sync setting, loop/reloop, media library back button and source selection, visualizer selection, video crossfade.\nMany other fixes and improvements.\n-------------------------------------------------------------------------------------\nDo not make money with this software...\n\nRemember to BUY the stuff if you USE it.\n------------------------------------------------------------------------------------- \nfuture-dada\n-------------------------------------------------------------------------------------\ndemonoid.pw\n1337x.to\nthepiratebay.se\nflashtorrents.org\ncastradio.net\nbtdigg.org\n-------------------------------------------------------------------------------------\nMMXV (05)","torrent":{"xt":"urn:btih:cec09c5d30bd26bf3a0eed8b0933ad25b9306120","amp;dn":"Algoriddim+djay+Pro+1.1.1+OS+X+%5BTNT%5D%5Bdada%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cec09c5d30bd26bf3a0eed8b0933ad25b9306120","infoHashBuffer":{"type":"Buffer","data":[206,192,156,93,48,189,38,191,58,14,237,139,9,51,173,37,185,48,97,32]},"announce":[],"urlList":[]}}