{"title":"Who Framed Roger Rabbit 1988 BrRip XviD Xult","uid":9994135,"size":892452243,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cef99f6dfd50a33fdb986de44b1d9910ca615c17&amp;dn=Who+Framed+Roger+Rabbit+1988+BrRip+XviD+Xult&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xultfoad","files":11,"time":1397893257,"description":"Who Framed Roger Rabbit 1988 BrRip XviD Xult\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0096438/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0096438/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Who_Framed_Roger_Rabbit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Who_Framed_Roger_Rabbit&lt;/a&gt;\nAuthor: Atreyu_II from The world of artists, 14 July 2007\n&quot;Who Framed Roger Rabbit&quot; is a wonder in the art of making films. Because it mixes live-action and cartoons, it was a challenge to be made. But that's exactly what makes it so distinguish and unique, especially considering that the idea works out so well. It's a different and original movie experience, a real winner.\n\nYet, the film is more than a combination of live-action and cartoons. It has a dark atmosphere with lots of suspense, almost like a thriller. Classic humor isn't forgotten either, with numerous funny lines and hysterical gags, as well as humorous characters. The joke about Â«uncle ThumperÂ» is one of the funniest, but there are many others. There's also a hilarious piano acting with Donald Duck and Daffy Duck, which they play the same piano song as in Tom &amp; Jerry's short &quot;The Cat Concerto&quot; and have their hilariously silly battle. In fact, the soundtrack of the movie is excellent, including Jessica Rabbit's song &quot;Why don't you do right?&quot; and a suspense music very similar to one from the original &quot;Back to the Future&quot;.\n\nOther movies that successfully mix live-action and cartoons are &quot;Mary Poppins&quot;, &quot;Pete's Dragon&quot; and &quot;Bedknobs and Broomsticks&quot;. Like &quot;Who Framed Roger Rabbit&quot;, those three movies combine this &quot;marriage&quot; very well. On the other hand, other movies such as &quot;Space Jam&quot; tried this idea but without the same success.\n\nI believe that this movie was made in a unique moment of inspiration. The sceneries are great, the designs, the cartoons, the backgrounds, the details, the animation, the special effects, the artwork... everything was carefully made and I much welcome that. This is one of the greatest Disney films.\n\nGreat actors make the difference too. Bob Hoskins is English but speaks with an excellent American accent, not to mention that he does the amazing thing of acting against the air. Joanna Cassidy, Charles Fleischer, Alan Tilvern, Stubby Kaye, Cristopher Lloyd and Kathleen Turner are awesome too. Kathleen Turner is the voice of Jessica Rabbit, with that sexy and sensual voice. And... guess what! Even the singer Frank Sinatra has a minor role in this film as the hilarious but useless Singing Sword. Even without looking at the credits, who wouldn't recognize that great voice? Frank Sinatra's voice is just as recognizable as Nat King Cole's or Sterling Holloway's.\n[img]http://www.freeimage.us/image-D9EF_535116F3.jpg[/img]\nAs for the characters, the weasels are a perfect example of chronical stupidity. They're humorous because they're always laughing, even though they know what happens to someone who can't stop laughing.\n\nMarvin Acme is Â«the king of the jokesÂ», always humorous and cheerful and at his funniest with his mythical hand-buzzer. Angelo is an idiot, drunk and greedy guy, but funny at the same time. Dolores is a great character. R. K. Maroon is an interesting character with half a dark side and half a good side. Judge Doom is a great villain, humorous, mysterious and somewhat sinister. Roger Rabbit is hilarious and very jolly - that's his only purpose as a cartoon, like he says himself. Jessica Rabbit is a very sexy cartoon, one of the most beautiful and sexiest ever - she's not bad, she's just drawn that way. Benny the Cab is funny. Baby Herman is a bit annoying - he might look innocent at first, but he is extremely rude and he loves to woo women. Eddie Valiant is another great character - grumpy, serious and funny sometimes. And he looks very much like my godfather in appearance.\n\nThe movie takes place in Hollywood, 1947. It does recreate the 40's very well. That influence is notorious in many ways, including the cars used.\n\nBefore finishing, let me say that I like rabbits very much. They're adorable and very cute animals, although in the cartoons they aren't as cute - but they're usually funny in cartoons.\n\nThis should definitely be on Top 250.\n\nVIDEO\nSize.... 851mb\nDuration.... 01:43:45\nCodec.... XviD\nFrame Width.... 640\nFrame Height.... 350\nData Rate.... 1146kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 192kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 44KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:cef99f6dfd50a33fdb986de44b1d9910ca615c17","amp;dn":"Who+Framed+Roger+Rabbit+1988+BrRip+XviD+Xult","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef99f6dfd50a33fdb986de44b1d9910ca615c17","infoHashBuffer":{"type":"Buffer","data":[206,249,159,109,253,80,163,63,219,152,109,228,75,29,153,16,202,97,92,23]},"announce":[],"urlList":[]}}