{"title":"Age Of Gladiators","uid":13690026,"size":187051338,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cf10adc4c0575b283ce7f666ec1ab8490aadb850&amp;dn=Age+Of+Gladiators&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1456596337,"description":"About This Game\r\nA Potential Scenario\r\nYou’re almost out of money. Two more days and you will no longer be able to pay your staff or gladiators. The fight scheduled today will draw exceptionally massive crowds, meaning the fight purse will be bountiful and the opportunity to place a large volume of bets will be high. One problem though: your top fighter is fatigued from his last fight and has a nagging shoulder strain. Plus he has a history of concussions, so it’s fair to say he will not be at full strength if you put him in the arena. But he’s the best you’ve got. The rest of your gladiators are rookies yet; still working with your trainers and far too inexperienced to send into the crucible just yet.\r\n\r\nThe next fight is a week away and poorly hyped. You cannot wait that long.\r\n\r\nIf you were of an evil disposition, you could execute your top fighter instead and seize his life savings; with the fight purses you have shared with him through his career, he has amassed a lot of gold. It could keep you going for a month or two - maybe more. Something to consider.\r\n\r\nOr if you find that distasteful, you could go to the money lenders instead. But their interest rates have been high these last few days: 30% or more. You could finance present operations with that – but you would suffer in the longer term.\r\n\r\nSo maybe you should send your top fighter into the arena. He is bruised up and fatigued – but he also is ranked 3rd overall by the so-called experts and pundits of Leptis Magnus, the current city you reside in. You know he is one of the best and might still have a good chance at pulling out a win.\r\n\r\nOr he could lose his life.\r\n\r\nWhat do you do?","torrent":{"xt":"urn:btih:cf10adc4c0575b283ce7f666ec1ab8490aadb850","amp;dn":"Age+Of+Gladiators","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf10adc4c0575b283ce7f666ec1ab8490aadb850","infoHashBuffer":{"type":"Buffer","data":[207,16,173,196,192,87,91,40,60,231,246,102,236,26,184,73,10,173,184,80]},"announce":[],"urlList":[]}}