{"title":"Miles Davis Filles limanjaro(jazz)(flac)[rogercc]","uid":5618835,"size":424735908,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf4983d1e936bd7606a27b283438aa2cb0ea3e84&amp;dn=Miles+Davis+Filles+limanjaro%28jazz%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc","files":9,"time":1276179491,"description":"MILES DAVIS FILLES DE KILIMANJARO\nLabel: Sony Jazz\nCD Released: 2002\nFormat:Flac\n\n\n\nFilles De Kilimanjaro is one of the most singular, compelling works in the entire Miles Davis discography. It marks thecontinental divide between the trumpeter's classic '60s quintet, and the furious period of experimentation which led to Bitches Brew, On The Corner and Agatha.\nBy 1968, Miles was feeling creatively restless, and stalwarts Herbie Hancock and Ron Carter were preparing to leave (to be replaced by Chick Corea and Dave Holland). So Filles De Kilimanjaro  is a transitional work, suffused in the heady abstraction of  the'60s, but with an ear out for the blues tonalities, electronic textures, and dancing rhythms of the jazz-rock epoch to come. Nevertheless, this is neither avant-garde jazz nor fusion; it occupies a space of its own aural design--a magnificent new direction in music.\nMiles' fascination with the Fender/Rhodes electric piano, and its potential for new chordal voicings, is at the heart of Filles De Kilimanjaro . Herbie Hancock treats it percussively on the relentlessly driving &quot;Frelon Brun&quot;, and with bell-like elan on the winsome title tune. Corea, meanwhile, feeds the horns guitar-like strums on the edgy, martial &quot;Petits Machins&quot;, and bluesy washes of sound on the eerie &quot;Mademoiselle Mabry&quot;. Bassists Carter and Holland find new harmonic possibilities within their vamp-like structures, freeing Tony Williams to engage Davis and Shorter in some remarkable airborne conversations: From the &quot;All Blues&quot;/James Brown references on &quot;Toot De Suite&quot; to thefree-form mystery of &quot;Mademoiselle Mabry&quot; where all the strong rhythmic beats are air-brushed away, the trumpet and tenor saxophone are allowed to create sophisticated new forms of phrasing. \n\n1.Frelon Brun\n2.Tout de Suite\n3.]Etits Machins (Little Stuff)\n4.Filles de Kilimanjaro\n5.Mademoiselle Mabry (Miss Mabry)\n6.Tout de Suite - (alternate take)\n\n\nRecorded at Columbia Studios, New York, New York between June 21 and September 24, 1968. Originally released on Columbia (9750)\n\n[color=orangered][b]Personnel:[/b] Miles Davis (trumpet); Wayne Shorter (tenor saxophone); Herbie Hancock, Chick Corea (electric piano); Dave Holland (bass); Ron Carter (electric bass); Tony Williams (drums).\n\n","torrent":{"xt":"urn:btih:cf4983d1e936bd7606a27b283438aa2cb0ea3e84","amp;dn":"Miles+Davis+Filles+limanjaro%28jazz%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf4983d1e936bd7606a27b283438aa2cb0ea3e84","infoHashBuffer":{"type":"Buffer","data":[207,73,131,209,233,54,189,118,6,162,123,40,52,56,170,44,176,234,62,132]},"announce":[],"urlList":[]}}