{"title":"Czeslaw Milosz - The Captive Mind (pdf)","uid":8060555,"size":3024550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf4df39372e6c66e9ebffed99bb2c25df3884003&amp;dn=Czeslaw+Milosz+-+The+Captive+Mind+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":3,"time":1359057169,"description":"Czeslaw Milosz - The Captive Mind. clearscan pdf.\n\ndetails from wikipedia:\n\nThe Captive Mind is a 1953 work of nonfiction by Polish writer, academic and Nobel laureate, CzesÅ‚aw MiÅ‚osz, translated into English by Jane Zielonko. The book was written soon after the author received political asylum in Paris following his break with Poland's Communist government. It draws upon his experiences as an underground writer during World War II, and his position within the political and cultural elite of Poland in the immediate post-war years. The book attempts to explain both the intellectual allure of Stalinism and the temptation of collaboration with the Stalinist regime among intellectuals in post-war Central and Eastern Europe. MiÅ‚osz describes the book as having been written &quot;under great inner conflict&quot;.\n\nThe Captive Mind begins with a discussion of the novel Insatiability by StanisÅ‚aw Ignacy Witkiewicz and its plot device of Murti-Bing pills, which are used as a metaphor for dialectical materialism, but also for the deadening of the intellect caused by consumerism in Western society. The second chapter considers the way in which the West was seen at the time by residents of Central and Eastern Europe, while the third outlines the practice of Ketman, the act of paying lip service to authority while concealing personal opposition, describing seven forms applied in the people's democracies of mid-20th century Europe.\n\nThe four chapters at the heart of the book then follow, each a portrayal of a gifted Polish man who capitulated, in some fashion, to the demands of the Communist state. They are identified only as Alpha, the Moralist; Beta, The Disappointed Lover; Gamma, the Slave of History; and Delta, the Troubadour. However, each of the four portraits is easily identifiable: Alpha is Jerzy Andrzejewski, Beta is Tadeusz Borowski, Gamma is Jerzy Putrament and Delta is Konstanty Ildefons GaÅ‚czyÅ„ski.[3]\n\nThe book elaborates the idea of &quot;enslavement through consciousness&quot; in the penultimate chapter, and closes with a pained and personal assessment of the fate of the Baltic nations in particular.","torrent":{"xt":"urn:btih:cf4df39372e6c66e9ebffed99bb2c25df3884003","amp;dn":"Czeslaw+Milosz+-+The+Captive+Mind+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf4df39372e6c66e9ebffed99bb2c25df3884003","infoHashBuffer":{"type":"Buffer","data":[207,77,243,147,114,230,198,110,158,191,254,217,155,178,194,93,243,136,64,3]},"announce":[],"urlList":[]}}