{"title":"Homosexuality And The Law A Dictionary","uid":4705678,"size":1448053,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d03ae21cc70d8f46059df3f534020e85d51e756f&amp;dn=Homosexuality+And+The+Law+A+Dictionary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"timnehguy","files":2,"time":1233853610,"description":"Homosexuality and the Law: A Dictionary\nby Chuck Stewart \n\nPDF, 446 pp.\nNOTE: This book is from 2001, so some of the information may be out of date.\n\nThis comprehensive and thoroughly researched work considers the legal issues that gay, lesbian, bisexual, and transgendered people face daily. Encyclopedic in length, the 112 alphabetically arranged entries include &quot;Absurd Sex Laws,&quot; &quot;The Federal Employment Non-Discrimination Order,&quot; &quot;Reparative Therapy,&quot; &quot;Sexual Harassment in Schools,&quot; and &quot;Wills.&quot; These entries are fully developed with the addition of supportive or derivative themes, including lists of specific references. Uniquely, this reference represents not only solid legal material but the sociological, psychological, and medical contexts. \n\nA 23-page introduction succinctly reviews the historical evolution of the gay rights movement, from Karl Heinrich Ulrich (the grandfather of gay liberation) to Stonewall to the advent of the &quot;separate but equal&quot; slogan. The almost 100-page appendix details state and local laws on a state-by-state and city-by-city basis and also provides a comprehensive list of appropriate resources and available services. Finally, a table of statutes and a helpful index complete this monumental work. Stewart, a specialist in intercultural education, is author of Sexually Stigmatized Communities. - John-Leonard Berg, Univ. of Wisconsin Lib., Platteville \n","torrent":{"xt":"urn:btih:d03ae21cc70d8f46059df3f534020e85d51e756f","amp;dn":"Homosexuality+And+The+Law+A+Dictionary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03ae21cc70d8f46059df3f534020e85d51e756f","infoHashBuffer":{"type":"Buffer","data":[208,58,226,28,199,13,143,70,5,157,243,245,52,2,14,133,213,30,117,111]},"announce":[],"urlList":[]}}