{"title":"The Complete Untitled Film Stills - Cindy Sherman (MoMa NY - Pho","uid":8519080,"size":6773866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d054c8ad8a636929fa7bd6d750f858331d41ea46&amp;dn=The+Complete+Untitled+Film+Stills+-+Cindy+Sherman+%28MoMa+NY+-+Pho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1369855660,"description":"Cindy Sherman: The Complete Untitled Film Stills By Peter Galassi, Cindy Sherman\n2003 | 164 Pages | ISBN: 0870705075 | PDF | 6 MB\n\n\n\nSherman's provocative and much-discussed Untitled Film Stills series, created between 1977 and 1980, is collected for the first time in this 9.5&quot; x 11.25&quot; volume from MoMA, which purchased the entire set of 69 shots in 1995. Sherman's mysterious and perplexing &quot;portraits&quot; should not really be called &quot;self,&quot; since Sherman appears solely in the guises of others, donning the clothing, wigs and makeup of various female '50s and '60s film &quot;types&quot; (the forgotten wife, the boozy hussy, the working girl, etc.) and elevating the art of playing dress-up to a whole new level. In her disarmingly honest introduction to the book, Sherman says of the European film stars like Simone Signoret, Sophia Loren or Jeanne Moreau, from whom she drew her inspiration, &quot;What I was interested in was when they were almost expressionless,&quot; a rare occurrence in posed and artificial publicity shots. But while Sherman's photographs may initially resemble film stills, their grainy, dodgy quality (Sherman says, &quot;I didn't care much about the print quality; the photographs were supposed to look like they cost fifty cents&quot;); her disturbingly blank expression and chameleon-like ability to disappear into character; and the backgrounds of empty New York City streets and rundown lofts (in some ways, the photos act as a historical archive of a time when a less-gentrified New York functioned as a giant playground for artists) all conspire to give necessary dissonance to the myths Sherman explores. Sherman began making the series at the age of 23, and it soon established her as a major voice in the contemporary art scene, adding a much-needed female presence in what is more often than not a hyper-macho field. In the process of questioning the portrayal of women, Sherman questioned the art of portraiture itself and its uneasy place in 20th-century American society, opening a different path on which to proceed. ","torrent":{"xt":"urn:btih:d054c8ad8a636929fa7bd6d750f858331d41ea46","amp;dn":"The+Complete+Untitled+Film+Stills+-+Cindy+Sherman+%28MoMa+NY+-+Pho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d054c8ad8a636929fa7bd6d750f858331d41ea46","infoHashBuffer":{"type":"Buffer","data":[208,84,200,173,138,99,105,41,250,123,214,215,80,248,88,51,29,65,234,70]},"announce":[],"urlList":[]}}