{"title":"Comedy - The COMPLETE Allan Sherman - My Son The Box","uid":4319907,"size":636486062,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d0781e6618644d0dc88a40405cf64d40ee21fda3&amp;dn=Comedy+-+The+COMPLETE+Allan+Sherman+-+My+Son+The+Box&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":160,"time":1217372532,"description":"This appears to be the full and complete collection of Sherman?s songs, with a few small exceptions, as noted in the review below. All available in CD quality and remastered, not from scratchy vinyl! This torrent was made available first on DEMONOID, and I am putting it here for greater distribution. Great thanks to the original uploader.\n\nReview from Amazon.\n\nBy \tLawrance M. Bernabo  (The Zenith City, Duluth, Minnesota) - See all my reviews\n            \n&quot;Hello Muddah, hello Fadduh, \nHere I am at Camp Grenada \nCamp is very entertaining \nand they say we&amp;#039;ll have some fun if it stops raining.&quot; \n\nThat alone should remind you of why having &quot;My Son, The Box&quot; would be a good thing. The main reason would be that this includes the complete works of Allan Sherman (almost: you would still have to get &quot;Peter &amp; The Commissar,&quot; Sherman&amp;#039;s concert with Arthur Fielder and the Boston Pops separately). Besides, you get a beaten up box for the box part (Sherman would have loved this, although he probably would have loved being alive even more). For years we have had to put up with only a single Alan Sherman hits collection on CD waiting for all of his albums to finally come out. The good news is that here are six of them, with the better news being that each is filled to the gills with bonus tracks, and the only bad news being that you have to go for the whole set all at once because (for now) this is the only way they are available. Not all the tracks are cherce, but you get the whole side of beef here: \n\n&quot;My Son the Folk Singer,&quot; Sherman&amp;#039;s 1962 debut album, which made him an overnight success (aided by word from the White House that JFK loved &quot;Sarah Jackman&quot;). &quot;All&quot; Sherman did was take recognizable tunes and give them new lyrics. Thus, &quot;Frere Jacques&quot; became &quot;Sarah Jackman&quot; (sung with Christine Nelson) and &quot;The Battle Hymn of the Republic&quot; became &quot;The Ballad of Harry Lewis&quot; (which offers the immortal line about the building &quot;where the drapes of Roth are stored&quot;). Also included are &quot;Shake Hands with Your Uncle Max,&quot; &quot;My Zelda,&quot; &quot;Jump Down, Spin Around (Pick a Dress O&amp;#039; Cotton),&quot; and there are ten bonus tracks taken from his peculiar version of &quot;My Fair Lady&quot; (e.g., &quot;Get me to the Temple on Time&quot;). \n\n&quot;My Son, the Celebrity&quot; (1963) was my first exposure to Alan Sherman and remains my favorite. There is not one song on this album (i.e., the first eleven tracks) that I do not treasure. If you force me to name favorites I would go with &quot;Bronx Bird Watcher,&quot; &quot;Let&amp;#039;s All Call Up A.T. &amp;T. And Protest to the President March,&quot; &quot;Harvey and Sheila,&quot; &quot;No One&amp;#039;s Perfect,&quot; and the two that I have been known to sign out loud, &quot;Me&quot; and the &quot;Shticks of One and Half a Dozen of the Other&quot; medley. Tacked on here are some choice outtakes, &quot;Chopped Liver&quot; and &quot;Smart Ass,&quot; But when you get to &quot;You Went the Wrong Way, Old King Louie&quot; you have actually jumped ahead to the next album. \n\n&quot;My Son, The Nut&quot; hit #1 on the album charts in 1963 and you know it was on the strength of &quot;Hello Muddah, Hello Faddah (A Letter From Camp)&quot; (remember the game? &quot;You will love it, love it madly, it&amp;#039;s a new game brought to you by Milton Bradley&quot;). I liked &quot;Hungarian Goulash No. 5&quot; and there is a reason that &quot;Hail to Thee, Fat Person&quot; ends the greatest hits CD. Before we get to the next album Debbie Reynolds shows up for &quot;Sue Me&quot; and we get the single version of &quot;The Twelve Days of Christmas.&quot; \n\nOkay, things are getting complicated, but when you get to Track 9 on Disc 3, &quot;Skin,&quot; we have moved on to 1964&amp;#039;s &quot;Allan in Wonderland.&quot; This album did not sell as well as the first three, which might be why they are splitting up albums this way on this six-CD set. &quot;Lotsa Luck&quot; is okay, &quot;Night and Day (With Punctuation Marks)&quot; has its moments (as Victor Borge could have told you), and &quot;Good Advice&quot; is also okay. But this was clearly a weaker effort. Even the single version of &quot;My Son, the Vampire&quot; lacks the proper bite (insert rim shot here). \n\nAlso from 1964 is &quot;For Swingin&amp;#039; Livers Only,&quot; but first we get the 1964 version of &quot;Hello Muddah, Hello Faddah.&quot; Tracks 2-12 constitute the album, which includes the edited version of &quot;The Twelve Days of Christmas&quot; and &quot;Pop Hates the Beatles.&quot; This one is better than the previous album, but not on the level of the first three. \n\nOkay, we are still on Disc 4 but now up to 1965&amp;#039;s &quot;My Name is Allan&quot; (you have to see the cover art to see he had the same childhood photographer as Barbra Streisand), but is another sub-par effort (just listen to &quot;The Laarge Daark Aardvark Song&quot;). Songs like &quot;That Old Back Scratcher&quot; and &quot;Call Me&quot; seem like second-class retreads of earlier material. &quot;Peyton Place U.S.A.&quot; and &quot;It&amp;#039;s a Most Unusual Play&quot; are the two best tracks, more for their satire than the linguistic wit that was Sherman&amp;#039;s hallmark (see &quot;Chim Chim Cheree&quot; for an example of the latter). \n\nDisc 5 starts with the extended version of &quot;Crazy Downtown&quot; and a bunch of outtakes before getting to 1966&amp;#039;s &quot;Allan Sherman Live! (Hoping You Are the Same),&quot; where he does more standup between songs than ever before. This does get him back to recording live in front of an orchestra in Las Vegas, but the material is just okay. \n\nDisc 6 gets us to Sherman&amp;#039;s final release for Warner Bros., &quot;Togetherness&quot; from 1967, and finds him heading in strange directions (check out the title track and &quot;Plan Ahead&quot;) Sherman&amp;#039;s studio recordings are not as good as when he is live in front of an audience. The last track on the album, &quot;There&amp;#039;s No Governor Like Our New Governor&quot; is about Ronald Reagan, and has some added irony given what we know now (there is also some other takes for added historical interest). We end with a whole bunch of songs about Enron (the fiber) and at the end we return again to the best track here to end on a good note, to wit: \n\n&quot;Wait a minute, it stopped hailing, \nGuys are swimming, guys are sailing, \nPlaying baseball, gee that&amp;#039;s better, \nMuddah Fadduh please disregard this letter.&quot;\n","torrent":{"xt":"urn:btih:d0781e6618644d0dc88a40405cf64d40ee21fda3","amp;dn":"Comedy+-+The+COMPLETE+Allan+Sherman+-+My+Son+The+Box","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0781e6618644d0dc88a40405cf64d40ee21fda3","infoHashBuffer":{"type":"Buffer","data":[208,120,30,102,24,100,77,13,200,138,64,64,92,246,77,64,238,33,253,163]},"announce":[],"urlList":[]}}