{"title":"DESCENT INTO THE MAELSTROM - LENNIE TRISTANO[TNTVILLAGE]","uid":5338010,"size":119364419,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d094a354f79e2f30593c91c33750d9a9326d25ce&amp;dn=DESCENT+INTO+THE+MAELSTROM+-+LENNIE+TRISTANO%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":15,"time":1265378862,"description":"[b][color=blue]LENNIE TRISTANO\n\nDESCENT INTO THE MAELSTROM\n[/b][/color]\n\n[b][color=green]::-&gt;Cover&lt;-::[/b][/color]\n\n[IMG]http://img697.imageshack.us/img697/4669/lpfront1lennie.jpg[/IMG]\n\n[b][color=green]::-&gt;Dati Album&lt;-::[/color][/b]\n\n[b]Autore:[/b] Lennie Tristano\n[b]Titolo:[/b] Descent Into The Maelstrom\n[b]Genere:[/b] Jazz\n[b]Anno:[/b] 1978\n[b]Etichetta:[/b] Universal\n\nRecorded betweeen 1953 and 1965. Released in 1978.\n\nLennie Tristano, piano\nSonny Dallas, bass\nPeter Ind, bass\nRoy Haynes, drums\nNick Stabulas, drums\n\n[b][color=green]::-&gt;Tracklist&lt;-::[/color][/b]\n \n1. Descent Into the Maelstrom 3:28\n2. Dream: Paris 1965 6:27\n3. Image: Paris 1965 4:33\n4. Take 1 - Rehearsal From Recording Date 3:13\n5. Take 2 - Rehearsal From Recording Date 4:06\n6. Take 3 - Rehearsal From Recording Date 6:35\n7. Stretch 6:11\n8. Pastime 3:42\n9. Ju-Ju 2:16\n10. Con Con 8:47\n\n[b][color=green]::-&gt;Recensione di: DanteCruciani&lt;-::[/color][/b]\n\nLa prima volta che ho ascoltato questo disco sono rimasto folgorato dalla sua Subdola bellezza.   \nIl pianismo di Lennie Tristano ÃƒÂ¨ una creatura molto difficile da descrivere, tante sono le sue facce e le sue sfumature. Ma il suo ascolto ÃƒÂ¨ un'esperienza che definirei &quot;sciamanica&quot;, intendendo con questo termine la capacitÃƒÂ  della sua musica di farci vagare in circolo come barche sul mare, e di tanto in tanto di darci la possibilitÃƒÂ  di attraccare, anche se per pochissimo, su isole misteriose e oscure. L'aura particolare di questo personaggio ÃƒÂ¨ visibile fin dalla copertina del disco: colori scuri, faccia dai tratti fortemente marcati, espressione enigmatica.\nCieco fin dall'infanzia, Lennie Tristano nacque nel 1919 a Chicago, da genitori italiani provenienti da Aversa (Caserta).  SuonÃƒÂ² il piano e altri strumenti fin da piccolissimo, mostrando immediatamente un'innata e maestosa capacitÃƒÂ  musicale. Col passare degli anni iniziÃƒÂ² a suonare in molti club dixieland di Chicago, finchÃƒÂ¨ negli anni '40 si trasferÃƒÂ¬ a New York. Geniale e intrigante, in breve iniziÃƒÂ² a frequentare ed a suonare con artisti del calibro di Lee Konitz , Charlie Parker, Dizzie Gillespie, Bud Powell. Proprio quest' ultimo pianista fu indicato da Tristano come sua grande fonte di ispirazione. Ma la sua musica ÃƒÂ¨ qualcosa che travalica anche il be-bop, a quell'epoca la piÃƒÂ¹ innovativa e particolare forma di jazz in circolazione. E' una musica che va dietro le cose, un approccio che, come nel caso di Miles Davis o Robert Wyatt, tende l'orecchio per esplorare vie piÃƒÂ¹ nascoste, ma anche piÃƒÂ¹ genuine. Tristano comunque ama e quindi suona del jazz, questo ÃƒÂ¨ sicuro; e non si abbandona di certo a forme d'avanguardia sterile. La sua musica risulta tuttavia incredibilmente particolare: io la definirei un misto di Bud Powell e Thelonious Monk, ma come se il tutto fosse suonato da un mago di magia nera su di un vecchio pianoforte. A creare strane formule d'alchimia musicale.\nDi grande importanza temporale e musicale ÃƒÂ¨ proprio il brano che dÃƒÂ  il titolo al disco e lo apre: &quot;Discesa nel MaelstrÃƒÂ¶m&quot;. Esso risale al 1953, mentre l'intero disco ÃƒÂ¨ in realtÃƒÂ  un insieme di registrazioni avvenute tra il 1951 e il 1965. E il brano in questione ÃƒÂ¨ un grande esempio di free-jazz ante litteram, che precede di almeno 5-6 anni i lavori di Ornette Coleman. Il titolo ÃƒÂ¨ ispirato all'omonimo racconto di Edgar Allan Poe. Il protagonista della vicenda ÃƒÂ¨ in compagnia di una guida, che lo scorta fin sopra un altissimo dirupo norvegese a picco sul mare, per fargli osservare l'enorme vastitÃƒÂ  oceanica sottostante, nella quale avviene uno strano fenomeno di mulinello gigante chiamato &quot;MaelstrÃƒÂ¶m&quot;. Successivamente la guida, un pescatore del posto, racconta di come una volta egli sia sopravvissuto dopo essere finito con la sua grande imbarcazione all'interno del mulinello. E di come abbia potuto vedere l'inferno da due passi. E il pianoforte di Tristano ÃƒÂ¨ talmente misterioso, gelido, forsennatamente impetuoso e ruotante che quel racconto te lo fa sentire fin sotto la pelle. Le note schizzano e si fermano, e poi di nuovo riprendono, stridendo e spruzzando come le schiuma delle onde sul legno della nave. E' una triste ricerca, un doloroso viaggio nel suo (nel nostro) MaelstrÃƒÂ¶m personale, che rimane forse l'abisso piÃƒÂ¹ scuro e profondo con cui possiamo avere a che fare. Dal racconto:\n\n     &quot;Pur sentendomi stordito, tesi lo sguardo e vidi un'ampia distesa d'oceano . A dritta e a manca, sin dove poteva giungere lo sguardo, si stendevano, quasi fossero i contrafforti stessi dell'universo, file e file di rupi spaventosamente nere... &quot;\n\n Il disco ÃƒÂ¨ composto da 10 brani, di cui i primi 6 di solo pianoforte, e lo possiamo suddividere piÃƒÂ¹ precisamente in quattro parti ideali:\n\n   1.\n      Il brano d'apertura;\n   2.\n      I brani 2 e 3, &quot;Dream-Paris&quot; e &quot;Image-Paris&quot;: pezzi di jazz &quot;classico&quot;, diciamo alla &quot;Woody Allen&quot;, ma che mantengono al loro interno un'aura misteriosa, con continuo alternarsi di accordi minori e maggiori che riverberano tra loro;\n   3.\n      I brani 4, 5, 6: tre diverse versioni dello stesso pezzo, la cui differenza sta in come vengono suonate le parti di basso, piÃƒÂ¹ veloci nel take 1, e progressivamente piÃƒÂ¹ lente nel take 2 e 3. Il risultato ÃƒÂ¨ subdolamente affascinante; prima l'oppressione dei bassi sembra piÃƒÂ¹ sfuggente, poi ÃƒÂ¨ sempre piÃƒÂ¹ evidente, come un'evoluzione verso l'oscuritÃƒÂ , ancora verso quell'abisso. Le note alte sono invece veloci, squillanti, stridenti: qui c'ÃƒÂ¨ tutta la descrizione dell'uomo, della luce e dell'ombra, dello Yin e dello Yang;\n   4.\n      I brani 7, 8, 9, 10: qui Tristano ÃƒÂ¨ accompagnato dal basso e da una vitalissima batteria. Ci troviamo di fronte a be-bop puro e semplice, piÃƒÂ¹ o meno velocizzato; il pianoforte si muove attraverso voli potenti e swingate sinistre. Conclude il tutto una batteria che ancora una volta definirei &quot;sciamanica&quot;.\n\nDa aggiungere che le registrazioni sono vecchie e non impeccabili, e la musica sembra quasi uscire fuori da un vecchio grammofono di una casa abbandonata, creando un'atmosfera ancor piÃƒÂ¹ noir e sinistra.            \n\nChiunque abbia avuto la pazienza di arrivare a leggere fin qui, lo ringrazio. Forse avrÃƒÂ  l'opportunitÃƒÂ  di conoscere meglio questo stranissimo artista, di tecnica sopraffina e capace di suonare davvero di tutto con tutti. Charlie Parker lo definÃƒÂ¬ &quot;Il Grande Acclimatatore&quot;. Io lo chiamo il grande &quot;Camaleonte Nero&quot;.\n\n\n[b][color=green]::-&gt;Dati Tecnici e Note&lt;-::[/color][/b]\n[color=red]\n[b]MP3 a 320 kb/s \nCover e Note allegate[/b]\n[/color]\n[b][color=red]TNTVILLAGE.SCAMBIOETICO.ORG[/b][/color]","torrent":{"xt":"urn:btih:d094a354f79e2f30593c91c33750d9a9326d25ce","amp;dn":"DESCENT+INTO+THE+MAELSTROM+-+LENNIE+TRISTANO%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d094a354f79e2f30593c91c33750d9a9326d25ce","infoHashBuffer":{"type":"Buffer","data":[208,148,163,84,247,158,47,48,89,60,145,195,55,80,217,169,50,109,37,206]},"announce":[],"urlList":[]}}