{"title":"R.E.M. - Perfect Square (Germany) (ISO-DVD) (2003)","uid":9734828,"size":7255302144,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d0c907c9ba70346541325203eab1c43a1e628300&amp;dn=R.E.M.+-+Perfect+Square+%28Germany%29+%28ISO-DVD%29+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sanhuesoft","files":1,"time":1394429853,"description":"=====================\nD E S C R I P T I O N\n=====================\n\nPerfect Square is a video recording of a concert by rock band R.E.M., filmed on 19 July 2003 at the Bowling Green in Wiesbaden, Germany. It was released in DVD format on the Warner Brothers label on March 9, 2004.\n\nThis concert is perhaps most notable for a performance of the song &quot;Country Feedback&quot;, which Michael Stipe opens by declaring it his &quot;favorite song&quot;. The rendition features appended lyrics from another song, Reveal's &quot;Chorus and the Ring&quot;, and a guitar solo by Peter Buck, neither of which are in the original. The performance (in audio form) also found its way onto the limited edition issue of the In Time compilation, which was released a few months after the Wiesbaden concert.\n\nOther concert highlights include the appearance of two then-new songs, &quot;Bad Day&quot; (Also originally known as PSA when first written in the early 1980s) and &quot;Animal&quot;, and the re-emergence of the long-lost song &quot;Permanent Vacation&quot;. &quot;Permanent Vacation&quot; dates back to 1980, years before their first album, while &quot;Bad Day&quot; dates back to 1985.\n\nIncluded on the DVD release is a bonus documentary, A Stirling Performance, chronicling the band's three-night stand at Stirling Castle in Scotland in July 1999. The documentary demonstrates the effect the concerts had on Stirling and its residents. It was released in 2000.\n\nThe documentary premiered in the UK on October 17, 2000, at London's Metro Cinema during the Raindance Film Festival. Its US premiere occurred at 7 Stages in Atlanta, Georgia, on June 10, 2001.","torrent":{"xt":"urn:btih:d0c907c9ba70346541325203eab1c43a1e628300","amp;dn":"R.E.M.+-+Perfect+Square+%28Germany%29+%28ISO-DVD%29+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c907c9ba70346541325203eab1c43a1e628300","infoHashBuffer":{"type":"Buffer","data":[208,201,7,201,186,112,52,101,65,50,82,3,234,177,196,58,30,98,131,0]},"announce":[],"urlList":[]}}