{"title":"The Wind (1928)","uid":4830100,"size":4358258379,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d14d043172c9c8873de17734ae435b4ff57482ce&amp;dn=The+Wind+%281928%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Willams","files":25,"time":1239099903,"description":"The Wind (1928)\n\n\nTitolo originale: The Wind\nPaese: Stati Uniti d'America\nAnno: 1928\nDurata: 95'\nColore: B/N\nAudio: muto\nGenere: drammatico\nRegia: Victor SjÃƒÂ¶strÃƒÂ¶m\nSoggetto: Dorothy Scarborough\nSceneggiatura: Frances Marion\nProduttore: AndrÃƒÂ© PaulvÃƒÂ©\nCasa di produzione: Metro-Goldwyn-Mayer\n\nInterpreti e personaggi\n\n* Lilian Gish: Letty\n* Lars Hanson: Liege\n* Montagu Love: Roddy\n* Dorothy Cumming: Cora\n* Edward Earle: Beverly\n* William Orlamond: Sounrdough\n* Carmencita Johnson: La figlia di Cora\n* Billy Kent Schaefer: La figlia di Cora\n* Leon Janney: La figlia di Cora\n\n\nSINOSSI\n\nRagazza della Virginia arriva nel Texas, in una zona arida e ventosa, ospite di un cugino e malvista dalla moglie di lui. Sposa un uomo che non ama, impara ad amarlo, ma ÃƒÂ¨ costretta a uccidere un suo amico che tenta di violentarla.\n\n\nRECENSIONE\n\nFilm muto, ma presentato negli Stati Uniti con effetti sonori sincronizzati su dischi.\nUna giovinetta del Sud (Lillian Gish) arriva in una zona deserta del West per vivere con un parente (William Orlamond) sposato a una donna brutale (Dorothy Cummings). Per sfuggirle, ella acconsente a un &quot;matrimonio bianco&quot; con un rozzo cowboy (Lars Hanson). Durante una tempesta, un forestiero (Montagu Love) vuole usarle violenza, ma ella lo uccide, e lo seppellisce coll'aiuto del marito che ha sempre amato.\nÃƒË† uno dei massimi capolavori dell'arte muta e il miglior film americano di SjÃƒÂ¶strÃƒÂ¶m non certo inferiore alle sue opere svedesi. Sin dalla prima sequenza interviene il vento, il personaggio essenziale del dramma. La protagonista arriva dalla Virginia, il paese in cui l'erba ÃƒÂ¨ sempre verde e, dopo una lunga curva del treno, una tempesta di sabbia l'assale improvvisamente. SjÃƒÂ¶strÃƒÂ¶m esprimerÃƒÂ  questo conflitto seguendo lo stile di regia che aveva creato in Svezia, che non deve nulla a Stroheim, ma col quale si puÃƒÂ² paragonare, come ha osservato Lewis Jacobs, che ha poi aggiunto: &quot;Egli sa sfruttare i particolari nell'interno d'una scena, piÃƒÂ¹ che comporre una scena col montaggio di inquadrature di particolari. In una sequenza, per esempio, la moglie del parente (Dorothy Cummings ) sta per tagliare un pezzo di vitello in cucina, ed ÃƒÂ¨ quindi sporca di sangue. La giovinetta, che viene a cercare un ferro per stirare, vede il sangue e si tira indietro con ripugnanza. L'incidente ÃƒÂ¨ descritto nella sequenza con un ricorso al montaggio veramente minimo &quot;.\nSe Lillian Gish ÃƒÂ¨ in Il vento non meno perfetta di quanto fu in Giglio infranto, non meno bravo di lei ÃƒÂ¨ Lars Hanson, che compare prima nella parte d'una specie di scemo del villaggio, ebete, mal messo, con la barba lunga, miserabile, cui la moglie dopo il matrimonio rifiuta naturalmente l'amplesso, ma che l'amore rende un uomo degno d'essere amato. Lo scioglimento ÃƒÂ¨ audacissimo, soprattutto per Hollywood. Quando il marito rientra nella povera casa e trova il cadavere, approva l'assassinio compiuto dalla moglie; i due non pensano neanche per un momento d'avvertire lo sceriffo, ma si sbarazzano del morto seppellendolo nella sabbia, e diventano allora finalmente marito e moglie, raggiungendo cosÃƒÂ¬ &quot;la felicitÃƒÂ  nel delitto&quot;. &quot;Quel che SjÃƒÂ¶strÃƒÂ¶m trovÃƒÂ² di colpo nella sua ultima opera importante ÃƒÂ¨ una relazione perfetta, personale, tra sceneggiatura e montaggio, tra concreto e astratto, tra il gesto e la visione generale&quot; (R. Bellour). Se, fuori degli Stati Uniti, il film fu sempre presentato muto, l'efficacia delle immagini ÃƒÂ¨ tale che lo spettatore crede continuamente di sentire il sibilo del vento che scuote la casa, e ne fa vibrare le finestre; la suggestione ÃƒÂ¨ tale che par quasi di sentir sulla pelle il contatto della sabbia sospesa ovunque nell'aria.\nDa Dizionario dei film, Firenze, Sansoni, 1968\n\n\nCARATTERISTICHE DEL DVD5\n\n\nDurata: 95'\nLingue: Muto [(Silent) con accompagnamento musicale\nSottotitoli: Italiano e Spagnolo\nFormato Video: 1.33:1\nCompressione: NESSUNA\nProgrammi utilizzati: DVD Decrypter\nContenuti Extra: - Introduzione di Lillian Gish - Galleria fotografica\nCover: Allegata\n\n\nCasa Distributrice: NoShame\n\n\nTNTVILLAGE.SCAMBIOETICO.ORG\n\nIMDB: 8.4/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0019585/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0019585/&lt;/a&gt;","torrent":{"xt":"urn:btih:d14d043172c9c8873de17734ae435b4ff57482ce","amp;dn":"The+Wind+%281928%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d14d043172c9c8873de17734ae435b4ff57482ce","infoHashBuffer":{"type":"Buffer","data":[209,77,4,49,114,201,200,135,61,225,119,52,174,67,91,79,245,116,130,206]},"announce":[],"urlList":[]}}