{"title":"Behavioral Emergencies for the Emergency Physician [PDF]~StormRG","uid":9619627,"size":6113387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1722a33f695a94bdf61ed5395a59dc39e43e457&amp;dn=Behavioral+Emergencies+for+the+Emergency+Physician+%5BPDF%5D%7EStormRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"0xmovva","files":-1,"time":1392481280,"description":"Pages: 414 \nPublisher: Cambridge University Press; 1 edition (May 6, 2013)\nLanguage: English\nISBN-10: 110701848X\nISBN-13: 978-1107018488\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nEmergency physicians, in all practice settings, care for patients with both undifferentiated psycho-behavioral presentations and established psychiatric illness. This reference-based text goes beyond diagnostics, providing practical input from physicians experienced with adult emergency psychiatric patients. Physicians will increase their understanding and gain confidence working with these patients, even when specialized psychiatric back-up is lacking. Behavioral Emergencies for the Emergency Physician is comprehensive, covering the pre-hospital setting and advising on evidence-based practice; from collaborating with psychiatric colleagues to establishing a psychiatric service in your ED. Sedation, restraint and seclusion are outlined. Potential dilemmas when treating pregnant, geriatric or homeless patients with mental illness are discussed in detail, along with the more challenging behavioral diagnoses such as malingering, factitious and personality disorders. This go-to, comprehensive volume is invaluable for trainee and experienced emergency physicians, as well as psychiatrists, psychologists, psychiatric and emergency department nurses and other mental health workers.","torrent":{"xt":"urn:btih:d1722a33f695a94bdf61ed5395a59dc39e43e457","amp;dn":"Behavioral+Emergencies+for+the+Emergency+Physician+%5BPDF%5D%7EStormRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1722a33f695a94bdf61ed5395a59dc39e43e457","infoHashBuffer":{"type":"Buffer","data":[209,114,42,51,246,149,169,75,223,97,237,83,149,165,157,195,158,67,228,87]},"announce":[],"urlList":[]}}