{"title":"The Complete Bad Company (2011) (Digital) (DR &amp; Quinch-Empir","uid":10770329,"size":227866491,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d1a3e35640822bc1ed6ec341c839bc73d92b0829&amp;dn=The+Complete+Bad+Company+%282011%29+%28Digital%29+%28DR+%26amp%3B+Quinch-Empir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nemesis43","files":1,"time":1408069134,"description":"The Complete Bad Company (2011) (Digital) (DR &amp; Quinch-Empire)\n\n\nReprints Bad Company from the pages of weekly British anthology comic 2000AD \n\n- nearly 400 digital pages of one of 2000ADs best - a future war tale with a outstanding creative team - Alan Grant, John Wagner and Peter Milligan, their idea was reworked by Brett Ewins and Jim McCarthy to become the 80`s gem that`s still a favorite today.\n\nHumanity is at war with a strange alien species known as the Krool. Young soldier Danny Franks is fighting on the planet Ararat, recruited by the renegades known as Bad Company after the destruction of his own platoon. As their name might suggest this is no ordinary group of soldiers; instead they are a collection of freaks and maniacs led by Kano, a Frankenstein's Monster-like character with a secret kept in a little box.\n\n\nDanny Franks - a naive young soldier whose story we follow as he gets broken and broken in. He narrates the story through his diary. He later becomes the leader of Bad Company when Kano is thought dead.\n    \nMac - A member of the same battalion as Danny, who joins Bad Company at the same time.\n    \nTrucker - Another member of Danny's battalion.\n    \nKano - the leader of Bad Company, who has had half his human brain replaced with a Krool half.\n    \nMad Tommy Churchill - a soldier who apparently believes himself to be a British soldier fighting World War II.\n    \nThrax - a cadaverous and unpleasant figure, who often expresses mistrust at Kano's leadership abilities.\n    \nWallbanger - the Company's robot, who as well as being a heavily armed fighter, is also the group's medic, scientist, food synthesizer and chef.\n    \nMalcolm - one of the few members of the Company to treat Danny in a friendly manner, and perhaps the most human.\n    \nDogbrain - a man whose brain has been replaced with that of a dog by the Krool.\n    \nFlytrap - having lost his arm, he replaced it with a carnivorous Ararat plant. This makes him sensitive to changes in the Ararat environment.\n    \nGobber - a native of Ararat. He acts as the Company's guide. He also has the ability to spit a substance like &quot;unbreakable chewing gum&quot;.\n    \nShrike - Companion of Thrax - resembles a voodoo-style witch-doctor in appearance.\n    \nJoe Scummer - Member of Bad Company. The first to try to open Kano's box.\n    \nStitches - Bad Company member with heavy facial scarring, hence his nickname.\n","torrent":{"xt":"urn:btih:d1a3e35640822bc1ed6ec341c839bc73d92b0829","amp;dn":"The+Complete+Bad+Company+%282011%29+%28Digital%29+%28DR+%26amp%3B+Quinch-Empir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1a3e35640822bc1ed6ec341c839bc73d92b0829","infoHashBuffer":{"type":"Buffer","data":[209,163,227,86,64,130,43,193,237,110,195,65,200,57,188,115,217,43,8,41]},"announce":[],"urlList":[]}}