{"title":"Mirror, Mirror: The Uses and Abuses of Self-Love (2014) epub","uid":9904806,"size":2112580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2348fecde06e64fe0212c47fe4c3bf2e66cd556&amp;dn=Mirror%2C+Mirror%3A+The+Uses+and+Abuses+of+Self-Love+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1396821837,"description":"Everyone deplores narcissism, especially in others. The vain are by turns annoying or absurd, offending us whether they are blissfully oblivious or proudly aware of their behavior. But are narcissism and vanity really as bad as they seem? Can we avoid them even if we try? In Mirror, Mirror, Simon Blackburn, the author of such best-selling philosophy books as Think, Being Good, and Lust, says that narcissism, vanity, pride, and self-esteem are more complex than they first appear and have innumerable good and bad forms. Drawing on philosophy, psychology, literature, history, and popular culture, Blackburn offers an enlightening and entertaining exploration of self-love, from the myth of Narcissus and the Christian story of the Fall to today's self-esteem industry.\n\n A sparkling mixture of learning, humor, and style, Mirror, Mirror examines what great thinkers have said about self-love--from Aristotle, Cicero, and Erasmus to Rousseau, Adam Smith, Kant, and Iris Murdoch. It considers today's &quot;me&quot;-related obsessions, such as the &quot;selfie,&quot; plastic surgery, and cosmetic enhancements, and reflects on connected phenomena such as the fatal commodification of social life and the tragic overconfidence of George W. Bush and Tony Blair. Ultimately, Mirror, Mirror shows why self-regard is a necessary and healthy part of life. But it also suggests that we have lost the ability to distinguish--let alone strike a balance--between good and bad forms of self-concern.\n","torrent":{"xt":"urn:btih:d2348fecde06e64fe0212c47fe4c3bf2e66cd556","amp;dn":"Mirror%2C+Mirror%3A+The+Uses+and+Abuses+of+Self-Love+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2348fecde06e64fe0212c47fe4c3bf2e66cd556","infoHashBuffer":{"type":"Buffer","data":[210,52,143,236,222,6,230,79,224,33,44,71,254,76,59,242,230,108,213,86]},"announce":[],"urlList":[]}}