{"title":"Neil Gaiman, Dave McKean - Signal To Noise (New Edition)","uid":8643501,"size":88648649,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d2c791585f4ac8143cba65e83dac8ded723d4bb0&amp;dn=Neil+Gaiman%2C+Dave+McKean+-+Signal+To+Noise+%28New+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1372930951,"description":"'Signal To Noise'\n\nDark Horse Comics, 2007, 83 pages\n\nWritten by Neil Gaiman\n\nIllustrated by Dave McKean\n\nNeil Gaiman and Dave McKean present their masterpiece in a completely remastered and redesigned edition overflowing with bonus material! Somewhere in London, a film director is dying of cancer. His life's crowning achievement, his greatest film, would have told the story of a European village as the last hour of 999 A.D. approached - the midnight that the villagers were convinced would bring with it Armageddon. Now that story will never be told. But he's still working it out in his head, making a film that no one will ever see. No one but us. Serialized in The Face in 1989, expanded and revised into a graphic novel in 1992, and adapted for radio in 2000, Signal to Noise has never stopped evolving. The bonus material in this edition captures every leg of the journey, including three related short stories unseen in nearly two decades, an additional chapter created for the CD release of the radio drama, and a new introduction by Dave McKean along with the original by Jonathan Carrol and the radio drama introduction by Neil Gaiman.\n\n--------------------------------------------------------------------------------------\n\nI tried to download the 'Signal To Noise' that is already available here at TPB to be sure I wasn't doing a double-up, but it wasn't moving at all past about 2%, so I gave up. It doesn't really matter, though, because I'm quite certain that it isn't a digital version, and this is (I believe it was released in 2012 for the 20th Anniversary of the first printing). Already my single favorite Gaiman/McKean work (of those where McKean illustrates the guts), the beauty of the images in this version took it up another couple notches. I've read this book at least ten times over the years and looking at this version I noticed things I'd never seen before (and I'm not just talking about the bonus material, sillies).  ","torrent":{"xt":"urn:btih:d2c791585f4ac8143cba65e83dac8ded723d4bb0","amp;dn":"Neil+Gaiman%2C+Dave+McKean+-+Signal+To+Noise+%28New+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2c791585f4ac8143cba65e83dac8ded723d4bb0","infoHashBuffer":{"type":"Buffer","data":[210,199,145,88,95,74,200,20,60,186,101,232,61,172,141,237,114,61,75,176]},"announce":[],"urlList":[]}}