{"title":"The Clique - Sugar On Sunday - Collection (2006) [FLAC]","uid":10361773,"size":408810352,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d36626e30a0bb4f23213fcc50787f8061981c8d3&amp;dn=The+Clique+-+Sugar+On+Sunday+-+Collection+%282006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":37,"time":1402816951,"description":"The Clique - Sugar On Sunday - The Definitive Collection (2006) \n\nThe Clique was a late 1960s American sunshine pop band from Houston\n\nTracklist:\n\n1. Sugar On Sunday\n2. My Darkest Hour\n3. Holiday\n4. Hallelujah!\n5. I'll Hold Out My Hand\n6. Judy, Judy, Judy\n7. Little Miss Lucy\n8. Soul Mates\n9. (There Ain't) No Such Thing As Love\n10. Superman\n11. Shadow Of Your Love\nBonus tracks:\n12. Sparkle And Shine\n13. I'm Alive\n14. Memphis\n15. Southbound Wind\n16. Superman (single version)\n17. Shadow Of Your Love (single version)\n18. Splash 1\n19. Stay By Me\n20. Love Ain't Easy\n21. Gotta Get Away\n\n\n\nThe sole album by the Clique is in reality the last full album cult hero Gary Zekley would produce. (Though the Austin-based band, also renowned in garage-psych circles for the first known cover of a Roky Erickson song, had recorded several previous singles, they did not play on the album; only singer Randy Shaw appears, with backing vocalists and musicians pulled from Zekley's usual stable of L.A. session pros.) Although the album spawned a Top 40 hit in the Tommy James-penned &quot;Sugar on Sunday&quot; and is best known for containing the original &quot;Superman,&quot; an underground garage rock classic given a new commercial life when R.E.M. covered it on Lifes Rich Pageant, it's not really Zekley's best work. By 1969, Zekley's brand of sunshine pop was out of commercial favor, and too much of The Clique is taken up with blatant copies of the current AM chart favorites. &quot;Hallelujah!&quot; is a blatant Blood, Sweat &amp; Tears rip-off, and &quot;Judy Judy Judy&quot; is pure Three Dog Night (with the &quot;Sock it to me!&quot; chorus shamelessly added to tie into Laugh-In star Judy Carne's popularity). For all the shameless hucksterism, though, Zekley still manages a few gems, particularly the Tommy James-like &quot;Little Miss Lucy&quot; and the hyper-dramatic &quot;My Darkest Hour.&quot; (The cover of the Bee Gees' &quot;Holiday&quot; is nice, too, though it adds little to the original.) And, true, &quot;Superman&quot; deserves every bit of its acclaim; it's by far the best song on the album. The Clique is perfectly listenable and occasionally terrific, but this is not Zekley at the peak of his powers; try the Yellow Balloon's self-titled disc or the Fun and Games' Elephant Candy for that. The Varese Sarabande reissue adds seven tracks from demos and singles, including two songs produced by Tommy James and featuring the Shondells as Shaw's backing group.\n","torrent":{"xt":"urn:btih:d36626e30a0bb4f23213fcc50787f8061981c8d3","amp;dn":"The+Clique+-+Sugar+On+Sunday+-+Collection+%282006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d36626e30a0bb4f23213fcc50787f8061981c8d3","infoHashBuffer":{"type":"Buffer","data":[211,102,38,227,10,11,180,242,50,19,252,197,7,135,248,6,25,129,200,211]},"announce":[],"urlList":[]}}