{"title":"Zeitgeist Addendum - deutsch synchronisiert - HQ-DVDrip.avi","uid":4846222,"size":1051845674,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d488fd81a7c384052f864c97c5dd2d9d3a748544&amp;dn=Zeitgeist+Addendum+-+deutsch+synchronisiert+-+HQ-DVDrip.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nuntium","files":1,"time":1239697802,"description":"Der Kern aller Probleme in unserer Welt ist das Geldsystem, welches einen unendlichen Schuldensog erzeugt und uns zwingt alle Entscheidungen und Handlungen in unserem Leben nach finanziellem Profit auszurichten. Dadurch verschwenden wir (bewusst und unbewusst) einen groÃƒÅ¸en Teil unserer Energie mit selbstsÃƒÂ¼chtigem, korruptem Verhalten, anstatt in Freiheit die gemeinsame Entfaltung der Menschheit im Einklang mit der Natur genieÃƒÅ¸en zu kÃƒÂ¶nnen. Politik, Religion und andere Gesetze sind niemals eine MÃƒÂ¶glichkeit, um gesellschaftliche Probleme zu lÃƒÂ¶sen oder einen Wechsel herbeizufÃƒÂ¼hren. Sie sind nur ein Symptom der korrupten Profit-Struktur des Kapitalismus. Einleitung: Unsere Gesellschaft ist strukturiert und kontrolliert von Organisationen. Politische Organisationen, Wirtschaftsorganisationen, ReligiÃƒÂ¶se Organisationen, Soziale Organisationen, Internationale..., Nationale..., Regionale... In diese Struktur werden wir hineingeboren und konditioniert. Das ist unsere RealitÃƒÂ¤t und diese RealitÃƒÂ¤t wird nicht angezweifelt. Das grÃƒÂ¶ÃƒÅ¸te Problem an der Sache ist das Geldsystem, die Finanz-Organisationen, die am allerwenigsten angezweifelt und durchschaut werden. Unser Wirtschafssystem ist scheinbar grundlegend notwendig fÃƒÂ¼r unseren alltÃƒÂ¤glichen Wohlstand und es scheint undenkbar, dass genau dieses System die Ursache fÃƒÂ¼r die immer weiter zunehmende weltweite Verarmung und Versklavung ist. Und selbst heute, wo jeder selber erlebt wie das System voll von korrupter Gier unsere gesamte Gesellschaft bestimmt, werden doch solche Erkenntnisse und Gedanken ganz schnell wieder verdrÃƒÂ¤ngt. In einer Welt, wo 1% der Welt-BevÃƒÂ¶lkerung 40% aller EinkÃƒÂ¼nfte kassiert, in einer Welt wo jeden Tag 3400 Kinder aufgrund von Armut und vermeidbaren Krankheiten sterben und 50% der WeltbevÃƒÂ¶lkerung von einem Einkommen unter 2 Dollar pro Tag leben muss, ist eines klar: Etwas lÃƒÂ¤uft sehr schief in diesem System!","torrent":{"xt":"urn:btih:d488fd81a7c384052f864c97c5dd2d9d3a748544","amp;dn":"Zeitgeist+Addendum+-+deutsch+synchronisiert+-+HQ-DVDrip.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d488fd81a7c384052f864c97c5dd2d9d3a748544","infoHashBuffer":{"type":"Buffer","data":[212,136,253,129,167,195,132,5,47,134,76,151,197,221,45,157,58,116,133,68]},"announce":[],"urlList":[]}}