{"title":"Help for the Haunted - John Searles","uid":9100708,"size":762792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4afb2e06b4f3dd67e8d0e606df46252c911abd2&amp;dn=Help+for+the+Haunted+-+John+Searles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1382762843,"description":"It begins with a call in the middle of snowy February evening. Lying in her bed, young Sylvie Mason overhears her parents on the phone across the hall. This is not the first late-night call they have received, since her mother and father have an uncommon occupation, helping &quot;haunted souls&quot; find peace. And yet, something in Sylvie senses that this call is different than the rest, especially when they are lured to the old church on the outskirts of town. Once there, her parents disappear, one after the other, behind the church's red door, leaving Sylvie alone in the car. Not long after, she drifts off to sleep only to wake to the sound of gunfire.\n\nNearly a year later, we meet Sylvie again struggling with the loss of her parents, and living in the care of her older sister, who may be to blame for what happened the previous winter.\n\nAs the story moves back and forth in time, through the years leading up to the crime and the months following, the ever inquisitive and tender-hearted Sylvie pursues the mystery, moving closer to the knowledge of what occurred that night, as she comes to terms with her family's past and uncovers secrets that have haunted them for years.","torrent":{"xt":"urn:btih:d4afb2e06b4f3dd67e8d0e606df46252c911abd2","amp;dn":"Help+for+the+Haunted+-+John+Searles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4afb2e06b4f3dd67e8d0e606df46252c911abd2","infoHashBuffer":{"type":"Buffer","data":[212,175,178,224,107,79,61,214,126,141,14,96,109,244,98,82,201,17,171,210]},"announce":[],"urlList":[]}}