{"title":"Degree of Murder [1967] Volker Schlondorff","uid":5890453,"size":1572850393,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d51768570a0cadbe7af5b85321ee52894f083040&amp;dn=Degree+of+Murder+%5B1967%5D+Volker+Schlondorff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1287224644,"description":" &lt;a href=&quot;http://bayimg.com/aapfDaACN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/aapfDaACN&lt;/a&gt;\n\nDegree of Murder (1967) \n\nMord und Totschlag (original title)\nVivre ÃƒÂ  tout prix (French)\nMord und Todschlag West Germany (alternative spelling) \nUn macello (Italy) \nVerentahrimat rahat (Finland) \nVivi ma non uccidere (Italy)\n \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0061992/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0061992/&lt;/a&gt;\n\nDOWNLOADED FROM CINEMAGEDDON.NET\n\nDUBBED IN ENGLISH, NEITHER THIS FILM NOR ITS SOUNDTRACK HAVE NEVER HAD A FORMAL COMMERCIAL RELEASE TO THE PUBLIC.  BE WARNED SOUND AND PICTURE QUALITY ARE BELOW AVERAGE.\n\nA Degree of Murder (German: Mord und Totschlag, French: Vivre ÃƒÂ  tout prix) is a 1967 West German film, starring Anita Pallenberg and directed by Volker SchlÃƒÂ¶ndorff. The film is widely recognised because of the soundtrack composed, produced, arranged, and played by Brian Jones (founder of the Rolling Stones), Pallenberg's boyfriend at the time. The film was entered into the 1967 Cannes Film Festival.\n\nIt was filmed in colour in West Germany in 1967.\n\n  Anita Pallenberg  ...  Marie  \n  Hans Peter Hallwachs  ...  GÃƒÂ¼nther  \n  Manfred Fischbeck  ...  Fritz  \n  Werner Enke  ...  Hans  \n\nMarie (Anita Pallenberg) shoots her ex boyfriend with his own gun, after he attempts to beat her. Instead of reporting this to the police she hires two men to help her dump the body in a construction site near an autobahn. While doing this she becomes romantically involved with both men.\n\nDespite its film noir trappings, director Volker Schlondorff's dispassionate thriller transcends its sub genre to become a more broad-based study of alienation and angst in West Germany during the 1960s. Clearly a product of its times, the film stars erstwhile sex symbol Anita Pallenberg ( Performance) as Marie, who shoots her ex-lover (Werner Enke) when he comes to her apartment and attempts to rape her. Rolling Stones guitarist Brian Jones, who was dating Pallenberg at the time, makes a brief appearance in the film as well as writing and performing the bouncy, psychedelic score just months before his untimely death.\n\nThe soundtrack by Brian Jones has never had an official release, possibly because of legal conflicts. It was recorded between late 1966 and early 1967.\n\nThe musicians were:\n\nBrian Jones: Sitar, organ, recorder, cello, banjo, harpsichord, autoharp, dulcimer, clarinet and harmonica. (Also composed, produced, arranged) \nJimmy Page: Guitar \nNicky Hopkins: Piano \nPeter Gosling: Background vocals, (rumoured to have played Mellotron) \nKenney Jones: drums \nGlyn Johns: Engineer \nMike Leander, Orchestra \n\n\nGerman Film Awards  \n1967  Won Film Award in Gold Outstanding Individual Achievement: Cinematography Franz Rath \n1967  Won Film Award in Silver Outstanding Feature Film (Houwer Film). A premium of DEM 300.000.-.  \n\nCannes Film Festival  \n1967  Nominated Golden Palm Volker SchlÃƒÂ¶ndorff  \n\n","torrent":{"xt":"urn:btih:d51768570a0cadbe7af5b85321ee52894f083040","amp;dn":"Degree+of+Murder+%5B1967%5D+Volker+Schlondorff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d51768570a0cadbe7af5b85321ee52894f083040","infoHashBuffer":{"type":"Buffer","data":[213,23,104,87,10,12,173,190,122,245,184,83,33,238,82,137,79,8,48,64]},"announce":[],"urlList":[]}}