{"title":"Gerald Wilson - 2000 - The Complete Pacific Jazz Recordings of G","uid":8831890,"size":2507986597,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d5ce664daa110e926ac723fe279655b65a4f3b55&amp;dn=Gerald+Wilson+-+2000+-+The+Complete+Pacific+Jazz+Recordings+of+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eika256","files":-1,"time":1377006811,"description":"Gerald Wilson - 2000 - The Complete Pacific Jazz Recordings of GW and His Orchestra (1961-69)\n5 CD box set\n\nIt's fitting that Mosaic was able to license Gerald Wilson's Pacific Jazz recordings rather than his earlier work from the '40s and '50s, when he was in the shadow of his compadres Ellington and Basie and Dizzy Gillespie -- who he wrote for and performed with during those years. Wilson's Pacific Jazz period begins at the dawn of the 1960s -- though he and Richard Bock, owner of Pacific Jazz, had talked as early as 1953 -- and the eventual deal was set up through Albert Marx, who owned the recordings and acted as producer. A total of ten albums were recorded for Pacific Jazz and two more for World Pacific. The story on these albums of Wilson as a composer and arranger -- and to a lesser extent a virtuoso trumpet player -- is as much as anything the story of popular big-band jazz during the tumultuous period. There are plenty of explorations here: in harmony, rhythm, and melody, extrapolated from long studies of composers as varied as Stravinsky and Debussy, but all of them are tonal. All of them swing; all of them groove. Whether it is &quot;The Wailer&quot; from 1960 or James Brown's &quot;I Got You (I Feel Good)&quot; from 1965 or &quot;Down Here on the Ground&quot; and &quot;Baby, Baby Don't Cry&quot; from 1969, Wilson had his finger firmly on the pulse of popular music as it changed, transformed itself into something else, and then became popular music again. Through it all, his ever-changing lineup of musicians -- including Groove Holmes, Teddy Edwards, Harold Land, George Duke, Bud Shank, Mel Lewis, Leroy Vinnegar, Wilton Felder, Victor Feldman, Bill Perkins, Bobby Hutcherson, Tommy Flanagan, Jimmy Rowles, Roy Ayers, Joe Pass, and countless others -- created a virtual history of the intertwining of jazz and popular music from both sides of the aisle during that decade. This is man who, late in the decade, would perform &quot;'Round Midnight&quot; and the Doors' &quot;Light My Fire&quot; in the same concert. These recordings are all full of intimate groove, lush swing, gorgeous nuances, and an elegance that hasn't been equaled since that time. There is none of the frenetic harshness associated with Buddy Rich's bands of the era, but rather an innate funkiness and sophisticated swing that is confident enough not to hurry through anything.\nSubtlety was everything in Wilson's world during this period -- and it is evidenced in the work of other players, such as Horace Silver's breakthrough &quot;Song for My Father,&quot; which he directly attributes to the influence of Wilson. Lee Morgan's Sidewinder and Rumproller periods also bore the Wilson stamp of pure open groove and in-the-pocket funked-up rhythms. In fact, based on the ten albums here, the case can be made that Wilson was the person who most influenced Blue Note's own artists during the entire period. It would be difficult to conceive Lou Donaldson cutting &quot;City, Country, City&quot; by War in 1970 if not for Wilson's take of Cream's &quot;Sunshine of Your Love.&quot; The difference between Wilson and the Blue Noters who went off into all kinds of crazy directions as they tried to score &quot;hits&quot; during the period was that Wilson was never interested in excess. His arrangements and compositions had the spare grace and elegance of a Ravel and the drama of Aram Khachaturian or Ellington -- especially when it came to the blues (1960's &quot;Yvette&quot; being a case in point, with Holmes' organ groove holding its own with an enormous horn section playing fills to his runs!). What this box set reveals is not so much how Wilson changed during the '60s -- after all, he'd been at the arrangement and composition game for 20 years before -- but how much he reacted to the changing face of the decade's music by taking it for what it was and shaping it according to a profound and accessible aesthetic. His harmonic concepts -- such as taking the key of B flat minor and juxtaposing a harmonic row in D flat major on top of it -- were revolutionary and influential in causing people to hear big bands differently, influencing even the Europeans later. The Complete Pacific Jazz Recordings of Gerald Wilson shows how big band music and jazz itself changed to reflect the popular music of a decade that had almost forgotten they existed, and how they were made hip again. (AllMusic)\n\nTrack list:\nCD 1\n01 - Blues For Yna Yna\n02 - Jeri\n03 - Moody Blue\n04 - Straight Up And Down\n05 - The Wailer\n06 - You Better Believe It\n07 - Yvette\n08 - Viva Trado\n09 - Moment of Truth\n10 - Patterns\n11 - Teri\n12 - Nancy Jo\n13 - Milestones\n14 - Latino\n15 - Josefina\n16 - Emerge\nCD 2\n01 - So What\n02 - Caprichos\n03 - Paco\n04 - Ravi\n05 - Aram\n06 - 'Round Midnight\n07 - Eric\n08 - Los Moros De Espana\n09 - Who Can I Turn to\n10 - Ricardo\n11 - Musette\n12 - In the Limelight\n13 - Lighthouse Blues\n14 - El Viti\n15 - Lately\n16 - Perdido\nCD 3\n01 - When I'm Feeling Kinda Blue\n02 - Freddie the Freeloader\n03 - Do Anything You Wanna\n04 - Yesterday\n05 - Watermelon Man\n06 - Yeh Yeh\n07 - One On the House\n08 - I Got You (I Feel Good)\n09 - I Concentrate On You\n10 - Well Son Shuffle\n11 - The Golden Sword\n12 - Man of La Mancha\n13 - The Breeze and I\n14 - Carlos\n15 - Chanson du Feu Follet (Song of the Mad Fire)\n16 - Mi Corazon (My Heart)\n17 - Blues Latinese\n18 - The Feather\n19 - La Mentra (The Lie)\n20 - The Serpent\nCD 4\n01 - Paper Man\n02 - I Should Care\n03 - I Got It Bad (and That Ain't Good)\n04 - The 'IT's' Where It's At\n05 - Blues for a Scorpio\n06 - L'il Darlin'\n07 - Misty\n08 - Viva Tirado\n09 - Everywhere\n10 - Out of This World\n11 - Pretty Polly\n12 - M. Capetillo\n13 - Little Bit of Soul\n14 - Do I Love You (Because You're Beautiful )\n15 - Del Olivar\n16 - Mini Waltz\nCD 5\n01 - California Soul\n02 - Light My Fire\n03 - Channel Island\n04 - Lullaby from Rosemary's Baby\n05 - Sunshine of Your Love\n06 - Russian River\n07 - Yesterlove\n08 - Down Here on the Ground\n09 - El Presidente\n10 - Equinox\n11 - Aquarius\n12 - Pisces\n13 - Scorpio Rising\n14 - Celestial Soul\n15 - Baby, Baby Don't Cry\n16 - You, Me and Now\n17 - Bluesnee\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:d5ce664daa110e926ac723fe279655b65a4f3b55","amp;dn":"Gerald+Wilson+-+2000+-+The+Complete+Pacific+Jazz+Recordings+of+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5ce664daa110e926ac723fe279655b65a4f3b55","infoHashBuffer":{"type":"Buffer","data":[213,206,102,77,170,17,14,146,106,199,35,254,39,150,85,182,90,79,59,85]},"announce":[],"urlList":[]}}