{"title":"Details for Autodesk AutoCAD Structure Detailing 2010.x86","uid":6381734,"size":2432613241,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d61f89dfe6ea77be54c834a0bd02f83584345b66&amp;dn=Details+for+Autodesk+AutoCAD+Structure+Detailing+2010.x86&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hoangemt","files":3,"time":1305052662,"description":"AutoCADÃ‚Â® Structural Detailing software, built on the familiar AutoCADÃ‚Â® platform, enhances productivity with precise detailing and creation of fabrication shop drawings for steel and concrete structures. AutoCAD Structural Detailing includes two powerful toolsets for structural steel and concrete reinforcement detailing projects. AutoCAD Structural Detailing is part of AutoCADÃ‚Â® RevitÃ‚Â® Structure Suite.\n\nAutoCADÃ‚Â® Structural Detailing software enables you to quickly and efficiently generate detailing and creation of fabrication shop drawings for reinforced concrete and steel structures. AutoCADÃ‚Â® Structural Detailing: Intelligent Structural Objects\n\nIntelligent Structural Objects\nIn AutoCAD Structural Detailing, engineers and drafters can create structural steel models or rebar drawings using intelligent objects such as beams, plates, columns, walls, and reinforcement bars, rather than lines and curves. You can virtually cut, lengthen, bend, split, and merge objects. They dynamically react to changes and automatically update material takeoffs.\nAutoCADÃ‚Â® Structural Detailing: Powerful Macros\n\nPowerful Macros\nAutoCAD Structural Detailing provides special tools and smart macros that enable fast automation of time-consuming structural tasks. Use macros to generate typical parts of steel structures (including connections, roof trusses, stairs, railings, and ladders), automatically place elements (such as grates or purlins), or generate complete concrete reinforcement drawings of typical parts of structures, together with rebar descriptions and material takeoffs.","torrent":{"xt":"urn:btih:d61f89dfe6ea77be54c834a0bd02f83584345b66","amp;dn":"Details+for+Autodesk+AutoCAD+Structure+Detailing+2010.x86","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d61f89dfe6ea77be54c834a0bd02f83584345b66","infoHashBuffer":{"type":"Buffer","data":[214,31,137,223,230,234,119,190,84,200,52,160,189,2,248,53,132,52,91,102]},"announce":[],"urlList":[]}}