{"title":"Imagine: Living in a Socialist USA (2014) Frances Goldin et al (","uid":9540521,"size":1210281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d65ef4fdbb8cde7e8c687e1e76d5b426544de96b&amp;dn=Imagine%3A+Living+in+a+Socialist+USA+%282014%29+Frances+Goldin+et+al+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1391033721,"description":"Imagine: Living in a Socialist USA by Frances Goldin et al\n\n\nFormat: mobi/epub/azw3\nLength: 324 pages\nGenre: Non-Fiction/Politics\nDate: 21 January 2014\n\nPart history, part analysis, part call to action, Imagine: Living in a Socialist USA, is a roadmap for anyone troubled by the social, political and economic inequities plaguing this country and the world.\n\nThe polar ice caps are melting, hurricanes and droughts ravish the planet, and the earth's population is threatened by catastrophic climate change. Millions of American jobs have been sent overseas and aren't coming back. Young African-American men make up the majority of America's prison population. Half of the American population are poor or near poor, living precariously on the brink, while the top one percent own as much as the bottom eighty. Government police-state spying on its citizens is pervasive. Consequently, as former President Jimmy Carter has said, &quot;we have no functioning democracy.&quot;\n\nImagine: Living In a Socialist U.S.A. is at once an indictment of American capitalism as the root cause of our spreading dystopia and a cri de coeur* for what life could be like in the United States if we had economic as well as a real political democracy. This anthology features essays by revolutionary thinkers, activists, and artists - including Academy Award-winning filmmaker Michael Moore, civil rights activist Angela Davis, incarcerated journalist Mumia Abu Jamal, and economist Rick Wolff - addressing various aspects of a new society and, crucially, how to get from where we are now to where we want to be, living in a society that is truly fair and just.\n\n*Cri de coeur - (French) [Lit.] Cry from the heart.\n\nContributors:\n\nPaul Street - Joel Kovel - Ron Reosti - Rick Wolff - Michael Steven Smith - Mumia Abu-Jamal - Angela Davis - Ajamu Baraka - Harriet Fraad - Tess Fraad-Wolff - Renate Bridenthal - Blanche Wiesen Cook - Leslie Cagan - Melanie Kaye/Kantrowitz - Steven Wishnia - Juan Gonzalez - Frances Fox Piven - Arun Gupta - Tom Angotti - Dave Lindorff - William Ayers - Mat Callahan - Clifford D. Conner - Fred Jerome - Michael Moore - Michael Ratner - Kazembe Balagun - Michael Zweig - Dianne Feeley - Paul Le Blanc - Martin Espada - Terry Bisson","torrent":{"xt":"urn:btih:d65ef4fdbb8cde7e8c687e1e76d5b426544de96b","amp;dn":"Imagine%3A+Living+in+a+Socialist+USA+%282014%29+Frances+Goldin+et+al+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65ef4fdbb8cde7e8c687e1e76d5b426544de96b","infoHashBuffer":{"type":"Buffer","data":[214,94,244,253,187,140,222,126,140,104,126,30,118,213,180,38,84,77,233,107]},"announce":[],"urlList":[]}}