{"title":"Ultima 1+2+3 [GoG]","uid":8400011,"size":37575949,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d724a722e0293b5e53305c7f09c2eb2fba67095f&amp;dn=Ultima+1%2B2%2B3+%5BGoG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GOG-Upp","files":5,"time":1366670881,"description":" &lt;a href=&quot;http://www.gog.com/gamecard/ultima_1_2_3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.gog.com/gamecard/ultima_1_2_3&lt;/a&gt;\n\nWhat's cool about it:\nThis pack includes: Ultima I, Ultima II: Revenge of the Enchantress and Ultima III: Exodus\nThree epic adventures set in a vast, open world full of mysterious places, evil creatures, and deadly secrets. Find out for yourself how these retro graphics have caused so many sleepless nights\nThis is how the acclaimed cRPG series started, created by the legend of computer gaming - Richard Garriott a.k.a. Lord British\nOverview:\nIn the beginning of this adventure, hordes of nightmarish creatures stalk forth from the lair of Mondain the Wizard to devastate the tranquil kingdoms of Sosaria. Step into the burning world of Sosaria. Take up the weapons of time and sorcery in a battle to destroy Mondain. \n\nIn your second quest, you will discover that, although the master is dead, his evil legacy lives on. Minax, apprentice of Mondain, has come of age, raining terror and destruction on the land. In her fury, she has torn the fabric of time and space, opening doors through which you may bring about her doom!\n\nFinally, after years of peace, fragments of a manuscript hint at an unholy alliance between Mondain and Minax. Of the fruits of that alliance, none can speak, but soon the Orc drums boom again. The Great Earth Serpent stirs in its slumber of countless ages. This time a party of adventurers must act, their only clue a single word scrawled in blood upon the deck of a derelict merchant ship: EXODUS.\n\n\n-------------\n\nIF YOU HAVE ANY REQUESTS, PLEASE WRITE THEM IN COMMENTS, ENJOY AND DON'T FORGET TO SEED IT BACK.","torrent":{"xt":"urn:btih:d724a722e0293b5e53305c7f09c2eb2fba67095f","amp;dn":"Ultima+1%2B2%2B3+%5BGoG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d724a722e0293b5e53305c7f09c2eb2fba67095f","infoHashBuffer":{"type":"Buffer","data":[215,36,167,34,224,41,59,94,83,48,92,127,9,194,235,47,186,103,9,95]},"announce":[],"urlList":[]}}