{"title":"The Universe in a Single Atom - Dalai Lama - Audio Book","uid":3590062,"size":264091043,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d744f012883fdeff179da71235539fbf012b3130&amp;dn=The+Universe+in+a+Single+Atom+-+Dalai+Lama+-+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"servoe","files":97,"time":1167984873,"description":"From: http://www.randomhouse.com/catalog/display.pperl?isbn=9780739322659\n\nGallileo, Copernicus, Newton, Niels Bohr, Einstein. Their insights shook our perception of who we are and where we stand in the world and in their wake have left an uneasy co-existence: science vs. religion, faith vs. empirical enquiry. Which is the keeper of truth? Which is the true path to understanding reality?\n\nAfter forty years of study with some of the greatest scientific minds as well as a lifetime of meditative, spiritual and philosophical study, the Dalai Lama presents a brilliant analysis of why both disciplines must be pursued in order to arrive at a complete picture of the truth. Science shows us ways of interpreting the physical world, while spirituality helps us cope with reality. But the extreme of either is impoverishing. The belief that all is reducible to matter and energy leaves out a huge range of human experience: emotions, yearnings, compassion, culture. At the same time, holding unexamined spiritual beliefs?beliefs that are contradicted by evidence, logic, and experience?can lock us into fundamentalist cages.\n\nThrough an examination of Darwinism and karma, quantum mechanics and philosophical insight into the nature of reality, neurobiology and the study of consciousness, the Dalai Lama draws significant parallels between contemplative and scientific examination of reality. ?I believe that spirituality and science are complementary but different investigative approaches with the same goal of seeking the truth,? His Holiness writes. ?In this, there is much each may learn from the other, and together they may contribute to expanding the horizon of human knowledge and wisdom.?\n\nThis breathtakingly personal examination is a tribute to the Dalai Lama?s teachers?both of science and spirituality. The legacy of this book is a vision of the world in which our different approaches to understanding ourselves, our universe and one another can be brought together in the service of humanity.","torrent":{"xt":"urn:btih:d744f012883fdeff179da71235539fbf012b3130","amp;dn":"The+Universe+in+a+Single+Atom+-+Dalai+Lama+-+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d744f012883fdeff179da71235539fbf012b3130","infoHashBuffer":{"type":"Buffer","data":[215,68,240,18,136,63,222,255,23,157,167,18,53,83,159,191,1,43,49,48]},"announce":[],"urlList":[]}}