{"title":"Learning JavaScriptMVC - Wojciech Bednarski [Epub] Ehhhh","uid":8729744,"size":1872300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7d92b32156986835ddcc6ebb8598b67b03d8337&amp;dn=Learning+JavaScriptMVC+-+Wojciech+Bednarski+%5BEpub%5D+Ehhhh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374569831,"description":"Overview\n\nJavaScriptMVC is a client-side, JavaScript framework that builds maintainable, error-free, lightweight applications as quickly as possible. As it does not depend on server components, it can be combined with any web service interface and server-side language.\n\n&quot;Learning JavaScriptMVC&quot; will guide you through all the framework aspects and show you how to build small- to mid-size well-structured and documented client-side applications you will love to work on.\n\nThis book starts from JavaScriptMVC installation and all its components are explained with practical examples. It finishes with an example of building a web application.You will learn what the JavaScriptMVC framework is, how to install it, and how to use it efficiently.\n\nThis book will guide you on how to build a sample application from scratch, test its codebase using unit testing, as well as test the whole application using functional testing, document it, and deploy the same. After reading Learning JavaScriptMVC you will learn how to install the framework and create a well-structured, documented and maintainable client-side application.\n\n\nProduct Details\n\nISBN-13: 9781782160205\nPublisher: Packt Publishing\nPublication date: 3/9/2013\nPages: 124\n\nMeet the Author\n\nWojciech Bednarski is a software engineer with an expert level of client-side technologies. He is passionate about JavaScript, Node.js, HTML5, Ruby, NoSQL, and POSIX-compliant systems. While at university he started freelance jobs and was obsessed by web accessibility and usability as well as web standards.\n\nThen he moved to Warsaw to start work as a web developer at eo Networks, recognized as one of the 50 fastest growing companies in Central Europe.\n\nThen he started work at Roche, one of the largest pharmaceutical companies in the world, where he worked on large scale, web-based systems as well as conducting workshops and technical seminaries. He was recognized with the Informatics Service Award in the category of Innovation. Then he moved to Copenhagen and started work at YouSee, the subsidiary of TDC, the biggest Danish telecom company, where he programmed set-top boxes. He won Copenhagen Startup Weekend and begun the Everplaces startup.\n\nAt the time of writing, he is a consultant for a New York-based company working on the next big thing you will use. He works from different places and lives with his beautiful wife and two black cats. He loves taking pictures (http://www.pixmod.net) as well as driving sport cars and traveling. Professional profile -http://www.linkedin.com/in/bednarski/ Twitter - @wbednarski","torrent":{"xt":"urn:btih:d7d92b32156986835ddcc6ebb8598b67b03d8337","amp;dn":"Learning+JavaScriptMVC+-+Wojciech+Bednarski+%5BEpub%5D+Ehhhh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d92b32156986835ddcc6ebb8598b67b03d8337","infoHashBuffer":{"type":"Buffer","data":[215,217,43,50,21,105,134,131,93,220,198,235,184,89,139,103,176,61,131,55]},"announce":[],"urlList":[]}}