{"title":"The Lives of Conn Smythe (2011).epub Gooner","uid":13707173,"size":6910674,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d803c3f71ec54ac304a43a012a522b89b7b87545&amp;dn=The+Lives+of+Conn+Smythe+%282011%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1456838060,"description":"The Lives of Conn Smythe - From the Battlefield to Maple Leaf Gardens - A Hockey Icon's Story (2011).epub Gooner\r\n\r\nPublisher: FENN-M&amp;S (October 18, 2011)\r\nLanguage: English\r\nISBN-10: 0771056834\r\nISBN-13: 978-0771056833\r\n\r\nThe first full-length biography of one of hockey's - and Canada's - most influential forces, Conn Smythe.\r\n\r\nWhile the story of the Toronto Maple Leafs has been told many times, there has never been a full biography of the man who created, built and managed the team, turning it from a small-market collection of second-rate players into the hockey and financial powerhouse that dominated Canadian sports and created a collection of Canadian icons along the way. From the 1920s to the mid-1960s, Conn Smythe was one of the best-known, highest-profile figures in the country - irascible, tempestuous, outspoken and controversial. He not only constructed a hockey team that dominated the league for long stretches, but was critical to the growth and shaping of the NHL itself. By building Maple Leaf Gardens and hiring Foster Hewitt to fill Canada's living rooms with weekly broadcasts, he turned Saturday night into hockey night, creating institutions and habits that became central to Canada's character and remain with us today.\r\n\r\nSmythe's story is much deeper and richer than the tale of a cantankerous hockey owner. Smythe fought in both world wars, fighting at Ypres and Passchendaele in the first war and landing at Normandy in the second. He was wounded in both and spent two years as a POW in a German camp after being shot down in 1917. He grew up in poverty and vowed to escape the life that was so incredibly hard on his family. Smythe was active in politics and ignited a national crisis over conscription that split the Liberal government in two and brought Mackenzie King to the brink of resignation.\r\n\r\nThis book tells the life of one of the country's great characters, a man who helped shape and define us and who left behind national habits and institutions that continue to lay at the heart of what makes Canada, Canada","torrent":{"xt":"urn:btih:d803c3f71ec54ac304a43a012a522b89b7b87545","amp;dn":"The+Lives+of+Conn+Smythe+%282011%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d803c3f71ec54ac304a43a012a522b89b7b87545","infoHashBuffer":{"type":"Buffer","data":[216,3,195,247,30,197,74,195,4,164,58,1,42,82,43,137,183,184,117,69]},"announce":[],"urlList":[]}}