{"title":"Divinity Original Sin (Mac) (Latest With 1.0.252 Patch)","uid":11696044,"size":14050053991,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:d807a8dee4694653a3093e0ed17fd3bf6ec9363e&amp;dn=Divinity+Original+Sin+%28Mac%29+%28Latest+With+1.0.252+Patch%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Sarah116","files":3,"time":1423718114,"description":"Hey guys, here the latest version of D:OS for mac. Hope you guys enjoy and please help seed.\n\n\n--------------------\n\n\nChanges for version 1.0.252.0: \n\nWe added the following hotfixes with 1.0.252.0: \n\nloading of a save with missing mod dependencies now throws correct error message instead of crashing \n\nfixed possible crash during/at end of combat (texture issue) \n\nBug Fixes: \n\nGameplay Blocked when talking to Leandra while escaping from Death Knights \n\nBairdotr party size issue fixed. You were no longer able to recruit a 4th party member. Loading your savegame should allow you to re-hire a 4th companion immediately. \n\nFixed Homestead room-opening issue if you spoke to Zixzax with a companion first, while other player characters were arriving. If you had this issue pre-patch, you can try loading your save and returning to the Homestead. \n\nFixed Zandalor being interruptible when you first meet him. This could cause story progression issues. \n\nEvelyn NPC blocked and remains in clinic before and after going through the lair scene \n\nEquipment usable in skill bar \n&quot;Send to Homestead&quot; appears in context menu if you start new game after loading save \n\nChange Tenebrium weapon damage calculation: Tenebrium ability is now a requirement and you get the damage boost from your weapon ability \n\nKickstarter pet black spider should now be the black spider model instead of fleshy spider \n\nIngame time incorrect after loading a save and then starting a new game \n\nFixed issue that could get your character stuck in skill preview mode after spamming skill keys when leaving a dialog \n\n\nBalancing changes: \n\nCyseal \n\nChimaera (script improved) \n\nDietmar (bugfix: enemies won't turn invisible again on save/load) \n\nLighthouse Horror (bugfix: scripting error) \n\nBlack Cove \n\nCrab Summoner (now summons more, hits harder, can teleport back to the player if too far away) \n\nLuculla Forest \n\nBlue Mushrooms (bugfix: summons will not be of a different faction anymore) \n\nVoid Shepherd (bugfix: killing the shepherd now ends the fight) \n\nDrunk Goblins (bugfix: goblins were not ending turn when drinking from flower) \n\nRafflesia (bugfix: now summons level 14 flowers) \n\nShadow Summoner (now stronger &amp; faster) \n\nSpider Queen (bugfix: now summons level 14 spiders) \n\nKromkromkris (bugfix: doesn't get attacked by his own summons anymore) \n\nHiberheim \n\nBoreas (bugfix: made non-teleportable &amp; doesn't move when it's not his turn anymore) \n\nDark Forest \n\nAnguish Demon (removed one summon, making the fight a bit easier) \n\nFire Demon (summons void dogs faster) \n\nKalgruuda Cloudpiercer (doesn't end turn after summoning and summons don't skip their first turn anymore) \n\nBraogg Spiritchaser (doesn't end turn after summoning anymore) \nTunnel Mushroom (made non-teleportable) \n\nStats changes \n\nRebalanced Constitution &amp; Damage: from Luculla to Dark Forest, overall, creatures go down faster but deal more damage \n\nToned down Armor: some Armor scores were too high, resulting in unnecessarily long \nfight \n\nRebalanced Initiative: some creatures had too high an Init, others too little. NPC Init scores will now be closer to players' score \n\nRebalanced Willpower &amp; Bodybuilding throughout the game \n\nRebalanced physical &amp; magical resistances \n\nSome creatures had high dexterity and were difficult to hit \n\nPure elementals (fire, water, air, earth) now have proper resistances and immunities \n\nMagic weapons changed (example: a flaming sword would inflict pure fire damage. \nNow, it inflicts physical (slashing) damage + a fire boost) \n\nEditor Update: \nWe have supplied a 3DSMax exporter to allow you to import custom animations and models into your mods","torrent":{"xt":"urn:btih:d807a8dee4694653a3093e0ed17fd3bf6ec9363e","amp;dn":"Divinity+Original+Sin+%28Mac%29+%28Latest+With+1.0.252+Patch%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d807a8dee4694653a3093e0ed17fd3bf6ec9363e","infoHashBuffer":{"type":"Buffer","data":[216,7,168,222,228,105,70,83,163,9,62,14,209,127,211,191,110,201,54,62]},"announce":[],"urlList":[]}}