{"title":"In.The.Shadow.Of.The.Moon.2007.AVI","uid":4160921,"size":830226694,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d8b01865952102c79fc3718d57f2d40d3f50a48c&amp;dn=In.The.Shadow.Of.The.Moon.2007.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Rud-gr","files":1,"time":1209376282,"description":"In the Shadow of the Moon is a 2006 British documentary film about the United States\\&amp;#039; manned missions to the moon. It premiered at the 2007 Sundance Film Festival where it won the World Cinema Audience Award. It was given a limited release in the United States on September 7, 2007 and in Canada on October 19, 2007.It was released on DVD in the United States on February 22, 2008 and is currently scheduled for release on March 31, 2008 in the United Kingdom.\n\nIn the Shadow of the Moon follows the manned missions to the moon made by the United States in the late 1960s and early 1970s. The documentary reviews both the footage and media available to the public at the time of the missions, as well as NASA films and materials which had not been opened in over 30 years; all of which has been remastered in HD. Augmenting the archival audio and video are contemporary interviews with some surviving Apollo era astronauts, including Al Bean, Michael Collins, Buzz Aldrin, Charlie Duke, and Harrison Schmitt. The former astronauts have the only speaking roles in the movie, although occasional supplementary information is presented on screen with text and archival television footage presents the words of journalists such as Jules Bergman and Walter Cronkite. Neil Armstrong, the first person to set foot on the moon, declined to participate.\n\nThe documentary shares its name with a book by space historians Colin Burgess and Francis French, and both include many original interviews with Apollo lunar astronauts. The documentary offers a complementary insight into the Apollo program compared to the book and is neither a source nor a tie-in.\n\n\nThis is a reworked version of one of the available uploads. Sound should be much louder and the filesize is a bit more convenient than the previous 4Gb.","torrent":{"xt":"urn:btih:d8b01865952102c79fc3718d57f2d40d3f50a48c","amp;dn":"In.The.Shadow.Of.The.Moon.2007.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8b01865952102c79fc3718d57f2d40d3f50a48c","infoHashBuffer":{"type":"Buffer","data":[216,176,24,101,149,33,2,199,159,195,113,141,87,242,212,13,63,80,164,140]},"announce":[],"urlList":[]}}