{"title":"X-Plane 8 DVD-VENGEANCE","uid":3267995,"size":4569331854,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d8baa5cf22be07de1119d1b9784b8643e5a089a9&amp;dn=X-Plane+8+DVD-VENGEANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BeMyGuest","files":94,"time":1103759457,"description":"Proudly Presents..  X-Plane 8 (c) Atari Games \n\n          Release Date : 12-21-04              Protection : - \n\n          File Count  : 92x50mb              Game Genre : Flight Simulation \n\n\n        X-Plane is the most comprehensive and powerful flight simulator \n\n      available for the personal computer. X-Plane simulates anything \n\n      that flies: single-engine fixed wing props to multi-engine jets; \n\n      gliders to dirigibles; helicopters to spacecraft to VTOLs such as \n\n      the V-22 Osprey and AV8-B Harrier. \n\n      \n\n      X-Plane has the most realistic flight model available for personal \n\n      computers. It comes with subsonic and supersonic flight dynamics, \n\n      simulating aircraft from the Bell 206 Jet-Ranger helicopter and \n\n      Cessna 172 light plane to the supersonic SR-71. \n\n\n\n      X-Plane comes with 29 aircraft spanning the aviation industry \n\n      (and history), and several hundred more are freely downloadable \n\n      from the internet. \n\n\n\n\n      X-Plane scenery spans the globe.You can land at any of thousands \n\n      of airports, as well as test your mettle on aircraft carriers, \n\n      helipads on building tops, frigates that pitch and roll in the \n\n      waves, and oil rigs. Weather is variable from clear skies and high \n\n      visibility to thunderstorms with controllable wind, wind shear, \n\n      turbulence, and microbursts. Rain, snow and clouds are available \n\n      for an instrument flying challenge, and thermals are available \n\n      for the gliders! X-Plane can download real weather data from the \n\n      internet, allowing you to fly in actual current conditions! \n\n\n\n      X-Plane also has detailed failure-modeling, with 35 systems that \n\n      can be failed manually, or randomly when you least expect it! \n\n      You can fail instruments, engines, flight controls, and landing \n\n      gear at any moment. \n\n\n\n      X-Plane includes Plane-Maker which allows you to create your own \n\n      airplanes, and World-Maker which lets you create your own scenery. \n\n      Also included is Weather Briefer which produces a weather briefing \n\n      based on actual weather conditions downloaded from the net. \n\n\n\n      X-Plane is extremely customizable, allowing you to easily create \n\n      textures, sounds, and instrument panels for your own airplanes \n\n      that you design. \n","torrent":{"xt":"urn:btih:d8baa5cf22be07de1119d1b9784b8643e5a089a9","amp;dn":"X-Plane+8+DVD-VENGEANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8baa5cf22be07de1119d1b9784b8643e5a089a9","infoHashBuffer":{"type":"Buffer","data":[216,186,165,207,34,190,7,222,17,25,209,185,120,75,134,67,229,160,137,169]},"announce":[],"urlList":[]}}