{"title":"Love Life - Rob Lowe - Read by the Author - Audiobook MP3","uid":10584997,"size":220826214,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d9236804165625819000518ac14e8cadfa9c3eef&amp;dn=Love+Life+-+Rob+Lowe+-+Read+by+the+Author+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1405731695,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\n\nLove Life\n\nWritten by: Rob Lowe\nNarrated by: Rob Lowe\nLength: 7 hrs and 33 mins\nFormat: Unabridged\nRelease Date:04-08-14\n\nActor, producer, and New York Times best-selling author Rob Lowe offers up a collection of personal stories in an honest and celebratory memoir about men and women, art and commerce, fathers and sons, addiction and recovery, and sex and love.\n\nActor Rob Lowe is an entertaining raconteur whose best-selling first audiobook, Stories I Only Tell My Friends: An Autobiography, was hailed as &quot;self-deprecatingly funny&quot; (The New York Times) and &quot;thoroughly entertaining&quot; (Time) and earned the author the cover of Vanity Fair.\n\nLove Life serves up another delicious selection of intimate stories and observations from Lowe's life, told with humor, warmth, and brutal honesty. After writing his acclaimed debut effort, Lowe felt he had more stories to share and many more friends to introduce. The result is a touching memoir about the business and craft of acting, the pitfalls of success, family, love, and much more.\n\nAmong the many adventures Lowe describes in Love Life are what it's like in the trenches as both the star and producer of a flop TV show; how a visit, as a 20-year-old, to Hugh Hefner's Playboy Mansion led to a surprise in the hot tub; how an actor prepares for a role, as well as the practical, boots-on-the-ground details no drama or film school would ever teach you. You'll delight at the hilarious account of the time a major movie star stole his girlfriend, and of coaching a kid's basketball team dominated by omnipresent helicopter parents. The story of coming to terms with his son's departure to college for the education his father never got will touch anyone with a family.\n\nBuilding on Stories I Only Tell My Friends, Love Life is the literary equivalent of returning to a favorite restaurant to savor a completely different, delicious new dish. If you love life, you'll love this audiobook. ","torrent":{"xt":"urn:btih:d9236804165625819000518ac14e8cadfa9c3eef","amp;dn":"Love+Life+-+Rob+Lowe+-+Read+by+the+Author+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9236804165625819000518ac14e8cadfa9c3eef","infoHashBuffer":{"type":"Buffer","data":[217,35,104,4,22,86,37,129,144,0,81,138,193,78,140,173,250,156,62,239]},"announce":[],"urlList":[]}}