{"title":"Louie &amp; The Lovers - Rise (1970) MP3@320","uid":10445479,"size":82998295,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9e2b85f7f5f16ae9363c974d5fc71c1f139e097&amp;dn=Louie+%26amp%3B+The+Lovers+-+Rise+%281970%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":12,"time":1403954446,"description":"&quot;Louie &amp; the Lovers' Rise is a legendary album, at least among hardcore record collectors. It's the kind of record that is heard of more than heard -- the kind of record rumored about in collectors' circles, as evidenced by R.E.M. guitarist Peter Buck impressing author Brett Milano in his ode to record collectors, Vinyl Junkies, the kind of record that fetches absurd prices when actually found in specialty shops or record conventions. Rise gathered such attention for a few reasons. First of all, it was genuinely rare, released briefly on Epic Records in 1970 but received little attention and sold only a handful of copies. Second, the album was produced by Texas cult hero Doug Sahm, whose dedicated following collects anything he recorded. Third, the band simply has a great story: they were a teenage Mexican-American garage band, inspired greatly by Creedence Clearwater Revival and to a lesser extent the Byrds, who were still in high school and playing sets of all-original material when they gained the attention of Sahm and Epic, leading to this one album. Finally, the music is really, really good, a fresh and unpredictable blend of Byrdsian jangle and psychedelia, CCR-styled choogling boogie, Texas blues, Mexican tradition, old-fashioned teen-beat rock &amp; roll, and a sense of popcraft learned from the Beatles. It's easy to see why Sahm went crazy for this band -- they share a similar pan-cultural sensibility, blurring lines between different musical styles not just over the course of an album but within a song, and it's done out of a natural love, not a self-conscious exercise in genre-hopping. Not that Louie &amp; the Lovers sounds much like the Sir Douglas Quintet; they arrive at a similar place by reinterpreting shared influences and following a similarly big-hearted, relaxed, and rocking vision. In many places, Rise does sound more dated than any Sahm project outside of Sir Douglas Quintet + 2 = Honkey Blues due to its mild trippiness (largely borrowed from the Byrds, in both harmonies and ringing guitars), but that element is offset by the group's supple musicality -- you would never guess they were teenagers -- and the uniformly strong songwriting of leader Louie Ortega, who pens memorable songs in a variety of styles from the rolling, countryish &quot;I Know You Know&quot; and the surging title track to the roadhouse boogie of &quot;Rock Me Baby&quot; and the backwoods stomp of &quot;Sittin' By Your River.&quot; These are songs that sound both fresh and familiar upon first listen and become more impressive with each spin -- precisely the kind of music that becomes a legend among fanatical record collectors.&quot;\n\nAllmusicguide","torrent":{"xt":"urn:btih:d9e2b85f7f5f16ae9363c974d5fc71c1f139e097","amp;dn":"Louie+%26amp%3B+The+Lovers+-+Rise+%281970%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e2b85f7f5f16ae9363c974d5fc71c1f139e097","infoHashBuffer":{"type":"Buffer","data":[217,226,184,95,127,95,22,174,147,99,201,116,213,252,113,193,241,57,224,151]},"announce":[],"urlList":[]}}