{"title":"Maps - Vicissitude (2013) [FLAC]","uid":8664219,"size":383112212,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da18cba30b08330d922b6865d446d4499752d49e&amp;dn=Maps+-+Vicissitude+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1373379047,"description":"\n  Maps - Vicissitude (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Electronic, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC \n  Bit Rate: ~ 950 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 A.M.A\n  02 Built to Last\n  03 You Will Find a Way\n  04 I Heard Them Say\n  05 Nicholas\n  06 Vicissitude\n  07 Left Behind\n  08 This Summer\n  09 Insignificant Others\n  10 Adjusted to the Darkness\n\n  Considering that there have been more than a few changes in James Chapman's music since We Can Create, the electro-shoegaze of his debut album as Maps, his third album, Vicissitude, is aptly named. Chapman ramped up his ambition on 2009's intricate, conceptual Turning the Mind, almost to the point where he seemed trapped in those songs' inner workings. Here, things are much more streamlined, whether on the sparkling single &quot;A.M.A.&quot; -- which serves as a potent reminder that Chapman's music owes as much or more to New Order as it does to My Bloody Valentine -- or the title track's looping arrangement, which continues the more overtly electronic trend in his work. Much like his Mute labelmate Junip, Maps excels at songs that are thoughtful and stealthily catchy, and Vicissitude boasts some of Chapman's clearest-eyed songwriting yet. As on Turning the Mind, mental and emotional states are of paramount importance, but now Chapman seems more grounded in dealing with life's vicissitudes. He sounds equally comfortable singing the praises of enduring things on &quot;Built to Last&quot; as he does accepting loss on &quot;Left Behind,&quot; and there's a uniquely reassuring quality to songs like &quot;You Will Find a Way&quot; and &quot;This Summer,&quot; where Chapman repeats the chorus &quot;forgive yourself&quot; like a mantra. The dreamy fog of Maps' first two albums resurfaces on &quot;Nicholas&quot; and &quot;Adjusted to the Darkness,&quot; which rivals Spiritualized's finest moments in its mix of vulnerability and majesty. However, even Vicissitude's most expansive tracks aren't pushy, and in its own subtle way the album delivers on the promise and intentions of Turning the Mind.","torrent":{"xt":"urn:btih:da18cba30b08330d922b6865d446d4499752d49e","amp;dn":"Maps+-+Vicissitude+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da18cba30b08330d922b6865d446d4499752d49e","infoHashBuffer":{"type":"Buffer","data":[218,24,203,163,11,8,51,13,146,43,104,101,212,70,212,73,151,82,212,158]},"announce":[],"urlList":[]}}