{"title":"How to Get Ahead in Advertising (1989)","uid":5230994,"size":1143374658,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da564aeb648bb3af162b8149096178e54ecc1af4&amp;dn=How+to+Get+Ahead+in+Advertising+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1261332567,"description":"Bruce Robinson - How to Get Ahead in Advertising (1989)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0097531&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0097531&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41F9TV89REL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41F9TV89REL.jpg&lt;/a&gt;\n\n\nBY ROGER EBERT /  May 12, 1989\n\n`How To Get Ahead in Advertising&quot; is a sour, mean-spirited attack on advertising, starring an actor who can be repulsive and hateful without even trying. Those are the good things about it. The film's weakness is that it hates advertising so much it can't shut up about it. The film would be better if it kept all of its images and performances and threw out a lot of the dialogue, which explains at great length things that need no explaining.\n\nThe hateful actor in the leading role may be, for all I know, actually one of the nicest and warmest chaps you'd ever want to meet.\n\nHis name is Richard E. Grant, and his first big movie role was last year in the bleak, knife-edged comedy &quot;Withnail &amp; I.&quot; He played a dark-eyed, lantern-faced, intense loner with spite for everybody. No other actor in recent movies, not even James Woods, is better at creating a repellent, spiteful, vindictive character, and it's wonderful to watch him here, gnawing away at decency. His performance is so good, it almost redeems the endless exposition.\n\nGrant plays Dennis Bagley, a hot-shot, chain-smoking London advertising executive who gets stalled on the big pimple cream account.\n\nHow to package it? &quot;Everybody knows that there is no product on the market which can cure a boil,&quot; he snarls at one point, &quot;except the person who has one.&quot; The real point, anyway, is not to heal pimples and boils, but only to improve them to the point where the consumer is encouraged enough to go out and buy more pimple cream.\n\nBagley and his wife, the lovely Julia (Rachel Ward), live a life of exemplary luxury in a country home near London. They entertain lavishly and have a life filled with foppish, supercilious friends. But on the weekend he has been wrestling with the pimple and boil account, Bagley cracks up at a dinner party, tells all the guests exactly what he thinks of them and starts to rail against the greed of advertising and the hypocrisy of modern society. He finally is almost reduced to foaming at the mouth, and his wife calls the men in the white coats.\n\nIt develops, however, that Bagley's problems are physical, as well as mental. He starts to grow a painful boil in his shoulder. It gets bigger and bigger. One day it opens an eye and looks at him. Eventually he realizes that the boil can think and talk, and that it contains all of the poisons of his life and career. Nobody can see or hear the boil except for him, unfortunately, and the doctor decides the only cure for his obsession is to lance the growth. By then, the boil has grown quickly, until it is as large as his head and, in fact, looks just like it. Which head is the boil? This satire is so broad it may sound crude, but the film's writer and director, Bruce Robinson, uses venomous wit and the truly rapacious performance by Grant to keep an edge on things. Robinson also wrote and directed &quot;Withnail &amp; I,&quot; with Grant playing an embittered, out-of-work actor, and in these two films Robinson and Grant have cornered the market on characters you love to hate.\n\nMy problem with &quot;How To Get Ahead in Advertising&quot; is that Robinson has so much he wants to say about the ills of the consumer society, and he has written it all down and given it to Grant as dialogue. The speeches reel on and on, talky and redundant, like an essay in a polemical magazine. Eventually we've had enough. The movie has everything it needs to be a successful satire on advertising, and more\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-33.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard01-33.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-32.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard02-32.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard03-32.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard03-32.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-30.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1022.photobucket.com/albums/af341/bubble_belly/Clipboard04-30.jpg&lt;/a&gt;\n\n---my rip---\n\n~~~~~~ How to Get Ahead in Advertising.avi ~~~~~~                                     \n\n                                                               \n\nFile Size (in bytes):...........................1,115,049,984                     \n\n                                                                                \n\n--- Video Information ---                                                       \n\nVideo Codec Name:...............................XviD ISO MPEG-4              \n\nDuration (hh:mm:ss):............................1:34:09                \n\nFrame Count:....................................135432             \n\nFrame Width (pixels):...........................608                  \n\nFrame Height (pixels):..........................320                  \n\nAspect Ratio:...................................1.900                     \n\nFrames Per Second:..............................23.976          \n\nVideo Bitrate (kbps):...........................1377                 \n\n......MPEG-4......B-VOP........................                    \n\nQuality Factor (bits/pixel)/frame:..............0.295&quot;                     \n\n                                                                                \n\n--- Audio Information ---                                                       \n\nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \n\nAudio Sample Rate (Hz):.........................48000             \n\nAudio Bitrate(kbps):............................192                 \n\nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \n\nAudio Channel Count:............................2    \n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE        \n","torrent":{"xt":"urn:btih:da564aeb648bb3af162b8149096178e54ecc1af4","amp;dn":"How+to+Get+Ahead+in+Advertising+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da564aeb648bb3af162b8149096178e54ecc1af4","infoHashBuffer":{"type":"Buffer","data":[218,86,74,235,100,139,179,175,22,43,129,73,9,97,120,229,78,204,26,244]},"announce":[],"urlList":[]}}