{"title":"20121213-Stossel-[Science vs. God].Fox Business.CF.avi","uid":7927966,"size":285309228,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db0101f18e10154cb54d9932a6eea4d43c7c7c29&amp;dn=20121213-Stossel-%5BScience+vs.+God%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1355631673,"description":"----------\n\nSTOSSEL - [Science vs. God] - Fox Business Network\n2012, December 13, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nI don't know if God exists. I'd like to believe, but...\n\nIn this week's show, atheists and believers weigh in on some life's most important questions: How was life created? Why is there order in the universe? Does science eliminate the need for God?\n\nLawrence Krauss and Michael Shermer say that humans invent religion to explain what they don't understand. But Ian Hutchinson and Dinesh D'Souza disagree--they're Christians who say their beliefs help make sense of what we know from science.\n\nBill Nye &quot;The Science Guy&quot; argues that creationism should not be taught to children.\n\nNidhal Guessoum, a professor of astrophysics in the United Arab Emirates, explains why Muslims have a particularly difficult time accepting modern science.\n\nAnd what would a world without God look like? Larry Taunton, author of &quot;The Grace Effect,&quot; says that the 20th century was an experiment in secular governance--and resulted in the deaths of millions of people. When Christianity flourishes, he says, people are more benevolent and charitable.\n\nIn the policy realm, Obamacare orders employers to pay for contraception for their employees, even if the employers have a religious objection. Tim Carney of the Washington Examiner says that's just wrong, but Fox News analyst Tamara Holder says it's a good thing.\n----------\n[uploader notes:]\n\no   My cable provider informs me that Fox Business is effectively shaking them down (my choice of wording) for more cash to carry the network. They're playing chicken, and my provider is doing the typical dance of asking subscribers to go dish their malcontent toward the channel to try to get them to blink. Either FBN will blink first and the channel will continue to be available to me, my provider will blink and the channel will continue to be available (but with quietly higher subscription fees, which've already been blossoming recently no doubt due to similar wars with other content channels), or my provider will dig in and like the Dish vs. AMC skirmish, my access to the channel will drop. The deadline for an agreement is the end of December, so...just FYI.\n\no   For added enrichment after the program above, try listening to this recent episode of this wonderful podcast, Brian Dunning's &quot;Skeptoid&quot;:\n &lt;a href=&quot;\nhttp://skeptoid.com/episodes/4324&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://skeptoid.com/episodes/4324&lt;/a&gt;\n\nIt's a fabulous show, Skeptoid, which you all ought to have in your rotation.","torrent":{"xt":"urn:btih:db0101f18e10154cb54d9932a6eea4d43c7c7c29","amp;dn":"20121213-Stossel-%5BScience+vs.+God%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0101f18e10154cb54d9932a6eea4d43c7c7c29","infoHashBuffer":{"type":"Buffer","data":[219,1,1,241,142,16,21,76,181,77,153,50,166,238,164,212,60,124,124,41]},"announce":[],"urlList":[]}}