{"title":"Space - Spiders - (1996)[EAC-MP3@320KBPS]","uid":5056423,"size":127527534,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:db2c36cc621fd1940ec53506b4ed3b038cb81751&amp;dn=Space+-+Spiders+-+%281996%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"1mann","files":24,"time":1250445938,"description":"Space - Spiders - (1996)[EAC-MP3@320KBPS]\n\n\n\nTrack list.\n\nSpace - Spiders\n\n01. Neighbourhood 03:28\n02. Mister Psycho 03:40\n03. Female Of The Species 03:19\n04. Money 04:01\n05. Me &amp; You Vs. The World 03:36\n06. Lovechild Of The Queen 03:42\n07. No-One Understands 04:08\n08. Voodoo Roller 03:15\n09. Drop Dead 04:26\n10. Dark Clouds 03:50\n11. Major Pager 03:16\n12. Kill Me 03:31\n13. Charlie M 03:50\n14. Growler 04:48\n\nBiography\nStealing from the campy styles of Echo &amp; the Bunnymen and the infectious sounds of the Boo Radleys, Liverpool's Space wasn't going to become just another U.K. band to burst onto the &quot;alternative&quot; scene in the early '90s. Tommy Scott (vocals/bass), Jamie Murphy (guitar), and Andy Kowalski (drums) formed in 1993 and aimed for a Who-influenced sound. A deal with Gut Records saw the release on the unnoticed Me and You Versus the World in 1996, but it was the kitschy single &quot;Female of the Species&quot; (1997) that made Space indie rock darlings. By now, keyboardist Franny Griffiths and vocalist Dave &quot;Yorkie&quot; Palmer had joined the group, and Space was enjoying favorable success with their Universal debut, Spiders. Already a massive hit in the U.K., &quot;Female of the Species&quot; also gained moderate airplay on college radio and MTV in America as well. A tour of the U.S. followed in mid-1997; however, it wasn't as bright as the band and critics had hoped. Murphy disappeared for a while, and the death of Palmer's mother, Gladys Palmer (a legendary singer from Liverpool), devastated the band. By the time Space had to record a follow-up, Kowalski left the band. Leon Caffrey (drums) took his place for the Tin Planet sessions and the album was issued in spring 1998, hitting number three on the U.K. charts. Space released a third studio effort, entitled Love You\nMore Than Football (2001), and featured Edwyn Collins in the co-production seat.\n\nReview\nQuirky and often highly clever, Space had one of the most appealing alternative rock releases of 1996 in Spiders -- which grossed some listeners out with a cover depicting tarantulas. This eccentric, risk-taking band (not to be confused with the late-'70s disco group Space) doesn't take itself too seriously, and brings an enjoyably twisted sense of humor to such goofy numbers as &quot;Female of the Species&quot; (an ode to a lover who practices witchcraft), &quot;Mr. Psycho&quot; and &quot;Voodoo Roller.&quot; Space's inspirations range from hip-hop to brooding East European folk, which is incorporated with inspired results on &quot;Money&quot; and &quot;Lovechild of the Queen.&quot; To be sure, the rockers can be overly self-indulgent, but like Frank Zappa and George Clinton, generally use their eccentricity advantageously.","torrent":{"xt":"urn:btih:db2c36cc621fd1940ec53506b4ed3b038cb81751","amp;dn":"Space+-+Spiders+-+%281996%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db2c36cc621fd1940ec53506b4ed3b038cb81751","infoHashBuffer":{"type":"Buffer","data":[219,44,54,204,98,31,209,148,14,197,53,6,180,237,59,3,140,184,23,81]},"announce":[],"urlList":[]}}