{"title":"Jennifer L. Armentrout - Onyx, [Epub Lit Mobi Pdb Pdf - Ita]","uid":12743064,"size":3215742,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db5be3fd5aa9d7833d3a5c5cfba00fe2fb0ba7c8&amp;dn=Jennifer+L.+Armentrout+-+Onyx%2C+%5BEpub+Lit+Mobi+Pdb+Pdf+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vitolanz","files":5,"time":1447265667,"description":"Jennifer L. Armentrout - Onyx, [Epub Lit Mobi Pdb Pdf - Ita][TNTVillage]\r\n----------------------------------------\r\n.:Dettagli:.\r\n\r\nAutore: Jennifer L. Armentrout\r\nTitolo: Onyx\r\nAnno: 2014\r\nLingua: Italiana\r\nGenere: Fantasy\r\nDimensione del file: 336 (Epub), 303 KB (Lit), 482 KB (Mobi), 319 KB (PDB), 1,65 MB (PDF)\r\nFormato del file: EPUB + LIT + MOBI + PDB + PDF\r\n----------------------------------------\r\n.:Trama:.\r\n\r\nAvere un legame con Daemon Black è proprio un bel guaio... Daemon è determinato a dimostrare che ciò che prova per me è qualcosa di più della nostra bizzarra connessione aliena. Lo so, dovrei proprio rinunciare a lui, però negli ultimi giorni è così... passionale! Ma abbiamo problemi più gravi. Molto più gravi. In città si aggira qualcosa di minaccioso: il Dipartimento della Difesa è qui. Se dovesse scoprire i poteri di Daemon e la nostra relazione, non avrei scampo. E nemmeno lui. In più a scuola c'è un ragazzo nuovo che nasconde un segreto. Lui sa cosa mi è successo e può aiutarmi, ma dovrei mentire a Daemon e stare lontano da lui. Come se fosse possibile. Contro ogni buon senso, mi sto innamorando di Daemon. Perdutamente. Poi, all'improvviso, cambia tutto. Ho visto qualcuno che non dovrebbe essere vivo. E devo dirlo a Daemon, anche se so che non smetterà mai di cercare la verità. Che cosa è successo a suo fratello? Chi lo ha tradito? E che cosa vuole il Dipartimento della Difesa da loro e, soprattutto, da me? Nessuno è ciò che sembra. E non tutti sopravviveranno alle bugie.\r\n----------------------------------------\r\n.:Biografia dell'autore:.\r\n\r\nJennifer Armentrout è un'autrice statunitense di libri fantasy. Sotto lo pseudonimo di J. Lynn vengono pubblicati, dalla casa editrice Nord, Ti aspettavo, Ti fidi di me? e Stai qui con me nel 2014, mentre l'anno successivo escono Rimani con me e Lontano da te. sotto vero nome, invece, l'editore Giunti ha pubblicato tutta la serie &quot;Lux&quot;: Obsidian e Shadows nel 2013, Onyx e Opal nel 2014 e Origin nel 2015. Sempre nel 2015, inoltre, è stato pubblicato da Harlequin Mondadori Caldo come il fuoco","torrent":{"xt":"urn:btih:db5be3fd5aa9d7833d3a5c5cfba00fe2fb0ba7c8","amp;dn":"Jennifer+L.+Armentrout+-+Onyx%2C+%5BEpub+Lit+Mobi+Pdb+Pdf+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5be3fd5aa9d7833d3a5c5cfba00fe2fb0ba7c8","infoHashBuffer":{"type":"Buffer","data":[219,91,227,253,90,169,215,131,61,58,92,92,251,160,15,226,251,11,167,200]},"announce":[],"urlList":[]}}