{"title":"Gabriel Knight Trilogy - Windows XP/Vista compatible versions of","uid":4524718,"size":5580190770,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:db7982d1d8401077d7353ee6e9cecbd958e03ce5&amp;dn=Gabriel+Knight+Trilogy+-+Windows+XP%2FVista+compatible+versions+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"KingOtar","files":-1,"time":1227308194,"description":"=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\nGABRIEL KNIGHT TRILOGY - WINDOWS\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nOVERVIEW:\n\nThe aim of this torrent is to provide a much-needed consolidation and update of the classic adventure game franchise 'Gabriel Knight.' Each game should be fully burnable and playable on modern Windows systems. This package is designed for Gabriel Knight fans, and as such includes several rarities and bonus features to enhance your enjoyment. Series veterans may also appreciate that the content found here, which formerly spanned 11 discs and several internet sites, is now consolidated into one DVD-sized package. \n\n\nTORRENT CONTENTS:\n\n1. Gabriel Knight 1: Sins of the Fathers\nCD image from the 'Gabriel Knight Mysteries' package, as well as the the Windows XP installer for better functionality on newer systems.\n\n2. Gabriel Knight 2: The Beast Within\nDVD image, compiled by the Gabriel Knight WinXP HD/DVD Installer and extracted from the 'Gabriel Knight Mysteries' 6-disc edition of the game.\n\n2. Gabriel Knight 3: Blood of the Sacred, Blood of the Damned\nThree CD images from the original CD release of the game.\n\n4. Game Manuals\nPDF scans for each of the games' manuals, as well as the graphic novels that accompanied GK1 and GK3.\n\n5. Walkthroughs\nPoint-by-point instructions in TXT format taken from various internet sources, as well as a video demonstrating how to solve the last puzzle in GK2.\n\n6. Game Soundtracks\nMidi extracts from GK1 in General MIDI format, as well as select songs digitally processed/recorded in .mp3. MP3 128kbps rip of the Gabriel Knight 2 Soundtrack from the 'Gabriel Knight Mysteries' package, including select songs from GK1 and GK3. MP3 game rips of the GK3 score.\n\n7. Extras\nSome assorted extras for you to check out. Among them -- the floppy version of GK1; the graphic novels of GK1 and GK3; the GK2 blooper reel; &quot;Pause,&quot; a short story by Jane Jensen that acts as the transition between GK1 and GK2; and several modding utilities with instructions for GK3.\n\n8. Utilities\nI've included WinRAR and Alcohol 120 so that you can decompress and mount the CD images\n\n\nINSTALLATION INSTRUCTIONS:\n\n1. Gabriel Knight 1: Sins of the Fathers\n - Decompress the rar file that contains the CD image\n - Place the image in a directory or burn the image using a program like Nero\n - Mount the image onto a virtual drive using a program like Alcohol 120\n - DO NOT run the setup on the CD. Instead, run the GK1 WinXP setup provided\n - Follow the setup program instructions, and select the letter of your virtual drive that contains the CD image\n - Choose your installation preferences. Recommended: Install the entire game onto your harddrive and run in fullscreen.\n\n2. Gabriel Knight 2: The Beast Within\n - Decompress the rar file that contains the DVD image\n - Place the image in a directory or burn the image using a program like Nero\n - Mount the image onto a virtual drive using a program like Alcohol 120 OR (recommended), burn the DVD image onto a DVD\n - Run the setup provided on the DVD.\n - Choose your installation preferences. Recommended: Install a portion of the game onto your harddrive (16mb minimum) and run from the game from the DVD/image. Uncheck the &quot;Interlaced video&quot; to remove the native black lines from the video sequences.\n\n3. Gabriel Knight 3: Blood of the Sacred, Blood of the Damned\n - Place the images in a directory or burn each image using a program like Nero\n - Mount the image of Disc 1 onto a virtual drive using a program like Alcohol 120\n - Run the autoplay or setup program directly from the CD/image\n - Follow the setup program instructions and select your installation preferences. Recommended: Install full game so that you don't have to swap CDs/images. Keep the 1st CD/image handy for gameplay.\n\n\nLet me know what you think, look for future retro gaming torrents, and happy Shadow Hunting! \n\n\nFOR TECH SUPPORT PLEASE VISIT THE SIERRA HELP FORUMS\n\nLink: http://www.sierrahelp.com/forums/viewforum.php?f=5&amp;sid=0094779b36c9de86a927fff3bb5cbcc8\n","torrent":{"xt":"urn:btih:db7982d1d8401077d7353ee6e9cecbd958e03ce5","amp;dn":"Gabriel+Knight+Trilogy+-+Windows+XP%2FVista+compatible+versions+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db7982d1d8401077d7353ee6e9cecbd958e03ce5","infoHashBuffer":{"type":"Buffer","data":[219,121,130,209,216,64,16,119,215,53,62,230,233,206,203,217,88,224,60,229]},"announce":[],"urlList":[]}}