{"title":"Secret Garden - Winter Poem (2011) [FLAC]","uid":6932387,"size":353031868,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dbb0040efaa1cc1012831a485a0006084baff280&amp;dn=Secret+Garden+-+Winter+Poem+%282011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tuemith","files":-1,"time":1325701489,"description":"According to pianist Rolf LÃƒÂ¸vland, Irish-Norwegian neo-classical duo Secret Garden's seventh studio album, Winter Poem, was inspired by the &quot;darkness that surrounds the Scandinavian winter.&quot; While there's a genuine sense of melancholy laced throughout its largely instrumental 11 tracks, fans of their luscious new age sound needn't fear a new gothic reinvention, as there's very little here likely to find its way onto a horror movie soundtrack. Indeed, the stately piano chords and sweeping string arrangements (courtesy of the Czech National Symphony Orchestra) of opener &quot;Make a Wish&quot; feel more suited to a Downton Abbey-esque costume drama, while elsewhere the lilting &quot;Anticipation&quot; recalls the emotive ivory-tinkling of Ludovico Einaudi's understated scores, the more uptempo &quot;Fionnuala's Cookie Jar&quot; is a highly percussive Irish jig packed with Celtic fiddles and tin whistles, and &quot;Suite,&quot; a 15-minute overture written especially for the 2010 Shanghai World Expo, reveals that LÃƒÂ¸vland and violinist Fionnuala Sherry are capable of realizing their symphonic ambitions. The three vocal tracks are just as quintessentially Secret Garden. &quot;The Dream&quot; is a lavishly haunting affair underpinned by muted beats, emotionally stirring strings, and lullaby-ish melodies, sung by Clannad's Moya Brennan in her own unmistakable ethereal style; Riverdance vocalist Fionnuala Gill lends her quivering glass-shattering tones to the atmospheric ballad &quot;Mary's Lament&quot;; while &quot;Powered by Nature&quot; (written by Brendan Graham, the man responsible for the now ubiquitous &quot;You Raise Me Up&quot;) is a valiant attempt to replicate the anthemic qualities of their most enduring song. Winter Poem is unlikely to convert those who have previously likened their music to wallpaper, but while it's true that there's nothing particularly challenging or inventive on offer here, it's hard to disagree with the opinion that what they do, they do very well. (by by Jon O'Brien of allmusic.com)\n\n\n01. Make a Wish Lovland [3:40] \n02.  Song For a New Beginning Lovland  [3:23] \n03.  The Dream Lovland [4:29] \n04.  Frozen In Time Lovland [3:49] \n05.  Anticipation Lovland [3:50] \n06.  Fionnuala's Cookie Jar Lovland [3:40] \n07.  Mary's Lament Graham, Lovland [3:56] \n08.  Song At the End of the Day Lovland [3:20] \n09.  Lament For a Frozen Flower Lovland [5:10] \n10.  Powered By Nature Lovland [5:39] \n11.  Suite (Prelude, Intermezzo, Polka, Air, Interlude, Hymn)\n\nEnjoy and Seed please","torrent":{"xt":"urn:btih:dbb0040efaa1cc1012831a485a0006084baff280","amp;dn":"Secret+Garden+-+Winter+Poem+%282011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbb0040efaa1cc1012831a485a0006084baff280","infoHashBuffer":{"type":"Buffer","data":[219,176,4,14,250,161,204,16,18,131,26,72,90,0,6,8,75,175,242,128]},"announce":[],"urlList":[]}}