{"title":"Doomsword - Discography (1999 - 2011) Metal","uid":6759344,"size":584533133,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:dc5232d60632ba79e56374ad0dc7673ef4bd7480&amp;dn=Doomsword+-+Discography+%281999+-+2011%29+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":41,"time":1319153190,"description":"320 kbps\n\nDoomsword (1999) \nResound the Horn (2002)\nLet Battle Commence (2003) \nMy Name Will Live On (2007)\n\n\nVBR VO\n\nThe Eternal Battle (2011)\n\n\n \n\n\nDoomSword are an Italian Heavy Metal band hailing from the foothills of the Alps in Varese, Lombardy.\n\nDOOMSWORD is one of the few bands firmly rooted in the sound of '80s heavy metal while being able to create something new for the next era in metal.\n\nThe first nucleus of the band was formed in 1996 when Deathmaster and Guardian Angel joined forces to create an ancient music project called 1014 AD. The project was entirely acoustic and the style was very influenced by medieval music.\n\nAfter a short hiatus the duo re arranged the existing material into proper metal songs in the way of Warlord, Cirith Ungol, Candlemass, Medieval Steel, maintaining a strong medieval influence but adding a heavy epic vein. The project changed name from 1014AD to DoomSword, and a first demo was recorded in 1997 called &quot;Sacred Metal&quot;.\n\nGuardian Angel took care of guitars and drums, Deathmaster of vocals and guitars, and a session bass player was recruited to record the 5 tracks comprised on the demo.\n\n\nThe band immediately received a good response from critics and fans and in 1998, Italian label Underground Symphony signed DoomSword for the release of an album, and bass player Dark Omen and singer Gabriele &quot;Nightcomer&quot; Grilli were recruited for the recording of the first album.\n\nThe homonymous debut album was released in 1999, and it's still considered a classic of Epic Heavy Metal.\n\n\nAfter the release of the first album, the line-up dramatically changed. Guardian Angel and Nightcomer left the band and were replaced by Grom (ex-Ancient) at the drums, The Forger at rhythm guitar, Gianluca Ferro (a.k.a. Guardian Angel II) at lead guitars, Deathmaster resumed his original role of singer in the band, which he would maintain to this day.\n\nItalian metal label Dragonheart signed DoomSword and with this entirely new set up the band would go on to release the critically acclaimed &quot;Resound The Horn&quot; in 2002 and - after Grom left to be replaced by Wrathlord in June 2002 - the band began their live activity taking part at important European festivals including the very first edition of the Keep It True. The sound of the band became more varied and melodic, and more strictly epic, abandoning in part the obscurity of the first album.\n\n\nAs the live activity intensified, Gianluca Ferro left the band to be replaced by Sacred Heart in 2003, right after the publication of DoomSword's &quot;Viking&quot; album &quot;Let Battle Commence&quot;. The album was a remarkable success and DoomSword were awarded best Italian band of 2003 by the popular Italian magazine Metal Hammer. The band evolved into a dark, heavy, oppressive battle-like sound, with Bathory being a strong influence on the band's compositions.\n\nIn 2004, after intense touring and participations to festivals such as the Bang Your Head and the Tradate Iron Fest (w/ Virgin Steele and Omen), and the replacement of Dark Omen with Midryasi bass player Geilt, DoomSword took a break, only to return in 2007 with the masterpiece &quot;My Name Will Live On&quot;, an album of extreme creativity that included elements from all the previous albums with new features such as fast songs and more intricate instrumental parts.\n\n\nIn 2011, DoomSword return with &quot;The Eternal Battle&quot;, an album that represents a new benchmark for Epic Metal, with the usual passion and emotion of the DoomSword sound combined with a further increased musical intelligence and depth, proving once again that DoomSword are a band in constant evolution with a lot more to give to Metal.\n\n\nSince the recording of &quot;The Eternal Battle&quot; bass player Geilt (who recorded the album) has been replaced by Fury'n'Grace bassist Christian &quot;Nidhoggr&quot; Grilli, already a member of DoomSword's side-project Gjallarhorn.\n\n2011 Line-up:\n\nDeathmaster: vocals\nSacred Heart: guitars\nWrathlord: drums\nNidhoggr: bass\n\n","torrent":{"xt":"urn:btih:dc5232d60632ba79e56374ad0dc7673ef4bd7480","amp;dn":"Doomsword+-+Discography+%281999+-+2011%29+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc5232d60632ba79e56374ad0dc7673ef4bd7480","infoHashBuffer":{"type":"Buffer","data":[220,82,50,214,6,50,186,121,229,99,116,173,13,199,103,62,244,189,116,128]},"announce":[],"urlList":[]}}