{"title":"Dragonfly - Dragonfly 1968 (2004) (flac)","uid":10068644,"size":234143263,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc709907a1993b7773d18bb8f8e04a3245ffddf5&amp;dn=Dragonfly+-+Dragonfly+1968+%282004%29+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":-1,"time":1398819017,"description":"eac secure cue log scans \n\n There was never really a band by the name of Dragonfly, and no gig was ever played under that name. Dragonfly was was just an album. The story goes on from here. A guy from Durango, Colorado, by the name of Gerry Jimerfield, had a band called The Lords of London. Of course none of them were British but it sounded good during the days of the British Invasion. Gerry was twenty-six and the others were nineteen and twenty. Gerry had already been in the military and had taken a rock band to LA, made a couple of records, and played on the TV show Hullabaloo. The band business in LA being what it was, Gerry moved back to Durango and stayed at his parent's kitchenette motel.\n\nMeanwhile, Barry Davis and Jack Duncan were playing in a local band in El Paso, Texas by the name of The Pawns. The El Paso music scene was jumping and for a town that size there were tons of bands, lots of very good players, but few good singers. The Pawns had been through a couple of incarnations but were still very successful. Jack joined The Pawns in 1965 and when drummer Jimmy Wagnon of the Bobby Fuller Four quit Barry Davis was hired. The other two guys in the band were married so Jack and Barry became good friends. Bobby Fuller was from El Paso and had a big time recording studio in his house. Jack had know Bobby and his brother Randall since he was sixteen and did some local rodie work for them. When Jack joined The Pawns he was learning guitar but the bass player wanted out. He sold his bass to Jack for $50.00, and showed him the basics of the the songs and that was it.\n\nThrough Bobby Fuller, The Pawns got turned on to playing Farmington, New Mexico with a local promoter up there. The Pawns would go up there about once every couple of months and play. They were very popular, made a ton of money, and word got around about them. One Saturday night Gerry Jimerfield and his then keyboardist, Erin McElaine, came down to Farmington to hear what The Pawns were all about. After the show Gerry introduced himself to Jack, said he had connections on the West Coast, and offered to put something together if Jack and Barry ever wanted to.\n\nA few months later, they gave Gerry a call. He invited them to move to Durango and said they could stay for free at his parent's motel. Barry and Jack threw their equipment in the back of Barry's '57 Canary Yellow Chevy Bel Air hard top and took off for Durango. The band rehearsed there for a couple of months as a four piece and then decided it was time to hire another guitar. Jack and Barry suggested another home boy by the name of Randy Russ. He had been in a competitive El Paso band by the name of the Instigators but when they called he jumped at the chance. Randy moved up to Durango and everything was in place.\n\nThe band went up to the Denver area and played many happening clubs of the time in Denver, Boulder, Ft. Collins, and Estes Park. They were well received and stated playing as an opening act at the famous Family Dog. One of the bands they seemed to end up exchanging sets with was a band named the American Standard with a great guitarist by the name of Tommy Bolin. The Lords of London were feeling their oats, so they headed out to California where Gerry said they would hook up with his old managers. They went through the stereotypical starving musician life for a while, living in a single motel room with little or nothing to eat. They headed back to Colorado to play for the summer and make some money and had a very successful time in the now-famous summer of love, the summer of '67.\n\nGoing back to LA, their managers were ready to get an album going but there was one problem: these guys were &quot;old school&quot; and believed that rock bands should neither write their own material nor play in the studio. They were looking for a new name when a traveling companion by the name of Mark Clark suggested The Jimerfield Legend. After all, Gerry was older, was the leader of the band, and had a stage charisma that epitomized the sixties. Many gigs were played under that name and one of the historical references to it is from one the Family Dog posters which can be seen on the wall in the stairwell of Steve McQueen's house in the movie Bullit. But their old school managers did not want to use the name Jimerfield because what if he left the band? So the Album came out under the name The Legend with a bunch of squirrelly-assed songs chosen by the managers and played by studio musicians, albeit by some of the best of the time like Carol Kaye and Hal Blane. The arrangements were done by the late Gene Page of Motown and Barry White fame.\n\nOne of the managers saw them at Family Dog in Denver, on the big stage, with psychodelic lights, and lots of kids going nuts. He was astounded at how the audience was into the band. After the first show, he asked the band why they hadn't told him they could write and play like that. They of course said they had tried to explain it to them but they just didn't get it.So the manager goes back to LA and tells his partner they need to let the band do an original album. When they got back to LA, they started recording what would become the Dragonfly album. In the meantime, the keyboardist had left the band and Dragonfly was done basically as two-guitars, bass and drums album. The managers also hired a producer by the name of Richard Russell (real name Richard Egizi) and the band cut the album at Amigo in I.D. Studios in north Hollywood with Hank Cicalo engineering. They made it an album, with no band member names listed and no pictures, again afraid that if anyone quit or changed it would damage the credibility of the band.\n\nWhen all was said and done, the band was financially broke, had no gigs and no promotions behind them. Nevertheless, they got a little air play on LA radio as Jack remembers hearing it and getting one small BMI royalty check. At one point, one of the managers called to say they could get them a gig at The Fillmore West in San Francisco. The guys never knew how serious this was but the wheels to move on were already in motion so it wasn't seriously considered. So Dragonfly went the way of many bands, off into oblivion. About 1998 or so, Jack got a call from a guy in Belgium, saying there was a radio station that played old obscure vinyl and one of the Dragonfly songs was in the top ten in terms of requests!\nby Jack Duncan\n\nTracklist:\n01. Blue Monday\n02. Enjoy Yourself\n03. Hootchie Kootchie Man\n04. I Feel It\n05. Trombodo\n06. Portrait Of Youth\n07. Crazy Woman\n08. She Don't Care\n09. Time Has Slipped Away\n10. To Be Free\n11. Darlin'\n12. Miles Away","torrent":{"xt":"urn:btih:dc709907a1993b7773d18bb8f8e04a3245ffddf5","amp;dn":"Dragonfly+-+Dragonfly+1968+%282004%29+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc709907a1993b7773d18bb8f8e04a3245ffddf5","infoHashBuffer":{"type":"Buffer","data":[220,112,153,7,161,153,59,119,115,209,139,184,248,224,74,50,69,255,221,245]},"announce":[],"urlList":[]}}