{"title":"Noam Chomsky - Media Control - The Spectacular Achievements of P","uid":6602413,"size":16618324,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dccf1a9553bc5f0cb448652f504198053dd2a5a1&amp;dn=Noam+Chomsky+-+Media+Control+-+The+Spectacular+Achievements+of+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"programa","files":9,"time":1313261736,"description":"Media Control: The Spectacular Achievements of Propaganda\nBy Noam Chomsky\n\n\nFormat: MP3\nBitrate: 32 Kbps\n\n\n&quot;Propaganda,&quot; says Noam Chomsky, &quot;is to a democracy what the bludgeon is to a totalitarian state&quot;--in other words, the means by which leaders keep the masses in line. In this slim pamphlet, he looks at American propaganda efforts, from the warmongering of Woodrow Wilson to the creation of popular support for the 1991 military intervention in Kuwait, and reveals how falsification of history, suppression of information, and the promotion of vapid, empty concepts have become standard operating procedure for the leaders of the United States--both Democrats and Republicans--in their efforts to prevent citizens from raising awkward questions about U.S. policy.\n\nBeginning with the Creel Commission, the Woodrow Wilson-appointed committee that turned isolationist America into a war-hungry machine, master political analyst Noam Chomsky traces the history of American propaganda. Part of the Open Media Pamphlet Series. \n\nNoam Chomsky is an influential linguist, professor, author, and activist. Chomsky has been active in left-wing politics and he opposed the Vietnam War. He is the eighth most cited source of all time, and is considered the ''most cited living author''. Chomsky is also the author of over 150 books.\n\n\nRunning Time: 1:09:14","torrent":{"xt":"urn:btih:dccf1a9553bc5f0cb448652f504198053dd2a5a1","amp;dn":"Noam+Chomsky+-+Media+Control+-+The+Spectacular+Achievements+of+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dccf1a9553bc5f0cb448652f504198053dd2a5a1","infoHashBuffer":{"type":"Buffer","data":[220,207,26,149,83,188,95,12,180,72,101,47,80,65,152,5,61,210,165,161]},"announce":[],"urlList":[]}}