{"title":"Orion the Hunter series by J.D. Chase (ePUB)(MOBI) - Traitor","uid":9646255,"size":2260963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:defc1e3df7f61dc7019ca5895d38235afed29402&amp;dn=Orion+the+Hunter+series+by+J.D.+Chase+%28ePUB%29%28MOBI%29+-+Traitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Xetron","files":12,"time":1393004935,"description":"Book 1: The Hunter\nGorgeous Interior Designer, Issy Prince, loves her life in Manhattan with her best friend, Angel. She loves to watch Angel's boyfriend's band and is used to getting the attention of any man she wants. She has no plans to settle down - ever - but has regular hot one night stands. Life is good.\nFormer Dominant, Lucas Hunter, has made millions in the construction sector. The handsome, anti-social, alpha male has been celibate for several years, preferring instead to hit the gym and maintain his awesome physique. When he meets Issy, sparks fly.\nWhat happens when two strong minded individuals find that they can't get each other out of their minds? Neither wants to get involved in a relationship but neither can walk away. Dare they embark on a passionate journey into the unknown?\n\nBook 2: The Hunted\nFollowing on from part one, The Hunter, things come to a head when Issy and Lucas give in to their desires for one wild night. But what will the consequences be? Issy learns a secret from Lucas' past and surprises them both by wanting to explore a new direction. The band find themselves with an unexpected temporary agent.\n\nBook 3: Hunting Lust\nFollowing on from The Hunter and The Hunted, Issy has relented to Lucas' requests to give him a one month trial. The rock band, Denial, scores some festival gigs but the actions of one band member threaten to tear the band apart. \nEvents from Issy and Lucas' pasts rear their heads. Can they overcome the consequences ... or will the damage be irreparable? \n\nBook 4: Hunting Truth\nIssy Price wakes in a strange bed after walking out on her man, Lucas Hunter, after she is paid a visit by a malevolent stranger who brings news that shocks her to the core. It seems that Lucas Hunter is not the man he said he was. Can she forgive him for the events that led to her walking out on him? Maybe everything isn't as it seems. \nIn Hunting Truth, we learn more about Lucas' past that could impact massively on his present ... it could even destroy his future. Lucas' past has well and truly caught up with him. Actions from the past and his need to hunt down and seek revenge could lead to Lucas losing all that he's worked for. Has he inadvertently brought about his own destruction? \nThe rock band, Denial, seemed destined for greater things. The hard won tour and possibility of a record contract were theirs for the taking. Surely the past can't wreak havoc on that too. \nAnd what's a sex club got to do with it all? It brings out the darker side of an unlikely person for starters! \nCan the relationship between Lucas and Issy survive the pressure? Or is the deep, blood-spilled revenge from the past too strong? That decision may just be taken out of their hands ... ","torrent":{"xt":"urn:btih:defc1e3df7f61dc7019ca5895d38235afed29402","amp;dn":"Orion+the+Hunter+series+by+J.D.+Chase+%28ePUB%29%28MOBI%29+-+Traitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"defc1e3df7f61dc7019ca5895d38235afed29402","infoHashBuffer":{"type":"Buffer","data":[222,252,30,61,247,246,29,199,1,156,165,137,93,56,35,90,254,210,148,2]},"announce":[],"urlList":[]}}