{"title":"&quot;Romanitas&quot; Trilogy by Sophia McDougall","uid":7128239,"size":4422080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df47542caee1166cab8b83812ea4bc88669915d8&amp;dn=%26quot%3BRomanitas%26quot%3B+Trilogy+by+Sophia+McDougall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rngtrk","files":5,"time":1332606842,"description":"Romanitas is an alternate history novel by Sophia McDougall, published by Orion Books. It is the first of a trilogy of novels based on a world where the Roman Empire has survived to contemporary times and now dominates much of the world.\n\nImagine a world in which Rome never fell. Now the Empire stretches across the Atlantic, slaves are constructing a giant bridge over the Persian Gulf, and magnetic railways span the globe. But tensions within and without are about to change the face of the earth. Marcus Novius is caught in a massive explosion at the Coliseum which kills his uncle the emperor . . . making Marcus, his heir, the new leader of the Roman Empire. Marcus, the healer Sulien and Una, his sister - and Marcus' own love - have been together through thick and thin, fighting for freedom, fighting for their lives, fighting for justice, and Marcus' ascension to Roman throne was supposed to be the start of something magnificent . . . But Marcus is horribly wounded himself in the explosion, and Sulien is having problems fighting his way through the terrible devastation to be at his friend's - his emperor's - side. And it's not long before Sulien and Una realise life will never be the same again, for the Roman Empire is about to face its most dangerous enemy . . .\n\nBook 1 - Romanitas:\nISBN-10: 0575096926\nISBN-13: 978-0575096929\n\nBook 2 - Rome Burning\nISBN-10: 0575096934\nISBN-13: 978-0575096936\n\nBook 3 - Savage City\nISBN-10: 0575094885\nISBN-13: 978-0575094888\n\n\nThe files are in .mobi (Kindle) format. .epub (iBook) format is available for 2 of the files. (Conversion to epub failed for one)","torrent":{"xt":"urn:btih:df47542caee1166cab8b83812ea4bc88669915d8","amp;dn":"%26quot%3BRomanitas%26quot%3B+Trilogy+by+Sophia+McDougall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df47542caee1166cab8b83812ea4bc88669915d8","infoHashBuffer":{"type":"Buffer","data":[223,71,84,44,174,225,22,108,171,139,131,129,46,164,188,136,102,153,21,216]},"announce":[],"urlList":[]}}