{"title":"Powerless 1-6","uid":7192468,"size":48449242,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e005cc78fa6374f9b8bd71b8aa876a410ac41e5d&amp;dn=Powerless+1-6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GIANNIS511","files":6,"time":1334674583,"description":"Powerless is a comic book series published by Marvel Comics. The series, which began in 2004, is written by Matt Cherniss and Peter Johnson and penciled by artist Michael Gaydos. It had a six issue run, all of which are now published together in a trade paperback collection.\n\n\nThe series begins with a psychologist, Dr. William Watts, waking suddenly in a hospital bed. According to his doctor, Dr. Susan Storm, he was suffering from a three day coma caused by falling on the sidewalk in front of his apartment. Dr. Watts remarks that he had incredibly vivid dreams of fantastical heroes and villains during his coma, so much so that he has trouble distinguishing which world is reality.\n\nThough the events in all six issues of Powerless occur in a version of Earth where superpowers do not exist, known in the Marvel universe as Earth-Powerless, there are occasional panels featuring characters from the &quot;fantasy world&quot; William Watts experienced while in his brief coma. These panels feature a wide variety of Marvel characters, many of which have a counterpart in Dr. Watts' actual life; however, many others only appear in these flashbacks. The events he experienced in this &quot;dream universe&quot; are very vague - however, the set of characters and costumes imply that it is most similar to the main Marvel universe, Earth-616.\n\n","torrent":{"xt":"urn:btih:e005cc78fa6374f9b8bd71b8aa876a410ac41e5d","amp;dn":"Powerless+1-6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e005cc78fa6374f9b8bd71b8aa876a410ac41e5d","infoHashBuffer":{"type":"Buffer","data":[224,5,204,120,250,99,116,249,184,189,113,184,170,135,106,65,10,196,30,93]},"announce":[],"urlList":[]}}