{"title":"ATV Offroad FuryÂ® Pro (PSP)","uid":3909016,"size":546973880,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:e017236896562ecd84b9a7bcdecad1af031347da&amp;dn=ATV+Offroad+Fury%C2%AE+Pro+%28PSP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FigzX","files":1,"time":1196024940,"description":"The most intense handheld off-road racing package is back with ATV Offroad FuryÂ® Pro for the PSPÂ® (PlayStationÂ®Portable) system. In addition to the adrenaline rush of pure ATV racing, players can now choose from more than 30 total vehicles to race, including MX bikes, buggies, and Trophy Trucks to compete on 64 all-new tracks, including tracks from the original ATV Offroad Fury titles.\n\nSupporting up to four players via wireless multiplayer connectivity, players will speed through more than 30 visually stunning environments with six distinct terrain types including snow, dirt, mud, ice, water, and grass. Featuring five new events, new vehicles and mini-games, and cross compatibility with ATV Offroad Fury? 4 for the PlayStationÂ®2, ATV Offroad Fury Pro will provide players the opportunity to tackle the trickiest off-road courses anytime, anywhere.\n\n    * New Cross-Connection Compatibility with ATV Offroad Fury? 4 for PlayStationÂ®2 - Players are now able to share customized circuits, exchange and upgrade vehicles, share trading cards, and access chatrooms and newsgroups with the upcoming ATV Offroad Fury? 4 for PlayStationÂ®2.\n    * New Shared Online Community - Players can access message boards and view scores, rankings, player profiles, and exchange game data with other players.\n    * Multiplayer Gameplay - Gamers can compete locally against friends or race fans around the country via wireless multiplayer connectivity, either via Ad Hoc or Infrastructure Mode.","torrent":{"xt":"urn:btih:e017236896562ecd84b9a7bcdecad1af031347da","amp;dn":"ATV+Offroad+Fury%C2%AE+Pro+%28PSP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e017236896562ecd84b9a7bcdecad1af031347da","infoHashBuffer":{"type":"Buffer","data":[224,23,35,104,150,86,46,205,132,185,167,188,222,202,209,175,3,19,71,218]},"announce":[],"urlList":[]}}