{"title":"Halo Primordium EPUB MOBI PDF","uid":6975910,"size":4265145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e05d8ea2bfb5e52cf9986e744822e7cdd67c53eb&amp;dn=Halo+Primordium+EPUB+MOBI+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"boobsman","files":14,"time":1327249348,"description":" &lt;a href=&quot;http://www.freeimage.us/image-8301_4F1C2A59.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.freeimage.us/image-8301_4F1C2A59.jpg&lt;/a&gt;\n\nHalo: Primordium: Book Two of the Forerunner Saga\n\nOverview:\n\nA long time ago, I was a living, breathing human being. I went mad. I served my enemies. They became my only friends. \n\nSince then, I ve traveled back and forth across this galaxy, and out to the spaces between galaxies a greater reach \nthan any human before me. \n\nYou have asked me to tell you about that time. Since you are the last true Reclaimer, I must obey. Are you recording? \nGood. Because my memory is failing rapidly. I doubt I ll be able to finish the story. \n\nOnce, on my birth-world, a world I knew as Erde-Tyrene, and which now is called Earth, my name was Chakas... \n\nIn the wake of apparent self-destruction of the Forerunner empire, two humans Chakas and Riser are like flotsam \nwashed up on very strange shores indeed. \n\nCaptured by the Master Builder, misplaced during a furious battle in space, they now find themselves on an inverted \nworld where horizons rise into the sky, and where humans of all kinds are trapped in a perilous cycle of horror and \nneglect. For they have become both research animals and strategic pawns in a cosmic game whose madness knows no end a \ngame of ancient vengeance between the powers who seeded the galaxy with life, and the Forerunners who expect to \ninherit their sacred Mantle of duty to all living things. \n\nIn the company of a young girl and an old man, Chakas begins an epic journey across a lost and damaged Halo in search \nof a way home, an explanation for the warrior spirits rising up within, and for the Librarian s tampering with human \ndestiny. \n\nThis journey will take them into the Palace of Pain, the domain of a powerful and monstrous intelligence who claims \nto be the Last Precursor, and who now has control of both this Halo and the fate of Forerunners and Humans alike. \n\nCalled the Captive by Forerunners, and the Primordial by ancient human warriors, this intelligence has taken charge of, \nand retasked, the Master Builder s cruel researches into the Flood which it may have itself unleashed on the galaxy \nmore than ten thousand years before.\n\nFormat: EPUB, MOBI, PDF\nLanguage: English\nAuthor: Greg Bear \nPublisher: Tor Books \nRelease Date:  1st Febuary 2012\nLength: 1150 pages","torrent":{"xt":"urn:btih:e05d8ea2bfb5e52cf9986e744822e7cdd67c53eb","amp;dn":"Halo+Primordium+EPUB+MOBI+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e05d8ea2bfb5e52cf9986e744822e7cdd67c53eb","infoHashBuffer":{"type":"Buffer","data":[224,93,142,162,191,181,229,44,249,152,110,116,72,34,231,205,214,124,83,235]},"announce":[],"urlList":[]}}