{"title":"Fuck Buttons - Slow Focus (2013) [FLAC]","uid":8743062,"size":390311587,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e0da60a0cdfe5164d0f0d25f80b655b529a6ff11&amp;dn=Fuck+Buttons+-+Slow+Focus+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1374843821,"description":"\n  Fuck Buttons - Slow Focus (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Experimental, Post-Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Brainfreeze \n  02 Year Of The Dog \n  03 The Red Wing\n  04 Sentients\n  05 Prince's Prize \n  06 Stalker \n  07 Hidden XS \n\n  After working with Mogwai's John Cummings on Street Horrrsing and Andrew Weatherall on Tarot Sport, Fuck Buttons' John Power and Andrew Hung chose to produce Slow Focus themselves. While traces of those other artists' influences linger here -- most notably on the gorgeous album closer &quot;Hidden XS,&quot; which recalls Mogwai in its heartbreaking melody and exquisite tension -- Hung and Power spend most of their third album proving how much they've come into their own. The duo manages to pack more beauty, menace, and melancholy into fewer songs, and the contrast between the implosive moments and soaring ones is sharper than ever. Indeed, the inclusion of Tarot Sport's &quot;Olympians&quot; in the 2012 Summer Olympics opening ceremony was the most prominent kind of validation for Fuck Buttons' way with a grand statement. \n\n  It's reinforced here by the sheer size and sweep of &quot;Brainfreeze,&quot; where the huge drums and swarming synths the duo has been known for since the beginning combine into Power and Hung's version of a rock anthem. Slow Focus is Fuck Buttons in supernova mode, with songs exploded into epics covering several emotions in their long-reaching arcs (the relatively petite &quot;Year of the Dog&quot; is the exception that proves the rule with its close-up on the duo's details). While several songs pass the ten-minute mark, they never feel bloated -- if anything, Slow Focus is some of Fuck Buttons' most vivid, kinetic music, moving in ways that feel completely natural, if not exactly expected: a distantly wailing soft rock saxophone joins the ricocheting beats and electronics on &quot;The Red Wing,&quot; elevating the song in a way that's both dazzling and befuddling. \n\n  But as impressive as Slow Focus' opening salvos are, fittingly enough it takes some time for the album's peaks to reveal themselves. &quot;Sentients&quot;' wrecking-ball rhythms and android mutterings are hypnotically eerie, echoing and magnifying some of the territory Boards of Canada covered on Tomorrow's Harvest; &quot;Prince's Prize&quot; seems to be content undercutting its elaborate and slightly crazed arpeggios with blasts of noise until a clapping-driven beat adds a bizarre -- but not unwelcome -- dancefloor element; and &quot;Stalker&quot; manages not only to be propulsive and droning at the same time, but also avoids being slavish in its homage to John Carpenter. With each album, Power and Hung have taken Fuck Buttons in many more directions post-Street Horrrsing than could have been imagined, and Slow Focus delivers some of their most masterful and seemingly effortless music yet.","torrent":{"xt":"urn:btih:e0da60a0cdfe5164d0f0d25f80b655b529a6ff11","amp;dn":"Fuck+Buttons+-+Slow+Focus+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0da60a0cdfe5164d0f0d25f80b655b529a6ff11","infoHashBuffer":{"type":"Buffer","data":[224,218,96,160,205,254,81,100,208,240,210,95,128,182,85,181,41,166,255,17]},"announce":[],"urlList":[]}}