{"title":"Pluralsight - Introduction to Versioning Environments With Vagra","uid":11659936,"size":1132597229,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e1c4100e8c7fa172b63f452c036e078889b15929&amp;dn=Pluralsight+-+Introduction+to+Versioning+Environments+With+Vagra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"NepsterJay","files":78,"time":1417983425,"description":"Level : Intermediate \nDuration : 4h 20m\nReleased : 02 Oct 2014\n\nIn this course, you'll learn everything necessary to create virtual environments, version the definition of the environments, and start reaping the benefits of Vagrant for developing and supporting software systems.\n\nPartitioning and automating the creation of environments and incorporating them into development workflows can be immensely valuable. But, historically it's been so much work it has rarely been worth the effort. That's no longer the case, thanks to Vagrant. With Vagrant, you'll know what software is necessary for a project, including software versions and configuration; you will have a history of why, when, who, and how this software was incorporated; you will eliminate surprises by developing in an environment similar to production; and be able to safely create and test scripts to automate the setup of environments. This will help you get projects up and running quickly and effectively onboard new team members. In this course, you'll learn everything necessary to start reaping the benefits of Vagrant for developing and supporting software systems","torrent":{"xt":"urn:btih:e1c4100e8c7fa172b63f452c036e078889b15929","amp;dn":"Pluralsight+-+Introduction+to+Versioning+Environments+With+Vagra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1c4100e8c7fa172b63f452c036e078889b15929","infoHashBuffer":{"type":"Buffer","data":[225,196,16,14,140,127,161,114,182,63,69,44,3,110,7,136,137,177,89,41]},"announce":[],"urlList":[]}}