{"title":"Time at the Top ebook  Edward Ormondroyd epub mobi Fiction","uid":10304916,"size":1790127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e265e0a49164257784441bf3cd038b87b0f91227&amp;dn=Time+at+the+Top+ebook++Edward+Ormondroyd+epub+mobi+Fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KiwiSue49","files":-1,"time":1402025260,"description":"5 out of 5 stars at both Amazon and goodreads as at Friday, 6 June 2014 for this edition.\n\n\n\nIt's strange enough when Susan Shaw disappears without a trace on a wintry March afternoon. It's stranger still when her uninformative note is found in the hallway of her apartment building, along with a black cat that no one has seen before. And it's strangest of all when she suddenly appears again, wearing clothes that are eighty years out of date, and tells a wild story about an old woman with a fly-away hat, an elevator that travels into the past, and a distressed family that only she can save.\n\nWho is going to believe such a tale? Certainly not her father. But Susan is determined to prove to him that it's all true. And she has other plans for him as well...\n\nWho, in fact, could believe such a tale? Even the author, who takes part in the story, has his doubts. But just as those doubts are all laid to rest, the mystery thickens once more. This time it's a double disappearance...\n\n\n\nNote: As at 6 June 2014 displays well on desktop computer using Calibre 1.36 for both the mobi and epub file and using version 1.10.8 of the Kindle application for the mobi file.\nOn the Samsung Note 10.1 (2012 model) I viewed the epub file with the Aldiko app and the Kindle for android for the mobi file.\n\nEnjoy.\n\n\n","torrent":{"xt":"urn:btih:e265e0a49164257784441bf3cd038b87b0f91227","amp;dn":"Time+at+the+Top+ebook++Edward+Ormondroyd+epub+mobi+Fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e265e0a49164257784441bf3cd038b87b0f91227","infoHashBuffer":{"type":"Buffer","data":[226,101,224,164,145,100,37,119,132,68,27,243,205,3,139,135,176,249,18,39]},"announce":[],"urlList":[]}}