{"title":"Astronomy Demystified","uid":8295588,"size":2990656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e28c502379bf3595bdd588fe274964e013ad0112&amp;dn=Astronomy+Demystified&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364137105,"description":"Stan Gibilisco, &quot;Astronomy Demystified&quot;\nMcGraw-Hill Professional | 2002-08-01 | ISBN: 0071384278 | 575 pages | PDF | 2,8 MB\n\nThis title offers the fast and painless way to grasp the fundamentals of basic astronomy ...without formal training. Want to master astronomy or aerospace engineering but are intimidated by the complex formulas and equations? Tried other self-teaching guides but were turned off by the dry, complicated presentation? Problem solved! &quot;Astronomy Demystified&quot; is a totally different, very entertaining, and amazingly effective way to learn the mathematics, fundamentals, and general concepts of astronomy.With &quot;Astronomy Demystified&quot;, you ease into the subject one simple step at a time - at your own speed. Unlike most other books on the topic, general concepts are presented first - and the details follow. In order to make the learning process as clear and simple as possible, heavy-duty math, formulas, and equations are kept at a minimum. This unique, self-teaching text offers: questions at the end of every chapter and section to reinforce learning and pinpoint your weaknesses; a 100-question final exam for self-assessment; tips on how to get the most out of observational tools such as binoculars and telescopes; discussion of the special problems associated with observing the sky at &quot;invisible wavelengths&quot;; and, an easy way to understand the math involved in astronomy. Simple enough for a beginner but comprehensive enough for an advanced student, &quot;Astronomy Demystified&quot; is your short cut to understanding the heavens.","torrent":{"xt":"urn:btih:e28c502379bf3595bdd588fe274964e013ad0112","amp;dn":"Astronomy+Demystified","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e28c502379bf3595bdd588fe274964e013ad0112","infoHashBuffer":{"type":"Buffer","data":[226,140,80,35,121,191,53,149,189,213,136,254,39,73,100,224,19,173,1,18]},"announce":[],"urlList":[]}}