{"title":"802.11 Wireless Networks: Security and Analysis (Computer Commun","uid":7304107,"size":5418907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e29d1596068c5fd47fe4c3b632320c047128a6e6&amp;dn=802.11+Wireless+Networks%3A+Security+and+Analysis+%28Computer+Commun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bookjuiced","files":-1,"time":1338138711,"description":"802.11 Wireless Networks: Security and Analysis (Computer Communications and Networks) by Alan Holt and Chi-Yu Huang\nEnglish | 2010 | ISBN: 184996274X | 224 pages | PDF | 5.34 MB\n\n\nWireless communication has the advantage of mobility and obviates the need for cabling, but is inherently less secure and is subject to the heavy regulation of the radio frequency spectrum. Nevertheless, the allocation of unlicensed parts of the spectrum has facilitated the growth in wireless local area networks (WLANs). WLAN technology is progressing at a rapid pace, but the most widely accepted WLAN standard is the IEEE 802.11.\n\n\nThis unique and highly practical text introduces the principles of WLANs based upon the IEEE 802.11 standards, demonstrating how to configure equipment in order to implement various network solutions. Readers will gain understanding of the security implications of wireless networks and learn how vulnerabilities can be mitigated. Additionally, the book examines the underlying 802.11 protocols and explains how to build mathematical models in order to analyze performance in a WLAN environment. Topics and Features: presents a practical approach supported by the extensive use of examples and detailed instructions; discusses various wireless network solutions across a number of different vendor platforms, including Cisco Aironet, Alactel-Lucent Omniaccess and Meru Networks; provides numerous mathematical models for analyzing the performance of IEEE 802.11 standards, and shows how to build these models using Maple; examines issues of wireless security and describes how to implement a wireless network with enterprise security; investigates the medium access control sub-layer, and models for performance analysis of the MAC layer; reviews the physical sub-layers of 802.11, describing modulation techniques and examining how devices adapt to changes in the RF environment. A highly useful text/reference for industry professionals, undergraduate and graduate-level students will also find this book an ideal companion to a university course on wireless networking. Dr. Alan Holt is Chief Technical Officer at the network consultancy company IP Performance Ltd., based in Bristol, UK. He is author of the popular Springer text Network Performance Analysis: Using the J Programming Language. Dr. Chi-Yu Huang works for Tata Technologies Ltd., and is currently a software consultant on the Airbus project in Bristol. She was formerly Operations Manager for DL Consulting, New Zealand.\n","torrent":{"xt":"urn:btih:e29d1596068c5fd47fe4c3b632320c047128a6e6","amp;dn":"802.11+Wireless+Networks%3A+Security+and+Analysis+%28Computer+Commun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e29d1596068c5fd47fe4c3b632320c047128a6e6","infoHashBuffer":{"type":"Buffer","data":[226,157,21,150,6,140,95,212,127,228,195,182,50,50,12,4,113,40,166,230]},"announce":[],"urlList":[]}}