{"title":"The Instruments of the Orchestra - Jeremy Siepmann  (Naxos)","uid":6111895,"size":693654733,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e34aeea3c7a3963ff58c2ae552c62d1fece2aa34&amp;dn=The+Instruments+of+the+Orchestra+-+Jeremy+Siepmann++%28Naxos%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Lucy1948","files":9,"time":1295385254,"description":"Unabridged and read by Jeremy Siepmann. 8 hours duration. 7 CD's. (Fraunhofer CBR 192 kbit/s 44khz JS, jetAudio 6.2+).\n\n\nInstruments of the orchestra, yes. But not just instruments in the orchestra. This is a set of portraits in depth, featuring individual instruments in many contexts (orchestral, chamber, folk, solo, operatic, cinematic, even jazz and avant-garde music) and in pieces from the Middle Ages to the present. Joining regular orchestra members are such exotic visitors as the eerie ondes martenot, the wind machine, banjos, bagpipes, coconuts, typewriters, six-shooters, taxi horns, and migrating swans - and the hundreds of examples range from illustrative snippets to entire movements. The first CD is devoted entirely to the violin, and the last to the greatest instrument of all, the orchestra itself.\n\nThis intoxicating, energetic, and remarkably informative survey of musical instruments is unprecedented in its scope and achievement. All the lively descriptions are followed by striking musical examples, of which there are over 200, spanning all eras, styles, and genres. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e34aeea3c7a3963ff58c2ae552c62d1fece2aa34","amp;dn":"The+Instruments+of+the+Orchestra+-+Jeremy+Siepmann++%28Naxos%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e34aeea3c7a3963ff58c2ae552c62d1fece2aa34","infoHashBuffer":{"type":"Buffer","data":[227,74,238,163,199,163,150,63,245,140,42,229,82,198,45,31,236,226,170,52]},"announce":[],"urlList":[]}}