{"title":"Space.Battleship Yamato.2010.revised.ENG.subs","uid":6932632,"size":7391753959,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e36484d616ed6b9e90c51f0d9df18bb67dd7cb5a&amp;dn=Space.Battleship+Yamato.2010.revised.ENG.subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"augustinwinter","files":3,"time":1325708469,"description":"This is a Blu Ray rip + iPad / iPhone optimised version of the live action 2010 release of Space Battleship Yamato, based on the brilliant and very dark 70s anime. It was basically the reimagined Battlestar Galactica decades before there was a Battlestar Galactica.\n\nWith all due credit and respect to the original English translators of this movie, I combined the efforts that went into three sub projects, reindexed the timecode to coincide better with the spoken dialogue and smoothed out some of the written dialogue.\n\nI don't envy the hard work translators go through to impart the true meaning of one language to another. \n\nOne issue I encountered was trying to figure out where to put full stops at the end of sentences vs. ellipses during long pauses.\n\nAnother issue was the decision of replacing what I assumed to be directly translated phrases such as &quot;I'm gonna mess you up.&quot;\n\nSpoken like that in America, we'd assume someone was going to be violently assaulted, but in the context of the scene in Space Battleship Yamato, the inferred meaning was &quot;I'm a liability to you.&quot;\n\nColloquial English bumps like that have been changed here and there, but nothing too major to preserve overall meaning.\n\nThis was a personal project in order for me to concentrate more on the movie and less time inferring meaning because of my woeful grasp of Japanese.\n\nAll credit to the originator of the Blu Ray rip which I converted for iPad / iPhone and the three original translators upon whom I based my sub work.","torrent":{"xt":"urn:btih:e36484d616ed6b9e90c51f0d9df18bb67dd7cb5a","amp;dn":"Space.Battleship+Yamato.2010.revised.ENG.subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e36484d616ed6b9e90c51f0d9df18bb67dd7cb5a","infoHashBuffer":{"type":"Buffer","data":[227,100,132,214,22,237,107,158,144,197,31,13,157,241,139,182,125,215,203,90]},"announce":[],"urlList":[]}}