{"title":"Ploning ((2009)) DVDrip[Tagalog](divx)BigbrO","uid":4840853,"size":734750460,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e42bf33d6c910b5879bed2dec13d97332c281082&amp;dn=Ploning+%28%282009%29%29+DVDrip%5BTagalog%5D%28divx%29BigbrO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"babaytoy","files":3,"time":1239492859,"description":"\nGreat DVDrip Tagalog Movie With EngSub..By: BigbrO\n\nOverview\n\nIn the picturesque island of Cuyo, Palawan, an illegal Taiwanese fishing \nvessel docks carrying the fisherman named Muo Sei, a man looking for\nsomething or someone with the name Ploning. He has from sunrise to \nsundown to look for this &quot;Ploning&quot;.\n\nIn his search, Ploning is revealed to be the island's town belle of the year \n1982. A dutiful daughter to patriarch Susing, a committed supporter to \ngrieving Intang, an honorary sister to extended family Nieves and Toting \na wise ally to simpleton Alma, a supporter to broken-hearted Siloy and a \nco-mother to half-paralyzed Juaning. A woman so important that the town\nbarely notices the absence of rain because of her presence in their lives.\n\nDespite her renowned beauty, everyone is puzzled why this 30-year-old \nspinster refuses to get married and still hopefully waits for her beau, \nTomas, to come back. Tomas left for Manila when Ploning was 16 years \nold and there has been no sign of him coming back any time soon. \nPloning's silent demeanor adds to the mystery and depth of love that no \none seems to understand.. In the center of this, is a 6-year-old boy named \nDigo who has built his world around the affection and care of Ploning, his \nfoster mother. But his entire world crashes as he learns that Ploning has \nplans of going to Manila to look for Tomas. Thus, leaving the boy with his \nbed-ridden mother, Juaning and his strict older brother, Veling. Digo tries\neverything to stop Ploning from leaving and finds an ally in the town's visitor, \nthe beautiful town nurse, Celeste. Celeste claims to have known and fallen \nin love with a man named Tomas and tried to follow him in Cuyo to find out \nif he loved him back. Ploning, with security and so much faith, denies that \nher Tomas and the man Celeste fell in love with are the same man. On the \nday of the fiesta, the rain comes and Ploning seems to be missing. Digo's\nfeeling of abandonment leads to a tragedy that grieves the town. But no \none was prepared for the secret that Ploning has kept all these years. \nA secret that exemplifies the selfless love that withstands blood, pain \nand even time.\n\n&lt;&lt;&lt; BigbrO &gt;&gt;&gt;\n\n","torrent":{"xt":"urn:btih:e42bf33d6c910b5879bed2dec13d97332c281082","amp;dn":"Ploning+%28%282009%29%29+DVDrip%5BTagalog%5D%28divx%29BigbrO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e42bf33d6c910b5879bed2dec13d97332c281082","infoHashBuffer":{"type":"Buffer","data":[228,43,243,61,108,145,11,88,121,190,210,222,193,61,151,51,44,40,16,130]},"announce":[],"urlList":[]}}