{"title":"The Science Delusion","uid":8334988,"size":686883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4479c6976d968270003c24ee32e5b4b7f375de9&amp;dn=The+Science+Delusion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364967410,"description":"\nRupert Sheldrake, &quot;The Science Delusion&quot;\nISBN: 1444727923, 144727951 | 2012 | EPUB\n\nFreeing the Spirit of EnquiryThe science delusion is the belief that science already understands the nature of reality. The fundamental questions are answered, leaving only the details to be filled in. In this book (published in the US as Science Set Free), Dr Rupert Sheldrake, one of the world's most innovative scientists, shows that science is being constricted by assumptions that have hardened into dogmas. The 'scientific worldview' has become a belief system. All reality is material or physical. The world is a machine, made up of dead matter. Nature is purposeless. Consciousness is nothing but the physical activity of the brain. Free will is an illusion. God exists only as an idea in human minds, imprisoned within our skulls. Sheldrake examines these dogmas scientifically, and shows persuasively that science would be better off without them: freer, more interesting, and more fun.In The God Delusion Richard Dawkins used science to bash God, but here Rupert Sheldrake shows that Dawkins' understanding of what science can do is old-fashioned and itself a delusion. 'Rupert Sheldrake does science, humanity and the world at large a considerable favour.' The Independent 'Certainly we need to accept the limitations of much current dogma and keep our minds open as we reasonably can. Sheldrake may help us do so through this well-written, challenging and always interesting book.' Financial Times","torrent":{"xt":"urn:btih:e4479c6976d968270003c24ee32e5b4b7f375de9","amp;dn":"The+Science+Delusion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4479c6976d968270003c24ee32e5b4b7f375de9","infoHashBuffer":{"type":"Buffer","data":[228,71,156,105,118,217,104,39,0,3,194,78,227,46,91,75,127,55,93,233]},"announce":[],"urlList":[]}}