{"title":"Power Play Viv Thomas Girlfriends NEW 2015 WEB-DL Split Scenes","uid":13107350,"size":808443077,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e4c456a246c3fbc0c4e5956f601d096466a141e1&amp;dn=Power+Play+Viv+Thomas+Girlfriends+NEW+2015+WEB-DL+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SudoSu","files":4,"time":1451346359,"description":"\nhttp://youpornbook.com\r\n\r\n.......................\r\nScreenshots : \nhttp://imgpremium.com/album/e4\r\n\r\nYear: 2015\r\nCountry: USA\r\nGenre: All Girl / Lesbian, All Sex\r\nDuration: 1:27:52\r\nEnglish language\r\nDirector: Guy Ranieri Sblattero\r\nStudio: Viv Thomas - Girlfriends Films\r\n\r\nAmirah Adara, Tiffany Doll, Diana Dolce, Tiffany Teen, Alina Henessy, Ariel Temple, Jemma Valentine, Felicia Kiss\r\n\r\nEight beautiful girls explore games of control and pleasure in &quot;Power Play,&quot; from director Guy Ranieri Sblattero. Episode one, &quot;Spank Me,&quot; sees naughty Amirah Adara deliberately distracting Felicia Kiss from her work. Felicia grabs her roughly, bends her over the desk and spanks her bottom hard. Anilingus and a vigorous fingering in both hot holes simultaneously gives Amirah an intense orgasm, and she replays the favor by licking Felicia's pussy and ass voraciously. In episode two, &quot;Dominate Me,&quot; Tina Walker is commanded to obey Katerina Muti's orders. She dresses her naked mistress in sexy lingerie, than masturbates for her. When Katerina can no longer resist, she finger-bangs Tina energetically. As Katerina strokes her own wet pussy, Tina slides a finger into her ass and pushes her over the edge. Jemma Valentine is an exhibitionist, and in episode three, &quot;Watch Me,&quot; she poses suggestively while sweet Diana Dolce films her. Visibly aroused by Jemma's sexy show, Diana is soon naked on the bed in doggy position as Jemma licks and fingers her pussy and ass. After Diana gives Jenna an assgasm, she straddles her face, her nipples stiff as Jemma jams her tongue deep. In the final episode, &quot;Restrain Me,&quot; Tiffany Doll confesses to a lesbian encounter as Henessy binds her wrists and blindfolds her. She kneels to eat Tiffany's pussy, making her shake and gasp with overwhelming pleasure, then sits on her face to get her pussy and ass thoroughly licked and fingered. After her climax, she goes down to suck Tiffany's pussy and finger-fuck her ass until she has a mind-blowing orgasm. With domination, submission, teasing and intense oral gratification, the girls of &quot;Power Play&quot; seek out a world of sublime erotic indulgence. Care to join them?\r\n\r\nVideo Quality: WEB-DL\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 704x396 ~ 1025kbps 25fps\r\nAudio: AC 44100Hz 2ch 192kbps","torrent":{"xt":"urn:btih:e4c456a246c3fbc0c4e5956f601d096466a141e1","amp;dn":"Power+Play+Viv+Thomas+Girlfriends+NEW+2015+WEB-DL+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4c456a246c3fbc0c4e5956f601d096466a141e1","infoHashBuffer":{"type":"Buffer","data":[228,196,86,162,70,195,251,192,196,229,149,111,96,29,9,100,102,161,65,225]},"announce":[],"urlList":[]}}