{"title":"Keay, John - Midnight's Descendants_South Asia from Partition to","uid":9813676,"size":6429443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4f37d209615f95ddf38f68a1d6c098ca3cf0ef8&amp;dn=Keay%2C+John+-+Midnight%27s+Descendants_South+Asia+from+Partition+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Papushi","files":-1,"time":1395585348,"description":"An epic narrative history that compares and contrasts the fortunes of all the countries that make up South Asia. If British India had not been partitioned in 1947, its population would today be the world's largest. At c1.5 billion, Midnight's Descendants (the offspring of those affected by 'the midnight hour' Partition) already outnumber Europeans and Chinese; and they are growing faster than either. They comprise all the peoples of what is now called 'South Asia' (the preferred term for the partitioned subcontinent of modern India, Pakistan and Bangladesh, plus Nepal and Sri Lanka). 'Midnight's Descendants' is the first history of the region as a whole. Correlating and contrasting the fortunes of all the constituent nations over the last six decades affords unique insights into what is hailed as one of the world's most dynamic regions. John Keay is an expert on the region and the book will be the first account to incorporate the rich story of South Asia's transnational, or 'diasporic', peoples - from the overlooked narratives of the subcontinent to the rise of India as a global force, 'Midnight's Descendants' will be expansive and tumultuous in the great tradition of India's narrative epics.","torrent":{"xt":"urn:btih:e4f37d209615f95ddf38f68a1d6c098ca3cf0ef8","amp;dn":"Keay%2C+John+-+Midnight%27s+Descendants_South+Asia+from+Partition+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f37d209615f95ddf38f68a1d6c098ca3cf0ef8","infoHashBuffer":{"type":"Buffer","data":[228,243,125,32,150,21,249,93,223,56,246,138,29,108,9,140,163,207,14,248]},"announce":[],"urlList":[]}}