{"title":"Innocent Blood - P.D. James  (Unabridged)","uid":11701407,"size":244786104,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e5694961e22429cc7fecd475639aba4a45c61b24&amp;dn=Innocent+Blood+-+P.D.+James++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"davieboy1966","files":12,"time":1423931856,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\nUnabridged and read by Michael Jayston. 11 hours 18 mins duration. 10 CD's. (48 kbps / 44 kHz Mono Fraunhofer CBR MP3).\n\n\n\nPD James produces superbly written, intricately detailed and meticulously crafted detective stories. Innocent Blood, however, is a departure from her usual whodunits as neither Chief Superintendent Adam Dalgliesh nor the young private detective Cordelia Gray is featured, and there is no crime to detect. Of the two murders that permeate the story, one happened ten years ago; the murderers were brought to justice and the crime itself, once front-page news, is now nearly forgotten. The other murder is yet to happen, and we watch it being planned.\n\nThe book is set in 1978 (it was written in 1980) and takes as its starting point the Children's Act of 1975, by which adopted adults had, for the first time in Britain, the right of access to their original birth certificates, and thereby the means of tracing their natural parents. Philippa Palfrey is intellectual, privileged and gifted, and was adopted at the age of eight into an affluent but emotionally stunted family. Apart from a few flashes of memory, she has no recollection of her life before the adoption; all that she knows of her background is what her adoptive parents have told her and the cosy fantasies she has constructed for herself...it is a tribute to James' powerful writing that, even when you know it's coming, the moment that Philippa quite casually learns the truth is still shocking...\n\nPhilippa is not an appealing heroine but her arrogance hides her insecurity and desperate need to belong. Her emotional awakening and eventual self-realisation is one of the key themes of the book. But it's also a study of deceit: lies told for good or selfish reasons, how they alter the course of a life, and the way we blindly and wilfully collude in our own deception. It's an emotionally harrowing book, but utterly absorbing. James' descriptions of people, even of minor characters, are vivid; her locations, the different 'villages' of London in particular, are so accurately detailed that I had to check my A to Z to be certain that the roads in which her characters live are fictional; I first read this book in one sitting; I found it impossible to put down. It's a tour de force by an intelligent and accomplished writer who is also deeply compassionate, and the book ends with the promise that one of those who had been as dead has at last discovered the way back to life. If you only read one PD James book, read this one. Better still, read them all. (Clare Redfern)\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e5694961e22429cc7fecd475639aba4a45c61b24","amp;dn":"Innocent+Blood+-+P.D.+James++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5694961e22429cc7fecd475639aba4a45c61b24","infoHashBuffer":{"type":"Buffer","data":[229,105,73,97,226,36,41,204,127,236,212,117,99,154,186,74,69,198,27,36]},"announce":[],"urlList":[]}}