{"title":"The Cordelia Gray Mysteries - P.D. James  (Unabridged)","uid":11701408,"size":445630622,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e638f1c9e83957470ff34ab80c4ed7af27a5578d&amp;dn=The+Cordelia+Gray+Mysteries+-+P.D.+James++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"davieboy1966","files":21,"time":1423931958,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\nBoth are unabridged OD CD's at 48 kbps / 44 kHz Mono CBR, Fraunhofer MP3.\n\n\n\n#1. An Unsuitable Job for a Woman (1972) read by Tammy Ustinov. 7 hours 22 mins duration.\nCordelia Gray, is a contemporary detective, liberated and independent. An attractive young woman in her early twenties, she has inherited a detective agency from her partner Bernie Pryde, and she intends to keep it running, make it profitable, and create a career for herself. Polite and at ease in elegant circumstances, Cordelia is also willing to take chances and do all the dirty work--and carry a gun. On her first case following the death of Bernie Pryde, Cordelia is hired by famed environmentalist Sir Ronald Callender of Garforth House, to find out why his son Mark has hanged himself. Sir Ronald has had little interest in or affection for his son during his lifetime but now seems determined to understand the reasons for his son's shocking suicide. Cordelia soon learns that just prior to his death, Mark dropped out of college and found work as a gardener, severing relations with his father from whom he declared he would accept no money or support. Further investigation leads Cordelia to believe that Mark was murdered...\n\n#2. The Skull Beneath the Skin (1982) read by Jane Asher. 13 hours 13 mins duration.\nThis is the second and last mystery featuring Cordelia Gray who featured in &quot;An Unsuitable Job for a Woman&quot; . Since then Cordelia has carved out a living running the detective agency that her ex-partner Bernie established, which agency now specializes in recovering lost pets thanks to the help of two part-time employees from Cordelia's old typing agency. Cordelia's still having a hard time making a go of the agency. She's putting up a new plaque (that's hung crookedly) when her prospective client arrives, the husband of the fading actress Clarissa Lisle. Clarissa had observed Cordelia concluding one of her pet detective forays and saw something undefined that she liked. As a result, Clarissa has sent her husband to hire Cordelia to protect Clarissa from receiving any more death threats while Clarissa tries to resurrect her career with an amateur production of &quot;The Duchess of Malfi&quot; on secluded Courcy Island....\n\n(The author wrote just the two titles in this series.)\n\nThe author passed away at the age of 94 in November 2014 : http://www.bbc.com/news/entertainment-arts-30232569\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e638f1c9e83957470ff34ab80c4ed7af27a5578d","amp;dn":"The+Cordelia+Gray+Mysteries+-+P.D.+James++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e638f1c9e83957470ff34ab80c4ed7af27a5578d","infoHashBuffer":{"type":"Buffer","data":[230,56,241,201,232,57,87,71,15,243,74,184,12,78,215,175,39,165,87,141]},"announce":[],"urlList":[]}}