{"title":"The Rolling Stones - Steel Wheels (1989) WMA320","uid":6320785,"size":137266487,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e6b18e45a48b6dc691e7acf6649ca75f9d3cee6d&amp;dn=The+Rolling+Stones+-+Steel+Wheels+%281989%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302936237,"description":"It's almost as if Mick Jagger and Keith Richards sat down and wrote the songs for this album thinking &quot;what is it that people want from a Stones album?&quot;. \nThey apparently decided that people want both the rockers, the ballads, and perhaps a bit of modest experimentalism (&quot;Continental Drift&quot;), and that's what &quot;Steel Wheels&quot; provides. \n\nIt opens with two tough rockers, &quot;Sad, Sad, Sad&quot; and &quot;Mixed Emotions&quot;, followed by the somewhat less remarkable &quot;Terrifying&quot; and &quot;Hold On To Your Hat&quot;, and the nice, bluesy &quot;Hearts For Sale&quot;. \n&quot;Blinded By Love&quot; is a lovely melody, a folkish, acoustic ballad with Phil Beer (who worked with the Fairport Convention, Mike Oldfield and the Albion Band among others) playing mandolin. \nThen comes one of the six (!) singles that were lifted off &quot;Steel Wheels&quot;, the ever-so-slightly disco-influenced &quot;Rock And A Hard Place&quot;. \n\nKeith Richards supplies the groovy, muscular rocker &quot;Can't Be Seen&quot;, which sounds like something off one of his solo albums, and the fine, soulful ballad &quot;Almost Hear You Sigh&quot; is actually a Keith Richards-number as well, although Mick Jagger sings it. Richards is playing a classical Velasquez guitar, and suddenly breaks into a magnificent, if too short, classical guitar solo. \nAnd finally, after the very African-sounding &quot;Continental Drift&quot; and the so-so &quot;Break The Spell&quot;, another ballad, this time with the lead vocal done by Keith Richards himself: &quot;Slipping Away&quot; is one of the best songs Richards has penned, lyrically and musically, and one of the best vocal tracks he and his whiskey-soaked pipes have laid down as well. \n\n&quot;Steel Wheels&quot; feels a lot like Keith Richards' album, probably in part because Richards already had some more or less finished material to work with, and his influence means that &quot;Steel Wheels&quot; rocks with a lot more sincerity than the two or three records that preceded it. \nIt has a few lesser tracks, but nothing is terrible, and there is a lot of good stuff here as well - dense, powerful rock n' roll from the only band who can seriously lay claim to the title &quot;the World's greatest rock band&quot;.\n\nby Docendo Discimus\n\nTRACKLIST:\n\n01 - Sad Sad Sad.wma                                                  \n02 - Mixed Emotions.wma                                               \n03 - Terrifying.wma                                                   \n04 - Hold On To Your Hat.wma                                          \n05 - Hearts For Sale.wma                                              \n06 - Blinded By Love.wma                                              \n07 - Rock And A Hard Place.wma                                        \n08 - Can't Be Seen.wma                                                \n09 - Almost Hear You Sigh.wma                                         \n10 - Continental Drift.wma                                            \n11 - Break The Spell.wma                                              \n12 - Slipping Away.wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:e6b18e45a48b6dc691e7acf6649ca75f9d3cee6d","amp;dn":"The+Rolling+Stones+-+Steel+Wheels+%281989%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6b18e45a48b6dc691e7acf6649ca75f9d3cee6d","infoHashBuffer":{"type":"Buffer","data":[230,177,142,69,164,139,109,198,145,231,172,246,100,156,167,95,157,60,238,109]},"announce":[],"urlList":[]}}