{"title":"Poison The Well - I,III , II,III , III,III (2009) [FLAC]","uid":8197790,"size":182688492,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e726b1916722ee0ce902c38d4dd3753b3f7d82d6&amp;dn=Poison+The+Well+-+I%2CIII+%2C+II%2CIII+%2C+III%2CIII+%282009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"piratebuddha","files":-1,"time":1361952092,"description":"I/III / II/III / III/III (pronounced as One of Three, Two of Three, Three of Three) is a limited edition set of three 7&quot; vinyl records by post-hardcore band Poison the Well. The collection features three EPs released both physically and digitally that contain songs written and recorded for the band's fourth studio album, but were never released. The three EPs were released throughout the recording process of Poison the Well's following studio album, The Tropic Rot, which was released on July 7, 2009.\n\nDuring the recording sessions for Poison the Well's fourth studio album, Versions, the band recorded more than enough songs than were necessary for one full album. After the release of Versions, Poison the Well had considered releasing the extra songs in a special way, however nothing had materialized until late 2008 when the band came up with the idea of a limited edition pressing on vinyl. The EPs in the series were released over the recording period of their fifth studio album, later to be known as The Tropic Rot. All songs from I/III / II/III / III/III were also made available as bonus tracks on digital retail versions of The Tropic Rot.\n\nEach release in the series contains two tracks, and could be obtained both physically in the form of a 7&quot; vinyl record or digitally from online digital retail stores. Physical copies could only be purchased at concerts or from online webstores for mail order. Physical copies are limited, although exact quantities are unknown. \n\nIn a limited run of 2,000 copies, all three EPs were also released on one CD containing all six songs. This CD was released as a Record Store Day exclusive, and could only be obtained at a participating independent record stores across the United States.\n\nTrack listings:\n\n1. &quot;New Fast&quot; \n2. &quot;Purple Sabbath&quot; \n3. &quot;Shuffle&quot; \n4. &quot;Bowie&quot; \n5. &quot;A#No.1&quot; \n6. &quot;Run Desire Gone Clean&quot;\n\n==================================================================================\n\nThousands of candles can be lit from a single candle, and the life of the candle will not be shortened. Happiness never decreases by being shared. ~Siddhartha\n\n#KeepSeeding!\t\n\t\t","torrent":{"xt":"urn:btih:e726b1916722ee0ce902c38d4dd3753b3f7d82d6","amp;dn":"Poison+The+Well+-+I%2CIII+%2C+II%2CIII+%2C+III%2CIII+%282009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e726b1916722ee0ce902c38d4dd3753b3f7d82d6","infoHashBuffer":{"type":"Buffer","data":[231,38,177,145,103,34,238,12,233,2,195,141,77,211,117,59,63,125,130,214]},"announce":[],"urlList":[]}}