{"title":"Liah Greenfeld - The Spirit of Capitalism. Nationalism and Econo","uid":10440081,"size":2223214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e73f21ee68a1103a0146cca6db5aec021b38a59e&amp;dn=Liah+Greenfeld+-+The+Spirit+of+Capitalism.+Nationalism+and+Econo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1403877827,"description":"Description\nProduct Details\nBook Title: The Spirit of Capitalism: Nationalism and Economic Growth\t\nBook Author: Liah Greenfeld (Author)\nPaperback: 560 pages\nPublisher: Harvard University Press (October 1, 2003)\nLanguage: English\nISBN-10: 0674012399\nISBN-13: 978-0674012394\n\n===================================================================================\nBook Description\nRelease date: October 1, 2003 | ISBN-10: 0674012399 | ISBN-13: 978-0674012394\nThe Spirit of Capitalism answers a fundamental question of economics, a question neither economists nor economic historians have been able to answer: what are the reasons (rather than just the conditions) for sustained economic growth? Taking her title from Max Weber's famous study on the same subject, Liah Greenfeld focuses on the problem of motivation behind the epochal change in behavior, which from the sixteenth century on has reoriented one economy after another from subsistence to profit, transforming the nature of economic activity. A detailed analysis of the development of economic consciousness in England, the Netherlands, France, Germany, Japan, and the United States allows her to argue that the motivation, or &quot;spirit,&quot; behind the modern, growth-oriented economy was not the liberation of the &quot;rational economic actor,&quot; but rather nationalism. Nationalism committed masses of people to an endless race for national prestige and thus brought into being the phenomenon of economic competitiveness.\n\nNowhere has economic activity been further removed from the rational calculation of costs than in the United States, where the economy has come to be perceived as the end-all of political life and the determinant of all social progress. American &quot;economic civilization&quot; spurs the nation on to ever-greater economic achievement. But it turns Americans into workaholics, unsure of the purpose of their pursuits, and leads American statesmen to exaggerate the weight of economic concerns in foreign policy, often to the detriment of American political influence and the confusion of the rest of the world.\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nBeginning in 15th-century northern Europe, unprecedented economic growth spread throughout the world, bringing with it nationalism, technological progress and rationalism in government, religion and justice, as well as eradication of traditional cultures, environmental damage, imperialism and wars of unparalleled destructiveness. Ever since, people have sought to explain these circumstances. Greenfeld (Nationalism: Five Roads to Modernity) joins them here: her thesis is that unrelated historical accidents engendered nationalism in England, France, Germany, Japan and the United States (and almost in Holland), and that competitive nationalism caused sustained economic growth. To defend her proposal, she eschews both the historian's careful study of primary sources and the economist's insistence on rigorously testable models, claiming that both of these paths have led to error. Instead, she relies upon extended excerpts from secondary sources. Since her examples (the five modernizations and one failed modernization) are unrelated, the book consists of straightforward descriptions of each one rather than abstraction or parallels. This method produces a reader in early modernization with just enough theory to segue between the chapters. The obvious use for this book is for a freshman sociology course on the origins of the modern economy; those looking for groundbreaking analysis will be disappointed. Greenfeld's criticism of all aspects of the modern world, from diet to work habits to culture, will engage only readers who are already disgruntled.\n\nFrom Library Journal\nGreenfeld (political science, Boston Univ.) offers a riveting follow-up to Nationalism: Five Roads to Modernity (Harvard Univ., 1992). Here she seeks to answer three questions: what caused the emergence of the modern economy, what made the economic sphere so dominant; and what are the reasons for sustained economic growth? Her fundamental proposition is that nationalism is responsible for the reorientation of economic activity toward growth. She strengthens her argument by focusing on the periods of emergence of the modern economy in England, France, Germany, Japan, and the United States. In addition, she adeptly addresses the concerns of critics of her previous work by including an in-depth look at Japanese nationalism and the roles that economics and diplomacy have played in fostering nationalism in her five primary subjects plus the Netherlands and Russia. Although her approach is unorthodox, the quality of her research and the richness of her arguments should be challenging to the various economists, historians, philosophers, and other social scientists who often need to be stimulated by the writing of those outside their disciplines. Highly recommended for both academic and public libraries. Norm Hutcherson, California State Univ., Bakersfield\n\n===================================================================================\nReviews\nLiah Greenfeld is unashamedly a bold sociological thinker, in search of the big questions and the big answers. The big question here is to explain our modern &quot;economic civilization&quot;--the transformation of our life worldwide. Most writiers have dealt with the &quot;how&quot;--the conditions of its emergence, take-off, and sustained growth. Greenfeld attempts the &quot;why.&quot; Though called &quot;the spirit of capitalism,&quot; in deference to Max Weber, she goes beyond Weber in arguing that nationalism, as a form of collective consciousness, is the cause of this great historical change, a bold and long foray. Those who feel that the social sciences should confront the big questions should not ignore this book. (Daniel Bell, Harvard University)\n\nThe Spirit of Capitalism offers an important thesis which it defends with rigor and passion. It links nationalism to the market society in complex ways. Liah Greenfeld's challenging, historically buttressed argument is bound to attract a wide and attentive audience. (Suzanne Keller, Princeton University)\n\nGreenfeld offers a riveting follow-up to Nationalism: Five Roads to Modernity. Here she seeks to answer three questions: what caused the emergence of the modern economy, what made the economic sphere so dominant; and what are the reasons for sustained economic growth? Her fundamental proposition is that nationalism is responsible for the reorientation of economic activity toward growth. She strengthens her argument by focusing on the periods of emergence of the modern economy in England, France, Germany, Japan, and the United States. In addition, she adeptly addresses the concerns of critics of her previous work by including an in-depth look at Japanese nationalism and the roles that economics and diplomacy have played in fostering nationalism in her five primary subjects plus the Netherlands and Russia. Although her approach is unorthodox, the quality of her research and the richness of her arguments should be challenging to the various economists, historians, philosophers, and other social scientists who often need to be stimulated by the writing of those outside their disciplines. Highly recommended for both academic and public libraries. (Norm Hutcherson Library Journal 2001-10-15)\n\n[An] important new book...Liah Greenfeld argues that patriotism, or nationalism, may have a lot more to do with economic motivation than you think. Most of us have come to accept the economist's view of humanity: On the whole, we are rational actors; we are naturally acquisitive; when political or social barriers are removed, most of us will go off on a determined quest to make money and achieve ever greater success. [Greenfeld] notes that [the] desire to make more and more money is a recent and localized phenomenon. For most people at most times and in most places, economic growth was not a central or even an important goal. (David Brooks Wall Street Journal 2002-01-24)\n\nThe Spirit of Capitalism is an immensely refreshing book...[It] deserves to bring about a paradigm shift in the understanding of economic growth. (John Gray Times Literary Supplement 2002-06-07)\n\nThis is a learned if irreverent and enjoyable book that is rooted in close study of several nations, and Greenfeld's command of diverse historical sources is impressive...Greenfeld certainly presents a scholarly and eloquent case for its importance. Her chirpy and cheeky style is also refreshing in areas dominated by somewhat arid economic historians. (Frank Webster Times Higher Education Supplement 2002-10-18)\n\n===================================================================================\nAbout the Author\nLiah Greenfeld is University Professor and Professor of Political Science, Sociology, and Anthropology at Boston University.\n===================================================================================","torrent":{"xt":"urn:btih:e73f21ee68a1103a0146cca6db5aec021b38a59e","amp;dn":"Liah+Greenfeld+-+The+Spirit+of+Capitalism.+Nationalism+and+Econo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73f21ee68a1103a0146cca6db5aec021b38a59e","infoHashBuffer":{"type":"Buffer","data":[231,63,33,238,104,161,16,58,1,70,204,166,219,90,236,2,27,56,165,158]},"announce":[],"urlList":[]}}