{"title":"Building Construction Illustrated 4th Edition{BBS}","uid":6630574,"size":42851478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7563e37a5f7a70772c0f24194bc84ad66064be6&amp;dn=Building+Construction+Illustrated+4th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1314320685,"description":"The classic visual guide to the basics of building construction, now with the most current information\n\nFor nearly three decades, Building Construction Illustrated has offered an outstanding introduction to the principles of building construction. This new edition of the revered classic remains as relevant as ever-providing the latest information in Francis D.K. Ching's signature style. Its rich and comprehensive approach clearly presents all of the basic concepts underlying building construction and equips readers with useful guidelines for approaching virtually any new materials or techniques they may encounter.\n\nLaying out the material and structural choices available, it provides a full under-standing of how these choices affect a building's form and dimensions. Complete with more than 1,000 illustrations, the book moves through each of the key stages of the design process, from site selection to building components, mechanical systems, and finishes.\n\n    * Illustrated throughout with clear and accurate drawings that present the state of the art in construction processes and materials\n    * Updated and revised to include the latest knowledge on sustainability, incorporation of building systems, and use of new materials\n    * Archetypal drawings offer clear inspiration for designers and drafters\n    * Reflects the most current building codes and CSI Master Format numbering scheme\n\nWith its comprehensive and lucid presentation of everything from foundations and floor systems to finish work, Building Construction Illustrated, Fourth Edition equips students and professionals in all areas of architecture and construction with useful guidelines for approaching virtually any new materials or techniques they may encounter in building planning, design, and construction.\n\n\n    * Paperback: 480 pages\n    * Publisher: Wiley; 4 edition (March 3, 2008)\n    * Language: English\n    * ISBN-10: 0470087811\n    * ISBN-13: 978-0470087817","torrent":{"xt":"urn:btih:e7563e37a5f7a70772c0f24194bc84ad66064be6","amp;dn":"Building+Construction+Illustrated+4th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7563e37a5f7a70772c0f24194bc84ad66064be6","infoHashBuffer":{"type":"Buffer","data":[231,86,62,55,165,247,167,7,114,192,242,65,148,188,132,173,102,6,75,230]},"announce":[],"urlList":[]}}