{"title":"Humble Pie - Rockin The Filmore","uid":3303830,"size":77338359,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7709bb2dc72434a727e461e88d8d571aa4da1b0&amp;dn=Humble+Pie+-+Rockin+The+Filmore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tadjad48bl","files":9,"time":1111264543,"description":"Well PIE fans leave the best to last and i have to prove rock fans out there FRAMPTON COMES ALIVE is a joke well listen to what the man was doing in his nappies (dipas) this is the ultimate live testament how a band should play listen to MARROITT ad lib to ROLLING STONE and see if you are amused rock fans you know this is the score. and to fans out there who download good music and cant reconise the file format it is wav ok so there macromedia flash or whatever does not reconize the file you ol faithfull media player will please can i have some positiveness out there not like that leecher on the small faces album otherwise i will cease to be. there is more marriott i can upload but silly coments like that one is not made me happy. love to all the fans of stevie or anyother like people associated with the pie. If you missed the last albums i will upload them as flac next. i am sorry if i couldnt seed ppl better but that is all down to the torrent servers and my own isp. my aim is to keep people happy. ENJOY!!!\n\n","torrent":{"xt":"urn:btih:e7709bb2dc72434a727e461e88d8d571aa4da1b0","amp;dn":"Humble+Pie+-+Rockin+The+Filmore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7709bb2dc72434a727e461e88d8d571aa4da1b0","infoHashBuffer":{"type":"Buffer","data":[231,112,155,178,220,114,67,74,114,126,70,30,136,216,213,113,170,77,161,176]},"announce":[],"urlList":[]}}