{"title":"DC - The New Frontier","uid":4554140,"size":182772102,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e7d9a93c14e99243967dc5738608b1b57850f766&amp;dn=DC+-+The+New+Frontier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shipjolly","files":6,"time":1228417176,"description":"DC: The New Frontier is an Eisner, Harvey, and Shuster Award-winning six-issue comic book limited series written and drawn by Darwyn Cooke and published by DC Comics from 2003 to 2004, collected in two paperback volumes in 2004 and 2005 and an Absolute Edition in 2006. The story has been adapted as an animated movie titled Justice League: The New Frontier, released on February 26, 2008.\n\nThe series is reminiscent of works such as Kingdom Come and The Golden Age. Similar to The Golden Age, New Frontier takes place primarily in the 1950s, and depicts the Golden Age superheroes Superman, Batman, and Wonder Woman meeting the The Flash, Green Lantern, and Martian Manhunter. The story bridges the gap from the end of the Golden Age to the beginning of the Silver Age of comic books in the DC Universe.\n\n\nPLOT:\nWorld War II is over. The Cold War has begun. The Age of the Superhero is in decline. But where are the heroes of tomorrow? From the perspective of those brave individuals who made it happen: encounter Superman, Wonder Woman and Batman, who survived the anti-hero sentiment of the Cold War, as well as eager newcomers like test pilot Hal Jordan and scientists Barry Allen and Ray Palmer, poised to become the next generation of crime fighters. All leading to the mounting threat of an alien presence on Earth, where dozens of characters from the &amp;#039;40s, &amp;#039;50s and &amp;#039;60s eras of DC Comics team up to defeat it.\n\n\n\nReleased on http://ComicPirates.info\t","torrent":{"xt":"urn:btih:e7d9a93c14e99243967dc5738608b1b57850f766","amp;dn":"DC+-+The+New+Frontier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7d9a93c14e99243967dc5738608b1b57850f766","infoHashBuffer":{"type":"Buffer","data":[231,217,169,60,20,233,146,67,150,125,197,115,134,8,177,181,120,80,247,102]},"announce":[],"urlList":[]}}