{"title":"Ray Brown - 1998 - Some of My Best Friends are... Singers FLAC","uid":8618655,"size":347881893,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8e24c2f20b32dae5de1a027b7f7218305e3c9cd&amp;dn=Ray+Brown+-+1998+-+Some+of+My+Best+Friends+are...+Singers+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"eika256","files":-1,"time":1372315077,"description":"Ray Brown - 1998 - Some of My Best Friends are... Singers\n\nWhat does a bass player do when he's recording an album as a leader? Surely not an hour's worth of bass solos! Ray Brown solved the bass player's dilemma with a series of recordings under the Some of My Best Friends Are... heading. This 1998 release is the third in the series, following the earlier Some of My Best Friends Are...Piano Players and Some of My Best Friends Are...Sax Players, and it's a gem. Featuring a sextet of fine vocalists, ranging from the well-established to the unknown, this CD is a class act from beginning to end. The rising jazz vocal superstar of the late '90s, Diana Krall, is showcased to great effect on &quot;I Thought About You&quot; and &quot;Little Boy.&quot; Well-established female vocal veterans Etta Jones, Dee Dee Bridgewater, and Marlena Shaw deliver superb performances, soulfully giving master lessons in the art of singing. The lone male singer spotlighted here, Kevin Mahogany, wraps his smooth baritone around the ballad &quot;Skylark,&quot; and swings gently on &quot;The Party's Over.&quot;\nThe one unknown in this collection is Oregonian Nancy King. This veteran of the San Francisco and Pacific Northwest scenes shows she has a fine way with a ballad on &quot;But Beautiful,&quot; and scats her way across the upbeat Brown original &quot;The Perfect Blues,&quot; that closes this set. Both of these songs also feature Antonio Hart's alto saxophone. In addition to Brown's trio mates Geoff Keezer and Gregory Hutchinson, musical support includes guitarist Russell Malone on two tracks and tenor saxman Ralph Moore cooking alongside Bridgewater on &quot;Cherokee.&quot; (AllMusic)\n\nTrack list:\n01 - I Thought About You (with Diana Krall)\n02 - Poor Butterfly (with Etta Jones)\n03 - More Than You Know (with Dee Dee Bridgewater)\n04 - Little Boy (with Diana Krall)\n05 - But Beautiful (with Nancy King)\n06 - At Long Last Love (with Marlena Shaw)\n07 - Skylark (with Kevin Mahogany)\n08 - Cherokee (with Dee Dee Bridgewater)\n09 - (There Is) No Greater Love (with Etta Jones)\n10 - Imagination (with Marlene Shaw)\n11 - The Party's Over (with Kevin Mahogany)\n12 - The Perfect Blues (with Nancy King)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:e8e24c2f20b32dae5de1a027b7f7218305e3c9cd","amp;dn":"Ray+Brown+-+1998+-+Some+of+My+Best+Friends+are...+Singers+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8e24c2f20b32dae5de1a027b7f7218305e3c9cd","infoHashBuffer":{"type":"Buffer","data":[232,226,76,47,32,179,45,174,93,225,160,39,183,247,33,131,5,227,201,205]},"announce":[],"urlList":[]}}