{"title":"Percy Faith - Music From Hollywood  1954","uid":4181167,"size":73663297,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e911549cc8e66b737c629873c160ac4aa0221497&amp;dn=Percy+Faith+-+Music+From+Hollywood++1954&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mingy2","files":9,"time":1210416719,"description":"\n\nPercy Faith (April 7, 1908 ? February 9, 1976) Canadian-born band-leader, orchestrator and composer, known for his lush arrangements of pop standards. He is often credited with creating the &quot;easy listening&quot; or &quot;mood music&quot; format which became staples of American popular music in the 1950s and continued well into the 1960s. Though his professional orchestra-leading career began at the height of the swing era, Faith refined and rethought orchestration techniques, including use of large string sections, to soften and fill out the brass dominated popular music of the 1940s.\n\nFaith was born and raised in Toronto, Ontario, Canada. He played violin and piano as a child, and played in theatres and at Massey Hall. After his hands were badly burned in a fire, he turned to conducting, and his live orchestras utilized the new medium of radio broadcasting. Beginning with defunct stations CKNC and CKCL, Faith was a staple of the Canadian Broadcasting Corporation&amp;#039;s live-music broadcasting from 1933 to 1940, when he resettled in Chicago. In 1945, he became a naturalized citizen of the United States. He made many recordings for Voice of America. After working briefly for Decca Records, he worked for Mitch Miller at Columbia Records, where he turned out dozens of albums and provided arrangements for many of the pop singers of the 1950s, including Tony Bennett, Doris Day and Guy Mitchell (for whom Faith wrote Mitchell&amp;#039;s number one single, &quot;My Heart Cries for You&quot;).\n\nHis most famous and remembered recordings are &quot;Delicado&quot; (1952), &quot;Song from the Moulin Rouge&quot; (1953) and &quot;Theme from A Summer Place&quot; (1960), which won the Grammy Award for Record of the Year in 1961. Faith remains the only artist to have the best selling single of the year during both the pop singer era (&quot;Song from Moulin Rouge&quot;) and the rock era (&quot;Theme from a Summer Place&quot;).\n\nThough Faith initially mined the worlds of Broadway, Hollywood and Latin music for many of his top-selling 1950s recordings, he enjoyed immense popularity starting in 1962 with his orchestral versions of popular rock and pop hits of the day. His &quot;Themes for Young Lovers&quot; album was a top seller during this era and introduced the Faith sound to a younger generation of listeners. With the success of Columbia record-mate Ray Conniff&amp;#039;s chorus and orchestra during this same time, Faith began using a chorus (usually all female in the early recordings, later mixed) in several popular albums from the mid-1960s on. Faith&amp;#039;s first single with a female chorus, &quot;Yellow Days,&quot; was a substantial hit in the MOR (Middle of the Road) easy listening radio format of the mid-1960s. Faith continued to enjoy airplay and consistent album sales throughout the early 1970s, and received a second Grammy award in 1969 for his album &quot;Love Theme from &amp;#039;Romeo and Juliet&amp;#039;.&quot;\n\nWith the advent of harder rock sounds in the 1970s, Faith&amp;#039;s elegant arrangements fell out of favor with the listening and record-buying public, although he continued to release albums as diverse and contemporary as &quot;Jesus Christ Superstar&quot; and &quot;Black Magic Woman.&quot; He released one album of country music and two albums of disco-oriented arrangements toward the end of his near 40 year career.\n\nThough best-known for his recording career, Faith also occasionally scored motion pictures, and received an Academy Award nomination for his adaptation of the song score for the Doris Day musical feature, &quot;Love Me or Leave Me.&quot; Several of his other original scores for dramatic features such as &quot;Tammy Tell Me True&quot; and &quot;The Oscar&quot; contained popular theme songs.\n\nPercy Faith died of cancer in Encino, California and was interred in the Hillside Memorial Park Cemetery in Culver City, California.\n\n\n\n\n\n01 - The Song From &quot;Moulin Rouge&quot; (Where Is Your Heart?)\n02 - Genevieve\n03 - Theme From &quot;The Bad And The Beautiful&quot; (Love Is For The Very Young)\n04 - Caribbean Night (Noche Caribe)\n05 - Return To Paradise\n06 - Invitation\n07 - Ruby\n08 - The Loveliest Night Of The Year","torrent":{"xt":"urn:btih:e911549cc8e66b737c629873c160ac4aa0221497","amp;dn":"Percy+Faith+-+Music+From+Hollywood++1954","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e911549cc8e66b737c629873c160ac4aa0221497","infoHashBuffer":{"type":"Buffer","data":[233,17,84,156,200,230,107,115,124,98,152,115,193,96,172,74,160,34,20,151]},"announce":[],"urlList":[]}}