{"title":"Principles and Practice of Psychiatric Nursing, 10E [PDF]","uid":9449390,"size":61688488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e933fd9b856103a2b705a4d955079917c2333cd4&amp;dn=Principles+and+Practice+of+Psychiatric+Nursing%2C+10E+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"F1restorm","files":-1,"time":1389146637,"description":"Principles and Practice of Psychiatric Nursing, 10E \nAuthor: Gail Wiscarz Stuart PhD RN FAAN \nPublished: 2012\nPublisher: Mosby\nISBN: 9780323091145\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nNOTE: access to the companion website (link in book) requires registration\n\nTested on the above readers with no problems on laptop and Android tablet. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_____________________________________________________________________________________\n\n\nUsing the latest clinical research and diagnoses, Principles and Practice of Psychiatric Nursing, 10th Edition provides a holistic, biopsychosocial approach to psychiatric nursing care. It follows the popular Stuart stress-adaptation framework and includes comprehensive coverage to simplify important nursing and medical concepts, promote quality and safety in care, and address psychobiology and psychopharmacology topics integral to today's psychiatry. New to this edition is a chapter on psychiatric care of military personnel, plus the latest on health care reform, prescription abuse, and obesity issues. Written by psychiatric nursing expert Gail W. Stuart, this market-leading text makes it easy to apply classroom theory to clinical practice.\n\n-An easy-to-follow writing style makes it easy to understand both simple and complex topics.\n-A well-rounded, collaborative approach provides coverage of all major psychiatric disorders from nursing and medical perspectives.\nThe Stuart Stress Adaptation Model of health and wellness provides a consistent nursing-oriented framework, with clear explanations of biological, psychological, sociocultural, environmental, and legal-ethical components.\n-An evidence-based practice approach bridges the gap between clinical research and everyday practice.\n-Learning from a Clinical Case boxes begin disorders chapters with thought-provoking questions and end chapters with answers and feedback.\n-Summarizing the Evidence boxes in the disorders chapters examine the research and findings that support psychiatric nursing care.\n-A family focus and discussions of outpatient care reflect current trends in psychiatric nursing.\n-A Patient Speaks and A Family Speaks boxes present short vignettes with the patient's and family's perspectives of the caregiving process.\n-Competent Caring: A Clinical Exemplar of a Psychiatric Nurse boxes feature the experiences and personal insights of practicing psychiatric nurses.\n-Medical and Nursing Diagnoses boxes and Detailed Diagnoses tables emphasize the interdisciplinary approach to patient care by presenting NANDA diagnoses relevant to specific disorders and describing the essential features of the related DSM-IV-TR diagnoses.\n-Nursing Treatment Plan Summary tables present care plans including patient goals with nursing interventions and rationales.\nPatient Education Plan and Family Education Plan tables include key information that you need to share with the patient and his or her family to facilitate shorter hospital stays and more outpatient care.\n-Therapeutic Dialogue boxes offer examples of nurse-patient interactions.\nClinical examples include selected nursing diagnoses.\n-Focus Points provide a comprehensive, point-by-point review of the important information in each chapter.\n-The Military and Their Families chapter addresses the issues and concerns surrounding the mental health needs of active, veteran, and National Guard personnel.\n-Updated coverage includes the latest on health care reform, prevention and mental health promotion, recovery and self determination, prescription abuse, and obesity issues related to mental health care.\n-Case studies in clinical chapters include scenarios related to chapter content and provide opportunities to develop clinical reasoning skills.\nSummary of Evidence boxes help you understand the latest clinical research and apply it to practice.\n-Clinical Reasoning boxes provide opportunities to make a decision based on a particular clinical situation. \n-Quality &amp; Safety boxes discuss QSEN competencies or other quality and safety issues.\n","torrent":{"xt":"urn:btih:e933fd9b856103a2b705a4d955079917c2333cd4","amp;dn":"Principles+and+Practice+of+Psychiatric+Nursing%2C+10E+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e933fd9b856103a2b705a4d955079917c2333cd4","infoHashBuffer":{"type":"Buffer","data":[233,51,253,155,133,97,3,162,183,5,164,217,85,7,153,23,194,51,60,212]},"announce":[],"urlList":[]}}