{"title":"Pasquale's Angel - Paul J. McAuley.epub","uid":9565352,"size":1165961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e99006af4ac2dd4b3263cca5b5bbe0ca2b19b911&amp;dn=Pasquale%27s+Angel+-+Paul+J.+McAuley.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391501078,"description":"The Renaissance has both blessed and cursed the great Florentine Republic - ushering in a glorious new age of artistic and scientific achievement...while drowning the powerful Mediterranean city/state in polluted rain and the filthy, tainted air that spews from its foundries and manufactories. This is the world Pasquale must diligently explore in search of an angelic vision that will enable him to create his masterpiece - a world far more frightening than he ever imagined. An assassin has struck down an assistant of Florence's most renowned personage, the immortal Raphael, on the eve of a much-anticipated visit by the Medici Pope Leo. Recognizing a golden opportunity to earn a florin or two, Pasquale offers his services as an illustrator to a local broadsheet - accompanying the brilliant, alcoholic investigative reporter Niccolo Machiavegli into the deepest shadows of their gray, steam-driven city. But there are fouler deaths to follow - and grave conspiracies breeding like rats beyond the roar of great engines and the hiss of acetylene street lamps. Intrigues of witchcraft, war, photography and flight are waiting to entrap the world-weary journalist and his unwitting aide. And it is in the high, solitary tower of the enigmatic hermit known as the Great Engineer where Pasquale must seek his destiny - to soar heavenward with the angels...or descend into Hell.","torrent":{"xt":"urn:btih:e99006af4ac2dd4b3263cca5b5bbe0ca2b19b911","amp;dn":"Pasquale%27s+Angel+-+Paul+J.+McAuley.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e99006af4ac2dd4b3263cca5b5bbe0ca2b19b911","infoHashBuffer":{"type":"Buffer","data":[233,144,6,175,74,194,221,75,50,99,204,165,181,187,224,202,43,25,185,17]},"announce":[],"urlList":[]}}