{"title":"Aliens.Vs.Predator.Update.4.to.6-SKIDROW","uid":5724843,"size":15151565,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e9e907b3ab00203d74b856e2f26baf3bf18f549c&amp;dn=Aliens.Vs.Predator.Update.4.to.6-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MAFIAA.","files":6,"time":1280423676,"description":"S  K  i  D  R  O  W\n\n-  T H E  L E A D i N G  F O R C E\n\nproudly presents\nAliens Vs Predator Update 4 to 6\n\nRELEASE DATE : 29-07-2010              PROTECTION : Steam  CEG\nGAME TYPE    : Shooter                DISKS      : CRACKED UPDATE\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n\nOn with the update release information:\n\nAliens Vs Predator Update 4 to 6\n================================\n\nUpdate 6\n========\n\nNew Features:\n\n- Predator Focus Attack now knocks you down between 9-12m\n\n- Alien Focus Attack damage has been returned to it's correct\nvalues\n\n- The chance to spawn on occupied/blocked friendly spawn\npoints and consequentially knock players out of world is\nreduced\n\n- Joining a Dedicated server which is running on non-standard\nports, leaving and then hosting a player match, will now no\nlonger cause any clients who join the hosted match to lose\nconnection upon starting the game\n\nUpdate 5\n========\n\nNew Features:\n\n- Enabled XP gain, leaderboard updates and associated\nachievements and skin unlocks for non-ranked games as well\nas Ranked Matches. Now the differences between ranked and\nunranked games is that in Ranked Matches, skill-based\nmatchmaking, team balancing and other Ranked Match\nassociated rules are enforced and in Player matches they are\nnot. You are now unable to have a game that does not update\nthe leaderboards, or award XP.\n\n- Major overhaul of low-level networking code for\nplayer-hosted (i.e. not Dedicated Server) games in order to\nimprove connection stability and pings.\n\nBug Fixes:\n\n- Prevented runaway memory consumption under D3D11 if an FMV\nis playing when you lock (ctrl-alt-del - &quot;lock computer&quot;)\nyour machine with an NVIDIA card.\n\n- Several &quot;groups&quot; issues have been fixed, including a\nreported issue with Group leaders causing group members to\ndisconnect from Games if they leave and then join another\nServer.\n\n- The spawning system has been tweaked, so that players will\nhave a reduced chance of spawning very close to other\n(enemy) players.\n\n- Server start up crash which occurred on Win 7 32bit Home\nPremium has been fixed.\n\n- Several Server stability (crash) issues have been fixed\n\nBalance Changes:\n\n- Flamethrower primary fire now ignites target if 25% of\nhealth has been depleted. Flames will now continue to burn\nuntil target is dead, or target extinguishes flames. Base\ndamage is unchanged.\n\n- Alien leap attack now causes the knockdown flinch on all\ntargets from the &quot;long distance&quot; range. Damage is unchanged.\n\n- Alien tail attack now causes the light attack flinch, which\ndoes not &quot;root&quot; the target. Damage is unchanged.\n\n- You are now not able to jump and start a melee move in the\nair/until the jump has completed, or initiate a melee move\nand then jump until the melee animation has finished.\nAffects all species.\n\n- Stealth attack has had some tweaks to reduce the potential\nfor an initiation to occur from outside the allowed &quot;angle&quot;\nand range has been reduced from 8m to 6m\n\n- The Predator flinch ranges have been equalised with the\nAliens, and as a result can now be knocked down by a counter\n(from any species), or an Alien leap attack that\nsuccessfully lands.\n\n- Knockdown leap distance is now between 9-12m instead of\n6-12m. Affects Aliens and Predators.\n\n- Predator maximum leap distance is now capped at 12m (in line\nwith Alien) and is not modified by vision mode.\n\n- The Marine block will now only block 50% of an incoming\nlight attack damage value instead of 100%.\n\nUpdate 4\n========\n\nClient:\n\n- Fix for a Skybox rendering problem in D3D11 build on Nvidia\nFermi cards\n\n- Various small D3D11 optimisations\n\n- Fixed rare bug where clients would get stuck on the loading\nscreen.\n\n- Fix clients not seeing the 'custom match' flag updating in\nthe 'Browse' screen when the dedicated server was changing\nsettings after initially hosting a match without changing\nany variables\n\n- Use an R prefix for rcon command output text upon\nsuccessful receipt of a rcon command\n\n- Prevent windows cursor being stolen when starting in\nwindowed mode but then doing ALT-TAB immediately.\n\n- Show (and sort) dedicated server search results as they come\nin instead of waiting for search to complete before\ndisplaying anything.\n\n- Fix extraneous Team appended to MOTD text when joining\ngame in progress\n\n- Invitations to dedicated server games now work.\n\n- Fixed all dedicated server games showing as &quot;at lobby&quot; in\nthe server browser, regardless of being at lobby or in\nprogress.\n\nDedicated server:\n\n- Fixed &quot;Ghost players&quot; being created on a server if the Steam\nbackend could not be reached for authentication when someone\nconnected. These appeared in the player counts when browsing\nservers, and in the server details player list when viewing\nservers in the Steam client server list.\n\n- Added more info to server console when players\nconnect/disconnect, and print out the player list in the\ncommand window (including scoreboard) at the end of each\ngame.\n\n- Use an R prefix for rcon commands and echo command output\nto server console as well as sending it to rcon client.\n\n- Enabled logfiles (writes out console output and some command\nline errors only to files in logfilesdedicatedserver). You\ncan still override the logfile directory by specifying\n-logdir on the command line and if you do so any logfiles\nfrom a previous session will be archived in a directory\ncalled logfilebackups.\n\n- Small performance optimisations\n\n- Dedicated server species ratios' commands check for unset\nvalues and report the default values instead of the invalid\nvalue (-1). The dedicated server was correctly setup in this\ncase, but the command feedback text was inaccurate\n\nInstall Notes:\n\n1. Unpack the included rar files.\n2. Run Aliens.Vs.Predator.Update.4.to.6.exe and install\n3. Copy the cracked content from SKIDROW directory to your\nmain installation directory and overwrite.\n4. Play the game\n\nSeed it! Or DIE!","torrent":{"xt":"urn:btih:e9e907b3ab00203d74b856e2f26baf3bf18f549c","amp;dn":"Aliens.Vs.Predator.Update.4.to.6-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e907b3ab00203d74b856e2f26baf3bf18f549c","infoHashBuffer":{"type":"Buffer","data":[233,233,7,179,171,0,32,61,116,184,86,226,242,107,175,59,241,143,84,156]},"announce":[],"urlList":[]}}