{"title":"Alice Woody Allen","uid":4573324,"size":734003200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea01899503a1b12e5fbc57396016c872f5290c56&amp;dn=Alice+Woody+Allen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ricsisifo","files":1,"time":1229134926,"description":"Synopsis by &quot;Cult Movies&quot; author Danny Peary...\n\nFifteen years ago, Alice (Mia Farrow) gave up her fashion career to marry the wealthy Douglas (William Hurt). Now they live in a fancy East Side apartment, with their two kids and several servants. She spends her time shopping, heaving beauty treatments, and being a good wife/mother. Raised a Catholic - her idol is Mother Teresa - Alice feels guilty just for being madly attracted to Joe (Joe Mantegna): a sax player and single father whose kids attend her kids' school. She is too shy to talk with him. Having a painful back, she goes to Dr. Yang (Keye Luke): a weird acupuncturist-herbalist, who realizes that her problem is caused by her attraction to Joe. Yang gives her a special herb. The next day she uninhibitedly flirts with Joe and they make a date. But later she feels to guilty and scared to keep it. She takes more of Yang's potions. One potion makes her invisible: she watches Joe make love to his ex-wife (Judy Davis). Another potion allows Alice to be with the ghost of her first love, Eddie (Alec Baldwin), of whom Joe reminds her. After several false starts and near break-offs, Alice and Joe consummate their love. When invisible, Alice goes to Douglas's office and catches him making love with a coworker. He has been unfaithful for years. Alice breaks up with him and goes to Joe, who sadly tells her that he is returning to his ex-wife. Yang gives Alice a potion that will make any man love her completely. She can choose between Douglas and Joe, but decides on neither. Instead, she goes to Calcutta and works with Mother Teresa. With better values, Alice returns to New York and happily brings up her kids alone. \n\n\nSinopse: Uma rica dona de casa de Manhattan, Alice Tate (Mia Farrow), parece ter tudo o que deseja, um belo apartamento, duas crianÃƒÂ§as perfeitas e um marido charmoso (William Hurt) e muito bem sucedido. Mas para Alice alguma coisa estÃƒÂ¡ faltando. Entediada com seus amigos importantes, limpezas de pele e cabeleireiros, ela estÃƒÂ¡ ÃƒÂ  procura de algo mais significativo na vida. Sob a influÃƒÂªncia de uma sÃƒÂ©rie de ervas mÃƒÂ¡gicas do Dr. Yang, Alice comeÃƒÂ§a uma fantÃƒÂ¡stica jornada de auto-descoberta, na qual ela fica face a face com suas necessidades reais, seus desejos, seus limites e seus dons. Do grande diretor/roterista Woody Allen, tambÃƒÂ©m estrelando Joe Mantegna, Cybill Shepherd e Alec Baldwin, Simplesmente Alice ÃƒÂ© um incrÃƒÂ­vel conto sobre riqueza, adultÃƒÂ©rio, culpa e a descoberta do que realmente conta na vida.","torrent":{"xt":"urn:btih:ea01899503a1b12e5fbc57396016c872f5290c56","amp;dn":"Alice+Woody+Allen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea01899503a1b12e5fbc57396016c872f5290c56","infoHashBuffer":{"type":"Buffer","data":[234,1,137,149,3,161,177,46,95,188,87,57,96,22,200,114,245,41,12,86]},"announce":[],"urlList":[]}}