{"title":"Marvel Super-Heroes v1 12-20 (1967-1969)","uid":9507748,"size":360968071,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ea177f420a122e94ec149389a53322620ec05cee&amp;dn=Marvel+Super-Heroes+v1+12-20+%281967-1969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1390346694,"description":"The first 11 issues of this series were under the title &quot;Fantasy Masterpieces&quot;, and were reprint-only. After issue 21, the series went back to an all-reprint format as well. However, the nine issues in-between presented here, 12-20, had at least one spotlight story featuring a different character, including a few brand new characters. From wikipedia, here is the list of originals found within and their writer/artist/inker:\n\n-#12 (December 1967) &quot;The Coming of Captain Marvel&quot; - Stan Lee, Gene Colan, Frank Giacoia\n-#13 (March 1968) &quot;Captain Marvel in &quot;Where Walks the Sentry&quot; - Roy Thomas, Gene Colan, Paul Reinman\n-#14 (May 1968)\tSpider-Man in &quot;The Reprehensible Riddle of the Sorcerer&quot; - Stan Lee, Ross Andru, Bill Everett\n-#15 (July 1968) Medusa in &quot;Let the Silence Shatter&quot; - Archie Goodwin, Gene Colan, Vince Colletta\n-#16 (September 1968) &quot;The Phantom Eagle&quot; - Gary Friedrich, Herb Trimpe (also inked)\n-#17 (November 1968) &quot;The Black Knight Reborn&quot; - Roy Thomas, Howard Purcell, Dan Adkins\n-#18 (January 1969) &quot;Guardians of the Galaxy&quot; - Arnold Drake, Gene Colan, Mike Esposito (as &quot;Mickey Demeo&quot;)\n-#19 (March 1969) Ka-Zar in &quot;My Father, My Enemy&quot; - Arnold Drake and\nSteve Parkhouse, George Tuska, Sid Greene\n-#20 (May 1969)\tDoctor Doom in &quot;This Man, This Demon&quot; - Roy Thomas and Larry Lieber, Larry Lieber and Frank Giacoia, Vince Colletta\n\nObviously the most notable of these stories and the reason I posted this torrent are the first two, which feature the introduction of the first Captain Marvel in #12 and the brief appearance of Carol Danvers in #13, which directly led into her ongoing series Ms. Marvel v1. However, we also get the first takes on the Phantom Eagle and the Guardians of the Galaxy, as well as some cool tales featuring established well-loved characters. All of these were done with an immense level of talent aboard - from the likes of Stan Lee and Roy Thomas as writers to Gene Colan and Herb Trimpe on art. Hope you enjoy this classic series, please seed and enjoy! :-) ","torrent":{"xt":"urn:btih:ea177f420a122e94ec149389a53322620ec05cee","amp;dn":"Marvel+Super-Heroes+v1+12-20+%281967-1969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea177f420a122e94ec149389a53322620ec05cee","infoHashBuffer":{"type":"Buffer","data":[234,23,127,66,10,18,46,148,236,20,147,137,165,51,34,98,14,192,92,238]},"announce":[],"urlList":[]}}