{"title":"Ex-Lady (Bette Davis) [1933] @! .avi","uid":4731819,"size":392995066,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea54133e4787fcaf3ff1b9368b9fcb1a34f9f212&amp;dn=Ex-Lady+%28Bette+Davis%29+%5B1933%5D+%40%21+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alien99","files":1,"time":1235071066,"description":"                   Bette Davis\t ... \tHelen Bauer\n\tGene Raymond\t... \tDon Peterson\n\tFrank McHugh\t... \tHugo Van Hugh\n\tMonroe Owsley\t... \tNick Malvyn\n\tClaire Dodd\t... \tIris Van Hugh\n\n\nCommercial artist Helen Bauer believes marriage kills romance. She lives with advertising writer Don Peterson. He convinces her to marry him. He later carries on with client Peggy Smith; Helen takes up with Don's competitor Nick Malvyn. In the end, the couple agree to give marriage another chance. \n\n\nThe script, while not a masterpiece, is considerably above the norm. It is witty, and understanding of the desires, pride and foolishness of young, intelligent people in love. Bette plays it superbly with a slightly bored, worldly-wise exterior, and a passionate but somehow innocent interior. She is the focus of the film, the other actors being mainly satellites around her. They do a competent job, but the show is all hers.\n\nThe Deco sets were designed by someone with an obvious artistic talent and a flare for that style. Just looking at the sets and the costumes is worth the price of seeing the film. What is a real surprise is that the director used Bette as a kind of art object. The way she would pose and slouch, the style and color of her hair, the way she would hold her cigarette, her glass, the way she would arrange her body, and her expression so completely complement these lavish sets as to be a art display in themselves. This movie would be entertaining if you turned off the sound track and just watched the visuals - it is that good.\n","torrent":{"xt":"urn:btih:ea54133e4787fcaf3ff1b9368b9fcb1a34f9f212","amp;dn":"Ex-Lady+%28Bette+Davis%29+%5B1933%5D+%40%21+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea54133e4787fcaf3ff1b9368b9fcb1a34f9f212","infoHashBuffer":{"type":"Buffer","data":[234,84,19,62,71,135,252,175,63,241,185,54,139,159,203,26,52,249,242,18]},"announce":[],"urlList":[]}}