{"title":"BBC The Frankincense Trail 2of4 HDTV x264 AC3 MVGroup 2009","uid":6288550,"size":1841589762,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:eabfe2939684a532e485bd23018b68cecb3b3504&amp;dn=BBC+The+Frankincense+Trail+2of4+HDTV+x264+AC3+MVGroup+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"BasilBrush","files":1,"time":1301711140,"description":"BBC The Frankincense Trail 2of4 HDTV x264 AC3 MVGroup 2009\n\nSeries in which intrepid presenter Kate Humble follows the ancient frankincense trade route of Arabia across the amazing modern world of the Middle East. Kate's journey along the 2,000-mile trail that first connected the Arab world with the West takes her on a quest that's steeped in history, searing with desert heat, and full of characters and adventure. For 3,000 years before the birth of Christ, frankincense was more valuable than gold. Its sweet smelling aromatic smoke was treasured by Pharaohs and Caesars, and their insatiable demand for frankincense created a trade route from the southern coast of Oman to the Holy Lands. Vast camel caravans carried thousands of tonnes of frankincense over tribal lands - known today as Oman, Yemen, Saudi Arabia, Jordan, Egypt, Israel and Palestine. Following the trail across these seven nations, Kate finds modernity coexisting with ancient traditions as she discovers what it means to be a Western woman in Arabia.\n\nPart 2: Saudi Arabia\nKate Humble follows the path of the ancient frankincense trade route through one of the most enigmatic nations on Earth - the Kingdom of Saudi Arabia. With unprecedented access, Kate enters the world of the nation's richest man, meets a remote mountain tribe whose ancestors once guarded the trade routes and who live at the fringe of Saudi society today, and discovers the treasures of an untouched shipwreck that once carried frankincense on the crystal-clear waters of the Red Sea. Travelling by camel, glider and boat, she traces the 1,000-mile trail through the Kingdom and discovers the modern nation and its people.\n\nTechnical Spec\nVideo Codec: x264 CABAC\nVideo Bitrate: 4000 Kbps\nVideo Aspect Ratio: 1.777:1\nVideo Resolution: 1280x720\nAudio Codec: AC3\nAudio Bitrate: 192 Kbps CBR 48KHz\nAudio Channels: 2\nRun-Time: 59mins\nFramerate: 25FPS\nNumber of Parts: 4\nPart Size: 1.71 GB\nSource: HDTV\n","torrent":{"xt":"urn:btih:eabfe2939684a532e485bd23018b68cecb3b3504","amp;dn":"BBC+The+Frankincense+Trail+2of4+HDTV+x264+AC3+MVGroup+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eabfe2939684a532e485bd23018b68cecb3b3504","infoHashBuffer":{"type":"Buffer","data":[234,191,226,147,150,132,165,50,228,133,189,35,1,139,104,206,203,59,53,4]},"announce":[],"urlList":[]}}