{"title":"Jenna &amp; Bethany Reid - Escape (FLAC)","uid":8084118,"size":278198619,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:eb07de349edbd6ce69b766c9e3edd50a108f5329&amp;dn=Jenna+%26amp%3B+Bethany+Reid+-+Escape+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"maxfall","files":-1,"time":1359582904,"description":"Hailing from Shetland, sisters Jenna and Bethany Reid combine their fiddle playing skills and compositional talents to present a brand new suite of original music, performed for the first time at the 2010 Celtic Connections festival.\n\nInspired by the extraordinary World War 2 escape missions that became known as the Shetland Bus. With no lights and at constant risk of discovery by German aircraft and patrol boats, crossings were made between Shetland and Norway during winter, under the cover of darkness across the dangerous waters of the North Sea.\n\nThe music tells the remarkable tale of the incredible journey of survival by Jan Baalsrud, a 26-year old Norwegian instrument maker who found himself alone and on the run for more than two months in the Arctic wastelands.\n\nJenna Reid (fiddle) and Bethany Reid (fiddle, piano) with James Thomson (flute, pipes), Iain Sandilands (percussion), James Lindsay (double bass), Phil Goodlad (narration) and Martyn McLaughlin (words).\n\nUploaders note: This is a rare album and I've ripped it in FLAC for your listening pleasure.","torrent":{"xt":"urn:btih:eb07de349edbd6ce69b766c9e3edd50a108f5329","amp;dn":"Jenna+%26amp%3B+Bethany+Reid+-+Escape+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb07de349edbd6ce69b766c9e3edd50a108f5329","infoHashBuffer":{"type":"Buffer","data":[235,7,222,52,158,219,214,206,105,183,102,201,227,237,213,10,16,143,83,41]},"announce":[],"urlList":[]}}