{"title":"Panty.Pops.8.XXX.DVDRiP.x264-PORNOLATiON","uid":8766118,"size":1915700131,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:eb5758ecf84c8f51c13a1a1ec044e2749a688024&amp;dn=Panty.Pops.8.XXX.DVDRiP.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"chkm8te","files":1,"time":1375337131,"description":"Panty.Pops.8.XXX.DVDRiP.x264-PORNOLATiON\n\nKagney Linn Karter, Juelz Ventura, Rachel Starr, Veronica Jett, Bonnie Rotten, Kevin Moore, Giselle Leon, Lolly Ink, Sophia Bella\n\nPanty Worship Anything Less Would Be The Typical Porn!\n\nWhen you're talking about true panty perverts, it takes one to know one ... and director Kevin Moore knows who you are! The feverish fetishist expresses his love for women's fine undergarments in 'Panty Pops #8,' his newest collection of undies-obsessed POV-style vignettes starring the sexiest female teasers and flashers in the adult industry. Kevin just can't seem to avoid getting caught peeping and jacking with his girlfriends' underwear. This leads to all sorts of sensuous fun as the objects of his lust taunt and flaunt until Kevin's gooey climaxes soak their dainty drawers in hot sperm. The girls model tasty unmentionables in slutty fashion shows, their alluring underthings ranging from smooth, slippery rayon to thin cotton panties to revealing thongs!\n\nBetween these teasing displays, the exquisite ladies enjoy sucking the director's meat, and on occasion he even gets to fuck them before blasting messy wads of sperm all over their panties. Kevin explores his (and your) dirty fetish with young, all-natural Giselle Leon; bespectacled beauty Veronica Jett; voluptuous, buxom Kagney Linn Karter; super-stacked slut Juelz Ventura; leggy, all-natural fox Sophia Bella; chesty blonde bimbo Lolly Ink; busty temptress Rachel Starr; and exotically tattooed punk princess Bonnie Rotten. Kevin Moore's 'Panty Pops #8' is nasty fetish taken to its natural, explosive climax for the truly panty-obsessed!\n\nScreens: &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=uaxx709eojgyc6h0nil2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=uaxx709eojgyc6h0nil2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxces.com/viewer.php?file=rgyy0dsa2bm13hskzy73.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxces.com/viewer.php?file=rgyy0dsa2bm13hskzy73.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:eb5758ecf84c8f51c13a1a1ec044e2749a688024","amp;dn":"Panty.Pops.8.XXX.DVDRiP.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb5758ecf84c8f51c13a1a1ec044e2749a688024","infoHashBuffer":{"type":"Buffer","data":[235,87,88,236,248,76,143,81,193,58,26,30,192,68,226,116,154,104,128,36]},"announce":[],"urlList":[]}}