{"title":"Trine Enhanced Edition (GOG)","uid":10638493,"size":1974476540,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ebf78a21c907b2d3f26adb48ace791ab35a0b882&amp;dn=Trine+Enhanced+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Sarah116","files":-1,"time":1406421420,"description":"Hey guys, here &quot;Trine Enhanced Edition&quot;. It includes all bonus content. Hope you guys enjoy and please help seed.\n\n\n--------------\n\n\n\n Bonus content included for FREE with purchase:\n   \n- Manual\n\n- 6 wallpapers\n\n- soundtrack\n\n- 8 avatars\n\n- 4 artworks\n\n- Enchanted Edition wallpaper\n\n\n--------------\n\n\nWhat's cool about it:\n- Winner of Best Downloadable Game (GameSpot's E3 Editors' Choice Awards) 2009.\n    \n- Enchanting visuals, beautiful music, and stunning attention to detail throughout the entire adventure.\n    \n\n- Polished and fluid game mechanics make the puzzle solving process a very enjoyable and rewarding experience.\n\n\n\nOverview:\n\nTrine Enhanced Edition\n\nTrine Enchanted Edition is a remake of the original Trine with dazzling new visual effects and numerous gameplay improvements!\n\nBoth Trine Enchanted Edition as well as the original Trine are included in the Enchanted Edition. The different versions are selectable from the game launcher. All Trine purchases have been automatically updated to Trine Enchanted Edition.\n\nTrine is a physics-based action game where three characters combine their powers to devise clever solutions to challenges created by hazardous puzzles and threatening enemies. The gameplay is based on fully interactive physics where each character's different abilities and tactics can be used to invent new ways to overcome obstacles and save the kingdom!\n\nThe single-player game is fantastic fun, but Trine is one of those games best played with a friend in co-op mode. Finding solutions in a synergy of different character skills, perfectly timing your actions, and solving puzzles together with your co-op partner is the kind of truly rewarding feeling that only the best co-op games can elicit.\n\nMany indie games get by with a minimalist approach to graphics and audio, making a virtue of limited resources and focusing solely on gameplay. Trine is not one of those games. It has stunning visuals and captivating audio; together, they create an enchanting combination that is almost hypnotically beautiful. Trine is a very unique experience, a slick combination of puzzle and platformer games with brilliantly executed co-operative mode.This is a great choice for anyone looking for a game that is not only fun and eye-candy but also keeps your brain pleasantly occupied.\n\nMultiplayer notice: Trine supports mutliplayer via hotseat. Online or LAN play are not available. ","torrent":{"xt":"urn:btih:ebf78a21c907b2d3f26adb48ace791ab35a0b882","amp;dn":"Trine+Enhanced+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebf78a21c907b2d3f26adb48ace791ab35a0b882","infoHashBuffer":{"type":"Buffer","data":[235,247,138,33,201,7,178,211,242,106,219,72,172,231,145,171,53,160,184,130]},"announce":[],"urlList":[]}}