{"title":"The Rothschild Dynasty.PDF","uid":9966508,"size":952857,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed7b7eb6b4945d206f8cb5f927243200993fcd92&amp;dn=The+Rothschild+Dynasty.PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"joshua13","files":1,"time":1397577902,"description":"Dr. John Coleman, author of The Committee of 300, tells how\nMayer Amschel, the founder of the&quot;Red Shield&quot;dynasty acquired\nhis first fortune. It is a far cry from the myths and legends that still\nsurround the man who began as a rag and bone merchant and\npawnbroker, working out of a small house on Judenstrasse,\nFrankfurt on the Main, Germany, where he lived with his wife and\nfamily.\nThe events attributed to history are often caused by a &quot;hidden\nhand&quot; pulling the strings of kings, princes and potentates from\nbehind the scenes. The phenomena is explained and the legends\nthat have grown up around the Rothschilds are demolished by\nthis book that also reveals the Rothschild's intriguing that brought\ndown men like Napoleon and Tsar Alexander II of Russia.\nLegends has it that Mayer Amschel Rothschild's &quot;genius and\nfinancial skills&quot; were inherited by his sons, but the truth is quite a\ndifferent story, as Dr. Coleman makes very clear in this well\ndocumented account that goes far beyond the best known\nlegends cloaking the true character of the family.\nExactly how Mayer Amschel Rothschild &quot;stuck it lucky&quot; and the\nsteps he took that brought the family from obscurity to &quot;virtual\nrulers of all Europe,&quot; makes fascinating reading.\nThis outstanding book is not only about the past, it is also about\nthe present and the future. It will help to explain many of the\nevents that perplex the ordinary people like the war in Iraq and\nthe war threats against Iran.","torrent":{"xt":"urn:btih:ed7b7eb6b4945d206f8cb5f927243200993fcd92","amp;dn":"The+Rothschild+Dynasty.PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed7b7eb6b4945d206f8cb5f927243200993fcd92","infoHashBuffer":{"type":"Buffer","data":[237,123,126,182,180,148,93,32,111,140,181,249,39,36,50,0,153,63,205,146]},"announce":[],"urlList":[]}}