{"title":"Alfred Jodocus Kwak - aflevering 1 t/m 52","uid":4796837,"size":10427896348,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ee10c3df26ab66fae7ddb3892850406f02773c76&amp;dn=Alfred+Jodocus+Kwak+-+aflevering+1+t%2Fm+52&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deebeebee","files":52,"time":1237910868,"description":"Gaarne helpen seeden! Het is te groot om alleen te doen!\n\nRecode van de mpg-rips die als torrent te vinden zijn. (Twee mpg bijgevoegd ivm rip-fout)\n\n[576x480.h264] \n\nAlfred Jodocus Kwak, vaak kortweg Alfred J. Kwak, is een eend uit een kindermusical uit 1976, bedacht door Herman van Veen. Hij kreeg echter internationale bekendheid als de eend in de gelijknamige Nederlands-Duits-Japanse tekenfilm, die werd geproduceerd van 1989 tot 1991.\n\nAlfred Jodocus Kwak wordt geboren als zoon van Johan Sebastiaan Kwak en Anna van de Polder. Vlak na zijn geboorte verliest Alfred zijn ouders en zijn broertjes en zusjes, die worden overreden door een grote auto, wanneer zij vanwege projectontwikkeling de polder waarin zij leefden hebben moeten ontvluchten. Henk de Mol, een goede vriend van de familie Kwak, ontfermt zich over de kleine, gele eend. Onder toezicht van zijn adoptievader groeit Alfred op in een woonklomp in Groot Waterland. Daarbij beleeft hij een groot aantal avonturen.\n\nIn tegenstelling tot vele andere tekenfilms voor de doelgroep van kleine kinderen, wordt in Alfred J. Kwak een groot aantal maatschappelijke en politieke problemen aan de kaak gesteld, zoals ontwikkelingssamenwerking en machtsmisbruik, maar ook thema's als vriendschap en solidariteit.\n\nZo evolueert het karakter Dolf, die Alfred aanvankelijk nog als vriend ziet, al gauw in een evenbeeld van Adolf Hitler, hoewel hij veelal gekleed gaat in een napoleontisch uniform. Dolf is leider van de Kraaienpartij, welke sterke overeenkomsten kent met de NSDAP en later een oorlog start op een manier die veel doet denken aan Nazi-Duitsland in de Tweede Wereldoorlog. Dolf, wiens naam ook lijkt op Adolf, past zelfs rassenleer toe, ondanks het feit dat ook hij half kraai, half merel is. Zijn afkomst is onduidelijk, waardoor Dolf zijn gele merelsnavel zwart moet kleuren om op een echte kraai te lijken. Toch wordt Dolf in het begin van de serie op een genuanceerde manier benaderd, alsof hij slachtoffer is geworden van een moeilijke jeugd.\n\nOok de apartheid komt in de tekenfilm aan de orde. Zo vlucht het vriendinnetje van Alfred, Winnie, naar alle waarschijnlijkheid vernoemd naar Winnie Mandela, uit een land met een regime gelijkend op dat van Zuid-Afrika ten tijde van de daar heersende apartheid. Kwah Wanna lijkt daarbij gebaseerd te zijn op Nelson Mandela.\n\nAndere maatschappelijke problemen die in de tekenfilmserie verwerkt zijn, zijn onder andere de walvisvaart, de armoede in Afrika (waarbij verwezen wordt naar het in 1985 door Bob Geldof georganiseerde project Live Aid voor EthiopiÃƒÂ«), de milieubeschadiging door oliewinning en het conflict in het Midden-Oosten.","torrent":{"xt":"urn:btih:ee10c3df26ab66fae7ddb3892850406f02773c76","amp;dn":"Alfred+Jodocus+Kwak+-+aflevering+1+t%2Fm+52","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee10c3df26ab66fae7ddb3892850406f02773c76","infoHashBuffer":{"type":"Buffer","data":[238,16,195,223,38,171,102,250,231,221,179,137,40,80,64,111,2,119,60,118]},"announce":[],"urlList":[]}}