{"title":"Bullrun Season 1 Complete","uid":5399957,"size":3723673600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ee2e69154998095c730df1b05191d53e45fda137&amp;dn=Bullrun+Season+1+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Jnxd1","files":10,"time":1267382436,"description":"Bullrun is a reality television show where 12 teams compete in a 4,100 mile road race. The series is hosted by Bill Goldberg, who is a former pro wrestler. The races on Bullrun are competed by 12 different teams in different cars with 2 people per team. Before the races begin, the teams have 2 options on how to get to the finish point. The options are Highway or My Way . The My Way is a route the teams make-up on their own. Most often, the My Way routes are shorter than the Highway routes, but harder to use. Highway is the route the producers of the show have chosen for the race. It is usually easier than the My Way route, but usually takes longer to complete. The only rule is that once you choose the way your team wants to go, you have to stick to it. (Meaning if you choose the My Way route you cant use The Highway route and vice versa.) Each episode also features a challenge designed to test driver skills. At the end of each episode, the team with the slowest overall time is told to hit the road and don't come back. ","torrent":{"xt":"urn:btih:ee2e69154998095c730df1b05191d53e45fda137","amp;dn":"Bullrun+Season+1+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2e69154998095c730df1b05191d53e45fda137","infoHashBuffer":{"type":"Buffer","data":[238,46,105,21,73,152,9,92,115,13,241,176,81,145,213,62,69,253,161,55]},"announce":[],"urlList":[]}}