{"title":"Protective Cultures, Antimicrobial Metabolites and Bacteriophage","uid":15325066,"size":10357210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee326c9c19f0afc460df80785f2fae2008d06daf&amp;dn=Protective+Cultures%2C+Antimicrobial+Metabolites+and+Bacteriophage&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468690267,"description":"Protective Cultures, Antimicrobial Metabolites and Bacteriophages for Food and Beverage Biopreservation - C. Lacroix (WP, 2011).pdf\r\n\r\nISBN 978-1-84569-669-6\r\n\r\nConsumers favour foods with fewer synthetic additives, but products must also be safe to eat and have a sufficiently long shelf-life. Biopreservation, the use of a product’s natural microflora and its antibacterial products for protection against pathogens and spoilage, is a method of growing interest for the safe production of high quality minimally-processed foods. This book provides an essential overview of key topics in this area.\r\n\r\nInitial chapters review central aspects in food biopreservation, including the identification of new protective cultures and antimicrobial culture components, existing commercial fermentates including nisin and natamycin and the potential of novel fermentates and bacteriophages to improve food safety. Part II concentrates on the use of protective cultures, bacteriocins and bacteriophages to control the carriage of pathogenic microorganisms in food animals and to modulate human gut microflora. Chapters in the final section of the book review biopreservation of different types of foods, including milk and dairy products, fermented meats, fresh seafood and fruit. A review of active packaging for food biopreservation completes the volume.\r\n\r\nEdited by a leading expert, Protective cultures, antimicrobial metabolites and bacteriophages for food and beverage biopreservation is a fundamental reference for researchers and food industry professionals working to ensure the safety of the food supply.\r\n\r\nReviews the central aspects in food biopreservation, including the identification of new protective cultures and antimicrobial culture components\r\nExamines the use of protective cultures, bacteriocins and bacteriophages to control the carriage of pathogenic microorganisms\r\nProvides an overview of the biopreservation of different types of foods, including milk and dairy products, fermented meats, fresh seafood and fruit","torrent":{"xt":"urn:btih:ee326c9c19f0afc460df80785f2fae2008d06daf","amp;dn":"Protective+Cultures%2C+Antimicrobial+Metabolites+and+Bacteriophage","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee326c9c19f0afc460df80785f2fae2008d06daf","infoHashBuffer":{"type":"Buffer","data":[238,50,108,156,25,240,175,196,96,223,128,120,95,47,174,32,8,208,109,175]},"announce":[],"urlList":[]}}