{"title":"One Must Fall - Battlegrounds","uid":3605654,"size":680253440,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee5d9e87bb5006528960405b4acb0d159cef70af&amp;dn=One+Must+Fall+-+Battlegrounds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DDRRE","files":1,"time":1170026942,"description":"One Must Fall: Battlegrounds\n\nwww.OMF.com\n\nIncluding crack, patches for offline use, game launcher\n\nPLEASE BUY THIS GAME IF YOU CAN - THIS TORRENT IS FOR PEOPLE WHO CAN&amp;#039;T GET THE GAME ANYWHERE.\n\nKeywords:\nOMF: BG , OMFBG , OMF , DRE-OMFB\n\nBattlegrounds is the pioneer on-line, 3D, multiplayer fighting game. OMF:BG represents a serious change in the philosophy of making fighting games. Instead of 2 players facing off in a small space, Battlegrounds features up to sixteen simultaneous players in huge arenas, fighting in team battles or all-out brawls!\n\nOur goal is to free you, the player, from the restrictions of the past, and allow you to fight the way you&amp;#039;ve always wanted to. Just like your favourite martial-arts movies, you can go toe-to-toe with several opponents, use nearby objects as weapons, and integrate terrain and hazards into your fighting strategy.\n\nBut...\n\nWe&amp;#039;ve missed an important detail: you get to do all this while piloting a huge robot.\n\nSometimes it&amp;#039;s hard finding somewhere to park the thing, but overall it&amp;#039;s worth it for the insane weapons systems and top-secret technology. There&amp;#039;s nothing quite like opening a miniature black hole to consume your opponents, or shooting out a stream of napalm the width of a 4-lane highway.\n\nYou pilot your &amp;#039;bot using a neural link, so you don&amp;#039;t need to worry about an airbag going off in your face everytime a punch or kick slips past your defences. And best of all, you aren&amp;#039;t liable for any dents and scrapes - after all, your sponsors are paying you to test their technology. Even if you get completely trashed, they&amp;#039;ll replace your &amp;#039;bot for the next match. Could it get any better?","torrent":{"xt":"urn:btih:ee5d9e87bb5006528960405b4acb0d159cef70af","amp;dn":"One+Must+Fall+-+Battlegrounds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee5d9e87bb5006528960405b4acb0d159cef70af","infoHashBuffer":{"type":"Buffer","data":[238,93,158,135,187,80,6,82,137,96,64,91,74,203,13,21,156,239,112,175]},"announce":[],"urlList":[]}}