{"title":"Contemporary Irish Knits","uid":9235106,"size":17818445,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef4e30d6b7d57e6d1e36640cd339efbc2b766b1c&amp;dn=Contemporary+Irish+Knits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385156212,"description":"Celebrate the Irish countryside and create one-of-a-kind knitted projects\nThe patterns found in Contemporary Irish Knits showcase traditional Aran knitting patterns to create the more fitted and flattering shapes that modern knitters prefer. You'll get 18 patterns for making one-of-a-kind Irish knits, encapsulating projects for women's, children, and men's wardrobe pieces, and accessories like bags, blankets, and shawls. Plus, you'll get easy-to-follow instructions and guidance on how to construct and enhance your knitting experience to make for a more intuitively put-together knitted item.\n\nThis all-new collection is exactly what today's knitter is looking for, and complemented by inspiring design and photography. If you're a knitter looking for innovative patterns, enhancements to your skill sets, and a chance to broaden your range of knitterly knowledge, Contemporary Irish Knits is for you. It features: contemporary Irish designs created using traditional techniques and stitch patterns implemented in new ways; a broad range of projects; guidance on working with different construction methods; and much more.\n\nFeatures an elegant design and 18 enjoyable-to-knit, one-of-a-kind patterns\nPatterns are just challenging enough to be fun to knit\nAll projects are thoughtfully designed for a beautiful finished project\nWhether you're an intermediate or advanced knitter, Contemporary Irish Knits gives you the skills, projects, and know-how to create truly gorgeous knitted pieces that celebrate Ireland's living knitted tradition with a modern, contemporary twist.","torrent":{"xt":"urn:btih:ef4e30d6b7d57e6d1e36640cd339efbc2b766b1c","amp;dn":"Contemporary+Irish+Knits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef4e30d6b7d57e6d1e36640cd339efbc2b766b1c","infoHashBuffer":{"type":"Buffer","data":[239,78,48,214,183,213,126,109,30,54,100,12,211,57,239,188,43,118,107,28]},"announce":[],"urlList":[]}}