{"title":"Cults - Static [2013] [FLAC]","uid":9067415,"size":253898335,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef51e8158bd28031bbabac1e88bc4715d731e46d&amp;dn=Cults+-+Static+%5B2013%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SmashAndGrab","files":-1,"time":1382134596,"description":"Cults - Static [2013] [FLAC]\n\nReleased ................ 2013\nSource .................. CD\nGenre ................... Pop/Rock\nStyle ................... Indie Pop\nCodec ................... FLAC\nBit Depth ............... 16 bits\nSampling Rate ........... 44.1 KHz\n\n01 - I Know\n02 - I Can Hardly Make You Mine\n03 - Always Forever\n04 - High Road\n05 - Were Before\n06 - So Far\n07 - Keep Your Head Up\n08 - TV Dream\n09 - We've Got It\n10 - Shine A Light\n11 - No Hope\n\nAs any musician will attest, breakups often provide plenty of songwriting fodder. Writing and performing songs with an ex, as Cults did on their second album, Static, is probably a special circle of hell, but when the results are this good, it's worth it. The album's imagery hints at Madeline Follin and Brian Oblivion's breakup -- their figures are turned apart instead of toward each other, as on Cults' cover -- and yet their music is stronger than ever, balancing the elements they set forth on their debut with fewer gimmicks and more complexity. Somehow, they mine even more drama out of the early-'60s pop that remains at the heart of their music: on the widescreen, weepy album closer &quot;No Hope,&quot; Follin wants to burn down the town that provides the backdrop to her grey, loveless days, and she stares into tears &quot;like a loaded gun&quot; on &quot;I Can Hardly Make You Mine.&quot; As on their debut, Cults are most gripping when they use the deceptive simplicity of vintage pop structures to pack a big -- and surprisingly nuanced -- emotional wallop. When Follin sings &quot;You and me/Always forever/We could stay alone together&quot; on &quot;Always Forever,&quot; love, security, boredom, and isolation wrestle within her clear soprano; similarly, on &quot;We've Got It,&quot; she teeters thrillingly between the anger (&quot;There's no more tears to cry for you&quot;) and desperation (&quot;There's only you, my dear&quot;) of heartache. Not surprisingly, Static's bittersweetness is often heavy on the bitter, but it only makes Cults sound more dynamic than they did on their first album. This is especially true of Follin's persona on these songs; where she used to sing about longing to go outside, here she's heartbroken but empowered, a little girl found as she sings &quot;Don't expect me to share my love with you&quot; on &quot;Keep Your Head Up.&quot; As on their debut, Cults' overall sound -- a sparkling wash that's equal parts Spector and Spiritualized -- is still the most unique and fully realized part of their music. It gets plenty of time to shine on Static, whether it's the crisp beats that pin down &quot;Shine a Light&quot;'s cloudy sweetness, the strings that add to &quot;High Road&quot;'s sophistication, or the brass that peppers &quot;So Far.&quot; In fact, the album's sound is so alluring that it sometimes threatens to overwhelm the delicate vocals and melodies. Still, Static is a vivid, poignant tour of heartbreak that's much more enjoyable than that description suggests.\n &lt;a href=&quot;\nhttp://i.imgur.com/JN0hxPS.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/JN0hxPS.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ef51e8158bd28031bbabac1e88bc4715d731e46d","amp;dn":"Cults+-+Static+%5B2013%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef51e8158bd28031bbabac1e88bc4715d731e46d","infoHashBuffer":{"type":"Buffer","data":[239,81,232,21,139,210,128,49,187,171,172,30,136,188,71,21,215,49,228,109]},"announce":[],"urlList":[]}}