{"title":"A. D. Miller - Snowdrops","uid":6495918,"size":4291292,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef9bacdd1e21fd48bd34b246f772322759fdd666&amp;dn=A.+D.+Miller+-+Snowdrops&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheBookie","files":-1,"time":1309071218,"description":"A. D. Miller - Snowdrops\n\nPublisher: Doubleday | ISBN: 0385533446 | February 22, 2011 | EPUB/PDF | 272 pages | 2 Mb/2 Mb\n\nAn intense psychological drama that echoes sophisticated entertainments like Gorky Park and The Talented Mr. Ripley.\n\nNick Platt is a British lawyer working in Moscow in the early 2000s - a place where the cascade of oil money, the tightening grip of the government, the jostling of the oligarchs, and the loosening of Soviet social mores have led to a culture where corruption, decadence, violence, and betrayal define everyday life. Nick doesn't ask too many questions about the shady deals he works on - he's too busy enjoying the exotic, surreally sinful nightlife Moscow has to offer.\n\nOne day in the subway, he rescues two willowy sisters, Masha and Katya, from a would-be purse snatcher. Soon Nick, the seductive Masha, and long-limbed Katya are cruising the seamy glamour spots of the city. Nick begins to feel something for Masha that he is pleased to think is love. Then the sisters ask Nick to help their aged aunt, Tatiana, find a new apartment.\nOf course, nothing is as it seems - including this extraordinary debut novel. The twists in the story take it far beyond its noirish frame - the sordid and vivid portrayal of Moscow serves as a backdrop for a book that examines the irresistible allure of sin, featuring characters whose hearts are as cold as the Russian winter.\n\n","torrent":{"xt":"urn:btih:ef9bacdd1e21fd48bd34b246f772322759fdd666","amp;dn":"A.+D.+Miller+-+Snowdrops","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef9bacdd1e21fd48bd34b246f772322759fdd666","infoHashBuffer":{"type":"Buffer","data":[239,155,172,221,30,33,253,72,189,52,178,70,247,114,50,39,89,253,214,102]},"announce":[],"urlList":[]}}