{"title":"Bubble Puppy - A Gathering Of Promises 1969 _ Demian - Demian 19","uid":4835982,"size":143695628,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f0092dedf081adf398960f1aa4d38917830f04d4&amp;dn=Bubble+Puppy+-+A+Gathering+Of+Promises+1969+_+Demian+-+Demian+19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Iron_Horse","files":25,"time":1239317542,"description":"Bubble Puppy - A Gathering Of Promises 1969 _ Demian - Demian 1970\n\nBubble Puppy was a Texan psychedelic rock band.\n\nHistory  Origins\nThe group was formed in 1966 in San Antonio, Texas by Rod Prince and Roy Cox. Looking to form a &quot;top gun rock band&quot; based on the concept of dual lead guitars, Prince and Cox recruited Todd Potter; a gymnast, saxophone player and guitarist. With the addition of Danny Segovia, the original line up of Bubble Puppy was complete. The name &quot;Bubble Puppy&quot; was taken from &quot;Centrifugal Bumble-Puppy&quot;, a fictitious children's game in Aldous Huxley's Brave New World. Bubble Puppy's live debut was as the opening act for The Who in San Antonio.\n\nAfter several line-up changes, the final roster for Bubble Puppy settled at Rod Prince and Todd Potter on lead guitars, Roy Cox on bass guitar and David &quot;Fuzzy&quot; Fore on drums. In 1967, Bubble Puppy moved to Austin, Texas and signed a recording contract with Houston-based International Artists, home to the 13th Floor Elevators and the Red Krayola.\n\nHot Smoke and Sassafras\nBubble Puppy scored a Top-20 U.S. hit in 1969 with their single, &quot;Hot Smoke &amp; Sassafras&quot;. The name was a misheard line lifted from an episode of &quot;The Beverly Hillbillies&quot;. The single peaked at number 14 on the Billboard 100. The song was also covered internationally, by The Mooche in the UK.\n\nIn 1969, Bubble Puppy released their only full-length album, A Gathering of Promises. However, despite Bubble Puppy's early success with the &quot;Hot Smoke &amp; Sassafras&quot; single, they experienced numerous conflicts with International Artists, and parted ways with the label in 1970.\n\nDemian\nSigning Nick St. Nicholas of Steppenwolf as a manager, Bubble Puppy moved to Los Angeles. Their name was changed to Demian (after Herman Hesse's 1919 novel, at the suggestion of their manager's wife); this was to avoid contractual difficulties with their previous record company but also because the former name appeared to link them with Bubblegum music.\n\nThe group signed to ABC-Dunhill Records and released one self-titled album in 1971, but its failure to perform on the charts led to financial difficulties with the label and, in 1972, the group split up.\n\nLater years\nThe members of Bubble Puppy continued to be active in the music industry after the band's demise. Potter and Prince played with Sirius through the late 1970s, and Fore drummed with the Texas punk rock band, D-Day, co-writing their cult hit, &quot;Too Young to Date&quot;.\n\nIn 1984, the original Bubble Puppy lineup reunited for performances and recordings, released as the LP, Wheels Go Round.\n\nRoy Cox founded The Blues Knights and issued a CD entitled &quot;Before I Go&quot; in 1999. He formed the NYC Outlaws in September 2007 in New York City, along with Tony Saracene on guitar, Dan Curley on guitar, Cody Willard on guitar, Evan Hammer on bass and Billy Brooks on drums.\nhttp://en.wikipedia.org/wiki/Bubble_Puppy\n\nAlbums\nA Gathering of Promises (1969)\nDemian (1970)\nWheels Go Round (1987)\nHot Smoke (2000)\n\nLineup:\nRod Prince - Lead Guitar / Vocals\nRoy Cox - Bass Guitar / Vocals\nTodd Potter - Lead Guitar / Vocals\nDavid Fore - Drummer / Vocals\n\nBubble Puppy - A Gathering Of Promises 1969\nCD To Mp3 224 mbit/s\nIncluded: CD Cover and this Info\nTracklist:\n01. Hot Smoke And Sassafrass\n02. Todd's Tune\n03. I've Got To Reach You\n04. Lonely\n05. A Gathering Of Promises\n06. Hurry Sundown\n07. Elizabeth\n08. It's Safe To Say\n09. Road To St. Stephen's\n10. Begininig\n\nDemian - Demian 1970\nCD To Mp3 320 mbit/s\n Included: CD Cover and this Info\nTracklist:\n01. Face the Crowd\n02. Windy City\n03. Love People\n04. Coming\n05. Todd's Tune\n06. No More Tenderness\n07. Are You With Me Baby\n08. Only A Loner\n","torrent":{"xt":"urn:btih:f0092dedf081adf398960f1aa4d38917830f04d4","amp;dn":"Bubble+Puppy+-+A+Gathering+Of+Promises+1969+_+Demian+-+Demian+19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0092dedf081adf398960f1aa4d38917830f04d4","infoHashBuffer":{"type":"Buffer","data":[240,9,45,237,240,129,173,243,152,150,15,26,164,211,137,23,131,15,4,212]},"announce":[],"urlList":[]}}