{"title":"Jane Lark - Illicit Love.epub","uid":9194135,"size":517923,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f013a81414d672fd9c0ffefb0d8669e675a15334&amp;dn=Jane+Lark+-+Illicit+Love.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1384450870,"description":"Trapped under the reign of a cruel keeper, Ellen Harding longs to be free. Under his oppression, her soul and conscience have died while her body lives on, fulfilling his dissolute desires. She is empty-a vessel-deaf to the voice of morality and blind to shame. When her eyes are drawn to a beautiful man for no other reason than his looks, she imagines what it would be like to escape her chains for a night by giving her body to him. Edward is restless, lonely, and a little angry with his lot in life-it is his only excuse for being drawn to another man's mistress. The woman's dark hair and pale eyes are striking, and he cannot take his gaze off her while she watches him over the top of a fan with an illicit intent in her eyes. Once he's known her, he cannot forget her, and once he's seen the evidence of her supposed benefactor's brutality, he wants to help her. But how can he when she will not run any more than she will speak of her past? When a desperate Ellen finally relents and shocks Edward from his sleep, he doesn't hesitate, he helps her flee. He just doesn't know he's running headlong into the secrets of her past.\nGenre: Historical Romance","torrent":{"xt":"urn:btih:f013a81414d672fd9c0ffefb0d8669e675a15334","amp;dn":"Jane+Lark+-+Illicit+Love.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f013a81414d672fd9c0ffefb0d8669e675a15334","infoHashBuffer":{"type":"Buffer","data":[240,19,168,20,20,214,114,253,156,15,254,251,13,134,105,230,117,161,83,52]},"announce":[],"urlList":[]}}