{"title":"Hex Editor Neo Ultimate Edition v6.20.02.5651","uid":12796580,"size":26249025,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f19b036414b265128e6939f2d56135b69802cdeb&amp;dn=Hex+Editor+Neo+Ultimate+Edition+v6.20.02.5651&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZarkBit","files":2,"time":1447980312,"description":"Hex Editor Neo Ultimate Edition v6.20.02.5651\r\n\r\nYou'll never find any other Hex Editor that\r\n\r\n    Saves your working time better than Hex Editor Neo. It's really fast.\r\n    Supports multiple revisions of your file with one click switching. It's convenient.\r\n    Supports saving/loading of your file manipulations history. It's safe.\r\n    Processes files of huge size without chances to be stacked. It's reliable.\r\n    Allows you to exchange file modifications history with colleagues. It's social.\r\n    Supports multiple threading and parallel processing. It's modern.\r\n\r\nHex Editor Neo is a binary files editing software utility for Windows. It's rich and handy set of features will help all software and hardware developers working with ASCII, hex, decimal, float, double and binary data.\r\n\r\nHighly optimized performance, carefully tuned user interface among with new level of application stability will save a lot of your time, money and precious nerves while working with binary files.\r\n\r\nMake patches with just two mouse clicks; manipulate your EXE, DLL, DAT, AVI, MP3, JPG files with unlimited undo/redo. Taste the visual operation history with branching.\r\n\r\nFeatures: Editing Files of ANY Size; Built-In Explorer; Unlimited Undo/Redo; Multiple Selection; Selection Save and Load; Find All; Replace All; History Browsing; History Save and Load; Patch Creation; Clipboard Operations; Bytes, Words, Double Words, Quad Words, Floats and Doubles Edit Mode; Pattern Coloring; Data Inspector; Bookmarks; Base Converter; Advanced copy &amp; export; Encodings.\r\n\r\nHexeditor is highly optimized to quickly perform the requested actions. It also allows you to continue working with a document while application is busy performing lengthy operation on another opened document.\r\n\r\nOnly Hexeditor Neo will allow you to edit large files without troubles.\r\n\r\nWe take special care about extreme performance while developing tools for you and your convenience.\r\n\r\nHex Editor can be successfully used for:\r\n\r\n    editing binary files of any size at highest speed\r\n    searching and replacing your data in a binary file\r\n    writing your microcode programs\r\n    researching the functionality of any executable file\r\n    making binary patches for your files in two clicks\r\n    opening physical and logical disks (volumes), process memory\r\n    working with any text encoding supported by your operating system\r\n    streamlining your work using Undo/Redo and other features\r\n\r\nHexEditor can be successfully used by:\r\n\r\n    software developers\r\n    private users\r\n    beta-testers\r\n    university students\r\n    coders\r\n\r\nHexEdit usage areas:\r\n\r\n    HexEdit Binary files\r\n    Make Patches\r\n    View DLLs Structure\r\n    HexEdit AVI files\r\n    HexEdit MP3 files\r\n    HexEdit JPG files\r\n    HexEdit FLA files\r\n    HexEdit SWF files\r\n \nhttp://www.hhdsoftware.com/hex-editor \nhttp://www.hhdsoftware.com/hex-editor/compare","torrent":{"xt":"urn:btih:f19b036414b265128e6939f2d56135b69802cdeb","amp;dn":"Hex+Editor+Neo+Ultimate+Edition+v6.20.02.5651","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f19b036414b265128e6939f2d56135b69802cdeb","infoHashBuffer":{"type":"Buffer","data":[241,155,3,100,20,178,101,18,142,105,57,242,213,97,53,182,152,2,205,235]},"announce":[],"urlList":[]}}