{"title":"Kai's SuperGoo","uid":3833256,"size":216748095,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f1b374769aab88824db1084985f1a24c61cfeb25&amp;dn=Kai%5C%27s+SuperGoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KKELTIKK","files":2,"time":1191775358,"description":"Manufacturer&amp;#039;s product description\nWith SuperGoo, your image behaves as though it&amp;#039;s made of digital liquid. You can stretch, warp, smear your image and more, using a library of customizable Liquid Image distortion tools... all in real time! In addition to manipulating your image with SuperGoo&amp;#039;s distortion tools, you can save your changes out into a series of keyframes, almost like a digital flip book. From here, you can render out an AVI or Quicktime animation, or a sequence of individual images. You can even preview your animation inside of SuperGoo instantly! Users of SuperGoo can use the Clone tool to mix images of family and friends... try putting dad&amp;#039;s beard onto mom&amp;#039;s face. Included with SuperGoo is a library of hundreds of facial components: eyes, noses, hairstyles, and more. These can be added onto the pictures you take, or you can create a virtual person from scratch. With SuperGoo&amp;#039;s intuitive controls, you need no prior knowledge of computers, graphics, or even the original Kai&amp;#039;s Power Goo to enjoy leaping headfirst into SuperGoo. You can use scanners or digital cameras to put your own data into SuperGoo, or choose from a library of images on the CD-ROM. These can all be output for animation, print, web design or illustration.\n\nScoured the net for this so I am reseeding. Enjoy. ","torrent":{"xt":"urn:btih:f1b374769aab88824db1084985f1a24c61cfeb25","amp;dn":"Kai%5C%27s+SuperGoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b374769aab88824db1084985f1a24c61cfeb25","infoHashBuffer":{"type":"Buffer","data":[241,179,116,118,154,171,136,130,77,177,8,73,133,241,162,76,97,207,235,37]},"announce":[],"urlList":[]}}