{"title":"Patton: Ordeal and Triumph  prabhu_","uid":11727785,"size":90103633,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1b6282fe54b6de564caa51b2b666a0305671ccd&amp;dn=Patton%3A+Ordeal+and+Triumph++prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"prabhu_","files":5,"time":1425145266,"description":"Patton Ordeal and Triumph  \n\nby  Ladislas Farago\n\nabout book :-\n &lt;a href=&quot;\nhttp://d.gr-assets.com/books/1347247878l/990979.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d.gr-assets.com/books/1347247878l/990979.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://d.gr-assets.com/books/1347247878l/990979.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d.gr-assets.com/books/1347247878l/990979.jpg&lt;/a&gt;\n\nThe book that inspired the Academy Award[registered]-winning film, finally back in print Previously published by Harper Collins/Mayflower Books He is America's most famous general. He represents toughness, focus, determination, and the ideal of achievement in the face of overwhelming odds. He was the most feared and respected adversary to his enemies and an object of envy, admiration, and sometimes, scorn to his professional peers. An early proponent of tank warfare, George S. Patton moved from being a foresighted lieutenant in the First World War to commanding the Third Army in the next, leading armoured divisions in the Allied offensive that broke the back of Nazi Germany. Patton was an enigmatic figure. His image among his troops and much of the press achieved legendary status through his bold and colourful comments and combat leadership, yet these same qualities nearly jeopardized his career and forced him out of the battle on several occasions. Victory was impossible without Patton, and returning to the field, his army was responsible for one of the most crushing advances in the history of warfare. In Ladislas Farago's masterpiece, Patton: Ordeal and Triumph, the complete story of this fascinating personality is revealed. Born into an aristocratic California family, Patton rose in military rank quickly and was tapped to lead the Allied landings in North Africa in 1942. Under Patton's direction, American troops cut their teeth against Rommel's Afrikakorps, advanced further and more quickly than British General Montgomery's army in the conquest of Sicily, and ultimately continued their exploits by punching into Germany and checking the Russian westward advance at the end of World War II. A sweeping, absorbing biography and critically hailed, Patton: Ordeal and Triumph provides unique insights into Patton's life and leadership style and is military history at it's finest.\n &lt;a href=&quot;\nhttp://d.gr-assets.com/books/1347247878l/990979.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d.gr-assets.com/books/1347247878l/990979.jpg&lt;/a&gt;\n\nabout author :-\n\nLadislas Farago (1906 - 1980) is author of many books, including The Game of the Foxes, The Broken Seal, and Strictly from Hungary, also available from Westholme.\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`","torrent":{"xt":"urn:btih:f1b6282fe54b6de564caa51b2b666a0305671ccd","amp;dn":"Patton%3A+Ordeal+and+Triumph++prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b6282fe54b6de564caa51b2b666a0305671ccd","infoHashBuffer":{"type":"Buffer","data":[241,182,40,47,229,75,109,229,100,202,165,27,43,102,106,3,5,103,28,205]},"announce":[],"urlList":[]}}