{"title":"Westlife  Dreams come True Live","uid":6479249,"size":6668554240,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f1e1c39b8ab66b22b006b60209b5b8315481ad35&amp;dn=Westlife++Dreams+come+True+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"garcin","files":-1,"time":1308432788,"description":"Westlife's first big break came in 1998 when they opened for the Boyzone and Backstreet Boys' concerts in Dublin. Later Act' award at the Smash Hits Poll Winners Party.[10] In March 1999, the group released their first single, &quot;Swear It Again&quot; which immediately topped the charts in Ireland and in UK for two weeks.[10] Their second single, &quot;If I Let You Go&quot;, released in August 1999 along with the highly acclaimed &quot;Flying Without Wings&quot; (their first 'Record of the Year'), released in October the same year, also followed suit. &quot;Flying Without Wings&quot; was also included on the soundtrack of the Warner Brothers film, PokÃƒÂ©mon: The Movie 2000. The first album, simply titled Westlife, was released in November 1999 and peaked at #2 in the UK. Ironically, the album was the biggest chart dropper in the music history of UK, falling from #3 to #37. In December 1999, the double a side fourth single was released,&quot;I Have A Dream&quot;/&quot;Seasons In The Sun&quot;, knocked Cliff Richard's &quot;The Millennium Prayer&quot; off the top spot and earning them the 1999 UK Christmas number-one single.[11][12] The fifth and last single from the album, &quot;Fool Again&quot;, also peaked at #1.[13] Then, the group went on a short UK, US[14] and Asian tour in support of their debut album before releasing a second album.\n\nCoast to Coast was released a year after and was another #1 UK album beating the Spice Girls' Forever album. It became the country's 4th biggest selling album of 2000 and is Westlife's biggest selling album to date.[15][16] The album was preceded by a duet with Mariah Carey on the Phil Collins' classic &quot;Against All Odds (Take a Look at Me Now)&quot; and the original song, &quot;My Love&quot; (the song that bagged their second 'Record of the Year' award). Both singles reached #1 on the UK charts.[17][18] With this, Westlife broke an unexpected record of having their first seven singles debut at the top of the UK charts, tying with The Beatles. However, in December 2000, they failed to secure their eighth chart-topper in a row with their UK and Ireland only single &quot;What Makes A Man&quot; when kid's favourite, Bob The Builder's &quot;Can We Fix It&quot;, was crowned as the Christmas number-one single of that year.[19] Outside the UK/Ireland territories, they have released &quot;I Lay My Love on You&quot; and &quot;When You're Looking Like That&quot; and gained chart success. In 2001, they launched their first world tour, &quot;Where Dreams Come True Tour&quot;, unofficially nicknamed &quot;The No Stools Tour&quot; due to the group's reputation of performing while perched on stools.[10][20]\n\nWestlife released World Of Our Own, their third album, in November 2001. &quot;Uptown Girl&quot;, &quot;Queen of My Heart&quot; and &quot;World of Our Own&quot; were released as singles, as of which all peaked at #1 in the UK.[21][22][23] &quot;Bop Bop Baby&quot; was also released as a single but it peaked at #5 in the UK Singles Chart. In 2002, Westlife went on their second world tour, the World Of Our Own Tour (In The Round).[10]","torrent":{"xt":"urn:btih:f1e1c39b8ab66b22b006b60209b5b8315481ad35","amp;dn":"Westlife++Dreams+come+True+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1e1c39b8ab66b22b006b60209b5b8315481ad35","infoHashBuffer":{"type":"Buffer","data":[241,225,195,155,138,182,107,34,176,6,182,2,9,181,184,49,84,129,173,53]},"announce":[],"urlList":[]}}