{"title":"La Distancia [DVDRip] [Spanish]","uid":4555935,"size":734945366,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1f18a55c7c2784c3095d86fff517e1a3c66a197&amp;dn=La+Distancia+%5BDVDRip%5D+%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mois20","files":3,"time":1228486591,"description":"Daniel es un joven boxeador. En varias ocasiones ha estado cerca de conseguir el tÃƒÂ­tulo nacional, su mÃƒÂ¡xima ilusiÃƒÂ³n, pero su estilo de pelea defensivo y poco arriesgado le ha frenado. Daniel se ve involucrado en un asesinato, lo que le une de manera destructiva a Guillermo, un policÃƒÂ­a corrupto y atormentado por su homosexualidad.\nDaniel se convierte en otra persona tras su paso por la cÃƒÂ¡rcel. Guillermo le obliga a matar a Manuel, un preso de pasado turbio. Los remordimientos tras el asesinato son terribles, pero al mismo tiempo siente una fuerte atracciÃƒÂ³n por Raquel, la viuda del preso al que asesinÃƒÂ³. Estas circunstancias modifican de manera radical e inesperada el carÃƒÂ¡cter de Daniel como persona y boxeador. La mirada desconfiada de su entrenador, tras su paso por la cÃƒÂ¡rcel, aumenta al contemplar su cambio. Los roces se suceden y el entrenador le pide que se vaya despuÃƒÂ©s de un ÃƒÂºltimo combate.\nLa peligrosa relaciÃƒÂ³n que mantiene con Raquel, provoca los celos de Guillermo, que se siente irremediablemente atraÃƒÂ­do por Daniel.\nGuillermo intenta interferir para que Daniel no pelee en su ÃƒÂºltimo combate amenazÃƒÂ¡ndolee de muerte, pero Daniel no tiene ninguna intenciÃƒÂ³n de prescindir de las dos cosas que le liberan de su pecado, el boxeo y su combate final y la relaciÃƒÂ³n con Raquel.\nUna sensaciÃƒÂ³n de temor recorre el cuerpo de Daniel al entrar de nuevo en un Ring. Mientras el pÃƒÂºblico le vitorea, percibe la mirada de Guillermo, incapaz de cumplir su amenaza y la de una enamorada Raquel.","torrent":{"xt":"urn:btih:f1f18a55c7c2784c3095d86fff517e1a3c66a197","amp;dn":"La+Distancia+%5BDVDRip%5D+%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1f18a55c7c2784c3095d86fff517e1a3c66a197","infoHashBuffer":{"type":"Buffer","data":[241,241,138,85,199,194,120,76,48,149,216,111,255,81,126,26,60,102,161,151]},"announce":[],"urlList":[]}}