{"title":"Big Guns - (1987) [Catalina]","uid":8783254,"size":1859191102,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f20abbbfd0b1a4ddd73eb9bb6a05ad11cba6747c&amp;dn=Big+Guns+-+%281987%29+%5BCatalina%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"urboboho","files":-1,"time":1375763674,"description":"Director William Higgins' &quot;Big Guns&quot; is one of my all-time favorites. In fact, I believe that all first-time gay porn directors should sit down and watch this \n\nclassic before they get started. Higgins takes his time with individual pairings, never forgetting that seduction and foreplay are turn-ons as well. It is quite \n\ndeserving of every bit of praise that has been heaped on it since its late-1980s release -- has there ever been a production loaded with so many wonderful \n\nscenes? \n\nThis tale of Navy jet pilots begins with young, beautiful Mike Henson waking up with a huge bulge in his underpants. He gets up and takes off his underwear, \n\nthen decides it's too cold to go to school. He climbs back in bed, stretches out his body and jacks his stiff dick. Rolling around, then standing up and \n\njerking, he finishes himself off back in bed, spewing on his belly, and then rubs a finger in the jism and back to his mouth. \n\nLater that day, friend Kevin Wiles comes over. Kevin complains that his butt is sore -- and then explains the reason. Kevin has stopped by the home of Chad \n\nDouglas, trying to collect for his paper route. As Chad reaches for his checkbook, his robe flies open, his daddy dick flopping around. Kevin can't take his \n\neyes off the package, and soon has to have a taste. Kevin manhandles as much as he can of the huge fuckstick, with Chad -- he of the thick mustache, hairy body \n\nand enormous endowment -- plugging in and out and slapping Kevin's face with the cock. He pretty much just flips Kevin against a table and rides his pretty \n\nbutt, slapping Kevin's backside as he does. Kevin later positions his head on a nearby table and gives Chad open access, Chad sliding inside fairly easily. \n\nAmazingly, Kevin's ass pretty much takes the entire shaft. Chad soon takes him missionary-style, his big balls slamming against Kevin's white cheeks. Chad drops \n\na load afterwards, but these two are far from done. Kevin sits on daddy's lap and slowly sinks onto the missile to end the scene. \n\nThe next sequence finds John Davenport and Chris Gray learning to shoot a gun. John suggests Chris learn how to shoot to protect himself. As John teaches his \n\nstudent, lining Chris' arms up correctly, he begins to caress Chris' arms, then smoothly works his way down. Their impassioned kiss seconds later, their mutual \n\nattraction swimming to the surface, is hotter than 90% of what's in porn these days -- with John actually seducing his partner. Locking lips, their tongues \n\nshooting out, John pulls down Chris' pants and squeezes his cheeks and hole. Once naked, Chris drops and locates John's hardon. His sucking is slow at first, \n\nthen almost frantic. These two move to the bed, where John mouth-fucks the muscular Chris. Their penetration is astonishing: Chris is on his back as he lets \n\nJohn ram it in. Chris' leg curls up as John slides into his tight opening. The strokes are steady but not rabid. Chris cums quickly -- all over his hairy thigh. \n\nThese two go at it again, though, this time doggy, Chris' ass a little more relaxed. The camerawork zooms in close on the screwing. For his part, John doesn't \n\ntake it easy this time, often peppering Chris' cheeks with hard slaps as he thrusts into him. \n\nAt a hotel, Mike Henson and John Davenport are at a pool, getting some R&amp;R. They see Kevin Williams arrive with his family, then take a dip by himself. Mike \n\nbets John a hundred bucks he can nab the blond. John decides to get Mike to video the encounter as proof, and to see the young stud get deflowered. Pretending \n\nto be a masseur, Mike goes to visit Kevin, whose parents have stepped away for a few hours. Mike tells him that a massage has been paid for. Kevin initially \n\nturns it down, thinking it's for his parents, but hesitantly agrees. Mike positions Kevin on his stomach on a bed, naked except for his shorts. As Mike's hands \n\nwork all over Kevin's body, Kevin gets visibly aroused. Mike grabs the boner, takes off Kevin's underwear, and tantalizingly strokes the erection. His hand \n\nmasturbating Kevin, Mike jets the other hand to Kevin's butt, priming it, until Kevin is practically begging to be fucked. Mike enters him from behind, poking \n\nthe cheeks and prompting heavy moans from both performers. It's an exquisite moment, Mike taking full advantage of the situation. He nails Kevin in three \n\ndifferent positions, grinding deeper and harder each time, before he and Kevin reach climaxes. Meanwhile, John Davenport has been privy to the action and \n\nquickly shucks his clothes and reaches his own orgasm while watching. \n\nMike Henson heads back to the base to party with his friends Mike Ryan and Jeff Boote. Finding their room, they check out the hot tub, sitting in their swim \n\ntrunks talking about the women they hope to bag later. When they get out and dress, Jeff laughs at the &quot;fundies,&quot; underwear made for more than one person, he \n\nfinds in Mike Henson's suitcase. Mike Ryan tries them on, laughs, and, on a dare, Mike Henson steps in as well. The three begin teasing each other, until they \n\nare all on a bed, naked and wrestling. Soon, the erections start, beginning with Jeff. The others tease him, then start spanking his naked cheeks. Mike Ryan \n\norally services Jeff, while Mike Henson tastes his sweaty backside. Then the action becomes just a frisky free-for-all, the guys sucking and rimming each other, \n\nfingering holes. What Higgins captures astonishingly well here is adolescent discovery, as the three do things they've probably never done before. It's fun to \n\nguess whose butts will get humped here, and it's Jeff who at first excitedly has a seat on Mike Henson's pole. Then, with Mike Henson on top of Mike Ryan, Jeff \n\nskewers Mike Ryan's ass for a while, then withdraws and pokes Mike Henson's hole. Before it's over, Mike Henson gets some more of Jeff's &quot;Boote,&quot; with Mike Ryan \n\nunderneath taking a cum facial from Jeff just before Mike Ryan bursts and Jeff tastes some of it. \n\nThe theme of seduction is repeated in the last full sex scene, with pilot Jeff Quinn befriending John Rocklin at a bar after John has sexually propositioned a \n\nfemale bartender. John has had too much to drink and the shameless Jeff takes advantage. They move outside, where Jeff teaches John about erogenous zones. Jeff \n\nmassages John's shoulders, his arms, his chest, teasing the fellow pilot. Jeff licks John's armpits, before placing a hand on his leg. John is now putty in his \n\nhands, and Jeff slowly takes his shoes off and kisses John's bare feet, before pulling his dick out of his pants and taking his time to give John a first-class \n\nblowjob. That leads to Jeff's tongue up John's rear, just before Jeff stuffs his boner inside. Their doggy-style outdoor fuck is superb, with Jeff eventually \n\nturning John over and lifting his legs to the heavens as they go at it. In a great role reversal, Jeff soon finds himself on the receiving end, his sphincter \n\ngetting massaged by John's randy dick. \n\nEngaging in mock war games the next day, Mike Henson, Jeff Quinn and Rocky Armano head to the bush. The games turns sexual, however, when they decide the loser \n\ngets some not-in-the-manual punishment. Rocky loses, and is captured, stripped and tied up. (That scene is continued in &quot;Hot Rods: The Young and the Hung Part \n\n2.&quot;)","torrent":{"xt":"urn:btih:f20abbbfd0b1a4ddd73eb9bb6a05ad11cba6747c","amp;dn":"Big+Guns+-+%281987%29+%5BCatalina%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20abbbfd0b1a4ddd73eb9bb6a05ad11cba6747c","infoHashBuffer":{"type":"Buffer","data":[242,10,187,191,208,177,164,221,215,62,185,187,106,5,173,17,203,166,116,124]},"announce":[],"urlList":[]}}