{"title":"The Journey Home - Radhanath Swami Audiobook","uid":15472797,"size":1147614030,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f20ed5d4cf26bef624064d23f89d7a447040cfbe&amp;dn=The+Journey+Home+-+Radhanath+Swami+Audiobook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SachinJ9862","files":59,"time":1470156585,"description":"The Journey Home - Autobiography of an American Swami\r\n\r\nRadhanath Swami (Richard Slavin)\r\n\r\nRadhanath Swami was born in Chicago in 1950. In his teens he set out to wander the world on a spiritual quest, which led him to eventually discover the yoga path of devotion. He presently travels in Asia, Europe, and America teaching devotional wisdom, but he can often be found with his community in Mumbai, where he works tirelessly to help develop communities, food distribution initiatives, missionary hospitals, schools, ashrams, emergency relief programs, and eco-friendly farms.\r\n\r\n\r\nMandala Publishing has released Radhanath Swami’s The Journey Home as an Audio Book. \r\n\r\nIn this extraordinary memoir, he weaves a colorful tapestry of adventure, mysticism, and love. With the author’s masterful reading, listeners are guided by the former Richard Slavin from the suburbs of Chicago to the caves of the Himalayas as he transforms from young seeker to renowned spiritual guide.\r\n\r\n\r\nThe Journey Home is an incredibly intimate account of the author’s steps to self-awareness and also a penetrating glimpse into the heart of mystic traditions and the challenges that all souls must face on the road to inner harmony and a union with the divine. Through near-death encounters, apprenticeships with advanced yogis, and years of travel along the pilgrim’s path, Radhanath Swami eventually reaches the inner sanctum of India’s mystic culture and finds the love he has been seeking. It is a tale told with rare candor, immersing the reader in a journey that is at once engaging, humorous, and heartwarming. \r\n\r\nA constantly in-demand speaker, Swami’s audiobook presents a rare opportunity for listeners to have an incredibly intimate and personal experience with a globally respected spiritual guru","torrent":{"xt":"urn:btih:f20ed5d4cf26bef624064d23f89d7a447040cfbe","amp;dn":"The+Journey+Home+-+Radhanath+Swami+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20ed5d4cf26bef624064d23f89d7a447040cfbe","infoHashBuffer":{"type":"Buffer","data":[242,14,213,212,207,38,190,246,36,6,77,35,248,157,122,68,112,64,207,190]},"announce":[],"urlList":[]}}