{"title":"The Story of Civilization - Will Durant","uid":6511758,"size":9323507228,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f21cc3fc5c075653e2c0491852289b9744d52ce4&amp;dn=The+Story+of+Civilization+-+Will+Durant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":602,"time":1309650909,"description":"THE STORY OF CIVILIZATION [Unabridged Recordings]\nBy Will and Ariel Durant\n\n\nOverview:\n\nThe Story of Civilization by Will and Ariel Durant is an eleven-volume set of books, which is consider by many as the twentieth century's classic masterwork of history, a magnum opus, for the general reader. The books are organized in such a way that they can be read as individual works or be read out of sequence with no loss to their meaning. The style of the books is conversational and peppered with puns and an overall enjoyable to read.\n\nDurant is amazingly concise while still making his points. That being said, he does require that the reader do some work: remember people and events. However, the books do not require heavy note taking or anything because these books are a fun read. His style is a good mix of history as literature and history as a science. The mix is necessary for the sake of readability and those of you who have been reading modern histories that seem rely too much on footnotes and data points or provide little at all will find his style refreshing.\n\nFor the student of history, this set is a fantastic collection. If you are looking to find an all encompassing treatise of world history, this where to start. You will not be disappointed.\nUnprecedented and unparalleled!\n\nSERIES OUTLINE:\n\no 01. Our Oriental Heritage - This volume covers Near Eastern history until the fall of the Persian Empire, and the history of India, China, and Japan to the 1930s.\no 02. The Life of Greece - This volume covers Ancient Greece and the Hellenistic Near East down to the Roman conquest.\no 03. Caesar and Christ - The volume covers the history of Rome and of Christianity until the time of Constantine the Great.\no 04. The Age of Faith - This volume covers the Middle Ages in both Europe and the Near East, from the time of Constantine to that of Dante.\no 05. The Renaissance - This volume covers the history of Italy from c.1300 to the mid 16th century, focusing on the Italian Renaissance.\no 06. The Reformation - This volume covers the history of Europe outside of Italy from around 1300 to 1564, focusing on the Protestant Reformation.\no 07. The Age of Reason Begins - This volume covers the history of Europe and the Near East from 1559 to 1648.\no 08. The Age of Louis XIV - This volume covers the period of Louis XIV of France in Europe and the Near East.\no 09. The Age of Voltaire - This volume covers the period of the Age of Enlightenment, focusing on the period between 1715 and 1756 in France, Britain, and Germany.\no 10. Rousseau and Revolution - This volume centers on Jean-Jacques Rousseau and his times. It received the PULITZER PRIZE for General Non-Fiction in 1968\no 11. The Age of Napoleon - This volume centers on Napoleon I of France and his times.\n","torrent":{"xt":"urn:btih:f21cc3fc5c075653e2c0491852289b9744d52ce4","amp;dn":"The+Story+of+Civilization+-+Will+Durant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f21cc3fc5c075653e2c0491852289b9744d52ce4","infoHashBuffer":{"type":"Buffer","data":[242,28,195,252,92,7,86,83,226,192,73,24,82,40,155,151,68,213,44,228]},"announce":[],"urlList":[]}}