{"title":"Ultra ISO Premium Edition 8.6","uid":3592587,"size":3347674,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f23b54e027f695b9898986538f0a81767dc753a5&amp;dn=Ultra+ISO+Premium+Edition+8.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Altoid","files":4,"time":1168298081,"description":"UltraISO is an ISO CD/DVD image file creating/editing/converting tool and a bootable CD/DVD maker, it can directly edit the CD/DVD image file and extract files and folders from it, as well as directly make ISO files from your CD/DVD-ROM or hard disk. At the same time, you can maintain the ISO bootable information, thus creating your own bootable CD/DVDs. You now have the power to make and edit your own ISO files, and then burn them to CD/DVD for your own needs. \nUltraISO is in sole possession of the intellectualized ISO document format analyzer, it can process at the present time almost all types of image files, including ISO and BIN, it may even support new image files which are yet to be created. UltraISO can open these image files, directly extract files and folders, edit it and convert other image files to the standard ISO format. \nUltraISO uses the double window unification user contact interface, you have the choice to only use the quick buttons and/or the mouse Drag &amp; Drops, you can handle any CD/DVD image file easily.\n\n*** UltraISO can:\n1. Duplicate disc to ISO file from CD-ROM. \n2. Build file on hard disk, CD-ROM, net drive to one ISO file. \n3. Extract files from ISO file. \n4. Edit ISO file in many format (such as Nero burning ROM, Easy CD Creator, CDRWin, CloneCD, BlindWrite, etc.). \n5. Make bootable ISO file. \n6. Create/Edit Audio CD image. \n\n*** Some details: \n1. Can directly edit the ISO image file. \n2. Can directly extract files and folders from ISO image file \n3. Can add / delete /create new directory /rename ISO file image content. \n4. Can make ISO file from hard disk document. \n5. Can create CD image from CD-ROM, maintain bootable information. \n6. Can process the compact disc boot information, you can directly add/remove/extract boot image of the ISO image. \n7. Supports nearly all known CD image file formats (.ISO, .BIN, .IMG, .CIF, .NRG, .BWI and so on) , and converts them to the standard ISO form image. \n8. May directly set the file/folder to hidden attribute \n9. Supports ISO 9660 Level1/2/3 and Joliet extension \n10. Automatically optimizes the ISO image file structure, saves the CD space. \n11. Supports the shell document type integration, Open Image files through double clicking them or the Right Click menu of the mouse with the open dialog. \n12. The double window user interface is extremely convenient to use. \n13. There are rich add-on tools, you can create ALL in 1 bootable compact discs, CD image file management, even the virtual CD/DVD drive, those functions are really powerful.","torrent":{"xt":"urn:btih:f23b54e027f695b9898986538f0a81767dc753a5","amp;dn":"Ultra+ISO+Premium+Edition+8.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f23b54e027f695b9898986538f0a81767dc753a5","infoHashBuffer":{"type":"Buffer","data":[242,59,84,224,39,246,149,185,137,137,134,83,143,10,129,118,125,199,83,165]},"announce":[],"urlList":[]}}