{"title":"XCOM.2.Steam.Preload-3DM","uid":13420447,"size":26401597438,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f2b9f95cea041f4a25e59420ae2af97a6a94a952&amp;dn=XCOM.2.Steam.Preload-3DM&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mercs215","files":29,"time":1454542379,"description":"Install instructions:\r\nIMPORTANT NOTE #1: Download at your OWN RISK! No preload unlocker may be released!\r\nIMPORTANT NOTE #2: Yes, you may use the preload files with the legit Steam copy if you bought a key from a 3rd party site and won't receive your key until release date (see below)!\r\n- Download and extract\r\n- Wait for preload unlocker and crack. \r\n- If you own the legit copy, extract and move all the .csd and .csm files to *Steamsteamappsdepotcache\r\n\r\nTitle: XCOM® 2\r\nGenre: Strategy\r\nDeveloper: Firaxis\r\nPublisher: 2K\r\nRelease Date: Feb 4, 2016\r\n\r\nAbout This Game\r\nXCOM 2 is the sequel to XCOM: Enemy Unknown, the 2012 award-winning strategy game of the year. \r\n\r\nEarth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future for humanity on the surface, while concealing a sinister agenda and eliminating all who dissent from their new order. \r\n\r\nOnly those who live at the edges of the world have a margin of freedom. Here, a force gathers once again to stand up for humanity. Always on the run, and facing impossible odds, the remnant XCOM forces must find a way to ignite a global resistance, and eliminate the alien threat once and for all. \r\n\r\nXCOM ON THE RUN: Take command of the Avenger, an alien supply craft converted to XCOM’s mobile headquarters. New open-ended gameplay lets you decide where to guide your strike team, how to grow popular support, and when to combat enemy counter-operations. \r\nRECRUIT RESISTANCE FIGHTERS: Five soldier classes, each with its own skill tree, let you create specific soldiers for your tactical plan. \r\nTACTICAL GUERRILLA COMBAT: New gameplay systems offer more tactical flexibility in combat. Use concealment to ambush enemy patrols. Loot enemies for precious gear and artifacts. Rescue VIPs and save fallen comrades by carrying them to the extraction point. \r\nA NEW BREED OF ENEMY: A diverse cast of enemies from powerful new alien species to the ADVENT, enforcers of the alien regime, offer a distinct tactical challenge. \r\nRESEARCH, DEVELOP AND UPGRADE: Configure and build rooms on the Avenger to give XCOM new capabilities on the battlefield. Use your Scientists and Engineers to research, develop and upgrade weapons and armor to fit your preferred tactics. \r\nEACH MISSION IS A UNIQUE CHALLENGE: Go on missions around the world, from wildlands to the heart of the alien-controlled megacities, to the depths of alien installations. There are virtually infinite combinations of maps, missions and goals. \r\nCREATE CUSTOM MODS: Community-focused tools allow you to create your own campaign, tactical gameplay, aliens, classes, strategy game features, and share within the Steam Workshop. \r\nENGAGE IN HEAD-TO-HEAD MULTIPLAYER: Mix-and-match squads of humans and aliens and battle head-to-head on randomly-generated maps.\r\n\r\nSystem Requirements\r\nMINIMUM: \r\nOS: Windows® 7, 64-bit \r\nProcessor: Intel Core 2 Duo E4700 2.6 GHz or AMD Phenom 9950 Quad Core 2.6 GHz \r\nMemory: 4 GB RAM \r\nGraphics: 1GB ATI Radeon HD 5770, 1GB NVIDIA GeForce GTX 460 or better \r\nDirectX: Version 11 \r\nStorage: 45 GB available space \r\nSound Card: DirectX compatible sound card \r\n\r\nECOMMENDED: \r\nOS: Windows® 7, 64-bit \r\nProcessor: 3GHz Quad Core \r\nMemory: 8 GB RAM \r\nGraphics: 2GB ATI Radeon HD 7970, 2GB NVIDIA GeForce GTX 770 or better \r\nStorage: 45 GB available space \r\nSound Card: DirectX compatible sound card","torrent":{"xt":"urn:btih:f2b9f95cea041f4a25e59420ae2af97a6a94a952","amp;dn":"XCOM.2.Steam.Preload-3DM","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2b9f95cea041f4a25e59420ae2af97a6a94a952","infoHashBuffer":{"type":"Buffer","data":[242,185,249,92,234,4,31,74,37,229,148,32,174,42,249,122,106,148,169,82]},"announce":[],"urlList":[]}}