{"title":"La logica oculta de la vida[ebook].","uid":6001318,"size":1891279,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f309db5318500f6f073cd0e75bc2480bf7ff6036&amp;dn=La+logica+oculta+de+la+vida%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zurera","files":-1,"time":1291192234,"description":"El autor se sirve de los principios econÃƒÂ³micos para explicar la lÃƒÂ³gica que subyace en las decisiones humanas, incluso en las que a simple vista parecen mÃƒÂ¡s descabelladas o irracionales. Ninguna actividad escapa al ojo detectivesco de Hardford y lo mismo indaga los motivos por los que en nuestros dÃƒÂ­as prolifera el sexo oral entre los adolescentes, o por quÃƒÂ© las prostitutas mexicanas asumen grandes riesgos al no exigir a sus clientes que usen preservativo. Ã‚Â¿Puede ser racional el racismo? Vivir en el campo no es tan ecolÃƒÂ³gico como hacerlo en la ciudad. En la ciudad los desplazamientos son mÃƒÂ¡s cortos, se pueden utilizar medios de transporte colectivos, se puede hacer la compra en lugares mucho mÃƒÂ¡s cercanos a casa. En las ciudades, por otra parte, hay muchas mÃƒÂ¡s personas de las que se puede aprender.\n\n\n\nLeyendo este libro se puede aprender incluso a jugar al pÃƒÂ³ker, ya que desvela los motivos por los que conviene hacer faroles. La vida real es un juego en que hay que marcarse faroles y tratar de averiguar quÃƒÂ© es lo que el otro piensa que vamos a hacer. Von Naumann, autor de la teorÃƒÂ­a de los juegos, en la que supone que los demÃƒÂ¡s son genios tambiÃƒÂ©n, y Schelling, que mediante lo que vino a llamar egonomÃƒÂ­a, desarrollÃƒÂ³ la adicciÃƒÂ³n como una guerra civil mental, aparecen continuamente en la obra.\n\nEn el amor tambiÃƒÂ©n rige la ley de la oferta y la demanda. La racionalidad explica el aumento del nÃƒÂºmero de mujeres cultas y preparadas. Y tambiÃƒÂ©n el del auge de los divorcios.\n\nLa economÃƒÂ­a puede intentar explicar tambiÃƒÂ©n por quÃƒÂ© desaparecieron los neandertales, siendo asÃƒÂ­ que probablemente eran mÃƒÂ¡s inteligentes, fuertes y resistentes que nuestros antepasados.\n\nLas instituciones polÃƒÂ­ticas de Nueva Zelanda, CanadÃƒÂ¡, Estados Unidos y Australia estaban diseÃƒÂ±adas segÃƒÂºn el modelo inglÃƒÂ©s, con respeto por la ley y la propiedad privada. Cuando se independizaron siguieron con ese modelo. En cambio, en las colonias regÃƒÂ­an otros principios muy diferentes, encaminados a explotar los recursos en beneficio de unos pocos. Sistemas que persisten despuÃƒÂ©s de que hayan conseguido la independencia.\n\nVicente Torres","torrent":{"xt":"urn:btih:f309db5318500f6f073cd0e75bc2480bf7ff6036","amp;dn":"La+logica+oculta+de+la+vida%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f309db5318500f6f073cd0e75bc2480bf7ff6036","infoHashBuffer":{"type":"Buffer","data":[243,9,219,83,24,80,15,111,7,60,208,231,91,194,72,11,247,255,96,54]},"announce":[],"urlList":[]}}