{"title":"Transformers Prime - 104 - Darkness Rising, Part 4 {C_P}","uid":6007468,"size":182193261,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f3245a1b98f835e8defbb3f76c71357f8212a86c&amp;dn=Transformers+Prime+-+104+-+Darkness+Rising%2C+Part+4+%7BC_P%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"despo1ler","files":-1,"time":1291365979,"description":"[URL=http://img269.imageshack.us/my.php?image=transformersprimelogo.jpg][IMG]http://img269.imageshack.us/img269/295/transformersprimelogo.jpg[/IMG][/URL]\n\n\n[URL=http://img547.imageshack.us/my.php?image=transformersoptimusprim.jpg][IMG]http://img547.imageshack.us/img547/694/transformersoptimusprim.jpg[/IMG][/URL]\n\nTransformers: Prime is an original computer-animated series by and on The Hub (Hasbro's new joint venture with Discovery Communications), in the U.S. The series broadcast its first two episodes on Friday, November 26, 2010, at 4:00pm Eastern/3:00pm Central on The Hub television network, as a special preview. It broadcast officially on Monday, November 29, 2010, at 6:30pm Eastern/5:30pm Central. In February 2011 the series will air new episodes (the rest of season 1).There will be toys of these guys, stop asking!\n\n\n\nStory\n \nTeam Prime live on Earth as a pre-emptive measure against the return of the Decepticons, forming an alliance with three teens as Megatron returns having discovered a rare element that grants him rule of life itself. The show delves into what it is to be a Prime, and though in continuity with Exodus and War for Cybertron, its Earth-bound backstory is reminiscent of the live-action film series.\n\n\n\nEpisode Cast (in credits order) \n\n Peter Cullen ...  Optimus Prime (voice) \n\n Frank Welker ...  Megatron / Zombie Cliffjumper (voice) \n\n Steve Blum ...  Starscream (voice) \n\n Jeffrey Combs ...  Ratchet (voice) \n\n Sumalee Montano ...  Arcee (voice) \n\n Kevin Michael Richardson ...  Bulkhead (voice) \n\n Tania Gunadi ...  Miko Nakadai (voice) \n\n Ernie Hudson ...  Agent Fowler (voice) \n\n Josh Keaton ...  Jack Darby (voice) \n\n Andy Pessoa ...  Rafael 'Raf' Esquivel (voice) \n\n Markie Post ...  June Darby (voice) \n\n\n              ===== File Info  ===== \nFileSize           : 173M\nPlayTime           : 00:21:28.288\nVideoCount         : 1\nAudioCount         : 1\n              ===== Video Info ===== \nVideo 0# Stream\nVideoCodec         : DX50\nVideoWidth         : 640 pixels\nVideoHeight        : 360 pixels\nVideoFrameRate     : 23.976fps\nVideoFrameCount    : 30888\nVideoBitRate       : 0\n              ===== Audio Info ===== \nAudio 0# Stream\nAudioCodec         : MP3\nAudioBitRate       : 128000\nAudioChannels      : 2\nAudioSampleRate    : 48000\n\n\nCharacters\n\n Autobots\n\nOptimus Prime: Leader of the Autobots. Transforms into a red semi-trailer truck. It was also shown in the &quot;Introducing The Hub&quot; commercial that Optimus Prime has a mouth feature, like in Transformers Animated and the live action films, but Prime can also access a mouth plate feature as seen in most of the pictures on the internet.\n\nArcee: A female Autobot. Transforms into a blue motorcycle. Arcee is the smallest and most agile of the Autobot team. Acts as vice commander of the team.\n\nBumblebee: Transforms into a camaro similar to the live action movie except with an engine block in the hood. As in the live action movies, Bumblebee communicates through electronic sound effects rather than specific human languages.\n\nRatchet: Team medic. Transforms into a hybrid medical truck. His appearance and attitude is similar to his Transformers Animated character.\n\nBulkhead: Transforms into a giant green ATV. Like Ratchet, Bulkhead's appearance is similar to the Transformers Animated character.\n\nCliffjumper: Transforms into a red Dodge Challenger, killed off in the first episode with his body used in testing Dark Energon.\n\nDecepticons\n\nMegatron: Leader of the Decepticons, transforms into a Cybertronian jet, similar the live action version. He believes that Earth-style forms are beneath him and attempts to utilize the Dark Energon he acquired from his time in space to end these &quot;War Charades&quot; with the Autobots in his favor.\n\nStarscream: Transforms into a silver gray a F-16 Fighting Falcon-like fighter. He is colored silver instead of the frequently used red and blue. Starscream shows respect for his commander, but waits for a chance to kill Megatron and take over leadership of the Decepticons.\n\nSoundwave: Transforms into a blue MQ-9 Reaper-type aircraft. His arms become the wings, resulting in them becoming very thin. According to his bio, he can use &quot;deployers&quot; that come out from his chest along with mechanical tentacles. Soundwave's robotic appearance is similar to Jetstorm from Beast Machines.\n\nRatbat: (no info atm)\n\nEradicons: Troops (also known as drones) who serve as foot soldiers for the Decepticons. They transform into purple muscle cars.\n\n Others\n\nUnicron: Only mentioned in the series so far, this is also where the Dark Energon Megatron uses eminates from. Dark Energon can revive the dead.\n[edit] Humans\n\nJackson &quot;Jack&quot; Darby: a 16 year old boy who accidentally encounters Arcee in her motorcycle form and enters into the Transformer War as a strong ally.\n\nMiko Nakadai: Miko's last name is Nakadai, but at Comic Con 2010, it said that Miko's last name was Tezuka. 15 year old female Japanese exchange student who seeks to be &quot;in on the action&quot; after seeing Arcee. Later shows mechnical aptitude.\n\nRafael &quot;Raf&quot; Esquivel: A very young computer whiz who is able to provide Ratchet the technical support for human technical devices that Ratchet cannot develop. Ratchet comes to respect Raf rather than a &quot;fleshy&quot;, becoming actual friend who actively support each other in later episodes. Seems to be the only one who understands Bumblebee.\n\nSpecial Agent Fowler: The Autobots' liaison to the outside world who only visits when there are &quot;issues&quot; like that of the Autobots failing to keep their fight with the Decepticons off the radar.\n\nJune Darby: Jack's mother.\n\n","torrent":{"xt":"urn:btih:f3245a1b98f835e8defbb3f76c71357f8212a86c","amp;dn":"Transformers+Prime+-+104+-+Darkness+Rising%2C+Part+4+%7BC_P%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3245a1b98f835e8defbb3f76c71357f8212a86c","infoHashBuffer":{"type":"Buffer","data":[243,36,90,27,152,248,53,232,222,251,179,247,108,113,53,127,130,18,168,108]},"announce":[],"urlList":[]}}