{"title":"Carter_Chris-One_by_One.epub","uid":8978321,"size":455635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f360a4b5997225581faa17ba70db04b1ce0f57fe&amp;dn=Carter_Chris-One_by_One.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1380494696,"description":"I need your help, Detective. Fire or water?'\nDetective Robert Hunter of the LAPD's Homicide Special Section receives an anonymous call asking him to go to a specific web address - a private broadcast. Hunter logs on and a show devised for his eyes only immediately begins.\nBut the caller doesn't want Detective Hunter to just watch, he wants him to participate, and refusal is simply not an option. Forced to make a sickening choice, Hunter must sit and watch as an unidentified victim is tortured and murdered live over the Internet.\n\nThe LAPD, together with the FBI, use everything at their disposal to electronically trace the transmission down, but this killer is no amateur, and he has covered his tracks from start to finish. And before Hunter and his partner Garcia are even able to get their investigation going, Hunter receives a new phone call.\nA new website address. A new victim. But this time the killer has upgraded his game into a live murder reality show, where anyone can cast the deciding vote.\n'Part comment on our reality TV obsessed society, it's punchy and fast paced' Sunday Mirror\nPraise for Chris Carter:\n'Gripping . . . not for the squeamish' Heat\n'A page turner' Express\n'You will not be able to stop until you have finished' ***** Crimesquad","torrent":{"xt":"urn:btih:f360a4b5997225581faa17ba70db04b1ce0f57fe","amp;dn":"Carter_Chris-One_by_One.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f360a4b5997225581faa17ba70db04b1ce0f57fe","infoHashBuffer":{"type":"Buffer","data":[243,96,164,181,153,114,37,88,31,170,23,186,112,219,4,177,206,15,87,254]},"announce":[],"urlList":[]}}