{"title":"Addicted to Unhappiness : Free yourself from moods","uid":8607883,"size":3934818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f37154810af9121030d6d0c75a0c85618838749f&amp;dn=Addicted+to+Unhappiness+%3A+Free+yourself+from+moods&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1372066194,"description":" Martha Pieper, William Pieper, &quot;Addicted to Unhappiness : Free yourself from moods and behaviors that undermine relationships, work, and the life you want&quot;\n2004 | ISBN-10: 0071433694, 0071385495 | 256 pages | PDF | 3,8 MB\n\nIf you have difficulty keeping resolutions, fight with those you care about, are in the power of substance abuse, or find it hard to rebound emotionally from upsetting events, you may be suffering from an addiction to unhappiness. Fortunately, the power to improve the most meaningful aspects of your life always remains in your own hands with Addicted to Unhappiness as your guide.\n\nLike so many others who struggle to better their lives, you have probably made repeated attempts at improvement that never resulted in lasting change. Best-selling author team Martha Heineman Pieper, Ph.D. and William J. Pieper, M.D. apply their years of psychotherapeutic work with children, adolescents, and adults to show you that before you can live the life you want it helps to recognize and understand the internal struggles that stand in your way. You'll discover how to overcome your addiction and achieve a stable sense of inner balance and happiness.\nBoth optimistic and realistic, Addicted to Unhappiness focuses equally on effective strategies for positive change and on combating the forces that oppose self-improvement. The authors guide you through getting started I(even when you don't feel like it), coping with episodes of backsliding, keeping your resolve when it starts to evaporate, and thinking of yourself as a recovering addict to unhappiness.\n","torrent":{"xt":"urn:btih:f37154810af9121030d6d0c75a0c85618838749f","amp;dn":"Addicted+to+Unhappiness+%3A+Free+yourself+from+moods","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37154810af9121030d6d0c75a0c85618838749f","infoHashBuffer":{"type":"Buffer","data":[243,113,84,129,10,249,18,16,48,214,208,199,90,12,133,97,136,56,116,159]},"announce":[],"urlList":[]}}