{"title":"Morrowind game of the year perfect edition NTSC USA XBOX","uid":3989417,"size":997014558,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f3f035a41656b904c44c1cdc9c3316a47086f9aa&amp;dn=Morrowind+game+of+the+year+perfect+edition+NTSC+USA+XBOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"UberChar","files":21,"time":1200969667,"description":"Morrowind Game of the Year Xbox Perfect Edition:\n(sorry for not spending hours creating ASCII Art)\n\nREAD THIS! I know it&amp;#039;s lengty, but for Christ sake at least skim it\n--------------------------------------------------------------------\n\nThis upload is the result of over a year of testing, researching, downloading,\nconverting files and scoring this game with a worthy\nsoundtrack.\n\nI will list most of the things added as well as notes and\nannotations appropriate to each one. But first...I will \ngive thanks to the many modders and people that have helped this lengty and ardous\nproject come to fruition.\n\nMost people thank at the end, but not me. These people are important\nand deserve recognition:\n\nI&amp;#039;m sorry I can&amp;#039;t thank everyone individually, but my way of thanks is this pack!\n\nJohnny evil - has a website of tons of xbox converted MORROWIND MODS\n\nFrezzno and Badboy from X-box sky - I used some of their stuff\nand they also gave me the idea.\n\nBethesda Softworks - How could I not thank them?\n\npeople are planetelderscrolls - all the various modders, whose mods I&amp;#039;ve tested\nI don&amp;#039;t have room to include all their names, but I thank them all and you should too!\n\nComposers that have made the music I&amp;#039;ve included - too many to name\n\nThank me if you have the time - I&amp;#039;ve spent over a year on this, and the better part\nof the last 6 hours, writing the FAQ, updating the mods, adding new music and uploading this!\n\nAnd lastly, I thank all of you for keeping this going and downloading this pack\n\n\nSoundtrack:\n--------------\nconsists of;\n\nMost of the music from Oblivion, converted by me, to wma format\n\nseveral &quot;good&quot; orchestral video game songs\n\na few LOTR selections and some of the original Morrowind Music\n\nSelections from Kingdom of Heaven and Batman Begins\n\nTwo great themes from Chronicles of Narnia - They fit so well into the game it will \nmake you cry like a little girl\n\n\nWARNING****  I have disabled certain mods for stability reasons, I have left them in the date folder,\nenable them, however, at your own risk. Some are okay to use after the main quest is done. The Ultimate\nGalleon is one of them. Some of the others should just stay disabled.\n\nMod Listing:\n\nARMOR, CLOTHING:\n----------------\n\nNetch Adamantium Armor: Check out the Inn in Peliagad\n\nRenaissance clothing: Go to Suran\n\nDragonscale Armor: \t\n\nThe Tsaesci Dragonscale Armour is one of the rarest sets of armour in existence. It was forged from the scales of black dragons during their destruction in Akavir and the metal adamantium by an unknown dragon hunter.\n\nYou can find the armour and longbow in a locked chest with a lock rating of 100 in Balmora. The chest itself is being cared for by the imperial spymaster who resides in Balmora.\n\nNinja Outfits: Purchase in Molag Mar\n\nYmdrisl: The armour is currently lying on the crates on the raised platform at the silt strider port in Gnisis with the shield and a few weapons, the other sets are near the temple as are the rest of the weapons.\n\nSPELLS:\n----------------\n\nScripted Spells: allows you to turn into animals as well as a few\nother nice spell;) HINT* buy from merchant in Vivec Mage Guild*** SEE ADDITIONAL \nREADME BELOW____ NOTE* I have tested this extensively and it runs very well, just don&amp;#039;t \ndo too many crazy things at once. Like spawn 100 skeletons and turn into a bat and fly around...\nYEs I have done this :)\n\nSCRIPTED SPELLS\nVersion    1.5\nRequires   Bloodmoon\nAuthor     Cortex\nBat Model  Lady Eternity\t\n\nTransform into creatures that can be seen in 3rd person view.\nSteal spells from enemies minds.\nAdd explosive damage to your attacks.\nCreate walls of fire and animated bones.\n\nGame balanced: Great care has been taken to ensure spells cost enough magicka for their power. Transformations disable hand held weapon use and most spellcasting. Wall spells require strategy to be effective. Stealing spells is a crime unless they attacked you first.\n\nThis mod adds new spells created through scripting and new npc&amp;#039;s who sell them.\n\n\nLOCATION OF NPCS\n----------------\nMages guild         - Ald-ruhn mages guild\nTelvanni            - Sadrith Mora (she is outside shopping at the market)\nVampire Clan Aundae - Clan Aundae headquarters near their leader\nVampire Clan Berne  - Clan Berne headquarters near their leader\nVampire Clan Quarra - Clan Quarra headquarters near their leader\nVampire             - Pelagiad Halfway Tavern during night time hours\n\nThe mortal NPC&amp;#039;s teach you if you are a member of their faction.\nThe clan vampire NPC&amp;#039;s teach you after you have done the first quest of their clan.\nThe non clan vampire teaches vampires after you have done a small quest for her.\n\n\n*****************************************************************\n\nTRANSFORMATION SPELLS\n---------------------\nThe metamorphosis spells lasts 60 seconds.\nThe form spells are permanent until you cancel them.\nThis means you could fly all the way to Solsheim with a single casting of bat form.\nYou can cancel the transformation by casting the Cancel Transformation spell\nwhich requires no magicka.\nLow cost vampire versions of the bat, mist and wolf spells exist from vampire npc&amp;#039;s.\nWerewolfs receive low cost werewolf versions of black, brown, white wolf spells when they\nfirst cast the normal version of that spell.\n\n\nCREATURE                    SPECIAL ABILITIES\n--------                    -----------------\nAlit                        Good jumper +50% acrobatics, good bite damage\nBat                         Flys fast and long distances. No attack\nBear (grizzly)              +60 strength, high damage\nBear (cave)                 +80 strength, high damage\nBear (polar)                +100 strength, high damage\nBoar                        Fast runner, Very powerful charge (thrust) attack\nCliffracer                  Flys and can also attack (use 1st person mode to attack)\nGuar (wild)                 Massive carrying capacity\nGuar (pack)                 Slower but even more carrying capacity\nGuar (white)                Massive carrying capacity\nKagouti                     Large carrying capacity, good charge (thrust) damage\nKwama forager               Small size\nKwama warrior\nMist                        Fly, 100% imunity normal weapons, 50% chameleon, No attack\nMudcrab                     Can breath both air and water but very slow\nNixhound                    Good speed for low magicka cost\nRat                         Small size\nReikling riding a boar      Fast runner, fast Very powerful charge (thrust) attack\nScamp                       Resist shock 50%, poison 75%, frost 50%, fire 50%\nScrib                       Small size\nSlaughterfish               Breaths water but has difficulty on land\nWolf (black)                Fast and tireless runner with a very fast bite\nwolf (brown)                Same as a black wolf\nwolf (white)                Same as a black wolf\nwolf (hell hound)           Deadly fast fire bite and imune to fire\nwolf (dire wolf)            Deadly fast shock bite and imune to shock\nwolf (winter wolf)          Deadly fast frost bite and imune to frost\n\nNatural weapons attacks like bite use the handtohand combat skill:\nIt may seem to use the shortblade skill but actually it is the hand to hand\nskill that is used and increased. This is how it works:\nWhen you transform, your handtohand skill is copied into your shortblade skill.\nAny increases in skill are applied to your handtohand skill.\nWhen you transform back your shortblade skill returns to its old value.\n\n\n*****************************************************************\n\nSPELL STEALING SPELLS\n---------------------\nThese rip spells from the minds of your enemies teaching them to you.\nThis causes permanent brain damage to your victim and saves you money.\nEach spell has touch range.\n\nTo use these, cast the spell on the npc, wait about 1 second for them to be\naffected by the spell, then press spacebar on the npc within the 5 seconds duration\nof the spell.\n\nThey consider it an attack for all these spells except the passive brain scan.\n\nCrimes:\nIf someone spots you useing these spells they can report the following crimes:\nAssault - Using any of these spells (except passive brain scan) unless the target\n          attacked you first.\nTheft   - Stealing spells unless the target attacked you first.\n\nOnce their brain has become too badly damaged you will no longer be able to\naccess any more of their spells.\n\nOccasionally during a combat a target may become too angry for mind rips to work\non them.\nWhen this happens the message &quot;This characture is in combat&quot; will appear.\nIf this happens, waiting for 3 days will reset their fight setting so you can try again.\n\nThese spells were invented by the arch lich Zahnodram who was rumored to keep\nwizards alive for days in his dungeons contineously stealing their spells and\nthen healing their minds with restoration magics.\n\nBrain Scan (active)        - Allows you to check what spells they have.\nBrain scan (passive)       - As active scan but they dont consider it an attack.\nMind rip I                 - Steal spells up to a total value of 100 gold.\nMind rip II                - Steal spells total value 200 gold\nMind rip III               - Steal spells total value 400 gold\nMind rip IV                - Steal spells total value 800 gold\nMind rip V                 - Steal spells total value 1600 gold\nMind rip VI                - Steal spells total value 3200 gold\n\n\n******************************************************************\n\nEXPLOSIVE STRIKE SPELLS\n-----------------------\nThese last 60 seconds.\nEach attack you make with a weapon or hand to hand causes an explosion.\nThese spells are designed to be used together.\nIf you cast all of them there isn&amp;#039;t much that can withstand your attacks.\nExplosive strike spells do NOT yet work while you are transformed.\n\nExplosive Strike - Fire       Explosion of 1-20 fire damage\nExplosive Strike - Frost      Explosion of 1-20 frost damage\nExplosive Strike - paralysis  Explosion of 1 second paralysis\nExplosive Strike - poison     Explosion of 1-20 poison damage\nExplosive Strike - Shock      Explosion of 1-20 shock damage\n\n\n****************************************************************\n\nWALL SPELLS\n-----------\nEach type of wall comes in 5 ranks, so a rank 5 wall of fire does 100 damage per second.\n\nWall Range                   Allows you to set the distance walls will be created\n                             from you.\n\nWalls of fire                Damage (20 x rank)\n                             Duration 60 seconds\n\nWalls of ice                 *** WALLS OF ICE ARE NOT IN CURRENT RELEASE ***\n                             Health (100 x rank) for each block of ice\n                             lose one health per second.\n                             Take double damage from fire.\n                             Enemies will attack them to get to you.\n\nWalls of bone                Health (20 x rank) for each skeleton\n                             Damage (1 to 4) x rank\n                             Duration 60 seconds\n                             This means a rank 1 wall skeleton is half as powerful\n                             as a normal summoned skeleton.\n                             A rank 2 is equal to a normal summoned skeleton.\n                             A rank 5 is two and a half times as powerful\n                             as summoned skeleton.\n\n*****************************************************************\n\nCOMPLETE LISTING OF ALL SPELLS\n------------------------------\nSPELL NAME                      MAGICKA COST        DURATION\n\nCancel Transformation             0                 Instant\nAlit Metamorphosis               25                 60\nAlit Form                        50                 Unlimited\nBat Metamorphosis                40                 60\nBat Form                         80                 Unlimited\nBear (Grizzly) Metamorphosis     60                 60\nBear (Grizzly) Form             120                 Unlimited\nBear (Cave) Metamorphosis        80                 60\nBear (Cave) Form                160                 Unlimited\nBear (Polar) Metamorphosis      100                 60\nBear (Polar) Form               200                 Unlimited\nBoar Metamorphosis               60                 60\nBoar Form                       120                 Unlimited\nCliffracer Metamorphosis         50                 60\nCliffracer Form                 100                 Unlimited\nGuar (wild) Metamorphosis        25                 60\nGuar (wild) Form                 50                 Unlimited\nGuar (pack) Metamorphosis        25                 60\nGuar (pack) Form                 50                 Unlimited\nGuar (white) Metamorphosis       25                 60\nGuar (white) Form                50                 Unlimited\nKagouti Metamorphosis            30                 60\nKagouti Form                     60                 Unlimited\nKwama forager Metamorphosis      15                 60\nKwama forager Form               30                 Unlimited\nKwama warrior Metamorphosis      25                 60\nKwama warrior Form               50                 Unlimited\nMist Metamorphosis               50                 60\nMist Form                       100                 Unlimited\nMudcrab Metamorphosis            10                 60\nMudcrab Form                     20                 Unlimited\nNixhound Metamorphosis           15                 60\nNixhound Form                    30                 Unlimited\nRat Metamorphosis                15                 60\nRat Form                         30                 Unlimited\nReikling Boar Metamorphosis     100                 60\nReikling Form                   200                 Unlimited\nScamp Metamorphosis              40                 60\nScamp Form                       80                 Unlimited\nScrib Metamorphosis              10                 60\nScrib Form                       20                 Unlimited\nSlaughterfish Metamorphosis      30                 60\nSlaughterfish Form               60                 Unlimited\nWolf (Black) Metamorphosis       40                 60\nWolf (Black) Form                80                 Unlimited\nWolf (Brown) Metamorphosis       40                 60\nWolf (Brown) Form                80                 Unlimited\nWolf (White) Metamorphosis       40                 60\nWolf (White) Form                80                 Unlimited\nWolf (Hell Hound) Metamorphosis  80                 60\nWolf (Hell Hound) Form          160                 Unlimited\nWolf (Dire) Metamorphosis        80                 60\nWolf (Dire) Form                160                 Unlimited\nWolf (Winter) Metamorphosis      80                 60\nWolf (Winter) Form              160                 Unlimited\n\nVampire Bat Metamorphosis        20                 60\nVampire Bat Form                 40                 Unlimited\nVampire Mist Metamorphosis       25                 60\nVampire Mist Form                50                 Unlimited\nVampire Black Wolf Metamorph     20                 60\nVampire Black Wolf Form          40                 Unlimited\nVampire Brown Wolf Metamorph     20                 60\nVampire Brown Wolf Form          40                 Unlimited\nVampire White Wolf Metamorph     20                 60\nVampire White Wolf Form          40                 Unlimited\nVampire Charm Mortal            112                 30\nVampire Flight                   22                 30\n\nWerewolf Black Wolf Metamorph    20                 60\nWerewolf Black Wolf Form         40                 Unlimited\nWerewolf Brown Wolf Metamorph    20                 60\nWerewolf Brown Wolf Form         40                 Unlimited\nWerewolf White Wolf Metamorph    20                 60\nWerewolf White Wolf Form         40                 Unlimited\n\nWall Range                        0                 Until changed\nWall of Fire I                   40                 60\nWall of Fire II                  80                 60\nWall of Fire III                120                 60\nWall of Fire IV                 160                 60\nWall of Fire V                  200                 60\nWall of Bones I                  40                 60\nWall of Bones II                 80                 60\nWall of Bones III               120                 60\nWall of Bones IV                160                 60\nWall of Bones V                 200                 60\n\nBrain Scan (active)              20                  5 plus dialog\nBrain scan (passive)             40                  5 plus dialog\nMind Rip I                       40                  5 plus dialog\nMind Rip II                      80                  5 plus dialog\nMind Rip III                    120                  5 plus dialog\nMind Rip IV                     160                  5 plus dialog\nMind Rip V                      200                  5 plus dialog\nMind Rip VI                     240                  5 plus dialog\n\nExplosive Strike - Fire          40                 60\nExplosive Strike - Frost         40                 60\nExplosive Strike - Paralysis     60                 60\nExplosive Strike - Poison        40                 60\nExplosive Strike - Shock         40                 60\nExplosive Strike - Fire          40                 60\n\n\n\nThe vampire transformations are the same as the mortal versions except they\ncost half the amount of magicka and automatically succeed. This is because vampires\nare better at changing into bats, mist and wolves than mortals.\n\nAs in daggerfall, Vampire charm mortal and vampire flight are low cost versions of\nthe standard mortal spells charm mortal and levitate.\nAs it is flight not levitate, the vampire version doesnt give a purple glow.\n\nThe werewolf transformations are the same as the mortal versions except they\ncost half the amount of magicka and automatically succeed. This is because werewolfs\nare better at changing into wolves than mortals.\n\n****************************************************************\n\nKNOWN ISSUES\n------------\n1. It is very hard to fight in 3rd person mode if transformed into a large creature\n   like a guar, bear or cliffracer. I lower the model in combat to try to make it easier.\n2. Many transformations are best used outside as they are too clumsy for\n   easy indoors movement unless in 1st person mode.\n3. Any transformation may jump in and out when in 3rd person mode if you\n   have a very slow framerate. Slow framerates may be due to a low end\n   machine, or may be due to another mod that attempts to do too much each frame.\n\n\n\n\n\n\nGRAPHICAL AND GAME IMPROVEMENTS:\n-----------------------\n\nBetter Heads Xbox Edition\n\nBetter Bodies Xbox Edition\n\nIncreased Hair Style Selections: Converted by me, adds more hairstyles \nfor all races\n\nMorrowind Anti-cities mod - gets rid of some rocks and other things \nto improve game performance, disable if it causes issues\n\nRoad Signs: Show real City Names now\n\nNew Textures: Smaller filesize = better framerate\n\nNew xbox loading screens! - Much nicer on the eyes\n\nAbot Where are all the Birds going? - Adds birds to Morrowind! \nTested and converted by me, created by Abot, works great!\n\nSeyda Neen Dialogue - Couldn&amp;#039;t get this to work in other cities, but check out the new\ndialogue in Seyda Neen, this wasn&amp;#039;t created by me, but it&amp;#039;s a damn fine mod. \n\n\nCHEATS, OTHER:\n--------------\nWerewolf Ring: Allows you to become a werewolf at will. Hint\nlook on plate in Vivec Mage Guild dining room. Will transform you\nfor 24 hours into a werewolf.\n\nCheat Ring and other Cheat Items: Check closet, downstairs in Balmora \nMage Guild - to activate press A button and then the B button - contains a house!\n\nArrow Belts-\tThis mod adds four belts to the enchanter in Ald-ruhn, Manor district. \nWhen you equip the belts they summon arrows and equip them whenever you run out. \nThere are three types of belts; Belt of Arrows (normal arrows), Belt of Burning Arrows \n(fire damage and weakness to fire), Belt of Stunning Arrows (paralize), and Belt of Poison Arrows (poison). \nI tried my best to not make this a cheat mod. The arrows are not worth anything, so you cannot make money from \nsummoning hordes of arrows. The belts are worth a good amount of money, too. These arrows are not EXTREMELY powerful, \nbut will give you a little more power in battle.\n\nBOOKS:\n------\n\nShakti&amp;#039;s Book of Secrets: Buy in Balmora Bookstore, a great comprehensive\ngame guide\n\nAlchemy Guide: Look on podium in Balmora Mage Guild Basement\n\n20 new books: featuring the work of H. P. Lovecraft, Lord Dunsany, \nthe brothers Grimm, Lewis Carroll and many more\nCheck in with Dorisa Darvel, the bookseller in Balmora, for the lighter fare. \nVisit Jobasha, the rare book dealer located in the Vivec foreign quarter, for the meatier stuff.\nMost of the books will improve your speechcraft skill - some will increase other skills. \nA few will even hold enchantments. Hope you have fun with them!\n\nHOMES:\n------\n\nA Good Place to stay - cove in Balmora near Temple\n\nCave Home - A cave high about Caius Cosade&amp;#039;s house\n\nCottage - Near Ebonhart on the road to Vivec\n\nWEAPONS:\n--------\n\nClaws - Balmora Armoror\n\nFrezno&amp;#039;s Buster Sword - Raiivir Trader in Balmora, \nlook on bed\n\nAutofire crossbow - Check out shop in Balmora near Silt Strider\n\nYmdrisl - See Armor Section\n\nLANDMASS:\n---------\n\nCheck out new waterfall near Balmora, very pretty ;)\n\nNew bridge from Solsteim to Mainland - Secret Location\nshould try to find when levels are high;) \nNOTE: This bridge has a lot of enemies and may affect game performance\ndisable if need be.\n\nTRANSPORTATION:\n---------------\n\nBalloon Transportation - Gnisis, Ald Velothi and Ghostgate\n\nINFORMATION AND WARNINGS SECTION:\n\n-------------------------------------\nREAD THIS, IMPORTANT!\n\nQUEST PROBLEMS: \n\nIf you can&amp;#039;t get out of the Census Office, or if you can, \nbut can&amp;#039;t get your quest from Old man Caius Cosades in Balmora, relax...\nThis is a common error, disable, not delete, disable a few mods and try again.\nYes it can be time consuming, but I&amp;#039;ve done it for hours and days. \nThis pack is pretested to not get quest errors, but if it does, just troubleshoot.\n\nMINOR GLITCHES:\n\nYeah there might be a few, but if they don&amp;#039;t mess up the game don&amp;#039;t worry, or disable the mod.\n\n\nDIRTY DISC ERROR!\n-----------------\nIf for some reason you get a dirty disc error at some point...\n\nPREVENTION:\n\n1. try to keep save file size low\n2. have backup saves, but delete them periodically\n3. dispose of corpses, try to keep inventory within reason\ni.e; filling your house with tons of schools hit is fun, \nremember the xbox has 64 mb of measly RAM.\n\n1. relax, this is normal\n2. think about disabling intense mods, if you wish\n\nHere&amp;#039;s a better FAQ about this problem from \n\nDIRTY DISC\n-------------------------\n\nIt&amp;#039;s not really dirty, okay.  Get over it. \nIt&amp;#039;s a known bug that plagues Morrowind on XBox.\nThere is no way to stop it, but it can be reduced.\nThis tip also includes reducing the incidence of &amp;#039;freeze&amp;#039; that will \nhappen as your game gets longer and longer.\n\nFirstly, go to your Options menu on the Start Screen and turn \nOFF autosave and shadows. \nThat&amp;#039;s the dirty disc problem half-solved.\nNot to mention the fact that you won&amp;#039;t have to wait forever for \nan autosave to finish every time you sleep.\nBut . . . save, save, save!  It&amp;#039;s now up to you to keep your own\nback-ups with the autosave turned off!\n\nSecondly, don&amp;#039;t try and do too much at once when \nyour game gets lengthy.  By this I mean;\n1] Don&amp;#039;t levitate at high speed while wearing the Boots of Blinding Speed, \nbattling a cliff racer and checking directions from your \ninventory map at the same time!\nI&amp;#039;d freeze too, if someone did that to me!\n\n2] Don&amp;#039;t drop stuff all over the place.  The hard-drive is forced to \nremember where it is forever; if you don&amp;#039;t want it, drop it in a crate \nor sell it to a trader.\n\n3] Don&amp;#039;t move people around un-necessarily.  Sure, it can be fun \nto &amp;#039;command&amp;#039; people onto rooftops or such, but again, the game has \nto remember what you&amp;#039;ve done.\n\n4] Bury your dead!  Not literally, use the &amp;#039;dispose of corpse&amp;#039; option \nas much as you can.  Yes, I know the game cleans up after you, but in the \nthree game days it takes for that to happen, a lot of folk can wind up \ndead, their goods and their bodies cluttering up your save \nlike seagulls at a picnic basket.\n\nBe tidy with the dearly departed.\n\nAt least once every game day, save your game as a &amp;#039;new save&amp;#039;.\nThis helps reset characters that have moved and tidy up your leftovers.\nExit via Start Screen and start again, deleting old game before you load.\nFor more advice check www.elderscrolls.com. \n\n\n\nENJOY!!!!!!!!!!","torrent":{"xt":"urn:btih:f3f035a41656b904c44c1cdc9c3316a47086f9aa","amp;dn":"Morrowind+game+of+the+year+perfect+edition+NTSC+USA+XBOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3f035a41656b904c44c1cdc9c3316a47086f9aa","infoHashBuffer":{"type":"Buffer","data":[243,240,53,164,22,86,185,4,196,76,28,220,156,51,22,164,112,134,249,170]},"announce":[],"urlList":[]}}