{"title":"Dondi White_Life of a Graffiti Artist - White and Witten Non-Fic","uid":8866734,"size":32086691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f45085e950f14822959ec771890bcedcb993de1e&amp;dn=Dondi+White_Life+of+a+Graffiti+Artist+-+White+and+Witten+Non-Fic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":3,"time":1377935075,"description":"&quot;In the beginning, there was the Word. On the streets and in the yards, the word was the Name. And the name was everything. It was persona and place, form and content, truth and fiction. The name was an act of self-invention, a pure visual manifestation, through alter ego, alias, and nom de plume, of personal expressions in the public realm. The name was a line and the line begat the Mark. Then, in the great style wars toward the end of the second millennium, medium, meaning, and message were joined in a golden era where the name became the source and signifier of Style. And when the name became wild style, the word was Dondi.&quot;\n\n-- from the Foreword\n\nThe dominance of the graffiti aesthetic in contemporary culture is undeniable. But how did an art form spawned in the train yards of 1970s New York achieve the ubiquity it now enjoys at every level of the mass-media landscape? There are many answers to the question, but one major factor is indisputable: Dondi White.\n\nComing of age in hardscrabble East New York in the early 1970s, Dondi White unknowingly began the process of introducing a whole new artistic dialect into the cacophony of the American art scene. His train pieces painted from roughly 1977 to 1982 stand as some of the most influential works ever committed to Transit Authority steel. Writing with legendary partners such as DURO, NOC 167, KID 56, KEL 139, and FUZZ ONE, Dondi created some of graffiti art's most enduring iconography. His pieces just don't stop -- and neither do the aliases. From the badass Mr. Whites to the cocky, self-satisfied Busses, from the nasty Pres to the perfect, vicious Rolls, Dondi straight killed it, again and again. Works like Children of the Grave Part 2 and Mr White + Bev remain benchmark pieces for graffiti aficionados the world over.\n\nIn the 1980s, partially through his collaborations with noted photographers Henry Chalfant and Martha Cooper, Dondi White's work entered the rarefied world of fine art. In making the transition from subway car to canvas, Dondi retained his unfaltering sense of letter form and balance, and his paintings remain a testament to the clarity of his aesthetic. Dondi's canvases were subsequently shown in galleries from New York to Amsterdam to Tokyo and beyond, influencing a new generation of young artists and introducing an indigenous American art form to the rest of the world.\n\nDondi White: Style Master General presents the life and work of a seminal -- yet heretofore overlooked -- American artist whose work has resonated on every level of our popular culture. Filled with rare photographs, original sketches, unpublished interview materials, and testimony from some of Dondi's closest cohorts, here, finally, is the full story. At the time of his death in 1998, Dondi had seen the majority of his work destroyed -- scraped off, painted over, or chemically removed from the steel upon which it thrived. Within these pages, however, it still speaks volumes.","torrent":{"xt":"urn:btih:f45085e950f14822959ec771890bcedcb993de1e","amp;dn":"Dondi+White_Life+of+a+Graffiti+Artist+-+White+and+Witten+Non-Fic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f45085e950f14822959ec771890bcedcb993de1e","infoHashBuffer":{"type":"Buffer","data":[244,80,133,233,80,241,72,34,149,158,199,113,137,11,206,220,185,147,222,30]},"announce":[],"urlList":[]}}