{"title":"Wrestling WCW Superstar - Goldberg Who's Next? [VHSrip ENG] TNT","uid":6176937,"size":577579072,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f53ba60492b757293d2acdd7009315675af3f938&amp;dn=Wrestling+WCW+Superstar+-+Goldberg+Who%5C%27s+Next%3F+%5BVHSrip+ENG%5D+TNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"l.diliberto","files":1,"time":1297802751,"description":"Wrestling WCW Superstar - Goldberg Who's Next? [VHSrip ENG] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52487&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=52487&lt;/a&gt;\n\n.: Plot :.\n\nIn this video, part of the WCW Superstar Series which features candid interviews of some of WCW's most recognizable names, talking about some of their greatest matches along with clips of the matches discussed.\n\nThis volume is dedicated to &quot;da man&quot;, the hottest superstar in World Championship Wrestling, Bill Goldberg.\n\nFrom Goldberg's debut in WCW, he was largely a mystery, as Mean Gene Okerlund was unable to get an interview with the powerful Goldberg for several weeks. What was known was that he was big and powerful, destroying Hugh Morrus in his Nitro debut within minutes with the spear, a modified football tackle and his patented finsher, the Jackhammer. Goldberg would later state that it was WCW Power Plant Head Trainer Dwayne Bruce who would give Goldberg the Jackhammer.\n\nA rivalry with former Chicago Bear Steve McMichael was &quot;a natural&quot;, according to Goldberg, since McMichael achieved more success in the NFL than Goldberg, and Goldberg wanted to prove himself the better in wrestling. Despite their rivalry, McMichael is complimentary of the former footballer.\n\nDuring his undefeated streak, Goldberg had a minor feud with Disco Inferno, whose flashy style Goldberg disagreed with. Disco Inferno said that he was just trying to help Goldberg during their feid, since he was &quot;kind of boring&quot; and Disco was just trying to bring the party.\n\nThere may be strength in numbers, but it didn't help Raven's Flock. Lodi felt that Goldberg was &quot;pretty tough&quot;, but that The Flock could take him all at once. When you take on The Flock, however, like their namesake, you take on all of them. Either one at a time, or all at once. Goldberg's feud with The Flock would include wrestling Saturn and utlimately capturing the WCW United States Heavyweight Championship from the leader of The Flock, Raven. Raven, of course, was less than complimentary. Raven swore that next time &quot;the outcome will be different&quot;, and Goldberg will &quot;feel the Even Flow&quot;.\n\nOf course, any major superstar in WCW had to deal with the nWo, and Goldberg was no exception. Konnan would give Goldberg the credit due, but would also question how Goldberg would handle it once he finally lost. Kevin Nash would also compliment Goldberg, but he would also let Goldberg know that as long as he holds the World Championship, he would be a target.\n\nSpeaking of the nWo, Goldberg discusses his greatest moment in WCW--capturing the WCW World Heavyweight Championship live on Nitro in his home state of Georgia from no less a competitor than Hulk Hogan. Hogan would have one other trick up his sleeve, of course, which is to give Goldberg a warm-up match against Scott Hall, someone who Goldberg would continue to have a rivalry with in the future, both on and off-screen.\n\nWhile battle royals might not be Goldberg's specialty, he manages to do just fine at Road Wild 1998, taking out The Giant (The Big Show) last.\n\nExploring the motivations of Goldberg, he is candid about the fact that he does not like to be made fun of, and will destroy all that try to gain attention in such a way. He is also close friends with another former footballer, Kevin Greene, who Goldberg says is one of the few people who he would trust in wrestling. The fans chanting his name also give him extra motivation in the ring.\n\nGoldberg leaves the viewer with a question. Who's next?\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://imagecache2.allposters.com/images/pic/62/040_FP0721~WCW-Goldberg-Who-s-Next-Posters.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imagecache2.allposters.com/images/pic/62/040_FP0721~WCW-Goldberg-Who-s-Next-Posters.jpg&lt;/a&gt;\n\n0=============================0\n\n.: Dati tecnici del ripping :.\n\nDimensione: 550.82 MB\nDurata: 55.09 Min\nVideo Codec: Divx\nVideo Bitrate: 1150 kb/s\nRisoluzione: 352x240\nFPS (Frames/sec): 29.970\nQF (Frame quality): 0.454\nAudio Codec: MP3\nAudio Bitrate:128 Kbps ","torrent":{"xt":"urn:btih:f53ba60492b757293d2acdd7009315675af3f938","amp;dn":"Wrestling+WCW+Superstar+-+Goldberg+Who%5C%27s+Next%3F+%5BVHSrip+ENG%5D+TNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f53ba60492b757293d2acdd7009315675af3f938","infoHashBuffer":{"type":"Buffer","data":[245,59,166,4,146,183,87,41,61,42,205,215,0,147,21,103,90,243,249,56]},"announce":[],"urlList":[]}}