{"title":"You Can't Say That! - David Bernstein","uid":11710106,"size":675045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f56868d60a989bb5562826ad36c621381ca89e61&amp;dn=You+Can%27t+Say+That%21+-+David+Bernstein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1424300224,"description":"\nActivists and courts are using antidiscrimination laws to erode civil liberties such as free speech, the free exercise of religion, and freedom of association. The books examines how these laws are being applied on college campuses and in the workplace in ways that threaten our fundamental freedoms.\n\n\nAbout the author:\n David E. Bernstein is an associate professor at the George Mason University School of Law. He is a graduate of Yale Law School, where he was senior editor of the Yale Law Journal and a John M. Olin Fellow in Law, Economics, and Public Policy. After clerking for Judge David Nelson of the Sixth Circuit Court of Appeals and working as a litigator at Crowell &amp; Moring, he served as a Mellon Foundation Research Fellow at Columbia University School of Law. Professor Bernstein is the author of more than 60 scholarly articles, book chapters, and think tank studies. He is author of Only One Place of Redress: African-Americans, Labor Regulations, and the Courts from Reconstruction to the New Deal (Duke University Press, 2001), coeditor of Phantom Risk: Scientific Inference and the Law (MIT Press, 1993), and coauthor of The New Wigmore: Volume on Expert and Demonstrative Evidence (forthcoming). He has been named one of the most cited professors among those who have entered law teaching since 1992","torrent":{"xt":"urn:btih:f56868d60a989bb5562826ad36c621381ca89e61","amp;dn":"You+Can%27t+Say+That%21+-+David+Bernstein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f56868d60a989bb5562826ad36c621381ca89e61","infoHashBuffer":{"type":"Buffer","data":[245,104,104,214,10,152,155,181,86,40,38,173,54,198,33,56,28,168,158,97]},"announce":[],"urlList":[]}}