{"title":"Anita Baker - Christmas Fantasy","uid":6864779,"size":345905397,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f5d7241c12ad7a42e91ffbe1b130ab4958fa6ab3&amp;dn=Anita+Baker+-+Christmas+Fantasy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1323050877,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51qeiD3mMdL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51qeiD3mMdL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Christmas Fantasy\nArtist: Anita Baker\nAudio CD (October 4, 2005)\nOriginal Release Date: 2005\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n1. Frosty\\'s Rag (Frosty the Snowman)\n2. Christmas Time Is Here\n3. I\\'ll Be Home for Christmas\n4. Christmas Fantasy\n5. God Rest Ye Merry Gentlemen\n6. Moonlight Sleigh Ride\n7. O Come, All Ye Faithful [Feat. The Yellow Jackets]\n8. Family of Man\n9. My Favorite Things\n\n\nAmazon Review:\nLast fall, eight-time Grammy-winning singer Anita Baker returned to the pop music scene after a ten-year hiatus with a gorgeous new album released on Blue Note Records entitled My Everything. After a triumphant year, Baker is back with a brand new holiday album: Christmas Fantasy. Baker arranged all nine tracks with producer Barry Eastmond, and penned three, for this soulful album, which includes such yuletide classics as \\&quot;O, Come All Ye Faithful,\\&quot; \\&quot;I\\'ll be Home For Christmas,\\&quot; and a sweet rendition of \\&quot;Christmas Time is Here\\&quot;.\n\nAllmusic Review:\nHoliday titles live a bit outside an artist\\'s standard discography, but if you look at Christmas Fantasy as a follow-up to the 2004 comeback My Everything, it continues that album\\'s looser feel, less concerned with the charts and all the better because of it. There are only nine tracks on Anita Baker\\'s Christmas Fantasy, but the album still clocks in at 45 minutes, with most tracks letting things comfortably develop past the five-minute mark. Part of the reason for this is the band. With George Duke, Larry Carlton, Joe Sample, the underrated Ricky Lawson, and other top-notch folk involved, it would be a shame not to let these boys play, but as much as they get to vamp, it\\'s still Baker\\'s album, 100 percent. Her increasing love of scat singing finds her interacting with the musicians in cool urbanite fashion, free but neither languid nor shamelessly bold. The exciting Crescent City take on \\&quot;Frosty the Snowman,\\&quot; \\&quot;Frosty\\'s Rag,\\&quot; may be the standout track at first glance, but it\\'s the cool interaction between singer and band on more subdued numbers like \\&quot;O Come, All Ye Faithful\\&quot; with the Yellowjackets and \\&quot;Moonlight Sleighride\\&quot; that makes the album worth returning to each holiday season. With its sparse, nearly haiku lyrics, \\&quot;Moonlight Sleighride\\&quot; is far and away the best of the three original numbers here, with \\&quot;Family of Man\\&quot; finishing second due to its mostly non-holiday lyrics that are clumsily tied to Christmas with a tacked-on final verse. A distant third, \\&quot;Christmas Fantasy\\&quot; feels too forced, but all is forgiven when Baker closes the album with an effervescent \\&quot;My Favorite Things,\\&quot; putting her own spin on a song despite all the \\&quot;definitive\\&quot; versions that have come before. Kudos to Baker for avoiding anything sugary or diva and delivering on the promise she makes in the liner notes. \\&quot;I wanted Mom &amp; Dad to have a recording that we could listen to with a glass of wine after the kids were in bed,\\&quot; she states. Christmas Fantasy is not only that but more evidence Anita Baker\\'s Career, Pt. 2 may be more sumptuous than Pt. 1.","torrent":{"xt":"urn:btih:f5d7241c12ad7a42e91ffbe1b130ab4958fa6ab3","amp;dn":"Anita+Baker+-+Christmas+Fantasy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5d7241c12ad7a42e91ffbe1b130ab4958fa6ab3","infoHashBuffer":{"type":"Buffer","data":[245,215,36,28,18,173,122,66,233,31,251,225,177,48,171,73,88,250,106,179]},"announce":[],"urlList":[]}}