{"title":"El Disco De Alexis Castro #7 Agosto 2014","uid":10836127,"size":795388471,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f705f0d5f5730029a4d8626b1fe6026a657f12d1&amp;dn=El+Disco+De+Alexis+Castro+%237+Agosto+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AlexisJP","files":68,"time":1408691211,"description":"   El Disco De Alexis Castro #7\n\n      ***TrackList***\n\n      Pop | HipHop | R&amp;B\n\n01 Maroon 5 - It Was Always You (By Alexis Castro DJ)\n02 Fences Feat. Macklemore &amp; Ryan Lewis - Arrows (By Alexis Castro DJ)\n03 Capital Cities - I Sold My Bed But Not My Stereo (By Alexis Castro DJ)\n04 Tony Bennett Feat. Lady Gaga - Anything Goes (By Alexis Castro DJ)\n05 Katy Perry - This Is How We Do (By Alexis Castro DJ)\n06 Jessie J, Ariana Grande &amp; Nicki Minaj - Bang Bang (By Alexis Castro DJ)\n07 Nicki Minaj - Anaconda (By Alexis Castro DJ)\n08 Pharrell Williams Feat. Miley Cyrus - Come Get It Bae (By Alexis Castro DJ)\n09 Ariana Grande Feat. Big Sean - Best Mistake (By Alexis Castro DJ)\n10 One Republic - Ordinary Human (By Alexis Castro DJ)\n11 Fifth Harmony - BO$$ (By Alexis Castro DJ)\n\n     Latino Reggaeton Cumbia\n\n12 Grupo Play (Fabi And Romi) - Al Limite De La Locura (By Alexis Castro DJ)\n13 Vi-Em - Nada Formal (By Alexis Castro DJ)\n14 El Retutu - Travesuras (By Alexis Castro DJ)\n15 Los Turros Feat. Anonymous - La Gata Del Vip (By Alexis Castro DJ)\n16 Tu Papa! Feat. Nene Malo - La Noche y Las Trampas (By Alexis Castro DJ)\n17 J Alvarez Feat. Jory Boy, Maluma, Ken-Y - Amor En Practica (Remix) (By Alexis Castro DJ)\n18 Don Omar Feat. Xavi - Nada Cambiara (By Alexis Castro DJ)\n19 Chino y Nacho Feat. Gente De Zona, Los Cadillacs - Tu Me Quemas (By Alexis Castro DJ)\n20 J Alvarez Feat. Baby Rasta &amp; Gringo, Divino - Te Imagino (By Alexis Castro DJ)\n21 Alexis &amp; Fido Feat. Gotay El Autentiko - Problematico (By Alexis Castro DJ)\n22 Yandel Feat. Gadiel - Plakito (By Alexis Castro DJ)\n23 Nova Feat. Ken-Y - Amiga (By Alexis Castro DJ)\n24 Natialia Jimenez Feat. Wisin - Creo En Mi (By Alexis Castro DJ)\n25 Gente De Zona Feat. Jencarlos Canela - Si Tu Fueras Mia (By Alexis Castro DJ)\n26 Alkilados - Una Cita (By Alexis Castro DJ)\n27 Ken-Y - Sentirte Mia (By Alexis Castro DJ)\n28 J Balvin - Ay Vamos (By Alexis Castro DJ)\n29 J Alvarez - Navegarte (By Alexis Castro DJ)\n30 Gente De Zona Feat. Pitbull - Yo Quiero (By Alexis Castro DJ)\n\n     ElectroPop EDM ElectroHouse DeepHouse\n\n31 Pitbull Feat. John Ryan - Fireball (By Alexis Castro DJ)\n32 Alexandra Stan - Dance (By Alexis Castro DJ)\n33 Victoria Kern &amp; Menno - Weekend (Bodybangers Remix) (By Alexis Castro DJ)\n34 Alesso - Tear The Roof Up (By Alexis Castro DJ)\n35 Sander van Doorn - Get Enough (By Alexis Castro DJ)\n36 Fedde Le Grand &amp; Michael Calfan Feat. Max'C - Feel The Love (By Alexis Castro DJ)\n37 Steve Angello Feat. Dougy - Wasted Love (By Alexis Castro DJ)\n38 Cedric Gervais Feat. Coco - Through The Night (By Alexis Castro DJ)\n39 Deorro &amp; D!rty Aud!o Feat. iE-z - Hit It (By Alexis Castro DJ)\n40 Oliver Heldens - Koala (By Alexis Castro DJ)\n41 Lilly Wood &amp; The Prick &amp; Robin Schulz - Prayer in C (By Alexis Castro DJ)\n42 Cash Cash Feat. John Rzeznik - Lightning (By Alexis Castro DJ)\n43 Maxi Trusso - Nothing At All (By Alexis Castro DJ)\n44 Bacefook Feat. Lolita Jolie - Mon Cherie (By Alexis Castro DJ)\n45 Tom Boxer &amp; Morena - Balans (By Alexis Castro DJ)\n46 Icona Pop - Get Lost (By Alexis Castro DJ)\n47 Benny Benassi Feat. Gary Go - Let This Last Forever (By Alexis Castro DJ)\n48 Example - Take Me As I Am (By Alexis Castro DJ)\n49 Stromae - Ta Fete (By Alexis Castro DJ)\n50 Thomas Gold &amp; Borgeous - Beast (By Alexis Castro DJ)\n51 Deorro Feat. Adrian Delgado &amp; DyCy - PerdoÂ´name (By Alexis Castro DJ)\n52 Afrojack &amp; Martin Garrix - Turn Up The Speakers (By Alexis Castro DJ)\n53 R3hab &amp; NERVO Feat. Ayah Marar - Ready For The Weekend (By Alexis Castro DJ)\n54 R3hab &amp; VINAI - How We Party (By Alexis Castro DJ)\n55 Dimitri Vegas &amp; Like Mike vs W&amp;W - Waves (Tomorrowland 2014 Anthem) (By Alexis Castro DJ)\n56 Jay Hardway Feat. Mike Hawkins - Freedom (By Alexis Castro DJ)\n57 Dillon Francis &amp; Martin Garrix - Set Me Free (By Alexis Castro DJ)\n58 Deorro vs. MAKJ - READY! (By Alexis Castro DJ)\n59 TST &amp; Moguai Feat. Amba Shepherd - Real Life (By Alexis Castro DJ)\n60 DVBBS - We Were Young (By Alexis Castro DJ)\n61 Dimitri Vegas &amp; Like Mike, Moguai Feat. Julian Perretta - Body Talk (Mammoth)(By Alexis Castro DJ)\n62 Blasterjaxx - Gravity (By Alexis Castro DJ)\n63 Don Diablo - AnyTime (By Alexis Castro DJ)\n64 Vicetone &amp; Tony Igy - Astronomia 2014 (Radio Edit) (By Alexis Castro DJ)\n65 Jason Derulo Feat. 2 Chainz - Talk Dirty (TJR Remix) (By Alexis Castro DJ)","torrent":{"xt":"urn:btih:f705f0d5f5730029a4d8626b1fe6026a657f12d1","amp;dn":"El+Disco+De+Alexis+Castro+%237+Agosto+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f705f0d5f5730029a4d8626b1fe6026a657f12d1","infoHashBuffer":{"type":"Buffer","data":[247,5,240,213,245,115,0,41,164,216,98,107,31,230,2,106,101,127,18,209]},"announce":[],"urlList":[]}}