{"title":"Breaking Bad Season 4 Dvdrip Eng Subs-Bigcus","uid":7943844,"size":5797487662,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f72c34cd87a9dd903fef3d7a85f419803e7ae000&amp;dn=Breaking+Bad+Season+4+Dvdrip+Eng+Subs-Bigcus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Bigcus","files":13,"time":1356075972,"description":"Breaking Bad Season 4 DVDRip Embedded English Subtitles for Spanish speaking parts.\n\nThe series &quot;Breaking Bad&quot; - one of the few serials movies, where heroes are people who have become to crime. Numerous stories of the film tell of hard life of drug lords. Walter White - chemistry teacher in high school. His life certainly had no luck, as there is never enough money, his son - invalid, the wife of Walter holds him under the heel, the final blow - he became ill with cancer. What would do an ordinary person in this situation? Perhaps humility waiting to death, but not like that, Walter - he decides to illegally manufacture synthetic drugs, and provide the family with money, while he was still alive. For sales of goods, he attracts an assistant of his former student - small drug dealer Jesse Pinkman. Dreaming to become rich and powerful drug traffickers, Jesse eagerly takes on the case ... Creating a show in which drug addicts and especially drug traffickers will be the main catalyst of the story is not something new and hitherto unknown to television. However, perhaps the first time we showed the whole process from the inside. In the film &quot;Breaking Bad&quot; have starred Bryan Cranston (&quot;Saving Private Ryan&quot;) and Aaron Paul (&quot;The Last House on the Left&quot;).\nResolution:720 x 408","torrent":{"xt":"urn:btih:f72c34cd87a9dd903fef3d7a85f419803e7ae000","amp;dn":"Breaking+Bad+Season+4+Dvdrip+Eng+Subs-Bigcus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f72c34cd87a9dd903fef3d7a85f419803e7ae000","infoHashBuffer":{"type":"Buffer","data":[247,44,52,205,135,169,221,144,63,239,61,122,133,244,25,128,62,122,224,0]},"announce":[],"urlList":[]}}