{"title":"Smile_Empty_Soul-Anxiety-(Advance)-2005-RNS [Rock/Alternative]","uid":3369642,"size":85132086,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f74ad742504cd4c808267116cbcd137554842d95&amp;dn=Smile_Empty_Soul-Anxiety-%28Advance%29-2005-RNS+%5BRock%2FAlternative%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"armis","files":18,"time":1123977858,"description":"ARTIST: Smile Empty Soul\nTITLE: Anxiety\nLABEL: Lava Records\nGENRE: Rock\nBITRATE: 214kbps avg\nPLAYTIME: 0h 51min total\nRELEASE DATE: 2005-09-27\nRIP DATE: 2005-08-13\n\nTrack List\n----------\n01. Bright Side                     4:06\n02. To The Ground                   3:42\n03. California's Lonely             3:06\n04. Self Inflicted                  4:44\n05. Holes                           3:52\n06. Don't Need You                  3:42\n07. Fight Of A Suburban Couple      2:15\n08. Refill Me                       3:56\n09. God's Army                      4:06\n10. Not Alright                     4:01\n11. Saturday                        3:12\n12. Cody                            1:38\n13. Proud To Be                     3:05\n14. Never Again                     3:18\n15. End Of The World                2:58\n\nRelease Notes:\n\n&quot;This record's called Anxiety for good reason!&quot; explains fully tattooed Smile\nEmpty Soul singer/guitarist Sean Danielsen of his band's sophomore disc. &quot;I\nhad a couple of break-downs while making this record - serious,\ngo-to-hospital break-downs. The record was so hard to get done, and it took\nits toll.&quot;\n\nFollowing the gold-certified success of Smile Empty Soul's 2003 self-titled\ndebut, Danielsen and bassist Ryan Martin had to deal with post-tour blues,\nparting company with their long-time drummer Derek Gledhill, and the pressure\nto deliver more hits after songs like &quot;Bottom Of A Bottle,&quot; &quot;Nowhere Kids,&quot;\nand &quot;Silhouettes&quot; enjoyed steady radio and MTV rotation. &quot;There were people\nsaying we had to write ?Bottom Of A Bottle: 2',&quot; laments the palpably\nneurotic Danielson, lank dark hair obscuring his face. &quot;So that was one of\nthe struggles of this record. I wasn't going to sit down and try to write a\nhit ... that's writing a song for the wrong reasons and we don't do that.&quot;\n\nFar from mailing-in for a clone of their previous album, Smile Empty Soul -\nwhile sticking with the winning formula of producer John Lewis Parker and his\nSuburban Hell studios in Saugus, CA - took a whole new production approach,\nincorporating fresh musical influences reflecting Smile's change in\nperspective from that of a local act in sleepy Santa Clarita, California, to\ntouring pros who now roam the nation for a living.\n\nAlways priding themselves on writing songs that can stand alone with just an\nacoustic guitar, SES took a stripped-down approach to their debut, with many\nlive takes and minimal overdubs, but for Anxiety they overhauled this ethic:\n&quot;This one's the exact opposite,&quot; laughs Danielsen. &quot;This album's definitely\nproduced ... guitars and harmonies are everywhere. Just from hitting the road\nwith the first record and listening to it along the way, we thought we'd like\nto try something new.&quot;\n\nThe guitar driven harmony approach also reflects some of the &quot;new-old&quot; music,\nwhich Danielsen and Martin have been re-discovering. &quot;I've been re-visiting\nolder stuff,&quot; Danielsen confirms. &quot;[Pink Floyd's] Dark Side Of The Moon and\nWish You Were Here, Led Zeppelin ... and I'm a huge Peter Gabriel fan.&quot;\n\nOn top of a staple diet of Queens of the Stone Age and At The Drive-In, Martin\ntoo has been taking a long look back: &quot;I just bought the Beatles' Revolver and\nI love that record ... and Simon &amp; Garfunkel - those harmonies are unreal.&quot;\n\nReflecting their ever-more-worldly outlook comes the Beach Boys-on-acid vibe\nof &quot;California's Lonely&quot;, which mulls outsiders' often over-rosy impressions\nof the state. &quot;People have a pre-conceived image and stereotype about\nCalifornia,&quot; Danielsen marvels. &quot;That it's this magical land of blond beauties\nand palm trees, where everyone's happy and having a great time and there's no\ndepression or issues ... but this place is just as shitty as anywhere else,\nit's just a different environment.&quot;\n\nAnd then there's the brave inclusion of &quot;Proud To Be&quot;, which, against the\nbackdrop of the Iraq war, Danielsen sings in the character of an\nunquestioning, arrogant redneck.\n\n&quot;These songs are bubbling with sarcasm,&quot; Danielsen admits. &quot;There's an attitude\namongst some Americans that we're the shit and we're gonna take on the whole\nworld. I like this country and I'm proud to be a part of this country, but I'm\nnot proud to be a part of that side of the country.&quot;\n\n&quot;God's Army&quot; continues Danielsen's sideways look at organized religion, rooted\nin his childhood experiences with his devoutly religious mother, and pours\nscorn on politicians who use faith as a manipulative tool. &quot;I just think people\nshould have their own belief system - too many people have died in the name of\ngod, y'know?&quot;\n\nBut while Anxiety is critical, and sometimes almost Alice In Chains-menacing,\nits tone is anything but two-dimensional. &quot;One thing that I think is a huge\nshift from the last record is that, even though it still has its moments of\ndarkness, Anxiety has a lot of shining optimism too,&quot; says Danielsen.\n\nSmile Empty Soul - who've toured with everyone from Jane's Addiction and Puddle\nof Mudd, to Deftones and Seether, and who took the '04 Sno-Core tour by storm -\nwill now embark upon an extended bout of roadwork behind Anxiety. But don't\nexpect the shows to be carbon copies of the album: more than ever SES is taking\nan in-the-moment, ultra-frenetic approach to live performance, prepared to take\nchances and embrace surprises.\n\n&quot;Our show's totally adrenaline fueled,&quot; Danielsen enthuses. &quot;We take the songs\nfrom the record and they come out as punk rock as we can make them - more\nenergy, louder, heavier, and I scream more! When things are forced, it's never\ngood - when you let things take on their own life a little, they just flow\nbetter.&quot;\n\nAnxiety is all the great things about Smile Empty Soul's debut, plus the\nmusical benefits of added wisdom and two years on the road. They've retained\ntheir instinctive songwriting savvy and remained true to themselves, while\nproducing a record to be reckoned with and honing their ultra-honest live\nshow. No need for anxiety after all...\n\n\n\narmis","torrent":{"xt":"urn:btih:f74ad742504cd4c808267116cbcd137554842d95","amp;dn":"Smile_Empty_Soul-Anxiety-%28Advance%29-2005-RNS+%5BRock%2FAlternative%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f74ad742504cd4c808267116cbcd137554842d95","infoHashBuffer":{"type":"Buffer","data":[247,74,215,66,80,76,212,200,8,38,113,22,203,205,19,117,84,132,45,149]},"announce":[],"urlList":[]}}