{"title":"Echo Night Beyond [Ntsc], Ps2","uid":5113996,"size":809205159,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:f7d4e0d3c13299c4e68f6b96ec6a2e1ef924053b&amp;dn=Echo+Night+Beyond+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Big_dude","files":-1,"time":1254960687,"description":"Echo Night Beyond for the Ps2                                     Rel. 07/27/2004\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        First Person Adventure\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with WinRar, game was tested and works. \nTry 7zip its free google it, if don't have WinRar.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n          \n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n         &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n         &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Tayio yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\n\nGame Description:\n\nThis is a rare game to find, luckly I was able to upload this here on TPB. The Graphics are really good for a PS2 Game especially the ghosts.\n\nIn the year 2044, Richard Osmond and Claudia Seifer take a flight into space in order to be married on Earth's Moon. However during the flight there is an accident and Richard wakes up disoriented and alone. Something strange seems to be going on, and maybe Richard is even seeing ghosts! He has to find Claudia before it's too late, and figure out what's going on.\n\nEcho Night: Beyond is a 1st person adventure game. Controlling Richard, the player moves around picking up and interacting with objects, including security cameras and computer logs. He remains in his space suit which provides a flashlight as well as a heart monitor. As he explores his surroundings on the moon, he's bound to become fearful and a little creeped out. If Richard's heart rate ever goes above 300, he'll die and the game is over.\n\nWhen confronted by an enemy- a ghost- you must run before your heart rate reaches a critical level, otherwise you will die of a heart attack. There are no means of directly defending yourself from ghost. Your suit is equipped with a flashlight, but must be kept charged by batteries. The ghosts can be defeated only by clearing the mist they inhabit. This is done by using a control panel to activate the ventilation system. To purify the souls of the dead, you must find and bring to them personal items from their human lives. The only exception to this is the priest ghost, who will pop out from time to time. When ghosts must be avoided, they can be spotted through the use of security monitors, which are placed throughout the station.\n \n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x speed.\n\nUse Verbatim or Tayio Yuden DVD Media for best quality, or if other media\nisn't working.\n\n\nIf using DVD+R then booktype to DVD-ROM \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:f7d4e0d3c13299c4e68f6b96ec6a2e1ef924053b","amp;dn":"Echo+Night+Beyond+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7d4e0d3c13299c4e68f6b96ec6a2e1ef924053b","infoHashBuffer":{"type":"Buffer","data":[247,212,224,211,193,50,153,196,230,143,107,150,236,106,46,30,249,36,5,59]},"announce":[],"urlList":[]}}