{"title":"The Fall Of Berlin 1945 By Antony Beevor (Epub,Mobi) Gooner","uid":9678250,"size":3960379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f80db974b78f43f27ffa6084f5c47ddc7e57354a&amp;dn=The+Fall+Of+Berlin+1945+By+Antony+Beevor+%28Epub%2CMobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1393606068,"description":"Paperback: 528 pages\nPublisher: Penguin (4 Oct 2007)\nLanguage: English\nISBN-10: 0141032391\nISBN-13: 978-0141032399\n\nPublication Date: 4 Oct 2007\nBerlin: The Downfall 19145 is Antony Beevor's brilliant account of the fall of the Third Reich.\n\nThe Red Army had much to avenge when it finally reached the frontiers of the Reich in January 1945. Political instructors rammed home the message of Wehrmacht and SS brutality. The result was the most terrifying example of fire and sword ever known, with tanks crushing refugee columns under their tracks, mass rape, pillage and destruction. Hundreds of thousands of women and children froze to death or were massacred because Nazi Party chiefs, refusing to face defeat, had forbidden the evacuation of civilians. Over seven million fled westwards from the terror of the Red Army.\n\nAntony Beevor reconstructs the experiences of those millions caught up in the nightmare of the Third Reich's final collapse, telling a terrible story of pride, stupidity, fanatacism, revenge and savagery, but also one of astonishing endurance, self-sacrifice and survival against all odds.\n\n'Fascinating, extraordinary, gripping' Jeremy Paxman\n\n'This brilliant storyteller makes us feel the chaos and the fear as if every drop of blood was our own. It is much more than just a humane account; it is compellingly readable, deeply researched, and beautifully written' Simon Sebag Montefiore, Spectator\n\n\nAntony Beevor began his career as a professional officer in the 11th Hussars. He is the author of several books, including The Spanish Civil War, Crete and The Mystery of Olga Chekhova. With his wife, Artemis Cooper, he wrote Paris After the Liberation, but he is best known for his books D-Day, Berlin and Stalingrad, the international No 1 bestseller, and winner of the Samuel Johnson Prize, Wolfson Price and Hawthornden Prize. He lives in London and Kent.","torrent":{"xt":"urn:btih:f80db974b78f43f27ffa6084f5c47ddc7e57354a","amp;dn":"The+Fall+Of+Berlin+1945+By+Antony+Beevor+%28Epub%2CMobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f80db974b78f43f27ffa6084f5c47ddc7e57354a","infoHashBuffer":{"type":"Buffer","data":[248,13,185,116,183,143,67,242,127,250,96,132,245,196,125,220,126,87,53,74]},"announce":[],"urlList":[]}}