{"title":"Obits - Bed &amp; Bugs (2013) [FLAC]","uid":8910482,"size":261389832,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f85f7638884ff1963a9d79ec044a02c13807b668&amp;dn=Obits+-+Bed+%26amp%3B+Bugs+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1379008140,"description":"\n  Obits - Bed &amp; Bugs (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Garage, New Wave, Post-Punk, Alternative\n  Source: CD (log)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Taste The Diff\n  02 Spun Out\n  03 It's Sick \n  04 This Must Be Done\n  05 Pet Trust \n  06 Besetchet \n  07 Operation Bikini \n  08 Malpractice \n  09 This Girl's Opinion \n  10 Receptor \n  11 I'm Closing In \n  12 Machines \n  13 Double Jeopardy (For The Third Time)\n\n  Much has been made of the Obits' celebrated pedigree, as the band exists in a long line of projects from the minds that gave us post-punk powerhouses like Edsel, Hot Snakes, Drive Like Jehu, and others. While these associations probably serve as both a blessing and curse to the band in terms of trying to express themselves outside the weight of their own past, with third album Bed &amp; Bugs, Obits seem to be entirely comfortable taking their muse in whatever direction suits them, seemingly without regard to stylistic boundaries or critical reception. That's not to say Obits have turned in a shoddy, self-indulgent album. With 13 tracks that dip in and out of snaky, Seeds-like garage stomp, surf tones, and even some drifty moments of neo-psychedelia, the band is covering all the bases, and tying together what could be disparate styles with their whole-heartedly emphatic approach to every performance. \n\n  Album-opener &quot;Taste the Diff&quot; opens with a chunky one-chord riff and a maniacal laugh from singer Rick Froberg before blasting off into a pushy road rock chord progression and the type of sinewy songcraft that the bandmembers have been perfecting for decades. Surfy sidesteps pop up throughout the album, from the reverb-soaked guitars of &quot;This Must Be Done&quot; to the entirely instrumental sparsity of &quot;Bestchet.&quot; A somewhat scattered look into minimal hipster blues gives &quot;Malpractice&quot; a White Stripes bite but moments later, &quot;This Girl's Opinion&quot; opens with the same darkly shimmering guitar interplay as Television. The album closes with the sputtering and stumbling &quot;Double Jeopardy (For the Third Time)&quot;, and in the hands of any other group, the genre-flipping schematic for Bed &amp; Bugs would have come off confusing or bewildering. Seasoned pros that they are, however, Obits seem unconcerned with anything except the moment at hand, and sell the songs accordingly. Solid performances and a vision beyond the obvious equate to an album that makes more sense than it should and one that pulls immediate gratification out of unexpected places.","torrent":{"xt":"urn:btih:f85f7638884ff1963a9d79ec044a02c13807b668","amp;dn":"Obits+-+Bed+%26amp%3B+Bugs+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f85f7638884ff1963a9d79ec044a02c13807b668","infoHashBuffer":{"type":"Buffer","data":[248,95,118,56,136,79,241,150,58,157,121,236,4,74,2,193,56,7,182,104]},"announce":[],"urlList":[]}}