{"title":"Jonathan Richman - 1976 - The Modern Lovers (FLAC)","uid":11273886,"size":435799720,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f8e6f5bb360ca82bb5ba743f3662c10fca54afe5&amp;dn=Jonathan+Richman+-+1976+-+The+Modern+Lovers+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"1subgenius","files":23,"time":1414115693,"description":"&quot;History's pegged Jonathan Richman and the Modern Lovers as proto-punk, but it's only been with the benefit of hindsight that his music has found a place at all. Like fellow ships at sea the Stooges, the New York Dolls, or the Velvet Underground, there was no precedent for what Richman was up to, nor was there much of a declared intent behind it. The Modern Lovers, like all of those other acts, were a rock band first and foremost. They played rock'n'roll. How others defined them was out of their hands.\n\nPunk's rallying cry remains the &quot;1-2-3-4!&quot; count-off, but it's obvious that there's more to Richman when he gleefully keeps counting up to six on &quot;Roadrunner&quot;. That track kicks off the Modern Lovers' self-titled debut, the impact of which has rippled through the work of fans as diverse as the Sex Pistols, Brian Eno, NPR fixture Sarah Vowell, sly subversives Art Brut, and lovesick crooner Jens Lekman. Back at the beginning, though, it was all about Richman, his insular world, and specifically his own obsession with the then-novel Velvet Underground, an appreciation he brought back home to Massachusetts after a trip to New York in the late 1960s.\n\nYou can hear the Velvets coursing though the Modern Lovers' debut-- impossibly out of print in the U.S. for nearly 20 years-- and not just because most of it was produced by John Cale (notorious impresario Kim Fowley gets credited with a couple of tracks, too). Richman had an innate knack for the Velvets' chugging drones, except rather than explore the dark stuff as Lou Reed did, Richman aims (mostly) for a certain innocence and naivete that's often at odds with the music itself. Indeed, Richman would switch gears before the album's belated release, and he all but disowned the harsher original sound of the Modern Lovers after shifting to softer, gentler sounds.\n\nThat belated release originally came in 1976 through the Beserkley label-- three years after most of the material had been recorded and two years after the original Lovers had broken up-- and these songs have been released in several forms since. Ratifying Richman's role as some sort of pioneer, what sounded revolutionary in the early 70s still worked in the late 70s, and endures as something special to this day. In fact, &quot;Roadrunner&quot; alone would have been enough to solidify his legacy: Its rinky-dink organ, Richman's stuffed-up nasal delivery and rudimentary &quot;Sister Ray&quot; guitars remain the perfect synthesis of garage rock sensibilities and nascent punk rule-breaking.\n\n&quot;I'm in love with the radio on/ It helps me from being alone at night!&quot; exhorts Richman in his half spoken/have sung voice as he hurtles down the highway like the titular bird (or at least its Looney Tunes equivalent). &quot;I'm in love with rock'n'roll and I'll be out all night!&quot; It's the perfect encapsulation of rock's romance and power, captured in a compact song so great it could honestly go on forever and keep you in the car until it's run its course (or at least until you've run out of gas).\n\nThe rest of The Modern Lovers is just as good, if slightly less eternal (the same goes for the alternate version included as a bonus track). &quot;Pablo Picasso&quot; is a hilarious take on the notorious painter's womanizing ways and their unsuitableness for the real world (&quot;Some people try to pick up girls and get called an asshole/ This never happened to Pablo Picasso&quot;), with Richman mixing envy, pity and disdain. &quot;I'm Straight&quot; is nervous nice-guy geek-rock that presages the Talking Heads (who, of course, eventually enlisted Modern Lover Jerry Harrison), and finds Richman touting his squareness the way others play up their bad-boy cool. On &quot;Girl Friend&quot;, he innocently but earnestly craves companionship for his walks through the Fenway and the Museum of Fine Arts.\n\nDuring the &quot;Old World&quot;, Richman extols the virtues of his parents' generation and pledges to maintain those bygone ways in the present. But on &quot;Modern World&quot;, he's just as enthusiastic about 1970s America: &quot;Well, the modern world is not so bad/ Not like the students say,&quot; he sings. &quot;In fact, I'd be in heaven/ If you'd share the modern world with me.&quot; Even when he's trying to get some in &quot;Astral Plane&quot; (&quot;I know we've been together just this week!&quot;), his desperation comes off charming, especially when it's paired with his &quot;Someone I Care About&quot; confession: &quot;What I want is a girl that I care about/ Or I want nothing at all.&quot;\n\nWhat reads as contradiction is simply one effect of Richman's irresistible inclusiveness. It's what sets him apart from the Velvets, the Ramones, the Stooges and the like-- acts attracted to themes that matched their ragged sounds. Richman's music is tough, but he is not. He loves the old world, he loves the modern world. He loves rock'n'roll, he loves girls, he loves America, and most importantly, he loves you. Leave the anomie of &quot;1969&quot;, the sleaze of &quot;Waiting for the Man&quot;, or the mean streets of &quot;53rd &amp; 3rd&quot; to the tough guys. Richman wants to rock you just like all the others, but he also wants to give you a big hug when he's done.&quot;\n\nSome of you seem to have enjoyeed all the sweet Richman sound posted lately. This is the last episode in the series, what some may consider to be the peak in JR's discography. Enjoy and keep on seeding pals. \n\nAnonymous benefitors rule !","torrent":{"xt":"urn:btih:f8e6f5bb360ca82bb5ba743f3662c10fca54afe5","amp;dn":"Jonathan+Richman+-+1976+-+The+Modern+Lovers+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e6f5bb360ca82bb5ba743f3662c10fca54afe5","infoHashBuffer":{"type":"Buffer","data":[248,230,245,187,54,12,168,43,181,186,116,63,54,98,193,15,202,84,175,229]},"announce":[],"urlList":[]}}