{"title":"The Story of the Guitar   (BBC - Complete Series)","uid":5065367,"size":1494933919,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f8f4d0cfa99ee9d5dfe60f252f3a2f93317b5e49&amp;dn=The+Story+of+the+Guitar+++%28BBC+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eddie1969","files":4,"time":1250986055,"description":"TV : Documentary : DVD quality : English\n\n \n\nPart 1 The Story of the Guitar: In the Beginning\n\nAlan Yentob embarks on a three-part personal journey to discover how the guitar became the world's favourite musical instrument. Beginning with the rise of the acoustic guitar, the series takes him from an ancient Middle Eastern ancestor of the lute, to the iconic guitars draped round the necks of Bill Hailey and Elvis Presley and beyond.\n\nFeaturing interviews with Bert Weedon - the man who taught Britain to 'Play in a Day', Pete Townshend, Bill Bailey, flamenco player Paco Pena and classical guitarist John Williams.\n\n\n\nPart 2 The Story of the Guitar: Out of the Frying Pan\n\nAlan Yentob presents a three-part series examining how the guitar became the world's favourite musical instrument.\n\nAs the guitar turns electric, music is changed for ever. The world's first electric guitar had nothing to do with jazz or blues, but Hawaiian-style music and was known as the 'frying pan'.\n\nYentob continues his investigation from the blues of the Mississippi to the guitar wars of the 1950s, when the Fender Stratocaster and the Gibson Les Paul were battling for supremacy.\n\n\n\n\nPart 3 The Story of the Guitar: This Time it's Personal\n\nIn the final programme of the series the guitarists talk about how they find their own sound, and how the guitar has changed their lives. Since its invention, the electric guitar has unleashed a seemingly inexhaustible sonic invention among guitarists.\n\nFeaturing Muse's Matt Bellamy, who turns out to be following in his father's space age footsteps, Tony Iommi from Black Sabbath, who talks about the invention of heavy metal, David Gilmour from Pink Floyd, Pete Townshend (Perhaps equally famous for smashing guitars), Johnny Marr from the Smiths on 'the mother of all riffs', Slash and The Edge from U2 among many others.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:f8f4d0cfa99ee9d5dfe60f252f3a2f93317b5e49","amp;dn":"The+Story+of+the+Guitar+++%28BBC+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8f4d0cfa99ee9d5dfe60f252f3a2f93317b5e49","infoHashBuffer":{"type":"Buffer","data":[248,244,208,207,169,158,233,213,223,230,15,37,47,58,47,147,49,123,94,73]},"announce":[],"urlList":[]}}