{"title":"Fever Tree 1st Album 1968","uid":8848812,"size":23885346,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f9038a980590aa99c0c319ff6c3742be2b1c253d&amp;dn=Fever+Tree+1st+Album+1968&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workablob","files":11,"time":1377468997,"description":"The self-titled debut album of this unfairly neglected psychedelic band is an odd mix of slick studio work laced with surprising moments of eclecticism, from soundtrack references to hard rock worthy of the best bands of the time. They open up with a pretty good piece of musical prestidigitation, melding Johann Sebastian Bach and Ennio Morricone into the album's first track, which segues neatly into a hard rock style that's their own on the spaced-out, Ravel-laced &quot;Where Do You Go,&quot; which sounds like the Doors and the Jimi Hendrix Experience jamming together. They also roll over &quot;Day Tripper&quot; and &quot;We Can Work It Out,&quot; squeezed into a two-song medley, like a proto-metal steamroller while quoting &quot;Norwegian Wood&quot; and &quot;Eleanor Rigby&quot;; then switch gears into a beautifully elegant, gently orchestrated pop/rock rendition of Neil Young's &quot;Nowadays Clancy Can't Even Sing&quot; that's worth the price of admission by itself. The harder rocking numbers (especially &quot;San Francisco Girls&quot;) are highly diverting artifacts of their time, while the last two songs, &quot;Unlock My Door&quot; and &quot;Come with Me (Rainsong),&quot; show off a totally unexpected and beautifully reflective folk-rock side to their sound that's strongly reminiscent of Phil Ochs' work on Pleasures of the Harbor and Tape from California. The variations in sound and content, plus the fact that the only keyboard player, Rob Landes, made any large contribution to the in-house songwriting (mostly the work of their producers, Scott &amp; Vivian Holtzman), makes it difficult to pin down precisely what Fever Tree was about, beyond the evidence at hand; but taken on its own terms, the album ought to be better known than it is, which is probably also true of the band itself. \n\n","torrent":{"xt":"urn:btih:f9038a980590aa99c0c319ff6c3742be2b1c253d","amp;dn":"Fever+Tree+1st+Album+1968","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9038a980590aa99c0c319ff6c3742be2b1c253d","infoHashBuffer":{"type":"Buffer","data":[249,3,138,152,5,144,170,153,192,195,25,255,108,55,66,190,43,28,37,61]},"announce":[],"urlList":[]}}