{"title":"Hardtied--The Good Little Slave  Veruca James MP4","uid":9875609,"size":1325828623,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:f9e7f9e62c343e006e842cf0f6c5094c853e6d7e&amp;dn=Hardtied--The+Good+Little+Slave++Veruca+James+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1396475015,"description":"The Good Little Slave | Veruca James\n\nApril 2, 2014\n\n\nMP4 only.\n\n\nVeruca stares seductively as she plays with her panties A bit of tough toe bondage pulls her feet forward. A rough hogtie with her hair pulling her head back. Veruca getting a dildo wet before it is buried in her snatch \nVeruca James bites into a wooden bit gag. Veruca looking into the camera, breathlessly waiting. \nDeep throat spit drips off the chin of this bound beauty. A tough hogtie seen from behind. \n  \nTake one look at this hot ass piece of meat and imagine all of the dirty things you would do to her. Veruca James is one of those girls that shows up on our door step looking for just that. Beautiful tits, a tight ass, and flexible body all make her an ideal candidate for the kind of training and rough treatment we specialize in and she craves. \n\nNothing makes Veruca wet and ready like a bit of bondage. Even languishing in her cage has her anxious for what she knows is coming next. Cyd inspects every inch of her body while she tries to contain her anticipation. She holds the slave position that she has been taught without complaining, eyes straight ahead, cautiously stealing glances as he moves around her. Every flaw on her is noted. Every vulnerability is noted twice. He moves quickly through his evaluation, checking her tits, pussy, and ass last. When he is through it is time for what she has been waiting for. \n\nBondage is what gets Veruca up in the morning. It is what she dreams of when she goes to bed at night. Every one of her sexual fantasies involves being tied up, pushed down, and turned into an object of sexual service. It doesn't take long for the effects of the rope around her body to become obvious. Her eyes become glassy as she makes her way into subspace. Her pussy is dripping wet. Her breathing turns into a combination of longing pants and satisfied moans. Even a light touch puts her right on the edge of orgasm. By the time Cyd starts vibrating her she is ready to cum until she passes out. He doesn't push her that far but, judging by the way her eyes refuse to focus she is perilously close.  \n \nScreens &lt;a href=&quot;\nhttp://hardtied.com/hogtied/bondage/2014/04_02vjames4/Hardtied-Veruca-James-The-Good-Little-Slave.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hardtied.com/hogtied/bondage/2014/04_02vjames4/Hardtied-Veruca-James-The-Good-Little-Slave.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:f9e7f9e62c343e006e842cf0f6c5094c853e6d7e","amp;dn":"Hardtied--The+Good+Little+Slave++Veruca+James+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9e7f9e62c343e006e842cf0f6c5094c853e6d7e","infoHashBuffer":{"type":"Buffer","data":[249,231,249,230,44,52,62,0,110,132,44,240,246,197,9,76,133,62,109,126]},"announce":[],"urlList":[]}}