{"title":"Programming Erlang.pdf","uid":4678296,"size":2783822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa21aeef4da734a87fe3bfe4e3f06aeac62420fe&amp;dn=Programming+Erlang.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"joepistuo","files":-1,"time":1232978645,"description":"Erlang solves one of the most pressing problems facing developers today: how to write reliable, concurrent, high-performance systems. It's used worldwide by companies who need to produce reliable, efficient, and scalable applications. Invest in learning Erlang now. \n\nMoore's Law is the observation that the amount you can do on a single chip doubles every two years. But Moore's Law is taking a detour. Rather than producing faster and faster processors, companies such as Intel and AMD are producing multi-core devices: single chips containing two, four, or more processors. If your programs aren't concurrent, they'll only run on a single processor at a time. Your users will think that your code is slow. \n\nErlang is a programming language designed for building highly parallel, distributed, fault-tolerant systems. It has been used commercially for many years to build massive fault-tolerated systems that run for years with minimal failures. \n\nErlang programs run seamlessly on multi-core computers: this means your Erlang program should run a lot faster on a 4 core processor than on a single core processor, all without you having to change a line of code. \n\nErlang combines ideas from the world of functional programming with techniques for building fault-tolerant systems to make a powerful language for building the massively parallel, networked applications of the future. \n\nThis book presents Erlang and functional programming in the familiar Pragmatic style. And it's written by Joe Armstrong, one of the creators of Erlang. \n\nIt includes example code you'll be able to build upon. In addition, the book contains the full source code for two interesting applications: \n\nA SHOUTcast server which you can use to stream music to every computer in your house, and \na full-text indexing and search engine that can index gigabytes of data. \n\nLearn how to write programs that run on dozens or even hundreds of local and remote processors. See how to write robust applications that run even in the face of network and hardware failure, using the Erlang programming language.\n\nThe book &amp; ebook can (and should) be purchased from http://www.pragprog.com/titles/jaerlang/programming-erlang","torrent":{"xt":"urn:btih:fa21aeef4da734a87fe3bfe4e3f06aeac62420fe","amp;dn":"Programming+Erlang.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa21aeef4da734a87fe3bfe4e3f06aeac62420fe","infoHashBuffer":{"type":"Buffer","data":[250,33,174,239,77,167,52,168,127,227,191,228,227,240,106,234,198,36,32,254]},"announce":[],"urlList":[]}}