{"title":"BATMAN: ARKHAM CITY - XPG - XBOX360 - REGION FREE - XGD3 0800 {B","uid":6741411,"size":8459845662,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:fa7c380895eab285285db926a31d1c32dc5283c0&amp;dn=BATMAN%3A+ARKHAM+CITY+-+XPG+-+XBOX360+-+REGION+FREE+-+XGD3+0800+%7BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"boobsman","files":82,"time":1318519091,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT2.0!!!\n &lt;a href=&quot;\nhttp://www.pix2links.com/image/hebd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pix2links.com/image/hebd.jpg&lt;/a&gt;\n\nDeveloped by Rocksteady Studios, Batman: Arkham City builds upon the intense, atmospheric foundation of Batman: Arkham Asylum, sending players soaring into Arkham City, the new maximum security &quot;home&quot; for all of Gotham City's thugs, gangsters and insane criminal masterminds.\n\nSet inside the heavily fortified walls of a sprawling district in the heart of Gotham City, this highly anticipated sequel introduces a brand-new story that draws together a new all-star cast of classic characters and murderous villains from the Batman universe, as well as a vast range of new and enhanced gameplay features to deliver the ultimate experience as the Dark Knight.\n\nBatman: Arkham City is the follow-up to the award-winning hit video game Batman: Arkham Asylum and delivers an authentic and gritty Batman experience.\n\nBecome the Dark Knight: Batman: Arkham City delivers a genuinely authentic Batman experience with advanced, compelling gameplay on every level: high-impact street brawls, nail-biting stealth, multifaceted forensic investigation, epic super-villain encounters and unexpected glimpses into Batman's tortured psychology.\n\nAdvanced FreeFlow combat: Batman faces highly coordinated, simultaneous attacks from every direction as Arkham's gangs bring heavy weapons and all-new AI to the fight, but Batman steps it up with twice the number of combat animations and double the range of attacks, counters and takedowns.\n\nNew gadgets: Batman has access to new gadgets such as the Cryptographic Sequencer V2 and Smoke Pellets, as well as new functionality for existing gadgets that expand the range of Batman's abilities without adding extra weight to his Utility Belt.\n\nNew story: Five-time Emmy-Award-winner Paul Dini returns to pen a brand-new story for Batman: Arkham City, taking gamers deep inside the diseased heart of Gotham.\n\nArkham has moved: Following the closure of Arkham Asylum and Blackgate prison, Gotham's new mayor, Quincy Sharp ordered the relocation of all inmates to Arkham City - a sprawling new super-prison five times bigger than Arkham Island, enclosing a wide variety of industrial districts, iconic locations and Gotham landmarks.\n\nHuge cast of characters: Players encounter numerous characters from the Batman universe, including Catwoman, Two-Face, Harley Quinn, Hugo Strange, Victor Zsasz, Calendar Man, The Joker, The Riddler and other iconic characters yet to be revealed.\n\nPlay as Catwoman: Players will have a chance to indulge in their darker side and explore Arkham City as the infamous feline femme fatale. Complete with her own storyline in the main game, Catwoman's adventure complements Batman's central role and is seamlessly interwoven with his main story arc. She will also be playable in the challenge maps with her own unique combat moves, gadgetry and signature 'takedowns'.\n\nFeatured voice over talent: Mark Hamill and Kevin Conroy reprise their roles as The Joker and Batman respectively.\n\n","torrent":{"xt":"urn:btih:fa7c380895eab285285db926a31d1c32dc5283c0","amp;dn":"BATMAN%3A+ARKHAM+CITY+-+XPG+-+XBOX360+-+REGION+FREE+-+XGD3+0800+%7BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7c380895eab285285db926a31d1c32dc5283c0","infoHashBuffer":{"type":"Buffer","data":[250,124,56,8,149,234,178,133,40,93,185,38,163,29,28,50,220,82,131,192]},"announce":[],"urlList":[]}}