{"title":"How Big Banks Fail and What to Do about It","uid":6540708,"size":452701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb1c3235ae83b390214465de883c2152bbd8c018&amp;dn=How+Big+Banks+Fail+and+What+to+Do+about+It&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1310676035,"description":"Darrell Duffie, &quot;How Big Banks Fail and What to Do about It&quot;\n Publisher: Princeton University Press | 2010 | ISBN: 0691148856 | PDF | 108 pages | 0.5 MB\n\n Dealer banks--that is, large banks that deal in securities and derivatives, such as J. P. Morgan and Goldman Sachs--are of a size and complexity that sharply distinguish them from typical commercial banks. When they fail, as we saw in the global financial crisis, they pose significant risks to our financial system and the world economy. How Big Banks Fail and What to Do about It examines how these banks collapse and how we can prevent the need to bail them out.\n In sharp, clinical detail, Darrell Duffie walks readers step-by-step through the mechanics of large-bank failures. He identifies where the cracks first appear when a dealer bank is weakened by severe trading losses, and demonstrates how the bank's relationships with its customers and business partners abruptly change when its solvency is threatened. As others seek to reduce their exposure to the dealer bank, the bank is forced to signal its strength by using up its slim stock of remaining liquid capital. Duffie shows how the key mechanisms in a dealer bank's collapse--such as Lehman Brothers' failure in 2008--derive from special institutional frameworks and regulations that influence the flight of short-term secured creditors, hedge-fund clients, derivatives counterparties, and most devastatingly, the loss of clearing and settlement services.\n How Big Banks Fail and What to Do about It reveals why today's regulatory and institutional frameworks for mitigating large-bank failures don't address the special risks to our financial system that are posed by dealer banks, and outlines the improvements in regulations and market institutions that are needed to address these systemic risks.","torrent":{"xt":"urn:btih:fb1c3235ae83b390214465de883c2152bbd8c018","amp;dn":"How+Big+Banks+Fail+and+What+to+Do+about+It","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb1c3235ae83b390214465de883c2152bbd8c018","infoHashBuffer":{"type":"Buffer","data":[251,28,50,53,174,131,179,144,33,68,101,222,136,60,33,82,187,216,192,24]},"announce":[],"urlList":[]}}