{"title":"The million Dollar Quartet - Elvis Cash Lewis &amp; Perkins","uid":4494997,"size":74300906,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc31e885c4bf6583f4816c59d7f88e3f91c5067b&amp;dn=The+million+Dollar+Quartet+-+Elvis+Cash+Lewis+%26+Perkins&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Welshguy","files":48,"time":1226158701,"description":"The Complete Million Dollar Quartet [ORIGINAL RECORDING REMASTERED]\n\nTrack Listings\n1. Instrumental - Elvis Presley, \n2. Love Me Tender - Elvis Presley, Presley, Elvis \n3. Jingle Bells - Elvis Presley, \n4. White Christmas - Elvis Presley, Berlin, Irving \n5. Reconsider Baby - Elvis Presley, Fulsom, Lowell \n6. Don't Be Cruel - Elvis Presley, Presley, Elvis \n7. Don't Be Cruel - Elvis Presley, Presley, Elvis \n8. Paralyzed - Elvis Presley, Presley, Elvis \n9. Don't Be Cruel - Elvis Presley, Presley, Elvis \n10. There's No Place Like Home - Elvis Presley, Payne, John Howard \n11. When the Saints Go Marchin' In - Elvis Presley, Traditional \n12. Softly and Tenderly - Elvis Presley, Traditional \n13. Just a Little Talk with Jesus - Elvis Presley, Derricks, Cleavant \n14. Jesus Walked That Lonesome Valley - Elvis Presley, Traditional \n15. I Shall Not Be Moved - Elvis Presley, Traditional \n16. Peace in the Valley - Elvis Presley, Dorsey, Thomas A. \n17. Down by the Riverside - Elvis Presley, Traditional \n18. I'm with a Crowd But So Alone - Elvis Presley, Tubb, Ernest \n19. Farther Along - Elvis Presley, Traditional \n20. Blessed Jesus (Hold My Hand) - Elvis Presley, Traditional \n21. On the Jericho Road - Elvis Presley, Traditional \n22. I Just Can't Make It by Myself - Elvis Presley, Brewster, Herbert \n23. Little Cabin Home on the Hill - Elvis Presley, Monroe, Bill \n24. I Hear a Sweet Voice Calling - Elvis Presley, Monroe, Bill \n25. Sweetheart You Done Me Wrong - Elvis Presley, Monroe, Bill \n26. Keeper of the Key (Carl Lead) - Elvis Presley, Stewart, Beverly \n27. Don't Forbid Me - Elvis Presley, Singleton, Charles \n28. Brown Eyed Handsome Man - Elvis Presley, Berry, Chuck \n29. Out of Sight, Out of Mind - Elvis Presley, Hunter, Ivory Joe \n30. Brown Eyed Handsome Man - Elvis Presley, Berry, Chuck \n31. Don't Forbid Me - Elvis Presley, Singleton, Charles \n32. You Belong to My Heart - Elvis Presley, Gilbert, Ray \n33. Is It So Strange - Elvis Presley, Young, Faron \n34. That's When Your Heartaches Begin - Elvis Presley, Hill, Billy [1] \n35. I'm Gonna Bid My Blues Goodbye - Elvis Presley, Snow, Hank \n36. Crazy Arms - Elvis Presley, Mooney, Ralph \n37. That's My Desire - Elvis Presley, Loveday, Carroll \n38. End of the Road - Elvis Presley, Lewis, Jerry Lee \n39. Black Bottom Stomp - Elvis Presley, Joseph, Morton Ferd \n40. You're the Only Star in My Blue Heaven - Elvis Presley, Autry, Gene \n41. Elvis Says Goodybe - Elvis Presley, \n\nFifty years after a 21-year-old Elvis Presley first shook the world comes a reissue of the famed Million Dollar Quartet recording, \n\nThe off-the-cuff Sun Records jam session where Jerry Lee Lewis, Carl Perkins, and Johnny Cash joined Presley for a loose-jointed romp through 46 songs.\n\nExcept that's not quite right--Cash either put down his part off-mic or rolled out his big baritone-bass when the tape wasn't rolling (the more likely explanation). So that, as Colin Escott writes in his liner notes, technically makes this a $750,000 Trio. \n\nAnd while this new edition is billed as the &quot;complete&quot; quartet--since 12 more minutes surfaced on a tape of superior sound quality found in Elvis's private collection, and the session is now in its right sequence--it obviously isn't the whole thing. (The 12 extra minutes are essentially four short instrumentals and &quot;Reconsider Baby&quot; at the start, as well as bits and pieces at different points throughout the CD.) But what survives is nevertheless fascinating, of course, not only for the historical record but for the fervor the three bring to a handful of spirituals (their finest moment) and how young Presley--who is already recording for RCA, and has just been dropped by Sun--presents himself. His new notoriety brings out a cocky charm, as he devotes much of these renditions of &quot;Don't Be Cruel&quot; and &quot;Paralyzed&quot; to an imitation of Jackie Wilson imitating him (Elvis knows Wilson only as one of Billy Ward's Dominoes), \nand boasting that Pat Boone recorded a song that Elvis wouldn't even audition. This fly-on-the-wall voyeurism should appeal to any student of rock 'n' roll history. \n\nBut serious Elvisphiles will especially enjoy hearing Presley talk about the seeds of recording &quot;That's When Your Heartaches Begin,&quot; mimic Hank Snow on &quot;I'm Gonna Bid My Blues Goodbye,&quot; and express bemused ire over Faron Young, who had sent him a song (&quot;Is It So Strange&quot;) he hoped Elvis would record. &quot;He didn't want to give me none of it--he wanted it all, you know,&quot; \n\nElvis says with a chuckle, supposedly referring to the publishing/writing credit, something Elvis's manager, the iron-fisted Colonel Tom Parker, demanded. As the trio moves through a plethora of material--Christmas songs, gospel, blues, R&amp;B, country, pop, Dixieland, cowboy, and bluegrass--they become the hammer, anvil, and steel, forging a new form of music. What you have here, then, is no less than the sound of it, taking shape. \n\n\n\nThis has to be one of the best artists Quartet in history! At least to in my memory but am sure you would know a better one if so let me know I would love to hear who that would have been\n\nArtwork Included please seed and enjoy!!\n","torrent":{"xt":"urn:btih:fc31e885c4bf6583f4816c59d7f88e3f91c5067b","amp;dn":"The+million+Dollar+Quartet+-+Elvis+Cash+Lewis+%26+Perkins","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc31e885c4bf6583f4816c59d7f88e3f91c5067b","infoHashBuffer":{"type":"Buffer","data":[252,49,232,133,196,191,101,131,244,129,108,89,215,248,142,63,145,197,6,123]},"announce":[],"urlList":[]}}