{"title":"From The Heart Of The World - The Elder Brothers Warning [1991]","uid":4222109,"size":731072512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fc8d5ec8d8671bb668d2b28c0ac5691af62f0a69&amp;dn=From+The+Heart+Of+The+World+-+The+Elder+Brothers+Warning+%5B1991%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"lil.bro","files":1,"time":1212643280,"description":"From The Heart Of The World - The Elder Brothers Warning [1991]\n\nVideo: XViD 432 X 320\nAudio: 80 kbps VBR MP3\nRuntime: 1:26:31\nSource: VHS\n\nA BBC TV production in association with the Goldsmith Foundation.\n\nThe Kogi are an indigenous people living in the Sierra Nevada de Santa Marta mountains of northern Colombia, in South America.\n\nThey are the only civilisation to have survived the Spanish conquests and to have kept their individuality. They are perhaps the only indigenous people in the world who, because of the particular nature of their surroundings, have been able to keep themselves apart and sustain their culture inviolate. And not only that.\n\nThe one anthropologist who managed to study them in the 1940&amp;#039;s and 50&amp;#039;s concluded that though they are similar in some ways to the other Indian peoples around the Caribbean, northern Central America and south to the Andes, there are such profound differences that &quot;in the end the Kogi stand alone&quot;.\n\nThey have survived to this day, keeping their traditions and relying upon, and looking after, the mountain environment. They believe it is their duty to look after the mountain which they call &quot;The Heart of the World&quot;. They call themselves the Elder Brother and refer to the new- comers as the Younger Brother, who they believe is destroying the balance of the world.\n\nIn 1990 the Kogi decided they must speak out to the rest of the world. They had survived by keeping themselves isolated but they decided that it was time to send a message to the Younger Brother. They could see that something was wrong with their mountain, with the heart of the world. The snows had stopped falling and the rivers were not so full. If their mountain was ill then the whole world was in trouble.","torrent":{"xt":"urn:btih:fc8d5ec8d8671bb668d2b28c0ac5691af62f0a69","amp;dn":"From+The+Heart+Of+The+World+-+The+Elder+Brothers+Warning+%5B1991%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc8d5ec8d8671bb668d2b28c0ac5691af62f0a69","infoHashBuffer":{"type":"Buffer","data":[252,141,94,200,216,103,27,182,104,210,178,140,10,197,105,26,246,47,10,105]},"announce":[],"urlList":[]}}