{"title":"Dictionary of Gnosis &amp; Western Esotericism (2006)","uid":8692136,"size":5973844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd7e6f4312a76f4c80bf8bc18340304da517f688&amp;dn=Dictionary+of+Gnosis+%26amp%3B+Western+Esotericism+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1373903903,"description":"Dictionary of Gnosis &amp; Western Esotericism (Brill, 2006).  Edited by Wouter J. Hanegraaff, in collaboration with Antoine Faivre, Roelof van den Broek and Jean-Pierre Brach.\n\nISBN: 9789004152311 | xxx + 1230 pages | PDF\n\n\nThis is the first comprehensive reference work to cover the entire domain of &quot;Gnosis and Western Esotericism&quot; from the period of Late Antiquity to the present. Containing around 400 articles by over 180 international specialists, it provides critical overviews discussing the nature and historical development of all its important currents and manifestations, from Gnosticism and Hermetism to Astrology, Alchemy and Magic, from the Hermetic Tradition of the Renaissance to Rosicrucianism and Christian Theosophy, and from Freemasonry and Illuminism to 19th-century Occultism and the contemporary New Age movement. Furthermore it contains articles about the life and work of all the major personalities in the history of Gnosis and Western Esotericism, discussing their ideas, significance, and historical influence.\n\nIt will appeal to all those interested in the history of religion, intellectual history, art and culture in Western society from Antiquity to the present, as well as classicists, medievalists, historians, and theologians.\n\nThe Dictionary of Gnosis &amp; Western Esotericism was selected Choice Outstanding Academic Title in 2006.\n\n\nReviews\n\n&quot;This superb dictionary should be an early stop for readers seeking basic, up-to-date, scholarly introductions to many aspects of Western religious eclecticism. There is no reference like it for its range and the objectivity of its coverage.&quot; -- S. Young, Choice, 2006\n\n&quot;The entries present balanced, neutral accounts of the topics and the major persons involved with them without simplification, distortion, or reductionism. . . Scholars will be delighted to have such a treasure take its place next to the popular treatments of the field.&quot; -- M.R. Pukkila, Choice, 2005.\n\n&quot;The Dictionary of Gnosis and Western Esotericism is a brilliantly conceived and skillfully executed reference tool unlike anything the scholarly world has ever seen. In two massive volumes it covers every aspect of pagan, Jewish, and Christian religious discourses and phenomena traditionally labeled gnosticism, hermeticism, astrology, magic, the 'occult sciences,' esoteric religion, and much more. The detailed and insightful articles, on nearly every related topic imaginable, are produced by an impressive array of renowned scholars, and usefully include up-to date bibliographies. Six years in the making, this is a work that every student of religion, ancient and modern, will certainly want to own.&quot; -- Bart D. Ehrman, University of North Carolina at Chapel Hill\n\n&quot;The Dictionary of Gnosis &amp; Western Esotericism is a must for any who would consider themselves a scholar of Esotericism, and should at the very least be in every academic library in the English-speaking world.&quot; -- J. Gordon Melton, Center for Studies on New Religions, 2005\n","torrent":{"xt":"urn:btih:fd7e6f4312a76f4c80bf8bc18340304da517f688","amp;dn":"Dictionary+of+Gnosis+%26amp%3B+Western+Esotericism+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd7e6f4312a76f4c80bf8bc18340304da517f688","infoHashBuffer":{"type":"Buffer","data":[253,126,111,67,18,167,111,76,128,191,139,193,131,64,48,77,165,23,246,136]},"announce":[],"urlList":[]}}