{"title":"Artillery- An Illustrated History of Their Impact","uid":4811419,"size":35827967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd819b9e29a7b1a0b1c6f502fc376b566d54cccc&amp;dn=Artillery-+An+Illustrated+History+of+Their+Impact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1238391689,"description":"&quot;Charts the development of large, crew-operated battlefield weapons from the dart firers and catapults of the ancient world to the invention of gunpowder in China and its applications in medieval Europe, and from the emergence of naval and land gunnery four centuries ago to the latest rapid-fire, rocket propulsion, laser guidance, and antiaircraft technologies.\n\nWritten by an expert on military history, Artillery explores the technological and strategic innovations that have made these weapons increasingly effective at breaking through fortifications, inflicting casualties from a safe distance, providing cover for advancing forces, demoralizing opponents, and defending positions from attack. Beyond the battlefield, the book also looks at the impact of artillery on history and on the lives of civilians as well as soldiers.&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:fd819b9e29a7b1a0b1c6f502fc376b566d54cccc","amp;dn":"Artillery-+An+Illustrated+History+of+Their+Impact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd819b9e29a7b1a0b1c6f502fc376b566d54cccc","infoHashBuffer":{"type":"Buffer","data":[253,129,155,158,41,167,177,160,177,198,245,2,252,55,107,86,109,84,204,204]},"announce":[],"urlList":[]}}