{"title":"X-MEN - DAYS OF FUTURE PAST - All Stories (1981-1998) (Marvel)","uid":8220059,"size":396990615,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fd97d58d592397b5b2a687820433b44b77cbc806&amp;dn=X-MEN+-+DAYS+OF+FUTURE+PAST+-+All+Stories+%281981-1998%29+%28Marvel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1362454137,"description":"&quot;Days of Future Past&quot; is a popular storyline in the Marvel Comics series The Uncanny X-Men issues #141 and #142, published in 1981. It deals with a dystopian alternative future in which mutants are incarcerated in internment camps. An adult Kate Pryde transfers her mind into her younger self, the present-day Kitty Pryde, who brings the X-Men to prevent a fatal moment in history which triggers anti-mutant hysteria.\n\nThe storyline was very popular at the time and was produced during the franchise's rapid rise to popularity due to the creative team of Chris Claremont, John Byrne and Terry Austin. As a result of the storyline's popularity, the dark future seen in the story has been revisited numerous times. The first issue of this storyline was voted the 25th greatest Marvel comic of all time by readers in 2001.\n\nThe storyline alternates between present day, in which the X-Men fight Mystique's Brotherhood of Evil Mutants, and a future timeline caused by the X-Men's failure to prevent the Brotherhood from assassinating Senator Robert Kelly. In this future universe, Sentinels rule the United States, and mutants live in internment camps. The present-day X-Men are forewarned of the possible future by a future version of their teammate Kitty Pryde, whose mind traveled back in time and possessed her younger self to warn the X-Men ...\n\n------\n\nX-Men: Days of Future Past is an upcoming film co-written, produced and directed by Bryan Singer. It will be the seventh installment in the X-Men film series. The screenplay, written by Simon Kinberg, Matthew Vaughn, and Jane Goldman, with Singer writing the story, is based on the 1981 comics storyline.\n\nActing as a dual sequel to X-Men: First Class and X-Men: The Last Stand, the third film in the series, the film stars some of their respective casts: Patrick Stewart, Ian McKellen, Hugh Jackman, Halle Berry, Anna Paquin, Shawn Ashmore and Ellen Page return from the original trilogy, while James McAvoy, Michael Fassbender, Jennifer Lawrence, and Nicholas Hoult return from X-Men: First Class.\n\nThe film is scheduled to go into production in April 2013, and is scheduled for release on July 18, 2014.","torrent":{"xt":"urn:btih:fd97d58d592397b5b2a687820433b44b77cbc806","amp;dn":"X-MEN+-+DAYS+OF+FUTURE+PAST+-+All+Stories+%281981-1998%29+%28Marvel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd97d58d592397b5b2a687820433b44b77cbc806","infoHashBuffer":{"type":"Buffer","data":[253,151,213,141,89,35,151,181,178,166,135,130,4,51,180,75,119,203,200,6]},"announce":[],"urlList":[]}}