{"title":"The Ox (Oxen) Sweden 1991, Sven Nykvist Director","uid":5151125,"size":740412980,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fe0a13a7ed4e22340a07bbfc9532ceefd9def1da&amp;dn=The+Ox+%28Oxen%29+Sweden+1991%2C+Sven+Nykvist+Director&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1257561088,"description":"In Swedish with embedded subtitle tracks in English, Norwegian and Svenska.\n\nThis is a great movie offering from Sweden although it will depress you to\nview it in its entirety if you have any sensitivity on the issues that are\nraised in it.\n\nYou may be familiar with some of the history of the great Irish spirited folk\nwho were sent packing from Britain and headed to a lovely land today they call\nAustralia. It is my sincere view and hope that the future leadership for the\nworld will in fact come from this continent island as I think our best\nsuccesses have been achieved there in a way that best guides the most human\nspirit we see having survived such similar evolutionary factors as to make them\nspecial for our purposes here. The point is that harsh treatment and insanely\ncruel standards of justice have often been applied in times of great economic\ndepression or in areas devoid of real spiritual guidance in favour of religious\nfundamentalism of the extremist variety.\n\nThis movie speaks to the issues of harsh justice in the grief that befalls a\nfine young couple that you see above. The man is quite Irish spirited as we\nunderstand the genre and the lovely wife with him is in fact well meaning and\nwell intentioned for him and grief is all that we see come in this tragic tale\nof cruelty that seems to find little to comfort those suffering in the\ncircumstances of near starvation conditions and the extremely harsh penalties\nmeted out in these conditions as I refer to above here.\n\nThe Swedes are a warm humanistic people who give the Irish their spirit in\nwhat all admire as Christianly beauty. Thats a great enough legacy to always\nconsider that they are family roots to those of us that come from this spirit\nand in this respect this movie is greatly interesting to view to avoid mistakes\nthat have known to befall the great spirited folk that come from this world.\n\nMichael Rizzo Chessman\nreview posted at moviesbyrizzo.info","torrent":{"xt":"urn:btih:fe0a13a7ed4e22340a07bbfc9532ceefd9def1da","amp;dn":"The+Ox+%28Oxen%29+Sweden+1991%2C+Sven+Nykvist+Director","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe0a13a7ed4e22340a07bbfc9532ceefd9def1da","infoHashBuffer":{"type":"Buffer","data":[254,10,19,167,237,78,34,52,10,7,187,252,149,50,206,239,217,222,241,218]},"announce":[],"urlList":[]}}