{"title":"Kaiser Chiefs - Off With Their Heads [mp3-256-2008]","uid":4422313,"size":69225819,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ffd8fd47b13e6939c1d3f921f1ee3fafc5abcfdf&amp;dn=Kaiser+Chiefs+-+Off+With+Their+Heads+%5Bmp3-256-2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"trfkad","files":-1,"time":1222850215,"description":"1. Spanish Metal\n2. Never Miss A Beat\n3. Like It Too Much\n4. You Want History\n5. Can't Say What I Mean\n6. Good Days Bad Days\n7. Tomato In The Rain\n8. Half The Truth\n9. Always Happens Like That\n10. Addicted To Drugs\n11. Remember You're A Girl \n\n\nTitle: Off With Their Heads\nArtist: Kaiser Chiefs\nStore Date: 28 oct 2008\nUpload Date: 01 oct 2008\nLabel: Motown\nGenre: Rock\nCover: front\nBitrate: 256 kb/s, joint stereo\n\n\nA mere eighteen months since the release of their second album Yours Truly, Angry Mob, which saw Leeds' Kaiser Chiefs have the best selling UK rock album of last year, they are set to unleash their third long-player. The multi-million selling bands 3rd album, entitled Off With Their Heads, is slated for Stateside release via Universal Motown and was produced in its entirety by Mark Ronson.\n2008's Producer of the Year Grammy winner, Mark Ronson has worked his magic again. Testing his skill with one of Britain's biggest rock bands, the team has created an impressive synergy and the record bears a more expansive sound of any Kaiser record to date. With backing vocals from Lily Allen and New Young Pony Club, it sees the band add to their ever bulging bag of hit singles.\nKicking off with the somewhat incongruous &quot;Spanish Metal&quot; before launching into &quot;Never Miss A Beat&quot; - the first single off the record, the album has a powerful launch. &quot;Like It Too Much&quot; replete with lush orchestral arrangements from Bond &amp; Bjork maestro David Arnold is a rousing classic Kaisers number which sits comfortably alongside the likes of album highlights &quot;You Want History&quot; and &quot;Good Days Bad Days&quot;; the latter underpinned by keyboard arrangements conjuring up New York disco morphed with Talking Heads-like brilliance, whilst in its wake creeps up the Kaiserdelic &quot;Tomato In The Rain,&quot; heralded by its Hammond Organ and great lyrics.\n&quot;Half The Truth&quot; more than nods to the likes of XTC and comes with a contribution from UK grime artist Sway, meanwhile friend and musical ally Lily Allen contributes backing vocals to &quot;Always Happens Like That&quot; before the psychedelic bent continues when drummer Nick Hodgson resumes vocal duties on album closer &quot;Remember You're Girl&quot;, sounding like a long lost John Lennon track from the mid-70's.\nOff With Their Heads was produced by Mark Ronson and Eliot James at RAK and Eastcote Studios in London in the Spring of 2008. It was mixed by Andy Wallace (Nirvana, LCD Soundsystem, Run DMC) at Soundtrack Studios, New York. \n\n","torrent":{"xt":"urn:btih:ffd8fd47b13e6939c1d3f921f1ee3fafc5abcfdf","amp;dn":"Kaiser+Chiefs+-+Off+With+Their+Heads+%5Bmp3-256-2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffd8fd47b13e6939c1d3f921f1ee3fafc5abcfdf","infoHashBuffer":{"type":"Buffer","data":[255,216,253,71,177,62,105,57,193,211,249,33,241,238,63,175,197,171,207,223]},"announce":[],"urlList":[]}}